{"user_id": "113582099538231230013", "name": "Don Johnson", "time": 1557178613139, "rating": 4.0, "text": "Great to see where Alabama laws are passed.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOMOv4V0s9LZC4LYLdghWWg4yCdN-XXGgsjN2vp=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e8176f6150d4b:0xa0405f26de0bfc77"}
{"user_id": "108437561035504098350", "name": "James Lawley", "time": 1588433740546, "rating": 1.0, "text": "When there's work to be done, the Democratic Representatives are nowhere to be found. This is not surprising, as they are known to be lazy and dishonest. They are also the root of most problems we face today.", "pics": null, "resp": null, "gmap_id": "0x888e8176f6150d4b:0xa0405f26de0bfc77"}
{"user_id": "109174247954586278873", "name": "Thomas E Jackson", "time": 1521593131605, "rating": 5.0, "text": "I work here!", "pics": null, "resp": null, "gmap_id": "0x888e8176f6150d4b:0xa0405f26de0bfc77"}
{"user_id": "108333285687161874316", "name": "Art Of Valor", "time": 1599896948341, "rating": 5.0, "text": "Quality instruction from this law enforcement academy in Anniston, AL on Fort McClellan. Very disciplined and structured environment, yet they provide adequate instruction and train future law enforcement officers very well. Great experience here. Wide variety of law enforcement training available. The basic training is one of the better programs in the state for training new police officers. Some of the best law enforcement training around.", "pics": null, "resp": null, "gmap_id": "0x888bb2c411eccb4f:0xc51d7e8470586c14"}
{"user_id": "116074129924369568895", "name": "Alex Zander", "time": 1566108990565, "rating": 5.0, "text": "Really want to be a officer", "pics": null, "resp": null, "gmap_id": "0x888bb2c411eccb4f:0xc51d7e8470586c14"}
{"user_id": "108314457338692104828", "name": "John W. Snow III", "time": 1508352570407, "rating": 5.0, "text": "I stumbled into here and I don’t want to leave. If you like legal history, this is the place to go!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOOFRyBRXp0ckVAVwKjnb9awQZGfzblH_WmoTid=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMg81Ipmm2sh7H35DzFhsRU5XbKE4ThOxW_FIjy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPigrvKgH-LgVN1TCl68jibnznYZP0ixsVLj_er=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipME6RJ764smtr3DwN1_kMMnOx9rZzq1pYT5BHXm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMliI98v_cecZZKlsF-QYGjqw53oGzn629tDtXS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM8TRSnsFx6cQhHpy0Oyo0jF-V0V8u6D4k7yiJL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOb08hxXS1WAu1DU6DNtq3GgdpOOJgqbbcD0_EZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNvbMjLk5InxwVcjgb4EWGNEgO_625jjo1u80Jo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNatjzvP949TNbfHrwmJy8nYcIi-UjE9zMUOSqt=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e8171a1488b27:0x18d46916707491cb"}
{"user_id": "109470031997274426711", "name": "The Band", "time": 1465666563246, "rating": 5.0, "text": "I call the law librarians at the Supreme Court Law Library. I am provided courteous assistance and where to look elsewhere for further information if it is not located here. I've noticed it doesnt seem to used much by lawyers on the few times I've been in only to see one or 2 people who don't work there. Too bad being a lawyer by ability to afford law school was really about money and not more important qualifications such as character and merit.", "pics": null, "resp": null, "gmap_id": "0x888e8171a1488b27:0x18d46916707491cb"}
{"user_id": "105931976750454029240", "name": "Bryan Carter", "time": 1552510681023, "rating": 4.0, "text": "There are excellent tours, but I'm normally there on business. The facilities are well cared for. I'm not recommending it for young people, but those interested in government and disciplined learning should check it out.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNK_UFrUxQHnxb-HV1lYgPSb2NteJ5xkX61TQu6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNM4KWTozhdZVrCdFV16GvlaP_yIDMfwgxgSOxP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNRlvigPaRR4tVd18AwqRpKCdfsYi7GxOetCC__=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM0O0WGirhhTUeC1ULbBCV09anrt_ClnUoYNtcM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNmSjex8E5QWKhW5Esh5e8zVW5366vMFRxdyUwo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPlOofBI_uhyDqVmTT446-IFnwvRj-Z0pua_RgN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOJGqIGEcgO7FFsjQPOi6PHM2-XgZMqVYnxam1L=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPGXorVtVI1MCkK7z6iws-aacjyCe8dj7aOV15w=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOEBpC9y149oo-A7d1QpQoCduJEnoD2FXITf_ro=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMI4G3gKryC342ZHyRrlyxTRo8C0o1KVdDS7equ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNHMUASMrFs1X-YLR6gz9ESA2ALGr4vUhclNFKz=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e8176f6150d4b:0x23b1f5f694250570"}
{"user_id": "117746737803080659584", "name": "Barry Hill", "time": 1552536864346, "rating": 4.0, "text": "I arrived late in the evening and was only there for one day. I was able to offer on the area and take a few photos.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOJYsNn6TMurerJ4KuSNNOGUTYUBwDzI9AVvrdc=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e8176f6150d4b:0x23b1f5f694250570"}
{"user_id": "103075807734360439649", "name": "Chris Bloomfield", "time": 1511316500328, "rating": 5.0, "text": "We got an excellent tour of the chambers here. It was arranged beforehand and I don't think it is normal to get a tour here. You can visit the galleries of either the House or the Senate and watch the politicians work. It's a modern government building built for function rather than to be ornate, but it is lovely still.", "pics": null, "resp": null, "gmap_id": "0x888e8176f6150d4b:0x23b1f5f694250570"}
{"user_id": "116180055105293261433", "name": "Anarcho-Primitivism for Albania 2020", "time": 1593569312246, "rating": 2.0, "text": "soon to be albania state houes", "pics": null, "resp": null, "gmap_id": "0x888e8176f6150d4b:0x23b1f5f694250570"}
{"user_id": "113582099538231230013", "name": "Don Johnson", "time": 1557178823844, "rating": 4.0, "text": "Nice place to tour and visit.", "pics": null, "resp": null, "gmap_id": "0x888e8176f6150d4b:0x23b1f5f694250570"}
{"user_id": "112542821168836946792", "name": "Myron Prins", "time": 1470312174055, "rating": 5.0, "text": "Run Alabama good state government of Alabama.", "pics": null, "resp": null, "gmap_id": "0x888e8176f6150d4b:0x23b1f5f694250570"}
{"user_id": "101277757634816178046", "name": "Lily Wild", "time": 1444369477754, "rating": 5.0, "text": "It was amazing i loved it", "pics": null, "resp": null, "gmap_id": "0x888e8176f6150d4b:0x23b1f5f694250570"}
{"user_id": "113916290179537080529", "name": "Jasmine Glenn (Jazzy)", "time": 1594911702364, "rating": 1.0, "text": "I will be glad when I move out of chambers county, this is the worst place ever. Case worker doesn't answer your calls or emails. My stuff not processed in a timely manner and not updated in the system. Please get better staff members. Customer service is no good, they have attitudes. I give them a zero stars if I could.", "pics": null, "resp": null, "gmap_id": "0x888c9b6ccf4ec87b:0x2d60da039c26f703"}
{"user_id": "105561131395772363493", "name": "Shasta Robinson", "time": 1584095513950, "rating": 1.0, "text": "Pitiful excuses for \"human resources\"\nNo answer, no return call ever in history, and unfriendly attitude. No willingness to pleasantly provide helpful assistance and lacks proper communication skills. And don't dare expect anything to be processed in a timely manner", "pics": null, "resp": null, "gmap_id": "0x888c9b6ccf4ec87b:0x2d60da039c26f703"}
{"user_id": "102550628742357946393", "name": "You Filthy Animal", "time": 1556034141700, "rating": 1.0, "text": "Horrible customer service! Phone rings and rings and does not even complete the automated recording. This is sad and unacceptable when it comes to obtaining child support information or court updates about dead beat parents. No wonder they have no worries,  the case workers apparently are not working either!", "pics": null, "resp": null, "gmap_id": "0x888c9b6ccf4ec87b:0x2d60da039c26f703"}
{"user_id": "115138788273064365492", "name": "James Miller", "time": 1556504354479, "rating": 1.0, "text": "Recently my son's mother got arrested In Chambers County causing my son to go into foster care. Before this incident I reached out to the department on several occasions about concerns about my son's mother being on drugs and also living conditions with no power, water or food. The department seemed to share no concern for this and their only solution was to close the case after not being able to locate my son or his mother. I filled 2 different police reports after finding bruising and clear signs of neglect finally pushing the department to take some sort of action. After a month of consistent phone calls they were able to reach my son's mother where she was arrested for obstruction and outstanding warrants. They were also able to verify living conditions, no food, water, etc. Later, I was told my son couldn't be placed with me because I lived in Ga, but foster care seemed like a better choice. I was told on this day I would get visitation every other weekend as well as being able to speak to my son over the telephone until they could file necessary paper work in Ga which after a week they still haven't done. On my first visit this previous weekend my son arrived with bruising over his legs and arms, un cut nails and hadn't looked like he had bathed for some time. After my visit I brought up these concerns to the case worker Alisa Colley, she seemed to have little compassion and almost seemed annoyed of my concerns. I was also asked to sign forms without any consent from an attorney when I was only there to spend quality time with my son. After being bombarded with forms that I insisted I wasn't comfortable signing without legal counsel the case worker Alisa contacted the supervisor Angie to speak with me. Once on the phone I was told if I didn't sign I wouldn't get any more visits with my son. When trying to explain I didn't understand what I was signing and bringing up clear signs of abuse and neglect of my son while in the departments care Angie continued to scream and yell at me where I couldn't get any words in. After the short phone call of abusive behavior and language I was told my visit was over and have not had any contact with my son over the last few days. I have made a report internally about these concerns and have plans to open a civil suit against the department.  I find it unjustified and unconstitutional for a department that's employed by tax payer dollars to feel they're above the law and act in the manner of which they did. The only people that will suffer is the children that they are sworn to protect.  They have failed grealty in this circumstance.", "pics": null, "resp": null, "gmap_id": "0x888c9b6ccf4ec87b:0x2d60da039c26f703"}
{"user_id": "109722357253982591528", "name": "Titanya Longshore", "time": 1466475799716, "rating": 4.0, "text": "I feel that the time that CCDHR child support division should consider opening the call hours up to accommodate the clients that actually work and have set break times. most clients have 10-15 min break and then a lunch break during the 8-12 call time...but if you call on lunch at 12-1230 during your lunch ...child support are no longer taking calls.It is may be also better if the dates that the office is going to be out for court each month be posted or announced in the pre recording given such  the one which gives the mailing address etc. I appreciate my worker she has always her very best  as my case worker and provide me with updates , changes,etc in my case...but as i said there is always for improvement on  any job as a whole . Thanks Ty longshore", "pics": null, "resp": null, "gmap_id": "0x888c9b6ccf4ec87b:0x2d60da039c26f703"}
{"user_id": "103951197161182397820", "name": "Minerva Bufford", "time": 1518719610854, "rating": 1.0, "text": "When trying to get something accomplished here is a nightmare. Who stop taking calls for services at noon?? That's ridiculous !!!! Damn shame", "pics": null, "resp": null, "gmap_id": "0x888c9b6ccf4ec87b:0x2d60da039c26f703"}
{"user_id": "112813256384416246337", "name": "Tremetrius Harper", "time": 1531228120594, "rating": 1.0, "text": "Never answer are able to reach case workers", "pics": null, "resp": null, "gmap_id": "0x888c9b6ccf4ec87b:0x2d60da039c26f703"}
{"user_id": "108802616910998511765", "name": "Elijah King", "time": 1626194276684, "rating": 1.0, "text": "I couldn’t get help over the phone so I drove from Birmingham to Montgomery just to be told “we stopped taking walk-ins 4 weeks ago. You have to call for a phone appointment”\nI’ve been calling since January and it’s pointless.\nADOL needs to do better. Way better", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNA4IR_qrQw8g3kfeRHknSW7eJPWat2iJAb_uzM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMz4ToW-ZDL15Icx_izfbD2u9EXW8-vnc1Io09F=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "107754091869730684227", "name": "Dennis A. Chesser", "time": 1624382351739, "rating": 1.0, "text": "70 days and counting, calling the inquiry line. And no appointment yet? 600 appointments a day, when 1.3 million are unemployed and looking for answers? Alabama and the governing body have failed us again. Time to rethink everything, about this state. I want out of here ASAP. Could I get what I am eligible for, so I can move on? Better opportunities elsewhere I feel.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "109797688332469209288", "name": "Monica Perryman", "time": 1625623055788, "rating": 1.0, "text": "I rather give no points artificial intelligence can not comprehend it. Zero therefore I win your laws has been found guilty all establishments church and states bible schools too. Your judicial systems owes me billions of dollars wrongful terminated off jobs site’s Todd Strange and Robert Bentley government statures Green Lantern postal services mailrooms clerks department headquarters to. All my lawsuits money on Alabama governments and employers of seminars.\n\nMajority of your government facilities and faculties are uneducated and unqualified employers businesses establishments to office jobs religious centers to schools.\n\nYou have been found guilty of interfering with people work history and lies for businesses and churches.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "112163926832308397598", "name": "King KeRay", "time": 1624286786151, "rating": 1.0, "text": "Absolutely useless. The people who work here should be fired immediately", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "109504799127297282369", "name": "Kierra Frost", "time": 1609180711812, "rating": 1.0, "text": "Impossible to talk to someone over the phone. I’ve been calling trying to talk to someone over 3 months now and still have been unsuccessful in doing so. I guess the employees are being paid just for being there because they’re definitely not doing their jobs. No help whatsoever!", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "118251531207639855426", "name": "Chelsea Barrett", "time": 1590790697337, "rating": 5.0, "text": "I drove 4hours both ways to the unemployment office 3 times. I got to the unemployment office at 3:00am and didn’t leave until 3 pm. The man who helped me was very nice and it only took him 3 minutes to fix my issue. I just wish there was a easier way to talk to someone as oppose to standing in line for 12+ hours only to talk to someone for 3 minutes. Overall I left happy! I had been claiming 11 weeks before they even fixed my issues! So I would definitely recommend going into the office for help.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "111836296249878568275", "name": "Randy Hughes", "time": 1586267589620, "rating": 1.0, "text": "I would give them a zero if that was an option. I filed two weeks ago for unemployment. I called on Friday to file my claim for the week, but misunderstood one of the questions they asked. Since I answered incorrectly, they stopped my claim and I was given a number to call. BUT I CAN'T GET THROUGH FOR ANYTHING!!!!! After I did a lot of digging, I finally managed to get a human being on the phone, but she was from a different department. I realize that, but I didn't know what else to do because I wanted to speak to an actual person to see if they could direct me to someone who could help. Since her phone has been blowing up with people like me, she tried to put me in touch with the director of the claims department, only to get his voicemail. I am not holding my breath, but I do pray that he will call me back. The insane thing is that I called the moment they opened, and I get a message saying that they are experiencing an extremely high call load and to call back later. This is freaking ridiculous.  if I don't hear back from someone soon, I am going to see if I can get the local news to do a story on it.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "112747154158709103107", "name": "joanne lewis", "time": 1616094183175, "rating": 5.0, "text": "i called and they ansewered immeaditly", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "103579326722083567229", "name": "Jamiel Cantrell", "time": 1591746939559, "rating": 1.0, "text": "I have been trying to file since March. I have been inputted into the system close to 10 times and the system deletes me. They will not answer the phone. Every time I try to file my  weekly certification... It says there has been a break in my claim and to certify this week call the one 800 number before Friday. I call it every time and their system will not recognize me or let them put me into the system. This is the most ridiculous miss management I have ever seen", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "106478789193224411619", "name": "TabrisTheAngel44", "time": 1602596838544, "rating": 1.0, "text": "I have been trying to get in touch with someone at the office or on the two 1 800 numbers about my claim for the past 2 and a half hours this morning and have recieved no help nor anyone calling me back. Hetting sick of ADOL giving me the run around at a damn near constant.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "105482256413866694061", "name": "Jeff Harris", "time": 1597937134679, "rating": 1.0, "text": "I can't even say Bad service.   There is NO service.  Impossible to get anyone on the phone. Impossible to get a response by email or mail.  I don't even live in Alabama and they stole my Federal tax refund, yet when I enter my Soc Sec # into their system,  it states # not recognized.  Government gone rogue with NO accountability.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "111734476623727295292", "name": "ROBIN Taylor", "time": 1596478221141, "rating": 1.0, "text": "I can never get through to the number they sent me in a letter saying my benefits were returned. I ordered the card weeks ago and never got it or the money they say I am supposed to get. It seems like the people who have worked most of their life get zero consideration. I have also emailed them several times as well with no email back.  Can you just show up to the main office or is it appointment only?", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "102555451513825896653", "name": "Brian Hill", "time": 1593551198476, "rating": 1.0, "text": "Was told 3 times (when I was able to connect) that they do not help war veterans recently separated from the military.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "109025585673648997409", "name": "Chasing Roots", "time": 1612309618565, "rating": 1.0, "text": "As if the state of Alabama had a bad enough reputation...not even the  Department of Labor works.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "110592983147376022118", "name": "Chanele Lewis", "time": 1597785194476, "rating": 1.0, "text": "I think people that does not have people skills should not work for the public. Been dealing with Department of labor for one month. You know they have you meeting at the Crump senior center for unresolved claims. I went last tuesday which  was August 11 2020. Was sent home because I needed  my test results saying I don't  have Corona. They lady treated me has if i was the plaque. She becked her hands for the security to come get me. So I proceeded to get my results. Came back this Tuesday. And I had the same exact lady. This week. She Is  rude as all get out. She is heartless and very inconsiderate. Didnt even want my results this week. Why put people through this. I'm listening to  the representative beside me being so nice. And my rep is so rude and careless.  Her table number is #8. Sad thing  is I called her supervisor and get no results", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "113468723278601391555", "name": "Michael Mcgill", "time": 1603139143077, "rating": 1.0, "text": "I've been trying to contact Alabama Department of Labor by e-mail,phone since the Last week July I haven't got a response as of October 19,2020 it's telling me it update in two days it's been months.\nJust wondering if we had to pay this money would the system be the same", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "112992088332590359510", "name": "Cleveland Freeman", "time": 1596349148555, "rating": 1.0, "text": "Going on 3 months now since I answered wrong one of their questions. Little did they know or even care to know, although I refused work for different job, I didn't say I was unemployed because I still work part time at main job claim partial benefits (which was full-time but because of Covid now part time). They didn't have issue paying out before this happened but penalize me regardless!! Tried speaking to virtual person on their website, because it's pointless calling busy 1-800 number. IT'S A NIGHTMARE!!", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "106546369659732851834", "name": "Becky Wilson", "time": 1589907903357, "rating": 1.0, "text": "I filed for 1/2 unemployment on March 23rd.  Then was  furloughed on March 26th. I answered the question and was told to call within 4 days. I called several times a day with no answer. I received a denial notice giving me 15 days from the date on the notice. It was dated 13 days prior. I tried to fax the appeal in but the fax number did not work. Four weeks later the fax finally went through. However, it was after my appeal time was up. This is disappointing. I have worked my whole life. In a time of need Alabama failed.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "110242006693261681409", "name": "Geoffrey Hayes", "time": 1611705123010, "rating": 1.0, "text": "The absolute WORST place I've ever had to deal with.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "101129258313901513135", "name": "De’Shunn Jones", "time": 1603133052172, "rating": 1.0, "text": "I have trying to get in touch with someone for 3 weeks now I’ve even emailed but every time I call there’s a heavy call load. This is unprofessional there are people that need their calls answered", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "115288146058795132466", "name": "Chef Evans", "time": 1591676061428, "rating": 1.0, "text": "Unbelievable debacle with this office. I have called over 1,000 times and left dozens of voicemails with phone records to prove it, emailed repeatedly and even resorted to sending messages through Facebook, trying to speak to a human being. This is  disservice to taxpayers and just typical of services in Alabama. Thanks for nothing Kay Ivey. Quit faking the Southern charm and do something about it. The state of Alabama is failing people, badly.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "103846757353592409952", "name": "Jasmyne Harrison", "time": 1593118138417, "rating": 2.0, "text": "The worst people to call or work with. Some are very sweet but you rarely get those you will 9 times out of 10 get the rude ones who will hang up in your face and send you on goose chase.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "110556441808360917927", "name": "Barbara Watkins", "time": 1592577955168, "rating": 1.0, "text": "If I could rate less I would. They are very unprofessional. You cannot get speak to a live person, you cant chat, and they love to just pend things. This state has been mismanaged for over 15 years now, and it's time for change.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "115972560006893872803", "name": "Summer Burnette", "time": 1586785784469, "rating": 1.0, "text": "I have been waiting an entire month to hear from the unemployment office. As I was laid off due to COVID-19 and absolutely no fault of my own. I recieved two different hearing dates. Neither time I called for my schedule hearing to be approved was I able to get through the phone lines. April 16th will be an entire month with no pay for me, at 8 months pregnant. 3 weeks left to go. This is the most unprofessional agency. I have faced in ALL current paperwork, pay stubs, etc. Everything they asked for, I have emailed them. NO RESPONSE. Currently mailing off another letter at the Post Office. Something HAS TO BE DONE!", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "110757444475457001751", "name": "Diane Moore", "time": 1610382776448, "rating": 1.0, "text": "you can never get through on the phone", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "111638605156127427358", "name": "Kristina Lilly", "time": 1601327950755, "rating": 1.0, "text": "I have left message after message and no one will return my call.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "109816719704836926452", "name": "D0oZY!", "time": 1588258305170, "rating": 1.0, "text": "They don’t get back to your calls whatsoever I’ve left 4 Messages throughout this week and last week, they haven’t called once. Very disappointed", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "112834981155190540545", "name": "rachel woods", "time": 1587663156545, "rating": 1.0, "text": "Very unprofessional and you can never get anyone on the phone. I've been calling back and forth sending emails to get some assistance and to no availability, nothing. Something needs to be done about this or they need to be investigated about their methods and procedures on helping people in general.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "111932026090820778154", "name": "Google ruined Youtube", "time": 1590309721819, "rating": 1.0, "text": "Website crashes and when you hold (and finally reach someone) they hang up on you! They need to be investigated!", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "106168303014294008330", "name": "Rhianna Pence", "time": 1598891198197, "rating": 1.0, "text": "I can’t even get a answer just a machine and I’ve been waiting since April to get it fixed now the numbers I call are blocked and I just want my unemployment I was suppose to get months ago", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "107273818134874439016", "name": "Exzavier Lockley", "time": 1588610008345, "rating": 1.0, "text": "Been calling  8 to 5  for the past three days. Can't get no one to answer the phone. Just take all the phones out and have everyone to just go down town. Very unprofessional.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "107538531123948463635", "name": "Mazanori Bito", "time": 1617229027883, "rating": 1.0, "text": "Terrible,Just Terrible", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "100878219937425227655", "name": "Charlessa Hoskin", "time": 1576536797019, "rating": 1.0, "text": "I TALKED TO A REPRESENTATIVE NAME CRYSTAL SHE TOLD ME TO PAY 100.00 I SAID OK SHE SAID SHE WAS SENDING THE PAPER IN THE MAIL FOR ME TO SIGN THAT I COULD GO AHEAD AND MAIL MY PAYMENT SO I DID WHEN THE PAPER CAME AFTER THE FACT IT SAID 125 SO I BACK TO HER WHAT SHE TOLD AND ETC COULDNT RESOLVE THE ISSUE SO I ASK FOR A SUPERVISOR NAME MRS BILLUPS SHE TALKING NOTHING FOR REAL SO THAT WHAT MADE ME WRITE THIS REVIEW", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "106309476812678915117", "name": "Trevor Sealy", "time": 1590767122723, "rating": 1.0, "text": "Another failed system.Thanks Kay Ivey.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "110990563011158761799", "name": "LaDejah Jordan", "time": 1595245807579, "rating": 1.0, "text": "I have drove to Montgomery 3 times about my unemployment I can’t get anybody on the phone I have tried emailing them still no response it’s been 3 months and still no payment has been made even though they say pending", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "113693316048658750448", "name": "DukeOfKnifes777", "time": 1591981052232, "rating": 1.0, "text": "2 months since filing and not so much as a call back. I have no job now and can't even talk to one of these people... They can only process 250 people a day at the physical location. Waste of taxpayers money.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "101714679319722635812", "name": "pink kitty", "time": 1588338843692, "rating": 1.0, "text": "This is sad no help for my family it's been two months really .", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "110671995020706208005", "name": "Roger Harrison", "time": 1501101366011, "rating": 1.0, "text": "Yeah, you still can't get up with anyone at all. After leaving my number and social two days ago I still have yet to receive any help. If you work here- I no longer see you as a human being.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "105326310740743376973", "name": "Bob Shouders", "time": 1487859888390, "rating": 1.0, "text": "Sad situation when the entire department directs you to the website and it is completely shut down and no one knows how long it will take to get it going.    As an employer trying to put folks to work and the folks trying to find a job are completely stopped because everything in the department is dependent on the website and its links.", "pics": null, "resp": {"time": 1487878719811, "text": "We apologize for the inconvenience, Mr. Shoulders.  Several state agencies were experiencing technical difficulties this morning.  Our site is up and running now.  You can always find in-person assistance in placing job orders by contacting your local Career Center."}, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "111130988478206402022", "name": "Amanda Outlaw", "time": 1541671216152, "rating": 1.0, "text": "Unprofessional staff. I rarely am able to get someone to answer. I had a conference call with Mr. Pepping and he was an extremely rude man. I could not finish a sentence without getting interrupted.", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "106258036649218661020", "name": "Douglas Freeman", "time": 1585237960381, "rating": 1.0, "text": "Poor poor help cant tell you anything", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "116059029046290104224", "name": "Matthew Corbin", "time": 1582216659547, "rating": 5.0, "text": "Never been there, but I'll love to meet all the \"Unprofessional staff\".", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "113868939323880425650", "name": "Brittany Byers", "time": 1456328291506, "rating": 4.0, "text": "I only placed this rating so that I was able to THANK the precious gentlemen's post.\nThank you for sharing ypur wife's MR.GUYTON... I fear that more than not, alot of individuals are given a really, really HARD time... My only conclusion is that they get tired of messing with the ones who just really don't want to work and feel the they are owed something.... Never the less that gives them NO REASON to mistreat or harass your wife... If they cannot handle the job provided to them, maybe they should rethink there career path. Tell your wife she is in both my thoughts & prayers!!\nPraying for her speedy recovery, and for you to have the strength to help her through this very trying time!!\n*GOD.SPEED*     °•&•°     GOD BLESS,\nBrittany L. Byers", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "103061170822458366670", "name": "Jack N. Guyton", "time": 1436552002761, "rating": 1.0, "text": "My name is Jack N, Guyton and my wife's name is Debra Guyton.\nOn July 9, 2015 my wife received a phone call in the afternoon. The man (I can't call him a gentleman) upset Debra as this was the second time she was called in the morning on the same day to answer questions about her requesting unemployment benefits.\nThe State Employee was rude, and abusive to Debra. She has been through hell for the last six months! She has undergone brain surgery in December 2014. Just after she was recovering she was diagnosed with colon cancer. She was hospitalized the second time to have 12\" of her colon removed 60 days ago. So she started trying to recover again. Her employed was not cooperative and demanded that she come back to work before her physician wanted her to do. Not withstanding, she tried for five days. After this she was in so much pain and mental confusion I put her to bed and demanded her to stay there as I was worried for her life.\nThe x.x.x that called her yesterday should be fired. I demand a written response about this state employee being examined as he said the conversation was recorded (I assume this was from the Birmingham office). Rest assured Governor Bentley, and Senator Richard Shelby will receive a complaint about this inexcusable incident. You can reach me by mail at:\nJack N. Guyton\n3007 Circle Drive\nBessemer, Ala 35023\n\nSincerely\nJack N. Guyton", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "105372277278602521102", "name": "Ann English", "time": 1493396049540, "rating": 1.0, "text": "I have a question about eligibility for an unemployment claim. There is NO WAY to speak to a human about this without filing a claim. You literally have to file a claim just to see if you are eligible. This is TERRIBLE customer service!", "pics": null, "resp": null, "gmap_id": "0x888e81771bd7e983:0xa9c600d85ee5aaca"}
{"user_id": "114320383854028004128", "name": "Starla Price", "time": 1554254401406, "rating": 1.0, "text": "Can somebody please tell me how this place treats people my finance just got sent there", "pics": null, "resp": null, "gmap_id": "0x8887962585ea2773:0x79072237e6f8ab4c"}
{"user_id": "110664495699416289836", "name": "Marsha Green", "time": 1469728725389, "rating": 5.0, "text": "Great 😀", "pics": null, "resp": null, "gmap_id": "0x8887962585ea2773:0x79072237e6f8ab4c"}
{"user_id": "102427713729591120268", "name": "angel marie", "time": 1534713729547, "rating": 3.0, "text": "its prison", "pics": null, "resp": null, "gmap_id": "0x8887962585ea2773:0x79072237e6f8ab4c"}
{"user_id": "110967843590947276324", "name": "Jube Lynn", "time": 1614556054731, "rating": 5.0, "text": "Had a issue with my driver license getting sent to my P.O Box. So it got sent back to Montgomery Alabama driver license division I’m from mobile al and I never received my DL’s. So I was calling this place about my situation an this guy I’m gonna call him sir he would not help me with my situation he kept saying call back Monday and I explain to him I’m coming from California can you please sir check an see if my Driver License is there he told me no call back Monday so I knew I was on the phone with the wrong person. So I kept calling an this lady answered the phone I’m gonna call her ma’am an I told her my situation and she told me she was gonna check the return Drivers License an she said it was a huge pile of returned DL’s it’s gonna be a minute to go through them all to find mines. 3 minutes later she picked up the phone an said I found yours just need to verify your Social Security number. I told ma’am my social an she said yes it’s here you can come pick it up an I drove from Mobile to Montgomery to get my driver license an it was worth the trip an I wanna thank you so much ma’am for helping me because that guy sir truly didn’t.. I appreciate you so much ma’am thank you very much!🙏🏾😃 If anyone have the same situation keep calling until ma’am answer the phone because sir ain’t gonna do nothing but give you the run around an tell you to call back Monday ...😐", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOzEjdOxCsG2eykBH-q9i-OZJRpDTuJDCdRwWEP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMpjeEudgGl8Qu5iuacNHw2Mbotz0-OhKmXV9BK=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "107362383291019667010", "name": "Hannah Castleberry", "time": 1618863223576, "rating": 1.0, "text": "This  place is nothing but a joke. You might as well take a day and go there because they will  not answer and when they do they are so rude. I waited and hour and 30 minutes for the lady to tell me that she doesnt have  access to they system and it was another department but there was only one prompt for departments only one.", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "110225647612744077460", "name": "TyKeshia Kidd", "time": 1618514765237, "rating": 1.0, "text": "THEY NEVER ANSWER THE PHONE. YOU HAVE TO TAKE OFF FROM YOUR JOB TO GET SIMPLE QUESTIONS ANSWERED. THEY DID NOT ANSWER 20 YEARS AGO WHEN I WAS OUT OF STATE AND NEEDED AN ANSWER AND THEY STILL DON'T. I'M QUITE SURE THEY DON'T CARE AS LONG AS THEY GET A CHECK", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "112194013597878130689", "name": "Timothy Petrose", "time": 1613660016566, "rating": 1.0, "text": "Good luck with trying to get a drivers license. No one ever answers the phones. No one ever to talk to. You'll spend multiple times on the phone and not speak to one person. Then get hung up on by their Machine.", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "105593103591551902478", "name": "Robert Reynolds", "time": 1594775210843, "rating": 5.0, "text": "I didn't get the names of the team that was working in Background Checks and Fingerprinting at Alea today 14 Jul 2020, but they deserve big Kudos. So welcoming and efficient!\n\nI see a lot of complaints here and many are regarding the phone system. The number on Google goes straight to the Drivers License division. They need someone to claim this and correct the number. I think that is causing most of the problem, at least that was happened to me.\n\nBut once I got the right folks! Boom they were awesome!!!", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "113314649654571994468", "name": "Jay 3", "time": 1607355415333, "rating": 1.0, "text": "This is just pitiful I been waiting for 45 mins and still have not got a answer yet", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "101096939682301015387", "name": "Tracy Coleman", "time": 1616104604395, "rating": 1.0, "text": "I called twice in 1 day to try to find out how much I would have to pay to get my license reinstated,so after being on hold for almost 2 hours ,needless too say,they hung up on me.what poor service you all have too offer people.", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "100910757995422743500", "name": "Dorisetta Moore", "time": 1566938054473, "rating": 1.0, "text": "I am a State worker and I feel that it is ridiculous that you can't talk to a real person.  You have to go through all of these recordings and still wait for 30 minutes to talk to someone.  What good is this Department to the public if you need information and can't talk to anyone.  I have called for three days and I get the recording and then I get to a point of just waiting.  Okay what now.  If this happened at the Department  I work with it would be reported.  Just my opinion we work for the public and the public should be able to talk to a person.", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "100426562471649074075", "name": "X", "time": 1575927642723, "rating": 1.0, "text": "Almost none of the numbers work and if they do it takes an act of Congress to get to a human voice and a miracle to get them to do their job. This is the fundamental problem with government, there’s no accountability for performance. I was forgot on hold for 22min., had to hang up and call back. There is so much confusion between courts and the agencies and they require you to do all the leg work and find all the dead ends. At the end of all that no one can help me because someone is supposedly on lunch at 3:20pm. Went in person and the office only had a couple sitting in it waiting. The employees did not appear to be busy just sitting there talking with one another. All I needed was a record update. Been at this for two hours.", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "102083430598622535466", "name": "musicloverofthegrill Robinson", "time": 1575585330278, "rating": 1.0, "text": "De 5 2019. Called THREE times only to be put on hold all three times, waited forever with absolutely zero assistance... Ridiculous.", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "108745852488853639427", "name": "nisslo yeltsin", "time": 1560371505216, "rating": 1.0, "text": "So you send out these letters of \"Failure to comply with motor vehicle insurance laws.\" Threatening me with fines and suspension when I've never been without insurance in my life! The epitome of guilty before proven innocent! I waste a vacation day trying to resolve this. You won't pick up the phone or worst yet, simply get told by a robot to hang up and try calling later. Unreal. If we'd ignore you like this, we'd all be sitting in jail.", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "115519365099761828678", "name": "Shelly", "time": 1551823805962, "rating": 1.0, "text": "I can't  get anyone to answer the phone! Every time I call, I press 6 to speak to someone. It rings once then says \"we have a high volume of calls, try your call again later.\" Well I have called about 5 times over 4 days at different times of the day and multiple calls per time I have tried. It is like they are setting us up for failure by making it very difficult to reinstate your license or keep it from being suspended. Even called the police dept to see if they could help me get in contact with them, no help at all. Beyond angry. I work two jobs so now I'm going to miss money at work to take off and drive down there. RIDICULOUS", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "117225327431766146191", "name": "Kaiser D", "time": 1555343948586, "rating": 1.0, "text": "ST991 : Parked unattended in a DISABLED VETERAN'S parking spot.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMSdmfZPCfV-4KO13hjGSj7ThFjlozVAer3MwvF=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "105181997274127023692", "name": "Wes Kelly", "time": 1581625601283, "rating": 1.0, "text": "Horrible..  Just Horrible  -  The director can not possibly have seen all of these reviews about the fact that it is IMPOSSIBLE to get someone on the phone.  If he has been reading them and isn't making an effort to fix the situation, we obviously need a new director.  Heck, they don't even have e-mail addresses listed on the website.  ALEA, you should be EMBARRASSED !!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "106544127252257406554", "name": "tyeshia witchard", "time": 1561842287409, "rating": 1.0, "text": "I wish I could give them 0 stars ! Noone answers the phone. I've called multiple times and noone answers the phone. This is absolutely ridiculous. Everytime ive sat on the phone for an hour waiting and noone answers !", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "103697366884425671524", "name": "Andrew Callen", "time": 1534964207341, "rating": 1.0, "text": "Never answer the phone. Absolute garbage. It's too bad that I can't post zero stars to reflect the level of effort in the building...", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "102719114729581206964", "name": "Brenda Hale", "time": 1468960076940, "rating": 1.0, "text": "wanted a duplicate of my license because I had lost it.  Put in all accurate info including my license number and it rejected my request. when I called, I was told to drive to my local office to get the copy. Website is no help at all!\nI doubt anyone entering their personal information would be able to accomplish what they need!!  Useless!", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "112484463177098865217", "name": "jacque labadie", "time": 1498762439285, "rating": 4.0, "text": "First off, calling this place is the WORST because of apparent understaffing. The 1st time it took 2 hrs of calling repeatedly before I could get put on hold! HOWEVER, when I finally got through, the ladies (Linda & I can't remember the other's name) I spoke to were absolutely wonderful. Both were incredibly helpful & courteous which is rare with any type of dmv related office! They actually made me feel a little better about getting my situation taken care of & I can't thank you enough for that! Ladies, if you ever read this, you both deserve 6 stars for your professionalism!!", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "113457439691400470364", "name": "Meagan Gann", "time": 1555438998488, "rating": 1.0, "text": "I’ve been on the phone with trying to get someone to answer for two hours. I have literally called 45 times in a row. They will eventually answer or I’ll keep calling until someone does! This is absolutely absurd.", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "104561655418292395901", "name": "Ronald Tong", "time": 1495575366557, "rating": 5.0, "text": "This is where you come to get your personal driver's abstract (driver's record).\nDon't get confused with other locations like the department of motor vehicles.", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "109753129417336882068", "name": "Bobby Timmons", "time": 1441297761940, "rating": 3.0, "text": "September 3, 2015\nThis office has moved. This address is a parking lot.\n\nThe correct address is 301 South Ripley Street, Montgomery, AL 36102\n\nSeptember 3, 2015", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "115687404051423382745", "name": "Jill Miller", "time": 1494347153431, "rating": 5.0, "text": "Agent was very friendly and professional, quick service.  No waiting line...highly recommend this location.", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "106056516096630615523", "name": "Justin Brooks", "time": 1488211889069, "rating": 1.0, "text": "Never answer phone calls Prattville way better", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "109008141594023364370", "name": "thomas oliver", "time": 1494356081220, "rating": 1.0, "text": "Every time I call it says press six to speak with a human and I always get a dial tone.\nI have called repeatedly for 4 hours one day.", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "118375306004903064536", "name": "Marcus Calhoun", "time": 1483645399479, "rating": 1.0, "text": "If I could give a Zero I would. The worst gov't agency in America. If you can get someone to answer the phone you're winning. It makes sense that the dumbest state in the Union would function this way.", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "115917116035135454313", "name": "Jonathan Germany", "time": 1439818060577, "rating": 1.0, "text": "Do not answer phone calls", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "117398550874626781006", "name": "Latanya Andrews", "time": 1465246704765, "rating": 1.0, "text": "Never answers the phone...this is ridiculous.", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "113278948935476812166", "name": "randy kynard", "time": 1548712432840, "rating": 1.0, "text": "Waited on phone for over an hour and was still on hold went up there and waited 1 hour and a half", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "114466451772352457001", "name": "ZJDGaming", "time": 1548445432654, "rating": 1.0, "text": "will not answer the damn phone", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "100035907507818162633", "name": "Vexing Devil", "time": 1452713052578, "rating": 1.0, "text": "How can I get info about DL reinstatement and how much I owe if no one ever answers the phone?", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "116824846018572518233", "name": "Tina Green", "time": 1480347106646, "rating": 1.0, "text": "Horrible experience. We have been waiting for an hour and a half and they aren't near calling us back. So ridiculous to wait this long to get a permit.", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "108047871128334723916", "name": "Jason Gibson", "time": 1554747561648, "rating": 1.0, "text": "Answer the phone it’s your job", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "103020850156987756335", "name": "Gage Cross", "time": 1455208720206, "rating": 2.0, "text": "What does it take to get you guys to answer a phone?", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "116836581767429014430", "name": "Trey Cutler", "time": 1458058213604, "rating": 1.0, "text": "Idiots don't even know how to answer a phone.", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "112888650250392088598", "name": "Ratt Croskey", "time": 1554235654650, "rating": 1.0, "text": "Hello ,hello, hello dam", "pics": null, "resp": null, "gmap_id": "0x888e817154b52965:0x2005ffc533b01570"}
{"user_id": "113975396167500149416", "name": "برك", "time": 1627330914377, "rating": 1.0, "text": "This is the second time I've taken employment at a new husiness and they've ignored the fact. I called when my department was switched to a new company and they never set up the auto payments. Now I'm at this new company entirely and I've called twice,  and had two entire *conversations*, given them all of the information to make it happen, and my payroll still hasn't seen anything a month and a half later. I reported the job myself. Now I'm having to send in payments separate(which they attach a service fee\" to, that my child doesn't see any of. Pay $280 so he can get $250? It's not interest, its the state taking it because it can.", "pics": null, "resp": null, "gmap_id": "0x889a4dbc9ec054d5:0x68bbe810822f038a"}
{"user_id": "102645125288469975710", "name": "Shaquonza Houston", "time": 1627323724757, "rating": 1.0, "text": "They never answer the phone. They have specific hours of 12:30 pm to 4:30 pm and no one answers the phone. Then the system hangs up on you. I am not a Alabama resident and trying to do business with a state that's out of date is so frustrating. You can't get any info.online,they want you there in person....hello I live out of state how can I walk in and request anything. I can not fill out a request form online to send in because they are behind  in times ...they need help but wont hire ...how do you expect to get buisness conducted.", "pics": null, "resp": null, "gmap_id": "0x889a4dbc9ec054d5:0x68bbe810822f038a"}
{"user_id": "111598091129866602003", "name": "Amanda", "time": 1566172270237, "rating": 4.0, "text": "I think that the biggest problem is not the people that work there, there just short on staff. Have always been friendly to me. People just need to realize that the staff employed there have rules and regulations to follow just like any other business.", "pics": null, "resp": null, "gmap_id": "0x889a4dbc9ec054d5:0x68bbe810822f038a"}
{"user_id": "108845587429531511151", "name": "Angela Lankford (Angela)", "time": 1542565427735, "rating": 2.0, "text": "The longest wait was getting the papers served.. I dug in and found I could hire someone myself to serve him (75 dollar detective) . After that it was a breeze got the court date and he didnt show so the nice lady judge ordered payments from his check.  2 months later my twins got their money and life got 600 hundred dollars a month easier.", "pics": null, "resp": null, "gmap_id": "0x889a4dbc9ec054d5:0x68bbe810822f038a"}
{"user_id": "101092549270948795650", "name": "Lovly MiMi", "time": 1584028927698, "rating": 1.0, "text": "They never answer the phone then they want give you your court order statement", "pics": null, "resp": null, "gmap_id": "0x889a4dbc9ec054d5:0x68bbe810822f038a"}
{"user_id": "101624315574995644747", "name": "Joshua Daigrepont", "time": 1582832175226, "rating": 1.0, "text": "Horrible place. Never answer the phones and very unhelpful", "pics": null, "resp": null, "gmap_id": "0x889a4dbc9ec054d5:0x68bbe810822f038a"}
{"user_id": "102264414509811078900", "name": "Manita Sykes", "time": 1597209262917, "rating": 1.0, "text": "Call and can’t get through/call placed on hold over an hour phone suddenly hangs up/emailed-no response-faxed no response-Been trying to get help with this agency in and out of State for over TWO YEARS-cases previously closed because they put my name instead of defendant so warrant was returned as undeliverable and case was dismissed- HELP !!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4dbc9ec054d5:0x68bbe810822f038a"}
{"user_id": "105845616086942748524", "name": "Jennifer Williams-Artis", "time": 1537206368899, "rating": 1.0, "text": "Need a better system in assisting with people's lives employees need a class on professionalism and customer service..wait time for appointments is ridiculous...free your schedule for the day", "pics": null, "resp": null, "gmap_id": "0x889a4dbc9ec054d5:0x68bbe810822f038a"}
{"user_id": "105233854087393872643", "name": "randall house", "time": 1472738331032, "rating": 1.0, "text": "Can never get a hold of anybody on the phone. Horrible service", "pics": null, "resp": null, "gmap_id": "0x889a4dbc9ec054d5:0x68bbe810822f038a"}
{"user_id": "107596615032502910795", "name": "Tamara Edwards", "time": 1493147895902, "rating": 1.0, "text": "They really need help to many cases and not enough workers.", "pics": null, "resp": null, "gmap_id": "0x889a4dbc9ec054d5:0x68bbe810822f038a"}
{"user_id": "107637277623682689504", "name": "Aesha McNair", "time": 1487000786350, "rating": 1.0, "text": "Worst child support system every!!!!!!!!! They could care less and it shows", "pics": null, "resp": null, "gmap_id": "0x889a4dbc9ec054d5:0x68bbe810822f038a"}
{"user_id": "110049684847264274895", "name": "Debra Colbert", "time": 1482153948449, "rating": 2.0, "text": "Never solve issues", "pics": null, "resp": null, "gmap_id": "0x889a4dbc9ec054d5:0x68bbe810822f038a"}
{"user_id": "111571058250066671542", "name": "Johnnie Lett", "time": 1457447767814, "rating": 4.0, "text": "Helpful", "pics": null, "resp": null, "gmap_id": "0x889a4dbc9ec054d5:0x68bbe810822f038a"}
{"user_id": "105090256631177026315", "name": "Candise Smith", "time": 1493146754733, "rating": 1.0, "text": "Sad...", "pics": null, "resp": null, "gmap_id": "0x889a4dbc9ec054d5:0x68bbe810822f038a"}
{"user_id": "112924870602619198649", "name": "CUB GIRL", "time": 1581988608416, "rating": 1.0, "text": "i filed a complaint about my oncologist who told me to call my PCP during my chemo treatments when i started throwing up bile.  YES, ALBME IS ABSOLUTELY USELESS.  i gave ALBME permission to get the records from my oncologist office and NO WHERE ELSE.  but the investigator unlawfully looked up my prescription data on Alabama's Prescription Drug Monitoring Program (PDMP) and then called one of my doctors who told me.  i'm submitting a HIPAA complaint (45 C.F.R. 164 is the HIPAA regulation, BTW) against that investigator and against ALBME.  i'm also suing them for WRONGFUL INTRUSION OF MY PRIVACY.  what a POS agency.", "pics": null, "resp": null, "gmap_id": "0x888e819df9f64531:0xe5f404284c81765b"}
{"user_id": "116759099413040066796", "name": "Michael Todd", "time": 1577817132281, "rating": 1.0, "text": "I filed a complaint against a Doctor for touching me in appropriately,  they will do absolutely nothing, the State medical board is absolutely useless and needs to be shut down, the state needs to fire all of them and put the money to good use instead of this place, i filed a police report and thats worked harder for me than any state medical examiner board.", "pics": null, "resp": null, "gmap_id": "0x888e819df9f64531:0xe5f404284c81765b"}
{"user_id": "111558192932113480076", "name": "TONY SNOW", "time": 1582849081435, "rating": 1.0, "text": "You would think that the Medical Examiners board when over 1200 patients were put on the street in Birmingham Alabama . After Doctor Ronald Moons  abandoned them with no place to go . Some were hospitalized and some killed them self . That the Boad would do something to help these people get restitution and help. But noooo they say they don't care what happens to people . Thanks Tony Ray Snow.", "pics": null, "resp": null, "gmap_id": "0x888e819df9f64531:0xe5f404284c81765b"}
{"user_id": "104960201953346248195", "name": "Tina Butts", "time": 1565229314587, "rating": 1.0, "text": "Called this place to report a doctor and they were HORRIBLE.  The person in charge of sending out the paperwork for claims needs to be FIRED for her attitude. Probably best to just go through the Legal system...what a shame!", "pics": null, "resp": null, "gmap_id": "0x888e819df9f64531:0xe5f404284c81765b"}
{"user_id": "107370873184357898867", "name": "Tiny King", "time": 1619015306805, "rating": 1.0, "text": "I wish they would pick up the phone. The worst customer service in history.", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "117789915610997462875", "name": "Quincy Cooper", "time": 1608383580667, "rating": 4.0, "text": "I can get questions answered faster.Since they don't pick up the 📱.", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "107245073880445493634", "name": "Leslie Woods", "time": 1589370942673, "rating": 5.0, "text": "Never had or have an issue with them. Very polite and understanding. My case worker is awesome. ❤️ Keep up the good work😉", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "101976147067692955822", "name": "Lady S", "time": 1603461543583, "rating": 1.0, "text": "It’s literally a pandemic and you mean to tell me NOBODY can answer the phone!??? The absolute worst customer service in history", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "110972077315291529658", "name": "Shay Self", "time": 1603384698729, "rating": 3.0, "text": "Some of the employees have very rude attitudes but other than that I have never had an issue its a quick process", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "117172533243669698609", "name": "Jamie Lipscomb", "time": 1586447433132, "rating": 1.0, "text": "This is the worst Food Stamp office i have ever dealt with whyyyyyy ppl to be so unprofessional then on top of that you get smart over the phone and hung up who does that they need to go there a clean the whole office up because they all know they be in the wrong for the things they say n do whem they suppose to be helping ppl but they making sure they family getting them", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "116045214475714457025", "name": "Anesha Mccord", "time": 1580890231313, "rating": 1.0, "text": "I'm not understanding what they want my daughter got denied she's 7 months pregnant only works 25 hours a week at 8$ a hour she has rent and bills. I guess she should have lied on the application like everyone else", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "115487255709694738563", "name": "Ms Natalie", "time": 1491507108694, "rating": 5.0, "text": "I called before I visited the building and the lady I spoke with was prompt and knowledgeable. When I arrived my experience was great as well. Everyone in the building were very helpful and polite. I'm from MD my first visit and I had no problems or complications. Very satisfied with the services I have been provided.", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "101616040918410689010", "name": "Zenetta Pickett", "time": 1515156587646, "rating": 5.0, "text": "Amazing service. I have never had any problems with them they are always helpful", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "110170384421520920416", "name": "Katrina Haynes", "time": 1579275759653, "rating": 1.0, "text": "I have called every day this week and placed on hold for two hours and nothing . what is the point in having a number if you don't answer it .after\ntaking my paper work down there and dropping it off because I could not get the fax to work , they have miss placed it .", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "100905017587726524017", "name": "Matthew Jones", "time": 1530024961758, "rating": 1.0, "text": "Absolutely horrible would be an understatement.  I’ve never dealt with any organization as bad as these guys.  I’m a veteran with severe PTSD and autoimmune issues and am unable to work right now so I really need assistance but when I call it takes at least 10-15 minutes before anyone even answers the phone, and forget about trying to get ahold of your case worker or anyone else.  I really wonder what it is that they are doing in there that literally nobody is able to answer the phones or offer any help.", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "110402288455527045212", "name": "Anesia Conner", "time": 1516674369584, "rating": 1.0, "text": "They have the nastiest attitudes as if we have to be payed out their pockets some people honestly need the help and really dont wont to be on assistance as is and they ensure you really feel some type of way for even having to apply", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "104726915799151517640", "name": "Jamese Hawkins", "time": 1486389799880, "rating": 1.0, "text": "The people there are very rude, I struggled with food and when I asked about getting them expedited they act as if that's something they don't do.  I've been left on hold for an hour plus, hung up on, and no one returns calls In an orderly fashion. Theres no hospitality or anything. They really know how to make you feel unwanted there. It's sad", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "102623277361479602426", "name": "tammy fitts", "time": 1575306973853, "rating": 1.0, "text": "AWFUL SERVICE-- NEVER answer phone, only recorded messages.", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "107405263207708352787", "name": "valerie harris", "time": 1521578581551, "rating": 1.0, "text": "Very unprofessional and you can't never get nobody to answer the phone. They mail boxes always full or the front never answer..", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "108045952566336658703", "name": "Tavaris Hinkle", "time": 1582127538211, "rating": 1.0, "text": "I had an 8:30 appointment 2/19/2020 & still waiting on the Call", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "116312241424495333320", "name": "Tiffany Jones", "time": 1587999748778, "rating": 1.0, "text": "Never answer the phone", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "116100970602241623754", "name": "Yvonne Garland", "time": 1510176030182, "rating": 1.0, "text": "I\nKeep calling they keep hanging up,stamps been deposited BUT not in my ACCOUNT? Nobody knows anything#governor IVEY", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "108892454138851115820", "name": "Dylan sexton", "time": 1494609402926, "rating": 1.0, "text": "Sick of computers can a real person learn to pick up the damn phone", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "103820519056776072978", "name": "Tricia Love", "time": 1467129902920, "rating": 1.0, "text": "The workers act as if they don't want their jobs, I've been calling for an hour straight and no on has answered the Food Assistance Customer Care line. She either must have taken a very long break or is out of position.\nTuesday, June 28th 2016", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "102823247695160185427", "name": "Lyriks James", "time": 1507062068673, "rating": 1.0, "text": "Be warned if you are white they are hateful. I walk in there and they treat black people with a smile but myself just pure hateful. They won't even tell me if my food stamp card is in or not.", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "107792144318000316262", "name": "Brianna I'Liea", "time": 1469729183685, "rating": 2.0, "text": "Last time i applied for stamps i was told that \"she\" already knew i didnt qualify for them before i even had a fair chance....they need to work on telephone etiquette...and being more friendlier with people...don't apply for a job working with people if you don't know how to do so", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "114839139249307948912", "name": "Bathsheba Ellers", "time": 1563918833408, "rating": 2.0, "text": "Cool", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "100434019056949581186", "name": "J W", "time": 1564144300457, "rating": 1.0, "text": "They are rude. They are mean. They can look up and see all this information on someone but not that they quit.", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "111594941648055452227", "name": "Jerry Norris, Jr", "time": 1471630482580, "rating": 1.0, "text": "Worst experience ever. No one can serve nor help and I am a legal US Citizen. Incompetence.", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "101868043503321101027", "name": "keya Lee", "time": 1515776002418, "rating": 2.0, "text": "My case worker sucks an they are very slow with getting you information they take forever to answer calls an some are very very rude while others are not", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "107422639777903190848", "name": "Carla CeeJay", "time": 1544455520370, "rating": 1.0, "text": "Absolutely horrible.", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "105893008722295123320", "name": "Larry Ashford", "time": 1503939207645, "rating": 2.0, "text": "Never can get a hold of your caseworker,they don't send out important information as far as notifying you for a 6month review.", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "102816499818471092192", "name": "Halbonise Galevans", "time": 1588106126521, "rating": 1.0, "text": "Damn shame", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "111744803557299509578", "name": "Nicole Barnes", "time": 1524496575800, "rating": 1.0, "text": "Never answers phone", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "101640810815619686103", "name": "Stldbos Clark", "time": 1500912401661, "rating": 1.0, "text": "Lost my paperwork twice in one month and caused me to lose my benefits and I've waited 2 weeks with no food assistance for me and my child", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "112155594184956367341", "name": "Gab Yarbrough", "time": 1528480937202, "rating": 1.0, "text": "The worker's are Rude and disrespectful and they take forever to answer the phone and the customer service is horrible", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "106316315815120533201", "name": "jerrica tanner", "time": 1480089442220, "rating": 4.0, "text": "It takes forever for them to answer the calls but they actually are very professional when they answer the phone. Well, at least the men I talk to are.", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "112724810415925159343", "name": "Jarvis Peoples", "time": 1479408791494, "rating": 1.0, "text": "Very unprofessional unorganized .. worst experience ever...", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "108852629165852615736", "name": "Nataly Marrufo", "time": 1472747624721, "rating": 1.0, "text": "Never never answer the calls. ..", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "113933571936394856909", "name": "Flora King", "time": 1469385621952, "rating": 3.0, "text": "Better service", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "104834474040116768563", "name": "Candice Craig", "time": 1465227034883, "rating": 2.0, "text": "They are very unprofessional here......", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "107223886342681840417", "name": "keke Burroughs", "time": 1467056776950, "rating": 1.0, "text": "Always keep u on hold until u have to drive down there!!", "pics": null, "resp": null, "gmap_id": "0x88891c8f31acca27:0xe9086e815c592484"}
{"user_id": "109355566130078545608", "name": "Jared Johnson", "time": 1621267499154, "rating": 1.0, "text": "Good luck getting them on the phone. Have called 20x times and when you do get them on the phone they are extremely rude.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "107068546972227789087", "name": "Jasmine Ball", "time": 1612296753732, "rating": 1.0, "text": "Horrible customer service over the phone. Extremely long wait times and then the automated system kicks in to redirect to their site and just hangs up. The title department NEVER answers/answered the phone. I just need to see what information they need from me to get a replacement title application approved that was rejected online. Called at least on 10 different occasion with NO success. I live out of state so I can't simply visit a local office. Very dissatisfied.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "106204452420939143075", "name": "jon Green", "time": 1616728268754, "rating": 1.0, "text": "Have found a way every year to keep my State Refund every year for years constantly finding loop holes to Rip off Alabama residents.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "114027772569592804517", "name": "Chad Carlson", "time": 1619804460970, "rating": 1.0, "text": "Your website does not work. there is literally no way to get in touch with you guys.... Pointless.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "112478283065121624958", "name": "Le Mounce", "time": 1621628264872, "rating": 1.0, "text": "Horrible customer service! Wow! Don’t even know how to put in words!", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "114797197342362179092", "name": "thenunster93", "time": 1602865916376, "rating": 1.0, "text": "Called to get an exact number on how much I still owed on my taxes and was told that they didn’t know and had no way to know because their system is malfunctioning and has been. I’ve been paying for over a year every month and it’s still messed up? Get it together.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "115225443660771481861", "name": "Christina Love", "time": 1622328581131, "rating": 1.0, "text": "It's ridiculously I never received payment yet  they never pick up phone.its pathetic they will not call you back for nothing you can leave 100 message and try to call before 5:00 like 4:50 until they were not let you in there at all . And I forgot horrible customers service", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "117390043703583260019", "name": "A B", "time": 1593450982500, "rating": 1.0, "text": "Only in Alabama; it is pretty sad of this office, which is germane to the many of under leadership agencies.  Ask a simple question about motor oil tax, and get routed to 3 different ones who has no clue, but they all worked in the Sales Tax Division.  I would think if you did not report may be that would get their attention, but who knows they too may be too lazy to care.  You all do not care then why should I waste my time on unfit employees of this department.  You may say that's law; and, I will say prove it.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "104559237368144332768", "name": "Rhonda Kimbrough", "time": 1562591766021, "rating": 5.0, "text": "I called with a question about my return and the call was picked up in less than 1 minute. The person who answered was efficient and professional and verified my return in less than 2 minutes after checking my identity. Great job! I'm sure the Dept. of Revenue gets a lot of criticism because no one is thrilled with paying taxes, but I support government workers that do a great job despite little recognition.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "109426932903338876761", "name": "Pierce Carter", "time": 1591823653149, "rating": 5.0, "text": "I called and they answered my questions.\nBada bing\nBoda boom\nI paid my taxes.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "105437510034619071887", "name": "Thomas", "time": 1589644687436, "rating": 1.0, "text": "Employee began with a severe attitude, called my spouse ignorant, and used profanity. Threatened to wipe our tax claim entirely without reason. This place lacks professionalism and basic decency. Glad to know they control the finances of Alabama citizens.....", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "110621434320713536075", "name": "pvmanisgg oorgh", "time": 1584729276340, "rating": 1.0, "text": "Beyond useless staff. Have no clue how to assist with taxes or revenue statements. Would be better off asking an 11 year old.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "100226370908044875544", "name": "Brooke Sheppard", "time": 1559696881941, "rating": 1.0, "text": "If I could give them zero stars I would! 🙄 aweful people to deal with! So incompetent! I have mailed our payment twice and they keep saying they have never received it! I just want to pay what we owe! I have proof saying it was delivered! I think it’s a conspiracy for them to make more money. Have problems every year!", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "117693302722919677907", "name": "Elizabeth Williams", "time": 1598645246933, "rating": 2.0, "text": "I the call for last five and get the same answer every time bad business very sad you can't get your money you work for", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "108566734610909141808", "name": "Michael Smith", "time": 1496703266342, "rating": 1.0, "text": "Last year I received my state tax refund between 12 - 16 weeks. Alabama is one of the toughest state to receive a tax refund. I still have not receive my 2016 tax refund and I filed it in March 2017.  When I check the status  it will take 8 - 12 weeks, but this is not true.  Not sure why it takes so long to process the application or make a deposit directly to your bank account.  It should be processed and automatically paid within a reasonable timeline. Please understand Alabama have come a long ways, but still have room for improvements to serve the taxpayers.  If you were depending on your tax return for a summer vacation.  You may want to look at other options.  However, like other agencies when you owe money you are required to pay in a timely manner.  The same should apply to Alabama state tax refund.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "113224544035323133567", "name": "Cara Egan-Mazher", "time": 1560349115477, "rating": 1.0, "text": "Alabama has some serious corruption problems with their state income tax. I wish more people in this state were aware how much Alabama is stealing out of their paychecks and for what? Alabama is the worst in education, public assistance, and healthcare. Where is this money going? I have lived in different states and can tell you this isn't right!!!! Now I have to hire a CPA to fix changes the state made to my income tax, which was right to begin with????? I hate Alabama!!!!", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "104633954399667333735", "name": "Cameron Foreman", "time": 1594067293696, "rating": 1.0, "text": "Offices need to be open so us tax payers can handle business on time this is ridiculous.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "111643069083028248663", "name": "Gigi", "time": 1536096529000, "rating": 1.0, "text": "No live people answer the phone.  After the maze of automated options, if you don't get cut off after receiving the busy signal, you get to wait on hold, listening to repetitive announcements.  I left it on hold while I worked on other tasks-one hour passed and still no one answered.  I wish I could give them zero stars.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "104159956114565387392", "name": "Wykesha Ewing", "time": 1486551618091, "rating": 1.0, "text": "Nobody knows there jobs your getting incomplete information, they don't return phone calls, any mess ups on their behalf and you're the one gonna have to pay for it. Security spend more time talking then there job, they dressed like they was chilling not business attire every encounter seemed shady. For this to be a government building you would think it that the business part of it was well organized and professional.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "110382524454952879362", "name": "Nawtyshygirl", "time": 1579890291091, "rating": 1.0, "text": "The staff that is suppose to give correct information, fail to do their job.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "114520722271179545871", "name": "Ryan Ashworth", "time": 1570639522112, "rating": 1.0, "text": "Week late on insurance payment.$200 fine revoked registration. This some sneak thievery at its best.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "100378180325887311061", "name": "Drew Keefer", "time": 1532553240211, "rating": 1.0, "text": "I do not recommend trying to call and speak with them. Not only did I hold for 30 minutes but nobody ever even answered. After reading through the reviews I can see why they have such negative things to say about this place.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "100906996811953797389", "name": "Mikey Skates", "time": 1559069441797, "rating": 1.0, "text": "Awful. Just awful.  The worst customer service phone call I have ever had in my life  I asked the lady why I haven’t receive my tax refund and she said I had to do a quiz and I said okay that’s fine and i said I would happily answer whatever quiz questions and then she told me she actually couldn’t do the quiz and then I asked to speak to someone in charge who could help and she hung up on me. Soooo yall are just gonna keep my tax refund then? Alabama sucks so much. Out of all the over 10 states ive lived in alabama is the absolute worst in every single way.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "112758691515194284770", "name": "Amanda Clark", "time": 1558622097600, "rating": 1.0, "text": "I filed on Feb 4th and here it is may 23. And all they can tell me is to be patient. Lady I spoke to was rude saying they get 25,000 returns a day and I need to learn to be patient. I always have got my return before the beginning of may", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "106219868560000733376", "name": "Andrew Smith", "time": 1562695688832, "rating": 1.0, "text": "Waited 14 weeks for a state tax refund. They said the max wait time for a state tax refund was 12 weeks. Then I called and they said that was only an estimate. Then I had to escalate the case to get the refund weeks later. This to me screams stunning ineptitude.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "107889207517402839913", "name": "Tiffany Cunningham", "time": 1554309703718, "rating": 1.0, "text": "Spoke to one  lady the first person that answered the call was pleasant. The lady after her was awful and so was the so called manager. New staff please. A bunch of rude ppl", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "115661640467192690408", "name": "Kim Stillman", "time": 1498504715818, "rating": 5.0, "text": "I had a concern about a Mandatory Liability Insurance Questionnaire, as we had never received one before.  The young woman who answered my call was pleasant, reassuring, and verified there was no need for concern.  Excellent customer service response!", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "115463189342823478465", "name": "Jan Mosley", "time": 1492717082023, "rating": 4.0, "text": "My wait time was less than a minute and the lady was very very nice. Would have given her 5 stars had she said my refund was on it way!! Lol", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "115192819121872977338", "name": "joseph corica", "time": 1582127778133, "rating": 1.0, "text": "The staff has no clue what they’re doing and could care less to help you", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "110680190085114340852", "name": "Joanna S", "time": 1555621058026, "rating": 1.0, "text": "I called the department of revenue at 3:30. I was on hold for 30 min, the music stopped I listened to someone type for about 5 min while I was trying to get their attention and then I was hung up on. I called back immediately, told the lady I was hung up on and she just transferred me again. The phone rang once or twice, then the operator said there is no one to answer my call. Very bad customer service. I would give zero stars if I could.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "114124900482765754210", "name": "samantha denmark", "time": 1559309280768, "rating": 1.0, "text": "Awful. Should not take this long to process a tax refund. I filed Jan 28th, said they don’t start until march 1- so 12 weeks from there. Called this week and someone was supposed to call me back.\nCalled back today now another 4 weeks?! This is ridiculous.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "102439149384931651186", "name": "Timothy Hunt", "time": 1558623761344, "rating": 1.0, "text": "Man the call center has terrible customer service!!! Those people are depressed def not there for the sake of helping people just drawing a check. If it wasnt for being  able to be transferred to a manager to handle the situation we'd all be screwed on account of their customer service and so far its only been females to answer the phone in the call center in Montgomery al. Their on ten from the jump....", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "116463439414251613222", "name": "Arkansas Smith", "time": 1542385340031, "rating": 1.0, "text": "Great example of tax dollars at waste. Have never spent more time in my life to try to give some government entity money.....WTH?", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "102751532739308173336", "name": "Cathy Keen", "time": 1530643023417, "rating": 1.0, "text": "Mailed my taxes on 2/2. Took them six weeks to even log it into their system.  Waited 12 weeks before calling multiple times to find out where my money is.  Finally have it supposedly approved but now it says another 3 weeks before we should receive the refund.  That will make it 24 WEEKS.  This is totally unacceptable!!!  If we haven't paid our taxes before 4/15 and waited 24 weeks to pay our tax bill we'd be hit with all kinds of penalty and interest!!!!!  Because we have no way of further adjusting how much is withheld out of our checks we are excepted to wait 6 months or more to get our money back!", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "110550350619706313747", "name": "Gail Tompkins", "time": 1528204941722, "rating": 1.0, "text": "I’ve been waiting for my state refund for 10 weeks now! It’s very frustrating and also ridiculous that a state will literally take their time processing YOUR MONEY! This is the most incompetent state I’ve ever dealt with and I will NEVER reside in the state of Alabama again. Had I owed them money they’d want it YESTERDAY and here I’m told 8-12 weeks to process a refund!! That’s is absurd!!  This is 2018 and Alabama still falls behind smh! You really need to do better!! 😡😡😡", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "108366718125405044437", "name": "David Jackson", "time": 1527596697364, "rating": 1.0, "text": "This is a bad place to work, very oppressive. Many divisions, not all, are very strict and management isn’t held to the same standards. Problem makers, especially in management, aren't dealt with, just shifted around or simply ignored .  In addition, much of the staff has an attitude problem. The turnover is very high.\n\nHowever, they don’t seem to have budget problems like some other agencies.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "104250110088533567752", "name": "Frank Danielson", "time": 1577481984877, "rating": 1.0, "text": "Grumpy old and big around lazy people", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "116911409403594335149", "name": "P T", "time": 1496780228037, "rating": 2.0, "text": "Filed my taxes in late January and still waiting on my refund. When I call there is a message that states that my filed taxes are being processed and that I should receive my refund 8-12 weeks from \"today\". I only want to know WHICH DAY??  I have been getting the same message for 8-12 weeks already.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "110591067399318009019", "name": "Corey", "time": 1499875700833, "rating": 1.0, "text": "Information regarding the timeline for sending my refund is totally ineffective. The link on the website (\"Where's my Refund\") is totally useless, as it states that your refund should be processed and provided within 8 to 12 weeks from today. I filed my state returns on 3/21/17 and it's now 7/5/17 and no refund has been received. When you call the ADOR office, the employees are courteous, but they don't give you any further information than the useless \"Where's my Refund\" link on the website.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "100319134907510330751", "name": "Dylan T424", "time": 1526447867160, "rating": 1.0, "text": "I still havent got mine yet its ridiculous it's been 3months since I filed like really need that  money. but if we owed them money they want it now and if not they charge interest. its pitiful that I have to wait so long", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "101847769799357721675", "name": "Jennifer Arcuri", "time": 1483645222779, "rating": 5.0, "text": "Both the woman I spoke with at the Department of Revenue and the gentleman in UI were extremely helpful, polite, and a pleasure to work with.  I got the information I needed quickly and I appreciate the way they handled my call.  Thank you!", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "115477747156675591990", "name": "Chanelle Matthews", "time": 1546977743495, "rating": 1.0, "text": "I have been trying to get in contact with anyone who works there and no response. I have been on hold all morning ridiculous. They want your money what a joke.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "103140785358144333419", "name": "Derek Rogers", "time": 1499878473889, "rating": 1.0, "text": "If you can avoid these people then please do. This is the worst service I have ever received. To make it worse, they are government employees. People that serve the public. My wife and I have both called in separate times (we have called about once a month) to find out more on the status of our return ( it has been 5 months). Each time we call every employee is extraordinarily rude and sound like they don't want to.m be there. They will transfer you to others without telling you, and they will hang up on you every time without warning.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "114421953740081395848", "name": "M Wood", "time": 1523722570210, "rating": 2.0, "text": "It doesn't matter how you file, electronically, paper or carrier pigeon, Alabama never meets its obligation of refunding 8-12 week after filing. In 15 years, I think I got one refund as early as June. Absolutely horrendous fiscal management. ADOR wants its money but the taxpayers have to wait on their refunds, always blaming it on the system. Then GET A NEW SYSTEM!\n\nUpdate 4/2018. I actually received my refund in April  (only 90 days!) I had my put my direct deposit information on my return and they sent me a check.  Maybe they can get all together in the next ...ohhh..... say 5-7 years. They are so technologically challenged, it's pitiful.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "117916966552796085894", "name": "Mattnjen02", "time": 1475601206543, "rating": 1.0, "text": "We filed in April and its now October and still haven't received our refund they will tell you few weeks over and over and you won't see anything ours is suppose to go direct deposit but now they saying they are mailing them out to keep identity theft low what the crap they just don't wanna give people there money but when someone owes them you gotta pay them right away ! They don't even deserve one star! By the time we get our refund it'll probably be tax season again!", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "113951894963903435568", "name": "Kathy Bates", "time": 1465921711865, "rating": 1.0, "text": "Waiting on the state of Alabama to send a refund does not even deserve one star. Been waiting four months!! Most of the time, the website isn't available ! It doesn't take long to take it out of our checks, does it?", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "102418245579842083359", "name": "Guy Carter", "time": 1506369567864, "rating": 1.0, "text": "HORRIBLE Automated attendant. Runs you thru the ringer & then hangs up on you. PATHETIC! If you can get someone on the phone they are usually good to help otherwise good luck!\nJust trying to get assistance on sales tax which we collect for the DOR.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "106239950453598103898", "name": "tom oconnell", "time": 1424274312332, "rating": 1.0, "text": "Horrible!!! What # do I call to ask a live person this question? Moved to Florida. What do I do with my Alabama plate? Am I do a pro-rated refund? Any help answering these questions would be appreciated", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "103635078601376322048", "name": "Shannon Davis", "time": 1492569167846, "rating": 1.0, "text": "Trying to pay online is a nitemare. Shouldn't be this difficult. Instructions don't work!", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "109575282466527216533", "name": "Sana Dee", "time": 1467142442260, "rating": 1.0, "text": "I filed on february 1, 2016. It was approved on February 2, 2016. It has been exactly 21 weeks since I have filed and I still have not received a refund for my money ( 8 to 12 weeks my ass ) my reply still hasn't been approved it still says processing . But last year when I owed them $164 they took it directly out of my checking account without hesitation.  I know they have a new system but this is ridiculous!  This state sucks! this is by far the WORST experiece i have ever had .  By the time I receive my refund it will be a new tax filing year !", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "112757478421123761332", "name": "phionah victours", "time": 1562232839448, "rating": 1.0, "text": "I haven’t received my returns everytime they are telling to me wait 8 to 12 weeks", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "109413598947320742323", "name": "Johnnie Johnson", "time": 1530236256970, "rating": 1.0, "text": "So glad and funny to be able to see other reviews and write one my self .\nThey absolutely hate their job . Not one bit of interest\nin you or your problem . HAHahaha you just have to laugh!,,", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "102325298086655912526", "name": "Emadeithappen 1", "time": 1506010010981, "rating": 1.0, "text": "Just called to follow up on getting my title replaced, which i sent in 3 weeks ago, and had the rudest experience. I could hear people standing and being very loud next to my service rep. I had to repeat my info 3 different times. Then she proceeded to be rude with me about my inquiry. Pathetic serice.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "108656921460981624092", "name": "Jonathon Washington", "time": 1572616138810, "rating": 1.0, "text": "I got my refund in 2017 and they turned around and said I owe $69 this year. The year I had my refund in 2017  i had to turn around  and pay back $834. This state is shady", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "115229069547770380211", "name": "Athena Fischer", "time": 1479329762969, "rating": 5.0, "text": "I deal with various offices in the Department of Revenue for business taxes paid by my employer and its entities.  I have found the staff at ADOR to be incredibly friendly and helpful, and able to help me resolve problems in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "117014630495551579381", "name": "Leslie S.", "time": 1491244650031, "rating": 1.0, "text": "It rings 1 time and then hangs up you!! Get organized! Earn you pay check!", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "101613542880731724109", "name": "Ursula Hambrick", "time": 1527626325417, "rating": 1.0, "text": "Poor customer service I literally hate calling them.  They are no help at a all.  The only thing you get is rude people who don't want to do their job", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "102951304582805102543", "name": "Mohammed Kassim", "time": 1556560048333, "rating": 1.0, "text": "I paid my taxes in time\nBut when it comes to my refund they took 4 -5 months\nAnd I paid my taxes for 2018 and I'm waiting for my refund they took more than 3 months to send me a letter that I owed them 1300$ from 2017\nWhat's wrong with this state", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "108728955321270776480", "name": "jason harsany", "time": 1550711309459, "rating": 1.0, "text": "Complicated filing systems. Hard to contact them", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "105822424967039066751", "name": "Ashley Terry", "time": 1513005496860, "rating": 1.0, "text": "I hate dealing with this office.\nWait on hold for over an hour, get talked to very rude and then they hang up on you!", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "118124745068704180227", "name": "Ann Aldacosta", "time": 1465468363263, "rating": 2.0, "text": "Shouldn't take 12 weeks to get a refund. We don't get 12 weeks to pay. My  return  has been over 12 weeks now.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "108758869438440186647", "name": "TrizzBizz", "time": 1529091778810, "rating": 1.0, "text": "Still haven't gotten my tax money and I filed way back at the beginning of February. People are probably having to wait forever because they probably don't have it to pay but if they feel you owe them even a quarter they snatch their money right then. With the corrupt scumbags that keep getting elected and embezzle from the state, no desire for anything lucrative to potentially bring in more state revenue as if religion pays bills, this state always has been the poorest and the state with the least progress in the country. So glad I have finally moved out this 1950 outdoor crapper and won't be back for as long as I'm breathing.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "104609514763186197847", "name": "Debbie Moreno", "time": 1500663169440, "rating": 1.0, "text": "horrible service... transferred 4 times the last transfer was back to the automatic line and another person answered waited 17 min for help with a vin number no one never came back to the phone.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "110299461687353075358", "name": "Tywana Bodacious Beauty", "time": 1519043096312, "rating": 1.0, "text": "When you owe the state of Alabama, they waste no time snatching your coins, but let them owe you!", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "101880788937721007398", "name": "Nat B", "time": 1573858004991, "rating": 1.0, "text": "Trash", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "109443505332265793068", "name": "Talietha Wright", "time": 1533661582929, "rating": 1.0, "text": "I've been waiting since February for my refund. Every time I call, I'm told that it's still processing.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "103815675878241400789", "name": "Stephanie Traywick", "time": 1517253694839, "rating": 1.0, "text": "Very rude don't want to explain anything always got something to say when they don't allow you to finish your question or response", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "103043337300499636772", "name": "Trey K", "time": 1527003898079, "rating": 1.0, "text": "been telling me 8-12 weeks for my tax refund  for the past 5 months", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "112778902171551191098", "name": "Peggy Judkins", "time": 1591902054251, "rating": 1.0, "text": "Awful service", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "108398124950114255206", "name": "Troy Stewart", "time": 1557842310721, "rating": 1.0, "text": "The worst.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "106869701322314952462", "name": "Renee Faust", "time": 1494956637842, "rating": 4.0, "text": "Great experience with ADOR.  I have only gotten one person that was rude.  I called right back, and talked with the kindest women.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "105854508041316476677", "name": "J.O. Degenhardt", "time": 1463749516180, "rating": 1.0, "text": "Filed in early February and still no refund. This is the 21st Century, there is no way it should take this long.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "116301224635918029495", "name": "kenyetta crenshaw", "time": 1489080190790, "rating": 1.0, "text": "These people are Rude and not helpful at all don't waste your time", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "106497829445282299570", "name": "DVIINE FEM", "time": 1522252896402, "rating": 1.0, "text": "2003 and still having problems getting my check", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "102938396913044369630", "name": "Joshua Burroughs", "time": 1464973071036, "rating": 1.0, "text": "They decided to cancel our direct deposit and instead send us a paper check. And they hung up on us after trying to ask why they did that.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "115743426927513124487", "name": "Brandi Murphy", "time": 1498493879681, "rating": 1.0, "text": "I like how they can take out money every time we get paid and when they want it but sure can't send refunds on time.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "108774753000134608529", "name": "Paul", "time": 1491591954648, "rating": 1.0, "text": "Efficiency - 0% Organization - 0% Qualified Personnel - 0% Competence - 0%", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "105763080224955820784", "name": "Beverly Johnson", "time": 1493731183030, "rating": 5.0, "text": "Very helpful and polite employees", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "107750772085459127940", "name": "Amy Odom", "time": 1491859587552, "rating": 1.0, "text": "The wait for some to answer your call is extremely long!!", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "100746035169449944232", "name": "gary patel", "time": 1490373847774, "rating": 1.0, "text": "All people not helpful at all just 1 question I ask and they transfer 7 time to the different people and rude people they work for government not boss hope someone will read this stuff and understand", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "110916599459834573891", "name": "isaac Wilson", "time": 1509981640662, "rating": 1.0, "text": "I have been waiting for my refund for over 9 months. Every time I call there is something else that delays my refund. I have sent the same information for the past 3 years. I sent the information Certified mail this year and they say we have not received it and the postal service delivered it 4 weeks ago, What kind of place is this.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "118154903917324992422", "name": "Melissa Echols", "time": 1462546747993, "rating": 1.0, "text": "We file in 31st of January and still hasn't got Our refund", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "102063152875562200449", "name": "Lenn Targett", "time": 1491929000022, "rating": 1.0, "text": "I am retired Army, and File in Jan of each year and may get my return by June..  I call and get the same type info... waiting on employer to verify income, they have the 1099's .  Don't understand why the wait.", "pics": null, "resp": null, "gmap_id": "0x888e81762b33d7c1:0x75dc0a25c647ff72"}
{"user_id": "109101683760206148966", "name": "Sadie Mae Carlson", "time": 1623268100977, "rating": 1.0, "text": "Everyone was incredibly rude and I left the building in tears. Extremely do NOT recommend... gonna sound like a broken record, but go to Opelika instead. People will be mean because it’s the DMV after all, but at least it’s a more pleasant environment. The employees need to understand that the people who come in, did not ask them to fill out the job application to work here. If they are that unhappy with their job they need a new one... but they probably will never find anything because of their awful attitude. They should be glad that I am sensitive and didn’t clap back, but if it was anyone else I’m sure that I would’ve been the lady’s dinner discussion tonight. That’s guessing that she is going home to anyone. I’m done.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "113575207581579038134", "name": "Stacy Sowders", "time": 1617980848056, "rating": 5.0, "text": "Great visit! Did not have an appointment, just walked right in!  Both the lady and gentlemen who I spoke with and saw others speak with were extremely kind and helpful!", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "116844311577613881067", "name": "Son Lam", "time": 1620047838772, "rating": 5.0, "text": "THE LADY AT FRONT DOOR SO NICE TO ME....THANKS PHENIX CITY DRIVE LICENSE", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "110232314057512429970", "name": "Nikki Horne", "time": 1619729720035, "rating": 5.0, "text": "Needed my license updated from moving recently. Everyone here was so polite and quick to get everyone in and out.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "111830593540201977038", "name": "Karla Hernandez", "time": 1614090705920, "rating": 5.0, "text": "I was afraid to come to this place given all the bad reviews. But I had a good experience. Had the first appointment in the morning along with my husband and they took us right away. Was greeted pleasantly and we were both in and out within 20min with our new Alabama licenses.", "pics": null, "resp": {"time": 1614091565058, "text": "Thank you so much for the nice comments! 😊"}, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "105602494944328735349", "name": "Angela C", "time": 1613925075986, "rating": 5.0, "text": "They may not answer their phones but if you have concerns or questions they will answer them in no time on Google review!  Awesome customer service,  and professional!  5 stars", "pics": null, "resp": {"time": 1614091887723, "text": "Thank you so much....we do answer when we can 😇"}, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "113780643245245135121", "name": "Master Tla", "time": 1605274273192, "rating": 5.0, "text": "I remember coming here once over 10 years ago to get my very first license and leaving empty handed. Then we started going all the way to Opelika. But today, I went back to this office because it's down the road from work and I'm glad I did. I had a very pleasant experience. I was in and out withing like 15 minutes. There were three wonderful ladies there who were very nice and honestly I've never left a government office feeling this good about it. 11/10 would recommend.", "pics": null, "resp": {"time": 1605275181394, "text": "Thank you so much for the sweet comments!! We're glad you had a great experience."}, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "107937465765177450443", "name": "Allie Frost", "time": 1621366678216, "rating": 1.0, "text": "They were extremely rude to me and my dad will not be using them ever again go to the opelika one don’t waste your money", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "109380338940776488378", "name": "Ephiney Valdez", "time": 1587301706547, "rating": 5.0, "text": "The Lady that helped me was really nice. It’s sad that I’m terrible with names. Idk where most of these people who wrote a review went but I had great service. Fast, to the point and she was very helpful with any questions I had. Advice for anyone needing to come here. Make sure you have EVERYTHING you need for your visit.(I’m sure you can find a list on the website) Things will go so much smoother.", "pics": null, "resp": {"time": 1591277449362, "text": "Thank you so much for your sweet reply."}, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "118074417690330752173", "name": "A Addison", "time": 1575478138710, "rating": 5.0, "text": "They may not have answered when I called but when I got there my questions were answered. Be mindful that there are only 2 people in the office attempting to assist everyone they can serve. Depending on the day and time your wait may be a little longer but the customer service was pretty good. Just sharing my experience.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "103125511279939734827", "name": "Roxylove1994", "time": 1591200882727, "rating": 5.0, "text": "I had a great experience here. I was nervous because of all the bad reviews but everyone was so nice and very helpful.", "pics": null, "resp": {"time": 1591205423580, "text": "Thank you for your review. We are glad you had a great experience."}, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "108727932252294408649", "name": "Ben Branton", "time": 1598277857154, "rating": 1.0, "text": "Absolutely horrible people that are not helpful at all. They only care about getting their government check and getting their hours that they have to work.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "105974474383170266827", "name": "James Troy", "time": 1584527023110, "rating": 1.0, "text": "Should have went to opelika. That's all I'm  Gonna say .... be best to go there frfr", "pics": null, "resp": {"time": 1584532734305, "text": "The same documents and procedures are required at all offices."}, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "118236320893632222286", "name": "Thomas Schwerin Jr", "time": 1584724529079, "rating": 5.0, "text": "Very helpful and knowledgeable staff...I had what was required of me and it was a very pleasant experience...", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "118334402558353761583", "name": "Stephanie L", "time": 1510758314050, "rating": 5.0, "text": "Both ladies were very nice, as always.. The lady who helped me today was very pleasant and helped me in a timely manner. It’s amazing how you get treated in this office, or anywhere else, when you understand why things may take a little bit longer than expected and treat the employees with the same respect that you expect in return. 🤷🏻‍♀️", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "114566632092704394005", "name": "Megan Parker", "time": 1550075324281, "rating": 1.0, "text": "This place is so ratchet. They wouldn’t let us sign in to get my friend’s permit because they have lunch break 12-1 and it was 11:20. Apparently they stop servicing at 11:30, but it wasn’t even 11:30. They also never answer the phone, so don’t try calling.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "106398180206069264221", "name": "Rachael DuBois", "time": 1570824011683, "rating": 1.0, "text": "I took a half day of vacation to get my daughter's driver's license. After waiting nearly two hours, we had to leave because they were so slow that they couldn't get to us. I am sick after having spent a half day of vacation to be turned away. Some people aren't given all the time in the world to get something done. What a horrible experience.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "116725988535789498776", "name": "Stacey Greer", "time": 1535056791893, "rating": 1.0, "text": "I called because I never received my license in the mail. The lady that answered was short and very rude. I had to argue with her to get any useful information. Luckily the lady in Montgomery was super nice and got it straightened out.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "109540470211781312225", "name": "Girlie Copeland", "time": 1554993552427, "rating": 5.0, "text": "The customer service was awesome and the lady who was assisting me was super friendly. I would recommend this place to anyone!", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "104195462328541063172", "name": "sara Serene", "time": 1494904956933, "rating": 5.0, "text": "Fantastic service from both ladies, one even went above and beyond to help me achieve my goal and for that I am very grateful.  When going anywhere in life remember TREAT PEOPLE HOW YOU WOULD LIKE TO BE TREATED!", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "101000589756485889570", "name": "playlist playlist", "time": 1583946948793, "rating": 1.0, "text": "well i passed the test 😎 the people were rude but that’s expected lol", "pics": null, "resp": {"time": 1583954258366, "text": "Congratulations on your test , can you explain what the problem was?"}, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "108660727688279982364", "name": "Brandy Hunter", "time": 1524867504261, "rating": 1.0, "text": "Very unprofessional. They close at 4:30 pm, and I arrived there at 4:10pm with my daughter to take her learners test and was turned away. Not to mention, I had arrived there prior with a copy of my daughter's birth certificate, and of course it was not acceptable. I left to go get an certified copy, and returned for the 2nd time at 4:10; when I was there the first time, no one thought about telling me that they stop accepting customers before they're closing time.  I work in a public facility and we would not nor would we be allowed to turn people away 20 min, not even 5 minutes before closing time. This shows laziness and a poor work ethic. This should not be allowed. Anyone that arrives before the closing time should be seen; that's the point of having a closing time. If they want to stop seeing people at 3:30/4, that's the time that they state as their closing time. I hope to never have to go there again, and I hope that someone makes some changes to better serve our community in a more positive way for the future!", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "104876437851709010165", "name": "Vickie Smith", "time": 1493745074792, "rating": 1.0, "text": "VERY VERY RUDE... DOES NOT ANSWER CALLS, will not give answers for guestions asked. they act like they are better then the people they are serving. This is a state office not their personal office and they need to treat the public with the same respect they would want if they came into an office like this. GET BETTER PUBLIC SERVING INDIVIDUALS...", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "100056255853779900034", "name": "Madelyn Myers", "time": 1557944161870, "rating": 1.0, "text": "I have called every day for a week.\nNo one answers. Ever.\nCalled the Opelika DMV got an answer on the first call.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "110080401484781918912", "name": "Valley Girl", "time": 1589221614626, "rating": 1.0, "text": "Terrified to go in will travel elsewhere based on reviews.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "115723207660072963949", "name": "Shauntel Lang", "time": 1487781216093, "rating": 2.0, "text": "When I got my license the lady was very nice it was quick and easy but i still haven't received my hard copy and it's going on two months now I have called the number that is on the paper copy they  literally never answer I just tried calling this place three times to see if I can come in again another paper copy with the new expiration date but they still didn't answer but the lady who I got was overall a nice but I will not request  but you call it's better for you to go on there face to face.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "112850640942053614473", "name": "DJ Chemlyte", "time": 1493912149134, "rating": 1.0, "text": "They have their office hours posted but will not answer calls. I'm guessing they are under staffed?... Attempted to reach them all day and no one will pick up the phone. Instead, someone would answer and hang up. This happened four consecutive times. We may be forced to go congressional on this one and improve the quality of personnel employed. This is completely unprofessional.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "113498148440912098758", "name": "Lee Smith", "time": 1438184333166, "rating": 5.0, "text": "Very friendly.  People don't understand that there are only two people in this office and if they answer the phone every time it rings,  no one would be waited on. The examiners are not rude. There are signs everywhere telling you what you need to have to get processed and noone reads them. If you had several people a day cuss you out because they were not prepared, you would understand.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "113261196103430054785", "name": "Kaleena Williamson", "time": 1454615762003, "rating": 1.0, "text": "They will not answer the phone! Hopefully I will have a better experience when I go in the office in the morning because I'm taking off work and praying I've got everything I need to renew my license tomorrow quickly!", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "101348501424003743960", "name": "Giovanni Arango", "time": 1454719573330, "rating": 1.0, "text": "Very rude people! I ask polite questions and all I get is attitude, they talk loud, roll there eyes, talk to me like I'm dumb. I feel like there racist to Hispanics", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "106264865564088922200", "name": "April Adkison", "time": 1488392333564, "rating": 1.0, "text": "I went in there today not knowing that I was suppose to do what I needed at the dmv. The lady was helpful somewhat but had an ugly attitude. I've always said why work with the public if you are going to have a bad attitude. Smh...", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "116083079620424691021", "name": "Luciana Shaw", "time": 1572715195525, "rating": 1.0, "text": "Came on a Saturday, because online it says it is open Saturday until 3pm, but it is closed.", "pics": null, "resp": {"time": 1583954364037, "text": "Phenix City office is not open on Saturdays\nPer www.alea.gov"}, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "101184646429636172776", "name": "Zachary M. Drexler", "time": 1439957962108, "rating": 1.0, "text": "If I could rate this place any lower, it would surly be a negative 9000. As most of you already know, the phone line seems to be messed up. Also, when I entered the building for the first time, the ticket machine had a sign that stated that they were no longer taking any more people to be seen by an associate. And  when I walked up to the \"desk\" no one payed any attention to me, their desk is not even a desk, its a door to go to another desk. It made me feel like they did not want me there. Customer service is terrible. Furthermore, I asked them for a drivers manual after standing there for about 10 min. and they said that you have to download it off their website. So, I tried doing that, and it said that their web page was unavailable.I have never experienced such a place with as bad customer service as they do.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "100094892005175887739", "name": "unique morgan", "time": 1511724620408, "rating": 5.0, "text": "Both ladies was extremely nice mrs clanton really go above and beyond to help me she was great. Thank you", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "106439695419509858084", "name": "Kimberly Rose", "time": 1532608764254, "rating": 1.0, "text": "I wish I could give zero stars the service here is awful and the people are super rude with minimal explanation when you ask any kind of question. Had to tell the woman three times why I was there. Then the system was down but said that It was just for back ground checks wrong it meant she couldn’t print and process any kind of license so I sat and waited for an hour for no reason also mind you I was the second person in line which is a ridiculous wait time.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "107225646102502061435", "name": "Kevin red", "time": 1447541819664, "rating": 1.0, "text": "Ok the only thing that you can like are the 2 lady's working in the lil hell whole the people that were there looked as if they woke up rolled out of a  New York gutter a man smoking inside, the dmv lady told him to put it out he got pisted.spit on the floor and left. some. People had shoes on, one lady had on a bra. And dirty  PJ  bottoms The people you can overlook,, even the drunk ones that didn't no why they failed the test before they drove.. Not the dam mice running around comeback to that Nasty dump No Fn way i don't know how those 2 lady's work there every day i felt bad for them. The people they call customers were mean nasty $hi++y people those lady's didn't get upset about anything not mad nor rude they just stayed in there Unsecure no camers no lock door no plexiglass Dingy mouse invested dungeon what a dumpster and i was in the military never been so let down at a DMV not even in DC or NewYork, were this bad. Maybe at the bus station with half the people being homeless. Would be expected not the DMV. Dumpster", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "104865239642721917167", "name": "Crystal Jones", "time": 1377620142644, "rating": 1.0, "text": "No one will answer the phone!  Will someone please do something about this?", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "105767471535257561502", "name": "Linae Totten", "time": 1504112931943, "rating": 1.0, "text": "Very poor attitudes towards customer service.  Her tone was quite disrespectful until she realized I was in the military.  It's a shame I wasn't treated with kindness and respect before that.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "111550088614243468088", "name": "Patrick Carver", "time": 1571160347814, "rating": 1.0, "text": "I have called and called and never got a answer.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "108110229258279104612", "name": "Jessie Green", "time": 1433863171486, "rating": 1.0, "text": "The driving instructor is really rude she failed me twice saying I didn't come to a complete stop at the stop sign and I sat there for 5 mins. They're just all rude people.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "110733269707790412023", "name": "Toikeious Watson-Christian", "time": 1496674378913, "rating": 2.0, "text": "I've called several times nobody will answer the phone it's 11am on Monday, the doors were locked when I got here!", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "105323011120731433830", "name": "Mike Ott", "time": 1478262765481, "rating": 1.0, "text": "Terrible customer service. The man and woman in the office both had very condescending attitudes and it just seemed like I was an inconvienience to them.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "114559231311799306981", "name": "Joey Pined", "time": 1481739858917, "rating": 1.0, "text": "Tried calling n phone just rings wish I had a job I didn't have to answer the phone", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "106979410289461904155", "name": "Daniel Griswell", "time": 1469454507301, "rating": 1.0, "text": "I'd give no stars if I could. For those of you who are complaining that nobody answers the phone, we were there for 4 hours and I never heard a phone ring. I don't think they are plugged in.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "102793785909991293121", "name": "Zachary Bozeman", "time": 1454958172007, "rating": 1.0, "text": "It was terrible they disrespected my friend @ giovanni arango and and his instructor was very rude disrespectful and saying he can't drive they need new instructors", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "111358742334338870132", "name": "Vivian 'Valkyrie' Piorkowski", "time": 1475984579668, "rating": 1.0, "text": "The ladies acted like we were bothering them when we came into this building. We were in the wrong building looking for the tag office which we thought would be at the DMV. They gave us directions that took us in the complete opposite direction of where we should have been going. They said they didn't know the name of the building so we could just google maps it. Turns out it was city hall...", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "114618746504650171540", "name": "Jay Yu", "time": 1389291147645, "rating": 2.0, "text": "Nobody answered phone! Dont undetstand!", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "112664868620896591727", "name": "Tim Kaltreider", "time": 1483622397443, "rating": 3.0, "text": "They don't open till 8:30. Web site needs updated", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "100641549903432936555", "name": "Andre Wilson", "time": 1504895466462, "rating": 1.0, "text": "There wait is entirely too slow🐌🐢.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "112664868620896591727", "name": "Tim Kaltreider", "time": 1483622397443, "rating": 3.0, "text": "They don't open till 8:30. Web site needs updated", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "102793785909991293121", "name": "Zachary Bozeman", "time": 1454958172007, "rating": 1.0, "text": "It was terrible they disrespected my friend @ giovanni arango and and his instructor was very rude disrespectful and saying he can't drive they need new instructors", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "104217515162974723903", "name": "Unique Kay", "time": 1466439440108, "rating": 1.0, "text": "It was okay", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "106979410289461904155", "name": "Daniel Griswell", "time": 1469454507301, "rating": 1.0, "text": "I'd give no stars if I could. For those of you who are complaining that nobody answers the phone, we were there for 4 hours and I never heard a phone ring. I don't think they are plugged in.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "117830707388692612398", "name": "treaveon abney", "time": 1446940677932, "rating": 1.0, "text": "The service is really bad! I have been calling for 3 days straight and still haven't got an answer", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "106756665590862988934", "name": "Patricia Culliver", "time": 1442592318266, "rating": 1.0, "text": "Can't get anyone on the phone", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "114618746504650171540", "name": "Jay Yu", "time": 1389291147645, "rating": 2.0, "text": "Nobody answered phone! Dont undetstand!", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "109711479415281600845", "name": "Rita Smith", "time": 1370287622648, "rating": 2.0, "text": "No one answers the phone. EVER.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "115842929767245206235", "name": "Angelia Hodges", "time": 1358436606404, "rating": 2.0, "text": "Can't get anyone to answer a phone.  Can I get away with this in my job????  Of course not.", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
{"user_id": "109098096634310318502", "name": "Clayton Smith", "time": 1348851014568, "rating": 2.0, "text": "Will not answer phone! Is this what our taxes pay for?", "pics": null, "resp": null, "gmap_id": "0x888ccdb7bd9e8147:0xafedd7bf02531b0b"}
