{"user_id": "115145440388501359477", "name": "Kruzifer Delaluz", "time": 1600870854124, "rating": 5.0, "text": "These guys are fantastic. They can always get what you need. Even if it isn't in stock in Mobile, they can get it in a day from the Ryerson in Birmingham, Atlanta or New Orleans. Guys in the shop are friendly and always willing to help. This is the only company I will ever buy metal from.", "pics": null, "resp": {"time": 1613563352766, "text": "Thank you for taking the time to leave a review Kruzifer Delaluz. Hope to see you back"}, "gmap_id": "0x889a4fc5bd86762d:0x21842788db8ebfcb"}
{"user_id": "108488913540565756993", "name": "Artem Varvinets", "time": 1597842804944, "rating": 4.0, "text": "1) Get ready to stuck while getting in to their yard. Thanks Sall for pulling me out.\n2) Right handed backing\n3) Dont hope to get loaded fast.\n1,5-2 hours.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMmPiCBfC4t2EKhTq3FqLA_2m5TKZNZx5MJOqY6=w150-h150-k-no-p"]}], "resp": {"time": 1613563454015, "text": "Thank you for taking the time to leave a review Artem Varvinets. Hope to see you back"}, "gmap_id": "0x889a4fc5bd86762d:0x21842788db8ebfcb"}
{"user_id": "113339664235625570364", "name": "Joshua Hicks", "time": 1601034477539, "rating": 5.0, "text": "Great company quick loading and unloading and awesome staff and work place highly recommended", "pics": null, "resp": {"time": 1606831889776, "text": "Thank you for taking the time to leave a review Joshua Hicks . Hope to see you back"}, "gmap_id": "0x889a4fc5bd86762d:0x21842788db8ebfcb"}
{"user_id": "102380636295761288115", "name": "Rebecca Spann", "time": 1600984331063, "rating": 5.0, "text": "Hands down the best company to purchase metal from. A+++", "pics": null, "resp": {"time": 1613563306755, "text": "Thank you for taking the time to leave a review Rebecca Spann. Hope to see you back"}, "gmap_id": "0x889a4fc5bd86762d:0x21842788db8ebfcb"}
{"user_id": "102838956268621124982", "name": "Honey Bugs Apiaries", "time": 1600870931569, "rating": 5.0, "text": "Great customer service, management, and friendly staff.", "pics": null, "resp": {"time": 1613563322060, "text": "Thank you for taking the time to leave a review Honey Bugs Apiaries. Hope to see you back"}, "gmap_id": "0x889a4fc5bd86762d:0x21842788db8ebfcb"}
{"user_id": "112927570451306250658", "name": "Jimmy Milan", "time": 1629297582422, "rating": 4.0, "text": "as a flatbed driver making a delivery, it was easy. simple in and out procedure.", "pics": null, "resp": null, "gmap_id": "0x888bb72165118a15:0xd680be41793985a7"}
{"user_id": "101662367206732765513", "name": "OUTLAW HEW", "time": 1626673094369, "rating": 1.0, "text": "During orientation they try very hard to appear as an employer who respects and abides by the federal laws regarding disabled persons, yet, they fire you for your disability and nothing more.\n\nAlso, the managers are too goofy-looking to ever be taken serious.", "pics": null, "resp": null, "gmap_id": "0x888bb72165118a15:0xd680be41793985a7"}
{"user_id": "117930841793256008242", "name": "Jacob Beach", "time": 1625004967380, "rating": 3.0, "text": "Pretty good experience all around.", "pics": null, "resp": null, "gmap_id": "0x888bb72165118a15:0xd680be41793985a7"}
{"user_id": "103659611990043172504", "name": "James Farrell", "time": 1628714908639, "rating": 4.0, "text": "I work there", "pics": null, "resp": null, "gmap_id": "0x888bb72165118a15:0xd680be41793985a7"}
{"user_id": "117883341065985820727", "name": "Rosa Campbell", "time": 1617761101444, "rating": 1.0, "text": "A horrible company with indescribably terrible management", "pics": null, "resp": null, "gmap_id": "0x888bb72165118a15:0xd680be41793985a7"}
{"user_id": "110741703398635112582", "name": "Marcus", "time": 1614013609762, "rating": 5.0, "text": "In and out in just under a hour", "pics": null, "resp": null, "gmap_id": "0x888bb72165118a15:0xd680be41793985a7"}
{"user_id": "103298200973261352638", "name": "Derrick Thrasher", "time": 1588851530741, "rating": 5.0, "text": "Great place to work. Wonderful people, Family oriented, and great opportunities to advance.", "pics": null, "resp": null, "gmap_id": "0x888bb72165118a15:0xd680be41793985a7"}
{"user_id": "102017420171335864107", "name": "Russ C", "time": 1511368510543, "rating": 1.0, "text": "no sales personal available. come back later, maybe somebody will be here by then ????\nHell of a way to do business.", "pics": null, "resp": null, "gmap_id": "0x888bb72165118a15:0xd680be41793985a7"}
{"user_id": "109900730839231018385", "name": "Ron Lister", "time": 1501116863852, "rating": 1.0, "text": "ZERO STARS.  These people are liars.  Plain and simple.  I will never work for this company again.  We had 13 people go out to AMNS Calvert Still mill for a 2, possible three day shutdown.  After 11 hrs. they said it was over and we would not be coming back.  We finished our task.  We were brought out by EM Contractors in Daphne, They perpetrated the lie.  They knew no one would go to Calvert al. for 11 hrs., so they right out lied to us.  And then they had the nerve to ask us to sign into the next task that would last about 30 minutes.  NA, we are good!  Yawl do it!  Do Not Answer the phone for EM Contracting in Daphne, the will screw you.  As for RJ Baggett, I will never work for you again", "pics": null, "resp": null, "gmap_id": "0x889a4dd81286a3e1:0x7d7b9f041832965b"}
{"user_id": "108448284389925447403", "name": "Rick Davis", "time": 1481001356507, "rating": 5.0, "text": "Good job company", "pics": null, "resp": null, "gmap_id": "0x889a4dd81286a3e1:0x7d7b9f041832965b"}
{"user_id": "106827135453115469843", "name": "ANDRE AUSBON", "time": 1629207127703, "rating": 5.0, "text": "Of all the Shelter places we looked at, these folks are the best in my opinion.  They have been specializing in building quality shelters for 25+ years.  We first made the short drive to their facility and was able to see several different styles.  The staff was very helpful and polite in pointing out all the options for door and seating placement.  They were helpful in understanding the different features on an indoor shelter vs outdoor shelter. They clearly discussed all the associated costs, delivery, etc.   They properly set your expectations on expected completion date.  We had ours delivered and installed in our Detach Garage.  We feel much more comfortable now having the shelter to protect us in time of need.", "pics": null, "resp": {"time": 1629210017230, "text": "Thank you for the great review and thank you for choosing us as your severe weather protection!! We are extremely grateful."}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "110021434649420750022", "name": "Angie Barnett", "time": 1627515313658, "rating": 5.0, "text": "We just had our 4x8 foot storm shelter installed on July 22, 2021.  We cannot say enough positive things about the quality, price, and customer service of this company.  We have experienced several close calls with tornadoes in Chilton County during the past two years.  The anxiety of not having a safe place to take shelter, especially with several small grandchildren, was more than I could handle.  With this shelter, I feel such a peace of mind in knowing that we will be protected.  I researched several companies, and kept coming back to Safe-T-Shelters because of their great reviews as well as their personable customer service reps who answered MANY questions for us.  I highly recommend this company!", "pics": null, "resp": {"time": 1627515645892, "text": "Hey Angie. Thank you so much for the wonderful review. It was a pleasure working with you. We are so grateful for your support and for choosing us for your severe weather protection."}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "107717561057349608893", "name": "Josh Cross", "time": 1627495320201, "rating": 5.0, "text": "After the tornado came through in 2019 we knew we had to get ourselves more prepared.  I reached out to Dustin at Safe-T-Shelter for some options.  They went above and beyond for us, they have a great product and great service too.  I highly recommend them if you want to have somewhere safe during the storms.", "pics": null, "resp": {"time": 1627496652919, "text": "Hey Josh. Thank you so much for the great review. It was a pleasure working with you and we hope our shelter will provide you and your family a lifetime of peace of mind during severe weather."}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "103321685727545622775", "name": "Hailey Gothard", "time": 1625521704469, "rating": 5.0, "text": "The customer service is excellent!  They provided a great and quality product and went above and beyond!  Once it was installed they touched up places on the shelter that paint had come off during the trip down and made sure we were happy with everything.  Great product and wonderful people!", "pics": null, "resp": {"time": 1625522399988, "text": "Thank you so much for your support! We are happy to hear you are pleased with our product and service."}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "107621797622888245872", "name": "Tracey Perkins", "time": 1627402930209, "rating": 5.0, "text": "Great service and so thankful for this peace of mind!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOkgZJksm3RP3g4QxfNv7TCulEG1owf5DjNe-MN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOWikWuRNcWgyvtJHmAYm91Tz4f26-ZxJtkmNSb=w150-h150-k-no-p"]}], "resp": {"time": 1627403565677, "text": "Thank you so much for the kind words and your support! We are happy to know our shelter has brought you peace of mind during severe weather."}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "111926278023014669452", "name": "Meredith Northington", "time": 1624303254236, "rating": 5.0, "text": "Professional, kind, personable, and friendly service. The men who installed our shelter were excellent, and they left no mess. They took time to explain how our shelter works and answered any questions we had. We love the experience we had with Safe-T-Shelter.", "pics": null, "resp": {"time": 1624303616822, "text": "Thank you for the wonderful review!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "103871142791637537634", "name": "kathryn seligman", "time": 1624318923591, "rating": 5.0, "text": "Wonderful company! Quick install ... professional and polite! Iam not afraid of storms now and I don’t have to leave my house! Also best price around.", "pics": null, "resp": {"time": 1624320249585, "text": "Thank you so much for the kind words! We are so glad to hear you are pleased with our product and service!!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "106663309816905799679", "name": "Dax McDaniel", "time": 1624302207853, "rating": 5.0, "text": "A simple process. They even gave my grandparents in law a referral check because they had also used them. Installation was a breeze. The delivery guys gave a full run down and extra ideas of what/ how to use it. Definitely 10/10", "pics": null, "resp": {"time": 1624302246415, "text": "Thank you so much for the compliment and choosing us!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "105638676960982885641", "name": "Johnston Johnston", "time": 1617291626593, "rating": 5.0, "text": "Excellent company. Very responsive and very informative throughout our whole buying process all the way to instalation even after installation they've contacted us. I wouldn't do business with any other company.. you get that local business feel from these guys.. we were beyond impressed with the quality of our shelter and it exceeded our expectations.. highly recommend this company to anyone looking to protect your family from storms or needing a safe room.", "pics": null, "resp": {"time": 1617293480751, "text": "Thank you so much for the wonderful review and thank you for choosing us for your severe weather protection!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "105925969529644270882", "name": "Sally Jones", "time": 1594336230157, "rating": 5.0, "text": "We are so happy to have our shelter completed! Every single person we dealt with was so nice a helpful. (No matter how many times I called LOL) The crews on site were great too. I am so thankful I don't have to drive to safety every time a bad storm is brewing! We are very pleased!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO8TK3YlLCN_Djp05W220fk7TWshU6v51PcKWcr=w150-h150-k-no-p"]}], "resp": {"time": 1594336562048, "text": "Thank you so much for the great review! We are very thankful you chose us for your severe weather protection and are confident it will provide you safety and peace of mind for years to come."}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "106937625608282259297", "name": "brand elks", "time": 1624304730524, "rating": 5.0, "text": "The 2 guys that came and put my T-Shelter in  they were Amazing and very nice they done a Great walk through to show me what I needed to Know on my T-Shelter Thanks Guys Job well done!!", "pics": null, "resp": {"time": 1624304810573, "text": "We are so grateful for your support and thank you for the great review and compliment!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "112838504787333717760", "name": "Janis n Bill McBride", "time": 1624303936564, "rating": 5.0, "text": "Very good experience.  The quote was for an installed product and the we're no \"hidden\" costs. The installers were efficient and polite.", "pics": null, "resp": {"time": 1624304683921, "text": "Thank you for the great review and we are happy to hear you are pleased with our product and service!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "111843736835860761361", "name": "Tammy Jenkins", "time": 1616961857790, "rating": 5.0, "text": "We are so thankful for our Safe- T- Shelter. They were easy to work with and the installers were friendly and efficient. We can rest easier now that we have one.", "pics": null, "resp": {"time": 1616962668911, "text": "Tammy, thank you so much for the great review. We are pleased to hear you are happy with our product and service and thank you for choosing us for your severe weather protection."}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "110647427682592120831", "name": "Kim R", "time": 1611948440425, "rating": 5.0, "text": "Just had my storm shelter installed yesterday. I pray I never have to use it. But it’s a great relief to know I have it. From day 1 of inquiring about the shelter to installation customer service has been excellent. I would definitely recommend Safe-T-Shelter.", "pics": null, "resp": {"time": 1611949593647, "text": "Hey Kim. Thank you so much for choosing us for your severe weather protection. We are very thankful for your support and great review!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "103755884796100154725", "name": "Glenn Hunter", "time": 1612982046523, "rating": 5.0, "text": "Easy to deal with and very professional.  Shelter looks excellent and is highly durable.  Provides a lot of peace of mind having a shelter available.  Would highly recommend this company", "pics": null, "resp": {"time": 1612983427708, "text": "Hey Glenn, thank you so much for your support and the great review!!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "101343665528561348311", "name": "Mitchell Mooneyham", "time": 1613436852725, "rating": 5.0, "text": "We just received are storm shelter a few weeks ago. We love it and the staff there was very professional and courteous. They did an awesome job. Would definitely recommend this business.", "pics": null, "resp": {"time": 1613437182835, "text": "Thank you for the great review and the kind words. We greatly appreciate your support!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "111673967106657221244", "name": "Scott Beaston", "time": 1612485852587, "rating": 5.0, "text": "Great buying experience! Everything went smoothly, from purchasing through the install. My wife and I can't thank you enough!!", "pics": null, "resp": {"time": 1612486616017, "text": "Scott, thank you so much for your kind words and we are extremely grateful for your support!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "116228650931383794861", "name": "Donna Forrester", "time": 1613244123470, "rating": 5.0, "text": "Excellent service and workers. Friendly and informative. Efficient. Highly recommend them", "pics": null, "resp": {"time": 1613244958797, "text": "Donna,\nThank you so much for the wonderful review. We greatly appreciate your support!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "103226827674315548838", "name": "Lezlie Armentor", "time": 1597203760049, "rating": 5.0, "text": "VERY Please with the service that I received from everyone with this company.  They went above and beyond to help me out and get it in place.  I would highly recommend them!  Thank you all!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNRxSnseOeXIYQgAhEcjX3mCiewsKl1HrDbVKUC=w150-h150-k-no-p"]}], "resp": {"time": 1597233966894, "text": "Thank you for the wonderful review! We are thrilled that we have exceeded your expectations and are grateful you chose us for your severe weather protection. Welcome to the STS family!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "112083335601313454450", "name": "Mitch Lawson", "time": 1612526113571, "rating": 5.0, "text": "excellent service and very sturdy structure.  I'll sleep better at night knowing my workers and I have a place to safely wait out bad storms now.", "pics": null, "resp": {"time": 1612532054952, "text": "Mitch,\nThank you for your support! We hope you never need it but we are confident it will bring you safety and peace of mind during severe weather."}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "107149201544206309065", "name": "Jackie Dickerson", "time": 1614636089826, "rating": 5.0, "text": "People here extremely helpful and friendly. If you need a Storm Shelter this is the place to get one. They stand behind their work and go the extra mile for you.", "pics": null, "resp": {"time": 1614888590993, "text": "Jackie, thank you so much for the wonderful review. We are so grateful for your support and are glad you were pleased with your shelter and experience!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "106848656200771457030", "name": "Spooky 'Verb", "time": 1589038299600, "rating": 5.0, "text": "Very satisfied. The installation took hardly any time at all. At last, when the alert goes out to get in our \"safe space\" we actually have one. Great job Safe-T-Shelter. Your customer service and installation team both rank A+! Was also nice to learn that, if need be, we could have them come and take it out (we have the 4'x5' shelter out in the garage) to install it in another house if we move. Awesome!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM-om65mG9AvcTophjo3n_4uMvOR4D-BkJi0foS=w150-h150-k-no-p"]}], "resp": {"time": 1589487258967, "text": "Thank you for the great review! We hope you never need it but are confident it will bring you safety and peace of mind during severe weather."}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "107563811627274826036", "name": "Ken Rabbitt", "time": 1584628506539, "rating": 5.0, "text": "I was very happy with the installation. Gary and Mark were very professional and efficient. They were careful unloading and placing the shelter into the garage. It was a tight fit, but they were able to place it right where I wanted it. It’s so nice to work with experienced installers! They were done in about 2 hours. I would recommend Safe T Shelter to anyone. Thanks.", "pics": null, "resp": {"time": 1584632460492, "text": "Thank you for the fantastic review. We are grateful you chose STS for your storm protection and we hope you never need it. We will pass your kind remarks on to our installers."}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "108063855327527313846", "name": "Shanna Crumley", "time": 1598655372864, "rating": 5.0, "text": "So satisfied with our storm shelter! Awesome customer service, easy installation, and peace of mind when storms come through. Would recommend Safe T Shelter to anyone looking for a shelter!", "pics": null, "resp": {"time": 1598657877225, "text": "We are extremely grateful that you chose us for your severe weather protection. Thank you for your wonderful review."}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "111449796621439442940", "name": "R. Christina McCoy", "time": 1594412402330, "rating": 5.0, "text": "We are very happy with our new storm shelter. It didn’t take very long to install and the guys doing it were kind and professional. We definitely feel safer and more prepared for Alabama weather.", "pics": null, "resp": {"time": 1594500626046, "text": "Thank you for the kind words. We are very thankful that you chose us for your severe weather protection and we hope you never need it."}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "109250509158018813023", "name": "Mrs. Hubcap", "time": 1580919658628, "rating": 5.0, "text": "We ordered our storm shelter Monday and they were able to install within 2 days!  The sales people were very helpful and helped us pick out the perfect size shelter for our family. The installers came out and installed our shelter in the pouring rain. They were awesome and very knowledgeable!  We feel so much safer now!  Great people!", "pics": null, "resp": {"time": 1580919724535, "text": "Thank you for the great review!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "113368060703464143698", "name": "Layron Doyal", "time": 1584649844060, "rating": 5.0, "text": "It was a pleasure to do business with Safe-T-Shelters. If I could rate them a \"10\", I would do so. If you live in Alabama, call them! I had my shelter installed in less than 10 days. The gentlemen that installed the shelter were professional, thorough, and quick with the task. My wife and I own a barn-dominium and had concerns with the numerous storms in northern AL. This is well worth the investment and a reasonable price. NO gimmicks, pay for the shelter once installed and you are happy. Instead of a new car you don't need, buy a shelter from these folks. My families safety has no price!", "pics": null, "resp": {"time": 1588218819002, "text": "Thank you so much for the great review! We are thankful you chose us for your severe weather protection."}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "112767593065582594136", "name": "Gina Walker", "time": 1582317731093, "rating": 5.0, "text": "I am writing this review for my father, Ray Stowe. He contacted Safe-T-Shelters on a Tuesday and a gentleman came out on Friday to show him the best location.  After determining the location, he gave my dad a reasonable price quote.  After accepting the price, they made a date for installation, which was the following Monday.  They showed up on time and was extremely courteous and did everything that they said they would do.  My dad, Ray Stowe, said he would definitely recommend them to anyone who asks.\n\nThank you for installing this shelter for my parents and doing so in a timely and courteous fashion.", "pics": null, "resp": {"time": 1582319873592, "text": "Thank you so much for the great review. We hope you never need it but are thankful your family chose us!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "100720822881276608690", "name": "The Cleaner Man", "time": 1580931574121, "rating": 5.0, "text": "We have one from Safe-T-Shelter. We had it installed after we moved here from Connecticut.  Luckily we never truly tested it but I can say that it is built very well! I hope I never prove it can withstand an EF5 but I am pretty confident it should have no problem. The team that installed it was very professional and did a great job. I feel safe knowing me and my family are safer because of our shelter.  Since its above ground and in our garage, we don't have to be exposed to the storms to enter it.", "pics": null, "resp": {"time": 1580932073879, "text": "Thank you for your kind words and taking time from your day to leave us a review!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "107791773486416008069", "name": "Phebe", "time": 1600205090701, "rating": 5.0, "text": "Awesome job installing my Safe T Shed.. very pleased with the professionalism and speed .. was installed much faster than I thought it would be.. Thank you", "pics": null, "resp": {"time": 1600245108212, "text": "Thank you for your kind words and we are extremely grateful for your support!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "107081759486745058185", "name": "Beth Baker", "time": 1586044460636, "rating": 5.0, "text": "We are so happy with our new Safe-T-Shelter that was installed last month!  From the first phone call we placed for information, the office staff answered all of our questions and we were thrilled to have it installed so quickly.  The guys were prompt, clean and a pleasure to work with.  Hope we never have to use it - but it is certainly reassuring that we have it in place.  Thank you!", "pics": null, "resp": {"time": 1589487172275, "text": "Thank you Beth for the great review and kind words!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "100390121875334386947", "name": "Melissa herring", "time": 1579316349978, "rating": 5.0, "text": "I love how knowledgeable they are about their products.  They were able to answer all my questions and had a plan that was laid out just to fit my needs. Brent was friendly and was very professional. I recommend them for all your safety shelter needs.", "pics": null, "resp": {"time": 1580919976948, "text": "Thank you for the kind words."}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "109394331153467150460", "name": "Jared T", "time": 1578943022188, "rating": 5.0, "text": "Safe-T-Shelter’s customer service and shelter build quality are excellent.  The shelter was delivered and installed in a timely manner.  The installation team conducted themselves in a professional manner and cleaned up after job completion.  I would recommend Safe-T-Shelter to anyone looking for excellent customer service, high quality, and a professional installation team.", "pics": null, "resp": {"time": 1580919984528, "text": "Thank you!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "111681830974569948177", "name": "Rod Lovett", "time": 1584641284050, "rating": 5.0, "text": "Professional people with a great product and it is a locally owned business. Always happy to spend my money with local businesses. Quick and easy process for a peace of mind product.", "pics": null, "resp": {"time": 1584645225422, "text": "Hey Rod. Thank you so much for the kind words. We are thankful you chose us for your storm shelter and are delighted you are pleased with our product and service."}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "101395709078169284627", "name": "TERESA DAWN THOMAS", "time": 1584401687938, "rating": 5.0, "text": "We have had ours for 6 years- they were easy to work with, affordable and delivered & installed in a timely manner. If you have young children, get them some magnets and let them decorate the walls. It can turn a scary situation into an adventure.", "pics": null, "resp": {"time": 1584402873714, "text": "Thank you so much for the kind words and we are grateful for your business. That is a wonderful idea about the magnets, we will definitely recommend that to people."}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "110429779552874079750", "name": "cherry bailey", "time": 1586056789623, "rating": 5.0, "text": "Great installation and plenty of room in our shelter! Had ours since 2012! Peace of mind now for us knowing we will be ok during a tornado!", "pics": null, "resp": {"time": 1589487213441, "text": "Thank you so much for the review! We are glad even after 8 years you are still very pleased with our product."}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "108753048072884206062", "name": "Cynthia Cross", "time": 1581562893431, "rating": 5.0, "text": "We recently had a shelter installed in our garage. The people were very professional and courteous. We were very pleased with the information provided to us and the service provided. I would definitely recommend them.", "pics": null, "resp": {"time": 1581565451304, "text": "Thank you so much for your kind words.  We greatly appreciate your business."}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "110203213637757900905", "name": "Diane Elam", "time": 1629462944860, "rating": 5.0, "text": "I had a safe shelter installed at my home in the spring. Thanks to God I have not had to use it yet. I got the V-shaped that fits in the corner of my carport so it fits perfect neck to my SUV. Great company to work with! They were there the vey day and time they scheduled installation.", "pics": null, "resp": {"time": 1629466024369, "text": "Thank you for choosing us for your severe weather protection and the great review!"}, "gmap_id": "0x88882f30f2831ecd:0xe5a886017bb70e6d"}
{"user_id": "106538656090900851706", "name": "Micael S", "time": 1606561146854, "rating": 5.0, "text": "I'm a TMC driver I met Mack today 4-8-20. he allowed me to park here overnight they have medium size yard but can turn around easy in. Look at the picks bay 12 is where the crain is to offload Rebar in are pics.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPO5UPW3m2Si5iH2io5PvB-3Dd_biGNN-7HNNmK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPdmoR0Yhm2ChOyTvB3dusnapUw_w0nCila_n1O=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOkQMKbRYQhP9aghvkdD1b4LbP7jwjP_4WZlLwY=w150-h150-k-no-p"]}], "resp": {"time": 1590178623953, "text": "Hi Micael, thanks for the great rating and feedback. It’s always our goal to make sure people who come through our facility are taken care of as efficiently and safely as possible. We’re glad to hear you had a positive experience! Thanks again, and we’ll see you next time. Drive safe."}, "gmap_id": "0x88891b16e86c9363:0x1bc6ad153f891fd0"}
{"user_id": "113058948239057106766", "name": "Kesha B.", "time": 1627953759198, "rating": 1.0, "text": "They do not provide a safe environment for the surrounding community.  USS storm water run off floods our property. The owners could careless because Fairfield is a predominantly black community. If this was happening and whites lived in the community, the flooding will not be a problem. The company refuses to send an engineer to access that the drain can not handle the capacity of water that flows through it. Instead, they blame it as an act of God. Sorry USS you can't blame your lack of maintenance of your storm drain on GOD. God sees what you all are doing and have done to not provide a safe environment for the black community in which your company resides. He also sees how you all have treated my mom's property like it is nothing. My mom has lost appliances, clothing, decorations, and tons of precious memories.\n\nEveryone including the mayor has thrown rocks and hid their hands. The Lord sits high and looks low. Do the right thing USS Steel and stop destroying the property of people that live in the surrounding community! The water floods our home due to the lack of USS ability to maintain and keep their storm drain clean and free of debris.", "pics": null, "resp": null, "gmap_id": "0x8888e1f4bb245979:0x5032f1aeb48c81ca"}
{"user_id": "101969661176786071177", "name": "Corneliu Mirza", "time": 1603197838768, "rating": 1.0, "text": "if you have zinc bars load be careful they scratch all trailer", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO8KNUi5aUF9uAjSJUQS6TFMSee5vlyggm2S2EL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMk_NrVEsW76vNgM5KyK035-Lz6GsLlIjHL4xJJ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888e1f4bb245979:0x5032f1aeb48c81ca"}
{"user_id": "111856794400448164423", "name": "Jack Dimmerling", "time": 1626129758210, "rating": 5.0, "text": "Great place to work ,good wages too.", "pics": null, "resp": null, "gmap_id": "0x8888e1f4bb245979:0x5032f1aeb48c81ca"}
{"user_id": "102636701675273975516", "name": "ThePilO72more", "time": 1533986124638, "rating": 5.0, "text": "Best place in the state of Alabama pure pleasure.", "pics": null, "resp": null, "gmap_id": "0x8888e1f4bb245979:0x5032f1aeb48c81ca"}
{"user_id": "112359187127091184143", "name": "Kevin Mitchell", "time": 1534021269103, "rating": 3.0, "text": "I work for a contractor there.", "pics": null, "resp": null, "gmap_id": "0x8888e1f4bb245979:0x5032f1aeb48c81ca"}
{"user_id": "106062933544923602073", "name": "Raymond “ReD” David Smith", "time": 1363531930687, "rating": 2.0, "text": "Contractors get screwed every time.", "pics": null, "resp": null, "gmap_id": "0x8888e1f4bb245979:0x5032f1aeb48c81ca"}
{"user_id": "118446406920625947650", "name": "Shirley Smith", "time": 1556609822107, "rating": 5.0, "text": "We have been associated with Browning Enterprise for all our need for structural steel custom fabrication and structural shape rolling for our construction projects.\n\nWe have been associated with Browning Enterprise from last few years. They are helping us in structural steel custom fabrication and structural shape rolling for our construction projects.  We are really fond of browning for his expertise in steel fabrication and engineering capabilities. These guys really know how to deal with complex steel projects and ensure timely delivery.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNqQdNKTghxoQgm186F6AJFKFhYReBhU7HlC_xP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPAxKbLZJ6AtUVzSAiWkV80YR4u2tHqEbs7-_Mw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP7E44cxQgJfqzrvKylgQDhZ6vkNqoLSsvU7ULR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOsXfxmoDgypyOwTH95aejLvqUPkQ2ThPS5oTyl=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a234dff3ac13d:0x2bb931801bc9b765"}
{"user_id": "103985842034365212967", "name": "Emily Claire", "time": 1517464975887, "rating": 4.0, "text": "We are an agricultural firm and we wanted a few commercial building steel components for our farm. Every other steel firm we called didn't have the capacity or capability to deliver the large parts to us on time and asked us to wait. That is why we were so astonished when Browning Enterprises took down our order and delivered the parts to us without a hitch. We will definitely order from them again.", "pics": null, "resp": null, "gmap_id": "0x888a234dff3ac13d:0x2bb931801bc9b765"}
{"user_id": "108262746343637653241", "name": "Doug Rotermund", "time": 1518782979314, "rating": 5.0, "text": "I run a gas station store in Alabama and when I needed metal sheets cut for my store I didn't know who would give me the best deal. Thankfully I found Browning Enterprises and their Laser Metal Cutting Machine. They did the job on time and had my store up and running in just a couple of days.", "pics": null, "resp": null, "gmap_id": "0x888a234dff3ac13d:0x2bb931801bc9b765"}
{"user_id": "114000221749730100518", "name": "Anton VanHappen", "time": 1518153321105, "rating": 4.0, "text": "I work for a supermarket and when I was ordered to buy a few flat metal sheets to double up as our shelves I contacted Browning because I knew they were the best at precision part flattening, from my previous job. They cut the metal by utilizing high definition plasma and laser technology and delivered the steel parts to us in record time.", "pics": null, "resp": null, "gmap_id": "0x888a234dff3ac13d:0x2bb931801bc9b765"}
{"user_id": "106029269099046104161", "name": "Leordan Carli", "time": 1491576207429, "rating": 5.0, "text": "Good place to load, very fast and friendly", "pics": null, "resp": null, "gmap_id": "0x888a234dff3ac13d:0x2bb931801bc9b765"}
{"user_id": "109292766465495540584", "name": "Tony Smith", "time": 1612385522917, "rating": 5.0, "text": "Great place to work and Great people to work for. Been here 20 years and counting.", "pics": null, "resp": null, "gmap_id": "0x88928eda8ceada2b:0xd9294e7bcc9f4eea"}
{"user_id": "109688919002205563676", "name": "Johnathon Henry", "time": 1518627336719, "rating": 5.0, "text": "Really loved working here", "pics": null, "resp": null, "gmap_id": "0x88928eda8ceada2b:0xd9294e7bcc9f4eea"}
{"user_id": "112223113611159698831", "name": "Jay Johnson", "time": 1608062552583, "rating": 5.0, "text": "Awesome shop with awesome products.  Whats even better is the office staff... SJ is the bomb.  She answered my questions, and the ones she didn't know, she got answers for! If you want to take your jeep to the next level and want to do it with people that care... Call Motobilt. You can look down at my reviews and notice I don't take the time to pass out reviews unless the are 100% deserved.", "pics": null, "resp": {"time": 1608064068146, "text": "Awesome thank you Jay. SJ is a great asset to our company for sure!"}, "gmap_id": "0x889293039ac6e833:0x797dde600971c259"}
{"user_id": "113502834838368916370", "name": "Scout Bywater", "time": 1599000762825, "rating": 5.0, "text": "These Well built parts are definitely worth the money. Im going through this company for parts from now on.", "pics": null, "resp": null, "gmap_id": "0x889293039ac6e833:0x797dde600971c259"}
{"user_id": "103339342325970809083", "name": "Ed Geleski", "time": 1569024273376, "rating": 5.0, "text": "Great company w. awesome products for Jeep JL 2018 fits well and looks good!", "pics": null, "resp": {"time": 1582580516165, "text": "Thank you"}, "gmap_id": "0x889293039ac6e833:0x797dde600971c259"}
{"user_id": "114128628838799003288", "name": "Richard LaFleur", "time": 1580667953105, "rating": 5.0, "text": "Great but where can I get one of the Motobilt hats?", "pics": null, "resp": {"time": 1582580500597, "text": "Search “Hat” on the website\n\nhttps://www.motobilt.com/products?search_api_views_fulltext=Hat+"}, "gmap_id": "0x889293039ac6e833:0x797dde600971c259"}
{"user_id": "108750497058104384728", "name": "Deborah Isler Mercer", "time": 1503781306804, "rating": 5.0, "text": "I just bought my first Jeep and I'm in the process of doing a few things to it. I told Bobby kind of what I was wanting and he showed me several options. I just picked it up this afternoon, it looks awesome!! Great customer service too! 😀", "pics": null, "resp": {"time": 1516026221459, "text": "Thank you for the business.  We are here to assist with anything you may need"}, "gmap_id": "0x889293039ac6e833:0x797dde600971c259"}
{"user_id": "105452462464054648210", "name": "HELIMOTO", "time": 1482464694549, "rating": 5.0, "text": "Outstanding service. They always kept me up to date on my Jeep. They were extremely knowledgeable on Jeeps and what I should expect for certain mods. I'll be back for sure.", "pics": null, "resp": {"time": 1516026170285, "text": "Thank you for the review.  Let us know if we can ever help with anything."}, "gmap_id": "0x889293039ac6e833:0x797dde600971c259"}
{"user_id": "100361319008120660168", "name": "Jeffrey Spellman", "time": 1528848592960, "rating": 5.0, "text": "Customer service is second to none, they go way above and beyond to please the customer. Not to mention their craftsmanship is impeccable.", "pics": null, "resp": {"time": 1582580528765, "text": "Thank you for your business"}, "gmap_id": "0x889293039ac6e833:0x797dde600971c259"}
{"user_id": "114512251085420097850", "name": "Summer Black", "time": 1496199405689, "rating": 5.0, "text": "Great American made products. One of the best around!! Would recommend them to anyone!", "pics": null, "resp": {"time": 1516026241356, "text": "Thanks Summer!!! Let us know if you need anything."}, "gmap_id": "0x889293039ac6e833:0x797dde600971c259"}
{"user_id": "106893280160492002149", "name": "Wesam Khalil P.Eng.", "time": 1603564110336, "rating": 5.0, "text": "Pleasure was working with Nucor Tuscaloosa in very different projects through my career and leading SGTEX Inc. afterwards. Nucor Tuscaloosa is also among customers who trusted SGTEX Inc. gas control solutions used for different applications in theri melt shop. A very professional steel production group that always pushing for next level of improvement and make any impossible very possible !!", "pics": null, "resp": null, "gmap_id": "0x8888a87766a4be0d:0x19151d89779d1624"}
{"user_id": "110115531778901191050", "name": "Robin Dunbar", "time": 1601560675504, "rating": 2.0, "text": "You watch a video to get credentials that says passengers are allowed, but the people at the gate say no passengers.  Someone needs to figure out what is going on.", "pics": null, "resp": null, "gmap_id": "0x8888a87766a4be0d:0x19151d89779d1624"}
{"user_id": "108663372362003326571", "name": "Brandi McCormack", "time": 1567702315752, "rating": 5.0, "text": "We love working with Nucor Tuscaloosa.  The people are very kind, loyal and helpful.  I wish all customers were like them!", "pics": null, "resp": null, "gmap_id": "0x8888a87766a4be0d:0x19151d89779d1624"}
{"user_id": "105253727071733834882", "name": "Kaplan Trucking", "time": 1567625006425, "rating": 5.0, "text": "Love working with Nucor Tuscaloosa.!!  Everybody from the loaders to the top brass are TOP NOTCH!   Always helpful!", "pics": null, "resp": null, "gmap_id": "0x8888a87766a4be0d:0x19151d89779d1624"}
{"user_id": "117516122139799542411", "name": "Crix Clonder", "time": 1568330465992, "rating": 1.0, "text": "Stay away trucker . Never come back again", "pics": null, "resp": null, "gmap_id": "0x8888a87766a4be0d:0x19151d89779d1624"}
{"user_id": "114974320387234296048", "name": "Andy Specht", "time": 1500321796617, "rating": 1.0, "text": "Loading is pretty quick if you load in the new yard. Otherwise pack lunch and dinner.", "pics": null, "resp": null, "gmap_id": "0x8888a87766a4be0d:0x19151d89779d1624"}
{"user_id": "116005792016920007237", "name": "Big Seksi", "time": 1469229934874, "rating": 1.0, "text": "This place is awful. Women in the scale house are rude to drivers. Hateful wenches. Getting loaded here is a joke. Takes forever. They must be union or just have complete lack of oversight from management. This place sucks. If I could give it less than a star, I would. Miserable rotten purgatory. I wish the Plant Manager would read this, and if he has a spine, would do something about it....but, he's probably a \"bean counter\" named Biff or Chad that's more preoccupied with reading his email, sending out memos, and improving his golf game,  than doing anything of substance for real working men.....pffft.\n\nUPDATE: 5 Months later\n\nThis place STILL sucks. No trucks in front of me. Appointment was 2hrs ago, STILL haven't gotten loaded. I HATE THIS PLACE", "pics": null, "resp": null, "gmap_id": "0x8888a87766a4be0d:0x19151d89779d1624"}
{"user_id": "105108788138277389636", "name": "Gerald Dinger", "time": 1420228851847, "rating": 5.0, "text": "Excellent Place to do business with a great place to load", "pics": null, "resp": null, "gmap_id": "0x8888a87766a4be0d:0x19151d89779d1624"}
{"user_id": "113620149909668373353", "name": "Billy Boutwell", "time": 1481168091887, "rating": 2.0, "text": "Under pressure  need to take a course in manners", "pics": null, "resp": null, "gmap_id": "0x8888a87766a4be0d:0x19151d89779d1624"}
{"user_id": "103301401942073514680", "name": "Willie Tinjaca", "time": 1447242116062, "rating": 4.0, "text": "excellent about business", "pics": null, "resp": null, "gmap_id": "0x8888a87766a4be0d:0x19151d89779d1624"}
{"user_id": "104322427186236773999", "name": "dewayne ross", "time": 1538676038005, "rating": 5.0, "text": "Great place to unload", "pics": null, "resp": null, "gmap_id": "0x8861e5063602d577:0x2de819bbb431cbb5"}
{"user_id": "104289304365603846829", "name": "Afg", "time": 1610397419645, "rating": 1.0, "text": "Not recommended any owner operator. It’s three hours\nStill didn’t load yet. Two another truck come after me. He first loaded those two trucks. This s not nice.", "pics": null, "resp": null, "gmap_id": "0x888604b7966729f5:0x85faeace3e2dff09"}
{"user_id": "115413436630741195009", "name": "Shirley Thomas", "time": 1591994521692, "rating": 5.0, "text": "They are slow they don't have there product stage for the amount of trucks that come through there because us truck drivers work on limited time we be there so long until we run out of hours to drive.  Need to work on there staging abilities Company need to have the workers do better than they are Thank you", "pics": null, "resp": null, "gmap_id": "0x888604b7966729f5:0x85faeace3e2dff09"}
{"user_id": "103579021805361070943", "name": "Onasis Bolton", "time": 1607090975213, "rating": 1.0, "text": "Waited at the railroad tracks for 45 minutes!!! Ridiculous", "pics": null, "resp": null, "gmap_id": "0x888604b7966729f5:0x85faeace3e2dff09"}
{"user_id": "105617304401220567713", "name": "Pharris Moore", "time": 1617147715278, "rating": 3.0, "text": "Slow loading", "pics": null, "resp": null, "gmap_id": "0x888604b7966729f5:0x85faeace3e2dff09"}
{"user_id": "108347339198065391940", "name": "K", "time": 1551107208953, "rating": 1.0, "text": "Place is a joke 4 am appt didn't leave till after 9 am. Every one stands around jerking each other off. Should never take this long to get loaded with as many people they have working/standing around. Never coming back.", "pics": null, "resp": null, "gmap_id": "0x888604b7966729f5:0x85faeace3e2dff09"}
{"user_id": "118016856004807378266", "name": "mundy Musgrove", "time": 1575937208437, "rating": 1.0, "text": "Terrible place to load. And if you run out of hours. They do not allow overnight parking.", "pics": null, "resp": null, "gmap_id": "0x888604b7966729f5:0x85faeace3e2dff09"}
{"user_id": "116385531531207291766", "name": "Michael Clark", "time": 1595991412292, "rating": 5.0, "text": "Great place to work!!", "pics": null, "resp": null, "gmap_id": "0x888604b7966729f5:0x85faeace3e2dff09"}
{"user_id": "105333814109498040401", "name": "kevin black", "time": 1465916510503, "rating": 3.0, "text": "This place only gets 3 stars from me. The loads pay really good but it takes forever to get loaded. The staff doesn't take your time serious. They spend entirely too much time socializing about personal agendas, or any and everything except getting the steel loaded and getting the trucks underway.", "pics": null, "resp": null, "gmap_id": "0x888604b7966729f5:0x85faeace3e2dff09"}
{"user_id": "103805369240448660324", "name": "HSV 702", "time": 1423447475151, "rating": 5.0, "text": "Outstanding Service!\n\nWe recently had a medium storm shelter installed and couldn’t be happier with our Steel Safe Shelter experience, from start to finish.  We stopped by their office and were given the pitch by one of the owners.  He was very knowledgeable, very confident in his product.  He wasn’t pushy and answered all our questions. After we shopped around, we decided to go with Steel Safe Shelters.  We stopped by, signed a contract and made a small down payment.  The following week they showed up around 9 a.m. and were completely finished by 4:30 p.m.  The work crew was super friendly and consummate professionals.  They truly knew their business.\n\nA few tips for those of you contemplating a storm shelter:  (1)  there are some companies in this area with little experience with installing shelters so be sure and ask how long they’ve been in business, (2)  verify a company’s standing with the Huntsville Better Business Bureau, (3) ensure they are fully insured in the event they damage your home (one company we spoke to said if anything was damaged during the install, WE would have to pay for the repair!), (4) ask how much the company wants for a down payment (Steel Safe only wanted 10%), and (5) ensure the concrete is pushed under the shelter during pouring – some companies don’t use this process but Steel Safe does.\n\nA colleague of mine recently went with another storm shelter company and was VERY unhappy with the decision.  The company took four days to install their shelter, damaged the shelter and seemed to be very disorganized.  And, they required a down payment of 50%!  So, ask lots of questions from a perspective company before making a final decision.  Steel Safe Shelters lived up to their word in every respect.\n\nThe final deciding factor for us to go with Steel Safe Shelters is that Lowes endorses them.  To be endorsed by Lowes is a big deal – they don’t put their name alongside any company unless they meet rigorous standards.\n\nOne final tip:  make sure you ask for one of their t-shirts! :  )", "pics": null, "resp": null, "gmap_id": "0x8889f80aeb3b02bd:0xd4785d1bbbd0beb6"}
{"user_id": "103733953955143824482", "name": "Bruce Weaver", "time": 1598043494714, "rating": 5.0, "text": "Great people and service. They took control of my project and exceeded my expectations. The priice was right what I had calculated it would be as well. Great Job!!!", "pics": null, "resp": null, "gmap_id": "0x88896dbe8894868b:0xcb76626134c1d485"}
{"user_id": "104099598367036383258", "name": "adam ledbetter", "time": 1590617637056, "rating": 5.0, "text": "Great service. I highly recommend them for all your welding needs. Stainless steel, aluminum, mild steel and everything in between. Great repairs and fab work from scratch.they can even cut custom jobs on the water plasma table.", "pics": null, "resp": null, "gmap_id": "0x88896dbe8894868b:0xcb76626134c1d485"}
{"user_id": "100201846689322805856", "name": "ken hollis", "time": 1562106245686, "rating": 5.0, "text": "I had a very good experience at Valley Repair Service on 7-2-2019. We had a lawn tractor wheel and hinge break off a cutting deck. I called this service and spoke with Ken the shop foreman and he told me they could make the repair. I drove to the shop with trailer and mower in tow. Ken welded the wheel hinge back onto the cutting deck within minutes! Great service and very nice welding work!\nThank you to Ken and Valley Repair Service!", "pics": null, "resp": null, "gmap_id": "0x88896dbe8894868b:0xcb76626134c1d485"}
{"user_id": "108466177877219908807", "name": "Rachel Sausley", "time": 1518386679085, "rating": 5.0, "text": "Great group of people", "pics": null, "resp": {"time": 1518387382216, "text": "Thank you"}, "gmap_id": "0x88896dbe8894868b:0xcb76626134c1d485"}
{"user_id": "106358428413308186965", "name": "Thomas Tolliver", "time": 1592575325260, "rating": 5.0, "text": "Fantastic Machine Shop with great customer service and even better pricing.  Truly a wonderful addition to the Alabama machine and steel services.", "pics": null, "resp": null, "gmap_id": "0x888920781674b659:0xee08794e8ae6adcb"}
{"user_id": "103368122665428357303", "name": "Farontha Booker", "time": 1573844834997, "rating": 3.0, "text": "Super friendly staff was more than helpful to get a driver there.", "pics": null, "resp": null, "gmap_id": "0x888920781674b659:0xee08794e8ae6adcb"}
{"user_id": "102679193764789257722", "name": "Jamie Vaal", "time": 1620433648954, "rating": 5.0, "text": "We had an amazing experience with these gentlemen! We were visiting from out of town and had a huge issue with a trailer which literally made impossible for us to continue our trip! They went above and beyond (seriously) to help us out! Thank you gentlemen so very much!", "pics": null, "resp": null, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "117549284173165215237", "name": "Mike B", "time": 1621546963480, "rating": 1.0, "text": "Very very rude people. Rseppionist is very rude when she answers phone. Terrible way to treat customers. This place is a joke . Waisted our time and didn't even do the job Which was a very simple job.", "pics": null, "resp": {"time": 1621596726752, "text": "We tried to accomadate this lady with her situation, I was even working on her project when she came to shop ,as far as being  rude, she wasn't very pleasant  herself, when you explain you will have to work her project in ,I even asked her to go wait in her truck while I finished her project, but no ,so sir I will be glad to finish ,come see me this morning yourself ,plates are all ready  made"}, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "112073226468449551182", "name": "amy tolbert", "time": 1588297643690, "rating": 5.0, "text": "Called almost at closing time and they told me to have my husband come on in . They stayed open for him and did an amazing job fixing the problem, charged a very reasonable price ,were very professional and friendly.Couldnt ask for any better.Would definitely use again.Thanks Micheal and the guys at J and S.", "pics": null, "resp": null, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "110104542312120385760", "name": "Reggie Burns", "time": 1604983331462, "rating": 5.0, "text": "Good workmanship", "pics": null, "resp": null, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "116948428538353870721", "name": "Nathan Nance", "time": 1605137427045, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "113305976062415365904", "name": "ashley robison", "time": 1494845545157, "rating": 5.0, "text": "I had a good neck ball installed in my truck and they did an awesome job it is clean and looks like it was installed during manufacturing!! I love it !! Thanks j&s!!", "pics": null, "resp": null, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "107743390634055755749", "name": "Yadier Val", "time": 1605808232936, "rating": 5.0, "text": "Very professional.", "pics": null, "resp": null, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "105403719873280713112", "name": "Mr. Precious", "time": 1578625132314, "rating": 5.0, "text": "Nice place 😎👍 I picked up a load from here once, my appointment was @14:00pm, and I called shipping office, they said come on over we’ll load you up, arrived around 10:40am took about 30 minutes in & out, forklift driver was very kind and helpful.", "pics": null, "resp": null, "gmap_id": "0x88629aa92a66e60d:0xfd15cc2f32f890be"}
{"user_id": "102891116107161773028", "name": "Michael Johnston", "time": 1570198875208, "rating": 4.0, "text": "It's a great place to work  lot of good people work here", "pics": null, "resp": null, "gmap_id": "0x88629aa92a66e60d:0xfd15cc2f32f890be"}
{"user_id": "112518830559889289763", "name": "Matt Perdue", "time": 1478060472663, "rating": 4.0, "text": "Worthington steel in decatur al is located inside the nucor facility", "pics": null, "resp": null, "gmap_id": "0x88629aa92a66e60d:0xfd15cc2f32f890be"}
{"user_id": "108034342544004050918", "name": "Vanessa Meares", "time": 1498773117829, "rating": 5.0, "text": "I work security for Nucor Steel. I am posted at the Worthington Steel gate. Gate entrance is Nucor Cold mill main gate. Park in gravel lot, cab facing south, and walk up to the guard shack.", "pics": null, "resp": null, "gmap_id": "0x88629aa92a66e60d:0xfd15cc2f32f890be"}
{"user_id": "102602111536724263576", "name": "FAP Logistics", "time": 1528310884901, "rating": 1.0, "text": "Horrible place", "pics": null, "resp": null, "gmap_id": "0x889af9c254256e69:0x7048c20a218b8f25"}
