{"user_id": "100804262974300566236", "name": "Danae Jones", "time": 1544745405281, "rating": 1.0, "text": "A huge waste of time AND MONEY!!! This man  DOES NOT STAND BY HIS WORK. DOES NOT REFUND YOUR HARD EARNED MONEY  WHEN HE DOES NOT REPAIR YOUR  ITEM. YOU WILL  STILL HAVE A BROKEN ITEM AND LOSE MONEY.  VERY UNPROFESSIONAL!!! MY opinion  a total SCAM  ARTIST.  TAKES MONEY AND DOESN'T REPAIR  YOUR ITEM!!   How can you  do people like that?? I hope karma  treats you the way you treat your customers. You sir are what is wrong with this world, people trust you to do  the job you are paid to do, fix their items. Instead you don't fix their item and keep their money. In my opinion  that is stealing, you didn't earn the money!!!!", "pics": null, "resp": null, "gmap_id": "0x88929267ca8160bf:0x7f02642ec9910a5"}
{"user_id": "115185519039552312861", "name": "Ben Martin", "time": 1544485682259, "rating": 5.0, "text": "Great job on my amp repair.  I think it works better than when new.  Very professional  and prompt service.  I highly recommend Frankie for complex repairs.", "pics": null, "resp": null, "gmap_id": "0x88929267ca8160bf:0x7f02642ec9910a5"}
{"user_id": "108789069592232153160", "name": "Dori Long", "time": 1544746393668, "rating": 1.0, "text": "My husband paid this man to fix his welder circuit board. He DID NOT  fix the circuit board AND  kept our money. Didn't stand behind his work or his word. Will be reported to the better business bureau !!", "pics": null, "resp": null, "gmap_id": "0x88929267ca8160bf:0x7f02642ec9910a5"}
{"user_id": "116353886882357609572", "name": "Aaron Smith", "time": 1544043993035, "rating": 5.0, "text": "Very friendly and experienced! I would recommend franky to anyone that needs repair done. Great job Thank You very much.", "pics": null, "resp": null, "gmap_id": "0x88929267ca8160bf:0x7f02642ec9910a5"}
{"user_id": "106748364415873570358", "name": "tim long", "time": 1544745700864, "rating": 1.0, "text": "Do not bring anything to Frankie for repair. I hired him to repair the circuit board in my welder. Paid him for the job, which only half of it was done. Asked him to replace all of the capacitors on the board. He did not. He left a diode that he had cut loose. The soldering was the worst looking hack jobs I have ever seen. He picked up the board and was paid $90 initially to check it on the machine. I had to drive to Dothan to retrieve it from him and paid the balance of $145. Installed the board and the welder has no output at all now. Originally agreed upon price was $220. When I got the board back the diode was never reconnected, the solder joints were ridiculously poor. And the welder still does not work. He came out and wanted another $25 to “check” the board again. He came and “checked” the board again. He said there is another bad part on the board. How could there be another bad part if he checked the whole board. So after seeing the poor workmanship displayed. I asked for a partial refund. He said no. So now I am out $235 and my welder still doesn’t work. If I had only known that he couldn’t do the job to start with, I would never have hired him to do it. This guy does not know what he is doing! Please save your hard earned money. Seek out a professional. Don’t get screwed like I did!", "pics": null, "resp": null, "gmap_id": "0x88929267ca8160bf:0x7f02642ec9910a5"}
{"user_id": "114161581008290634342", "name": "rob merritt", "time": 1544791721483, "rating": 1.0, "text": "Frankie is a hack and a tool at best. He is not a man of his word. He thrives on only doing part of the job, so that you call him for extra costly service calls. Also not impressed with his Harbor Freight soldering gun (which he isn't very proficient with) . His guarantees are worthless. POS", "pics": null, "resp": null, "gmap_id": "0x88929267ca8160bf:0x7f02642ec9910a5"}
{"user_id": "109754473359666271736", "name": "stephanie phillips", "time": 1538755599864, "rating": 5.0, "text": "Did a great job on the repair you did on our juke box.. thanks again", "pics": null, "resp": null, "gmap_id": "0x88929267ca8160bf:0x7f02642ec9910a5"}
{"user_id": "118303040143212847532", "name": "Cynondria", "time": 1546618556287, "rating": 1.0, "text": "He never showed up. I called Frankie at 10 am to get my tv fixed. We set up an appointment at 4 the same day. I drove from Daleville with a 60 inch tv (very heavy to lug down a flight of stairs during a storm) to get it fixed. When we got there it was a little past 4 so I called him on his phone. He said he was on a service call and to wait for him til 5. Okay sure. So we drove around for a bit before coming back at 5. We tried calling but he wouldn’t answer pick up.we waited out there til 6:25 and tried calling a few more times before giving up. If you run a Business and set up an appointment please be professional about it. Because not only did you waste my time but you wasted my gas and that’s money. :/ the least that could have been done was to set up an appointment for another day or at least tell us you were too busy or something. Ignoring customers is not the answer.\n\nEdit 1/3: he messaged us to repair our tv a few days after the above incident. We let him take it. He stole our tv and closed his business. What a scam. I will be coming over to the business to claim the television set we left there", "pics": null, "resp": null, "gmap_id": "0x88929267ca8160bf:0x7f02642ec9910a5"}
{"user_id": "114582556614685432064", "name": "Willie Thornton", "time": 1543361365018, "rating": 4.0, "text": "He's a good guy when it comes to help on ur electronic", "pics": null, "resp": null, "gmap_id": "0x88929267ca8160bf:0x7f02642ec9910a5"}
{"user_id": "102020991952672674107", "name": "Keith Hudson", "time": 1536183707979, "rating": 5.0, "text": "Great repair work on a 25 year old Only FM receiver. Thanks!", "pics": null, "resp": null, "gmap_id": "0x88929267ca8160bf:0x7f02642ec9910a5"}
{"user_id": "116808512320047918707", "name": "Mark Given", "time": 1537981032920, "rating": 5.0, "text": "Frankie repaired my old 70’s Marantz receiver back to new. Great work, quick turnaround and all at a fair price.", "pics": null, "resp": null, "gmap_id": "0x88929267ca8160bf:0x7f02642ec9910a5"}
{"user_id": "100575974924538630642", "name": "Layna Cook", "time": 1535478791106, "rating": 5.0, "text": "Awesome service . fast and friendly!! Highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x88929267ca8160bf:0x7f02642ec9910a5"}
{"user_id": "116007633929684088257", "name": "Bryan Dawkins", "time": 1523129457389, "rating": 5.0, "text": "Fast friendly service, with quality work!!!!", "pics": null, "resp": null, "gmap_id": "0x88929267ca8160bf:0x7f02642ec9910a5"}
