{"user_id": "113844019148039137461", "name": "Aylin Turkoglu", "time": 1629577423543, "rating": 5.0, "text": "New manager doing better job then old one. Was friendly and got my device fixed fast!!! Old manager let it sit for two months without fixing it and new one didn’t let it sit for even two hours! Very happy, will be coming back.", "pics": null, "resp": null, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "113797312064259664752", "name": "Usagi Tsukino", "time": 1629746409620, "rating": 5.0, "text": "Thank goodness they're under new management! New manager is clean and most importantly kind and tends to individual device needs. I expect great things and will be coming back thanks to the promising new management.", "pics": null, "resp": null, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "107707064511504806163", "name": "Montanna Minnifield", "time": 1618411739995, "rating": 1.0, "text": "It has almost been two months since I’ve dropped my Apple Watch off for the screen to be replaced. I was told it would be 2 weeks at most for repair. Every time I call it sends me straight to voicemail, I’ve left multiple messages with no response, and when I do go to the store they are always closed. I most definitely do not recommend. I just want me Apple Watch and the money I paid for it as well.", "pics": null, "resp": {"time": 1618419550115, "text": "Montanna,  We have now Reopened after battling covid-19 which cause a abrupt and long  temp closure\n\nWe have reached out to let you know your watch is ready for pickup and we will get you taken care of of\n\nHope you have a fantastic day and see you soon !"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "117740349339992595089", "name": "Judy Jacobson", "time": 1618200572068, "rating": 1.0, "text": "I brought my sons tablet in to repair a broken screen, that was on January 17th of this year. I have called several times and left messages, with no reply. At first they said 3-5 days, then 2 more, then another week etc...etc....the one time my husband called and actually talked to someone it was a rather rude female that told him to not call again. An employee of Walmart stated she hasn’t seen anyone at the store for over a week. I wish someone could be honest and tell me what is going on. My son uses his tablet for communication. I really would like my tablet and the $200 I have paid back. I don’t know who to talk to. Customer service is not returning calls. SO frustrated!", "pics": null, "resp": {"time": 1618403569328, "text": "Hey Mrs Jacobson  we will be in-touch  today and find out what’s going on with this repair!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "102211152703057884799", "name": "Oscar Castro", "time": 1622256502727, "rating": 1.0, "text": "I had them order me a screen to repair my phone, well they got the screen in , but then they closed due to covid, and i totally understand, but i was not aware of the situation so i took my phone else where, a week later they finally opened, but i already had my screen repaired, so i politely asked for a refund, and was told i should recieve my refund in 5 to 10 business, its been 2 months now , no refund and no one will answer the phone, ive left voice messages and a number where they can reach me, but its been total silence on there end. I dont understand. Thats why im giving them 1 star, when issue is fixed ill gladly change my rating but 1star for now.", "pics": null, "resp": {"time": 1622443075793, "text": "Hello Oscar, Thank you for bringing this situation to our notice. This is not by any means reflective of the #iFixandRepair standards of service and customer satisfaction.\nPlease email us at info@ifixandrepair.com with your contact info and details about your case. We will do our best to fix this for you."}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "107248164164328935641", "name": "Amber Blackshear", "time": 1617842551672, "rating": 1.0, "text": "Unfortunately I can't leave a 0 star review.\nI will not do business here again. Unprofessional and rude. The store is rarely ever even open! Paid over $200 for a botched phone repair and I can't even get it back up there to make them fix it. Do not recommend.", "pics": null, "resp": {"time": 1617924651600, "text": "Hello amber we apologize we have been out completely due to Positive covid test and the symptoms that follow.\n\nWe would love to resolve the issue with your repair as you have a lifetime defect warranty and are covered by most anything other then physical damage or liquid exposure !\n\nPlease call the store at 334521112 as we have called a few times but there is no voicemail setup\n\nWe Hope to get this issue fixed for you !"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "112848020888042315044", "name": "Joshua Remley", "time": 1616795113252, "rating": 1.0, "text": "I paid $300 to get my note 9 screen replaced. Its been almost a month when I was told it would be 2-3 days. I have yet to get my phone fixed and its almost impossible to get someone on the phone. This has been the worst experience when trying to fix any phone. Not to mention I was told the reason its taking so long  is because the wrong screen was shipped to them the past 3 times they sent the replacement screen!!!", "pics": null, "resp": null, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "117750521824969567024", "name": "Tesla Jay Waterloo", "time": 1615162460190, "rating": 3.0, "text": "Quality of repairs is varying. Some are great and others are rushed through and poorly done. Service also varies too. I'd go for a battery or front screen replacement and not much else unless you just absolutely need it done.", "pics": null, "resp": null, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "104141227538683538612", "name": "Dave Myers", "time": 1621012817313, "rating": 1.0, "text": "They cannot change samsung watch battery or sell me one and there attitude was rude to tell me they can't and don't have license to do so will never be back", "pics": null, "resp": {"time": 1621122734654, "text": "Hi Dave, Thank you for bringing this situation to our notice. This is not by any means reflective of the #iFixandRepair standards of service and customer satisfaction.\nPlease email us at info@ifixandrepair.com with your contact info and details about your case. We will do our best to fix this for you."}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "109472859822736821034", "name": "Karen Bostick", "time": 1582766654278, "rating": 5.0, "text": "Apple could not have given me better service in their own store, than Duncan did. He was super busy, with other customers in the small store, and simultaneously gave us all extremely courteous and excellent service. I can honestly say that I have never had better or friendlier service in my entire life, and I am 55. Thank you so much, and God bless!", "pics": null, "resp": {"time": 1582839319852, "text": "Hello Karen, thank you so much for taking the time to leave this great review!\n\nHere at iFixandRepair, our dedicated staff works very diligently to make sure you love our work. This provides us with great encouragement to keep doing what we do!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "111421874257700590328", "name": "Andrea Miller", "time": 1598666514136, "rating": 5.0, "text": "Duncan stayed late just to help replace the screen and battery in our time of need! Very helpful, knowledgeable, and professional! Definitely recommend this place!", "pics": null, "resp": {"time": 1600734133371, "text": "Andrea,  thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service.\n\nHave a fantastic day!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "115958357469866748956", "name": "Nathaniel Rogers", "time": 1602276177723, "rating": 5.0, "text": "The guys at I fix at the Dothan mall did an awsome job fixing my Iphone", "pics": null, "resp": null, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "106103162308665464525", "name": "Mark Salter", "time": 1596907745542, "rating": 5.0, "text": "The young lady who works in here is very good at her job. And very nice.", "pics": null, "resp": {"time": 1600734165736, "text": "Mark, thank you for this friendly review. We hope to see you again soon! Please bring your friends and family!\n\nBest regards!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "112940885218230172562", "name": "Pam Hutcheson", "time": 1590294329862, "rating": 5.0, "text": "I really needed a screen fixed on an iPad that was my Autistic son's. Preferably same day. Brandon was able to fix it in about 3 hours. I would highly recommend iFixandRepair at Walmart in Dothan.", "pics": null, "resp": {"time": 1596323681825, "text": "We are so happy we were able to get you taken care of"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "112005685604550532107", "name": "Taylor Kathlynn", "time": 1571163613815, "rating": 5.0, "text": "10/10 recommend! Dunkin super helpful and super sweet to both me and my rowdy three year old.  He educated me on what was going on with my phone and then fix the problem in 10 minutes. They’re super affordable as well! Go see these awesome guys!", "pics": null, "resp": {"time": 1571171379287, "text": "Thanks for the awesome review, Taylor! We work hard to meet expectations like yours, and we’re happy to read we hit the mark for you. Come back and see us soon. Don't forget to follow us on Facebook @ifixdothan  and @ifixandrepairofficial on Instagram."}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "107989365652977596273", "name": "Amanda Kay Whiddon", "time": 1582498896069, "rating": 5.0, "text": "Amazing experience.  Technician was very helpful, knowledgeable and fast.  We were in and out with a brand new iPhone 8 screen within 30 min.  Worth the money!!!  Right I inside Northside Walmart.", "pics": null, "resp": {"time": 1582576708846, "text": "Thank you, Amanda! We really appreciate you taking the time to leave us such a nice review! We hope to see you again soon!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "115384465542359146436", "name": "Soungia M", "time": 1582169914776, "rating": 5.0, "text": "Duncan helped me with both of my iphones, very knowledgeable, patient and went above and beyond what was required.\nHe stayed 1 1/2 hours after closing time.\nWe’re very grateful for his excellent service.\nI would HIGHLY RECOMMEND “DUNCAN” and your company.\nHe’s the GREATEST!!!!!!", "pics": null, "resp": {"time": 1582576735435, "text": "Hey, thank you for this awesome review. We'll make sure the store and Duncan get recognition from this."}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "105114007958219365528", "name": "Teresita Castro", "time": 1618081850608, "rating": 1.0, "text": "Been waiting a month now and no response from no one.", "pics": null, "resp": null, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "112192861692454081656", "name": "Logan Conroy", "time": 1604538135999, "rating": 5.0, "text": "Very knowledgeable people here. Thank you!!", "pics": null, "resp": null, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "105805463810729862692", "name": "Andrew Kenny", "time": 1620305015564, "rating": 5.0, "text": "Very good service", "pics": null, "resp": {"time": 1620624954047, "text": "Hello Andrew, thank you so much for amazing feedback 🙏 Hope to see you again!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "108219337906669676300", "name": "Patricia Saenz", "time": 1619055190963, "rating": 1.0, "text": "Could not help me at all", "pics": null, "resp": {"time": 1619055866362, "text": "Please email us at dothanwm@ifixandrepair.com and explain the situation"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "110822407954379715071", "name": "Brianna Kilow", "time": 1588274019347, "rating": 1.0, "text": "I cracked and destroyed my Apple Watch and called over to this business asking for pricing. I spoke with a guy name Duncan(maybe not his name, not sure) and he gave me a price and told me it would take 5 DAYS for it to be fixed and returned back to me. I dropped my watch off on April 16th almost at closing time. It is April 30th and I still have not received my watch. I’ve called multiple times to check the status and every time they tell me it will be back in a couple of days. I called Monday and I was told he received tracking and that it’ll be here in a couple of days. I sent a friend to the place of business to get a status update and my friend was told that it shipped today ( April 30th) and will be here in a few days. So I called back up there and talked to the same guy and he told me that they received tracking information Monday but it didn’t ship until today (BS). I also made him aware that my last day in the area would be Sunday and I will need my watch before I leave, he says if it’s not here by Sunday we can ship it to you ( which I’m sure will be another week). At this point I asked to speak to the manager, he said he wasn’t in but he would call him to see if they could expedite my watch ( how do you expedite a shipment that has already been shipped) and he would get back in touch with. Oh he also mentioned that the reason why it’s taking so long is because the person they sent the watches to is backed up with orders and his shop has been closed and I said why wasn’t I told this from the beginning, I was told 5 days and he said he didn’t know that information until after my watch shipped. So yea, no watch still and it still isn’t promised to be here before I leave town. Worse experience EVER. OH NOT TO MENTION THIS IS COSTING ME $258.", "pics": null, "resp": {"time": 1596323917308, "text": "Brianna please accept our apologies on the delays in meeting those original time frames   We have seen a fast increase is Apple Watch Repair’s and working with our partners to insure delays are cut down to a minimum going forward we strive to get every device in and out in the fastest possible time . Communication is key and along with the partners we use are working on a ticketing system that will offer status update along the way we greatly appreciate your business and if there is anything you ever need please don’t hesitate to call or stop in! Stay safe and well"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "118257884304292743560", "name": "Blake Bedsole", "time": 1556681605884, "rating": 5.0, "text": "Took my mother to get a new phone today as she busted her old one (motherboard and all) not really fixable; however, after getting a new phone (through a phone company) and being told the phone she picked has no screen protectors available, I quickly messaged ifixandrepair Walmart location, in hopes they would have something. Within two minutes I received a response with the product I requested and the price. Met with Tyler as I came into the store explaining we were on the search for screen protectors for which he showed us all available options and what they would look like once installed. Needless to say not only did my mom get one but so did I and we are both very pleased. I recommend anyone with phone repairs or just on the look for new accessories or gadgets visit Tyler and his team for prompt and quality service!", "pics": null, "resp": {"time": 1557348140637, "text": "Thank you so much for your kind words, Blake. We really appreciate you taking the time out to share your experience with us — and we agree, Tyler is truly a gem to have on our team! We count ourselves lucky for customers like you. We look forward to working with you again in the future!\n\nPlease follow us on Facebook @ifardothan.\n\nHave a lovely day!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "104120971759401892850", "name": "Kayden Chapel", "time": 1554048157604, "rating": 1.0, "text": "I was out of town and my phone crashed on me. I went in to get it fixed and they said it would be a week and they would ship it to me. After 35 days and tons of phone calls to the owner my phone could not be located and all of them were caught in multiple lies. If that wasn’t bad enough they stopped answering my calls so I was left without a phone. After a month and a half I finally got my phone back and there were even more problems than when I gave it to them. NEVER TAKE YOUR PHONE HERE. The owner Tyler lied to my face and wouldn’t even give me my phone back when I asked for it 6 hours after I left it. I have never dealt with so many dishonest people at one store. Worst experience of my life. The experience was horrible, and to make it worse I got took for $200 and they refused to refund after not fixing the problems and causing more.\n\nResponse 2: I guess the “board repair time frame” covers all the lies told. Also once again another lie. Ifixit denied the charges being refunded and the credit card company had to eat them.", "pics": null, "resp": {"time": 1553990313858, "text": "Unfortunately. The board repair time frame was out of our control . As a third party board repair team is the ones we use . While having it at board repair a charge back was placed on the payment and was sent back to you as soon as we had it back in our position . This was also handled at the end of last year as we have the charge back notice  as it was never our desire for the time frame we updated you based on the information provided by the boated repair team\n\nSome iPhone 7 devices have many many  board level and chip level flaws that are design issues and also beyond anything that can be controlled or prevented"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "109492675352532173731", "name": "Daniela Garcia", "time": 1588019550857, "rating": 5.0, "text": "They were able to fix the back screen of my iPhone, and the customer service was excellent. I would go to them again 😊", "pics": null, "resp": {"time": 1596323931475, "text": "Thank you for your business"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "116034933543279482406", "name": "Megan Pitts", "time": 1585090840217, "rating": 1.0, "text": "Very unprofessional employees. Paid\n$220 to get my phone screen fixed and the same day the screen popped up bc they didn’t fix it correctly. then when i took it back with my receipt they wouldn’t fix it again. terrible service.", "pics": null, "resp": {"time": 1596323579110, "text": "Megan we would like to looked into this further please email tjordan@ifixandrepair.com your type of phone and invoice number"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "115393214302779695749", "name": "kalid theone", "time": 1556593498999, "rating": 5.0, "text": "The very best in their field. Fast, professional and quality repairs. I wish I could give them 1billion stars in this review! Thank you so much!!", "pics": null, "resp": {"time": 1574788045726, "text": "Hello,  thank you so much for taking the time to write this review. We hope to keep in touch through our social media, follow us on Facebook @ifixdothan and @ifixandrepairofficial on Instagram, to get the most updated info about promotions and new products!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "115371005614984694931", "name": "Nate Curry", "time": 1556563624581, "rating": 5.0, "text": "They are an amazing service it was quick and easy. Amazing customer service and worry free. I will definitely be looking forward to using them in the future.", "pics": null, "resp": {"time": 1575136030665, "text": "Hello Nate, thank you so much for taking the time to write this review. We hope to keep in touch through our social media, Don't forget to follow us on Facebook @ifixdothan  and @ifixandrepairofficial on Instagram to get the most updated info about promotions and new products!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "101044526742222994492", "name": "Michael Long", "time": 1491075101447, "rating": 5.0, "text": "Fast and friendly with their service", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPwfBZr5LwBw4n7r8lpFKZAE9m2WnYjqvFbJQ8Y=w150-h150-k-no-p"]}], "resp": {"time": 1491234076806, "text": "Thank you so much for taking the time to leave a Five Star Review, Michael! We appreciate the opportunity to repair your device and we hope to help you again in the future. We know your time is valuable so again....Thank you!\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "105781631879418803806", "name": "Elizabeth Conner", "time": 1494278088567, "rating": 5.0, "text": "GREAT SERVICE.  Tony was a great help for both of our iPhones. Quick and courteous. Will be a customer from now on. It is more affordable than you think to fix a phone. Worth talking to him before you throw it out!!", "pics": null, "resp": {"time": 1494343827625, "text": "Thank you so much for taking the time to leave a Five Star Review, Elizabeth. We appreciate the opportunity to repair your device and look forward to helping you again in the future. Thank you!\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "107169532334824296932", "name": "julie Parrish", "time": 1536676936033, "rating": 5.0, "text": "My experience was great! Tyler was very helpful and patient. Service was fast and dependable. I’ve already recommended others who need help. 👍", "pics": null, "resp": {"time": 1553878828133, "text": "Thank you so much for your kind words, Julie. We really appreciate you taking the time out to share your experience with us — and we agree, Tyler is truly a gem to have on our team! We count ourselves lucky for customers like you. We look forward to working with you again in the future!\n\nPlease follow us on Facebook @ifardothan.\n\nHave a lovely day!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "113654691197406124571", "name": "David Birge", "time": 1559396582595, "rating": 5.0, "text": "My note 9 screen was busted and looks brand new. Only had to wait 30 minutes. Definitely suggest Tyler", "pics": null, "resp": {"time": 1559404060934, "text": "Thank you, David! We really appreciate you taking the time to leave us such a nice review! We hope to see you again soon!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "114123465533585964211", "name": "William Hoehn", "time": 1574625300196, "rating": 4.0, "text": "This Wal-Mart is better than the south side Wal-Mart. Helpful and polite.", "pics": null, "resp": {"time": 1596323996330, "text": "Although we are not Walmart’s page we do think the Walmart we have a store is is pretty awesome William if you ever need any devices repairs or advice please stop in we would love to help"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "107951683250277873326", "name": "Kontra Band k", "time": 1569883101051, "rating": 5.0, "text": "I highly recommend Tyler an duncan to repair any device you have they are amazing an it takes them little time👍🏾👍🏾👍🏾👍🏾👍🏾 I’d give them 100 stars", "pics": null, "resp": {"time": 1569950928144, "text": "Hello, thank you so much for this friendly review. We will make sure our staff get recognition from this.\n\nWe hope to see you in the future, and please bring your friends and family.\n\nDon't forget to follow us on Facebook @ifixdothan  and @ifixandrepairofficial on Instagram."}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "112456773361375079723", "name": "jermaine beaty", "time": 1540152746767, "rating": 1.0, "text": "If I could give this place 0 stars I honestly would! These people will keep your phone up to 5 months! Sending back and fourth across the world for it just to come back not even fixed and when it’s time to get your refund they’ll give you partial payment of what you paid & tell you to expect the rest on your card in 4 to 5 business days then block your number and never give you what they owe you! DO NOT RECOMMEND THIS PLACE FOR ANYBODY", "pics": null, "resp": {"time": 1540153647021, "text": "Please email with your invoice number and contact information so we can get this taken care of today ! Dothanwm@ifixanrepair.com"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "104560145914116150602", "name": "Elise Padgett", "time": 1529862042704, "rating": 5.0, "text": "Customer service was amazing! Tyler did everything to get my device repaired quickly! I would definitely recommend this location!", "pics": null, "resp": {"time": 1553878950877, "text": "Elise, thank you so much for taking the time to write this review. We hope to keep in touch through our social media, follow us on Facebook @ifardothan to get the most updated info about promotions and new products!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "107049164912679606292", "name": "Diane Trousdale", "time": 1570884928705, "rating": 5.0, "text": "Fixed my iPad. Very satisfied. Will use again.", "pics": null, "resp": {"time": 1570894269125, "text": "Diane, thank you for taking the time to share your experience with us! We work hard to meet expectations like yours, and we’re happy to read we hit the mark for you. Come back and see us soon.\n\nHave a fantastic day!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "100321580875417512611", "name": "karmeal Candy Gang", "time": 1557252905458, "rating": 5.0, "text": "These guys are great I had my baby “20” inch done and the price was awesome and I will go back whenever I need work on a phone,tablet", "pics": null, "resp": {"time": 1557345391363, "text": "Teree, thank you for taking the time to leave us a five-star review.\n\nWe hope to see you here again and please bring your friends and family.\n\nDon't forget to follow us on Facebook @ifardothan.\n\nHave an awesome day!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "113690630488798242592", "name": "Susan English", "time": 1492736015943, "rating": 5.0, "text": "The people here were extremely nice & gave me several options. They had to special order my screen but it came in way before the time it said it would.  I would definitely recommend this ifix location to anyone.", "pics": null, "resp": {"time": 1492789817706, "text": "Susan. We appreciate your positive feedback about us. We are always providing the best for our customers. If you're traveling to our area again soon, don't hesitate to call us.\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "100762238250388186705", "name": "Ann Darlene Holloway", "time": 1571166099103, "rating": 5.0, "text": "Wonderful customer service. Very helpful.", "pics": null, "resp": {"time": 1571171286717, "text": "Thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service.\n\nHave a fantastic day!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "111678452878636293084", "name": "Jessie Johnson", "time": 1550548005759, "rating": 5.0, "text": "My experience is always great whether I need help resolving issues with my computer or phone they are always super helpful and very knowledgeable! Highly recommend!", "pics": null, "resp": {"time": 1553875054077, "text": "Jessie, thank you so much for taking the time to leave us a five stars rate!\n\nPlease do visit us again, we love having you as a customer.\n\nDon't forget to follow us on Facebook @ifardothan.\n\nCheers!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "106927774206447628157", "name": "Adra Talbott", "time": 1498494981645, "rating": 5.0, "text": "Excellent customer service! Elena was super professional, courteous, and thoroughly explained all of my options. I would definitely recommend Ifix!", "pics": null, "resp": {"time": 1515169187563, "text": "Dear Adra, we're so glad that you got to experience Elena doing what she loves!\nHere at iFixandRepair we work really hard to offer the best technology customer service there is. We'll make sure Elena gets recognition from this. Did you know we have social media where you can keep track of our products, and tech tips? Here is our Facebook and Instagram page  @ifixandrepairofficial\nNext time we hear from you we hope is with a follow!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "118290929481412888631", "name": "Renae Pride Holton", "time": 1570924767943, "rating": 5.0, "text": "These guys Rock!!! I called these guys and asked if they could fix my watch today, they told me to bring it in...They fixed my Samsung Watch..Thanks you guys!!💣💣🎯", "pics": null, "resp": {"time": 1571171668386, "text": "Wow! You make us happy with your comment. We hope to see you in the future and please bring your friends and family.\n\nFollow us on Facebook @ifixdothan and @ifixandrepairofficial on Instagram.\n\nHave a nice day!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "115808389742444221045", "name": "AnneMarie Carlson", "time": 1529862361665, "rating": 5.0, "text": "Amazing service and for a great price. Definitely go there for all your repair needs!", "pics": null, "resp": {"time": 1553878889735, "text": "AnneMarie, thank you for taking the time to leave us a five stars review.\n\nWe hope to see you here again and please bring your friends and family.\n\nDon't forget to follow us on Facebook @ifardothan.\n\nHave an awesome day!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "115744665251611342205", "name": "Authentically Asriel", "time": 1570922335971, "rating": 5.0, "text": "Fixed my phone in less than an hour. Best customer service", "pics": null, "resp": {"time": 1571171751182, "text": "Hey, thank you for this awesome review. We'll make sure the staff get recognition from this."}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "110947775292296814960", "name": "Hannah Paulk", "time": 1544741227467, "rating": 1.0, "text": "I wouldn’t recommend this place for any repair. Took my husbands phone to have a battery replaced and it took a week to get the parts in supposedly. Come to find out after 4 trips to the store an employee was sent across the road to pick up a battery and the parts never came in. In the process of our repair they broke the screen and now insists on sending it off to have it fixed but expect us to pay the full cost. I ask for a full refund and was told that I would have to call someone else. I did that and still haven’t heard from anyone. The only reason they get one star is cause I can’t post a zero star review. Don’t waste your time and money people.", "pics": null, "resp": {"time": 1553878724222, "text": "Hi Hannah, we apologize for taking so long to respond. We appreciate you for bringing this situation to our notice. This is not by any means reflective the #iFixandRepair standards of service and customer satisfaction.\n\nPlease email us at info@ifixandrepair.com with your contact info and details about your case. We will do our best to fix this for you.\n\nHave a nice day! #iFixandRepair"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "116046658850615240936", "name": "Andrew Bolin", "time": 1556645415748, "rating": 5.0, "text": "Only place in Dothan i would trust to get my phone repaired, friendly staff and affordable prices for top quality repairs!!!", "pics": null, "resp": {"time": 1569950799188, "text": "Thank you so much! :)"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "113299959056076534740", "name": "Brandon Groomes", "time": 1492278230055, "rating": 5.0, "text": "Great customer service.... will definitely come back! Quick service and great deals!", "pics": null, "resp": {"time": 1492446749900, "text": "Thank you so much for taking the time to leave a Five Star Review, Brandon! We appreciate the opportunity to repair your device and we hope to help you again in the future. We know your time is valuable so again....Thank you!\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "111691396270695328400", "name": "Joshua Tucker", "time": 1524087517743, "rating": 5.0, "text": "This is undoubtedly the best repair shop in the Dothan area! Theyre really fast and the quality is better than anywhere around! Very professional!", "pics": null, "resp": {"time": 1553879039873, "text": "Thanks for the awesome review, Joshua! We work hard to meet expectations like yours, and we’re happy to hear we hit the mark for you. Come back and see us soon. Please follow us on Facebook @ifardothan.\n\nHave a wonderful day!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "109930260305497483519", "name": "Bridget Bryant", "time": 1491763625796, "rating": 5.0, "text": "Quick and fast. Needed my phone fixed asap and they did the job.  Very satisfied!", "pics": null, "resp": {"time": 1491838327715, "text": "Bridget. We appreciate your positive feedback about us. We are always providing the best for our customers. If you're traveling to our area again soon, don't hesitate to call us.\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "115759762021358266494", "name": "Samuel Sanders II", "time": 1553817352069, "rating": 5.0, "text": "Fixed my Galaxy S9+ in 30 minutes which I thought my phone was done after being ran over by my forklift today at work. Big thanks to ifixandrepair Northside Walmart location.", "pics": null, "resp": {"time": 1553877359712, "text": "Samuel, thank you so much for taking the time to leave us a five stars review!\n\nWe'll make sure the store gets recognition from this. Please do visit us again, we love having you as a customer.\n\nDon't forget to follow us on Facebook @ifardothan.\n\nCheers!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "102842313387751842193", "name": "Tiarra R Butler", "time": 1493325589578, "rating": 5.0, "text": "Great custom service! The repair was extremely fast! Will be send friends and family to this store!", "pics": null, "resp": {"time": 1493393070503, "text": "Thank you so much for taking the time to leave a Five Star Review, Tiarra. We appreciate the opportunity to repair your device and look forward to helping you again in the future. Thank you!\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "103148228613544990438", "name": "Anonymous", "time": 1499301639855, "rating": 5.0, "text": "Elena helped me pick out a phone case that was not only protective, but really cute. She was very helpful & made sure I was happy with everything before I left.", "pics": null, "resp": {"time": 1515169422428, "text": "Dear Shelby, we're so glad that Elena helped you get down with style! Your satisfaction is all that matters to us!\nHere at iFixandRepair we work really hard to offer the best technology customer service there is. We'll make sure Elena gets recognition from this. Did you know we have social media where you can keep track of our products, and tech tips? Here is our Facebook and Instagram page  @ifixandrepairofficial\nNext time we hear from you we hope is with a follow!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "101364933329942605810", "name": "Janay Wilson", "time": 1523991035857, "rating": 5.0, "text": "This location has really made a big improvement from previous owners , the employees  are knowledgeable  and honest,  they take the time to fully explain what they are doing and  why ,I've always been treated with a smile and inviting attitude. I would highly recommend the ifixandrepair  in Northside Walmart for any repair needs !\n\nThey have recently  done a remodel that looks incredible and shows the level of care that they have for the business.", "pics": null, "resp": {"time": 1553879131342, "text": "Janay, thank you for taking the time to leave us this great review.\n\nWe hope to see you here again, thanks for your trust in us, and to help us to spread the word!\n\nPlease don't forget to follow us on Facebook @ifardothan.\n\nHave a great day!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "116123369976100198498", "name": "Ralphal McHellon", "time": 1490661764828, "rating": 5.0, "text": "I had a really great experience here I would definitely refer this place for any phone repairs they did a great job on my galaxy s6", "pics": null, "resp": {"time": 1490713117070, "text": "Thank you so much for taking the time to leave a Five Star Review, Ralphal.\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "118089568593399390010", "name": "Enrique Lopez", "time": 1474328921098, "rating": 1.0, "text": "WOULD NOT RECOMMEND. Was getting an iPhone 6 repaired that had a little bit of frame damage. The screen would not sit properly so I asked the person working to open the screen again to see if there was anything in the way from keeping it from going down anymore. The guy literally spent 30 minutes just trying to remove a screw from the bottom of the phone which he was never successful which resulted in him breaking a little bracket that holds the screen in place. The guy was rude and kept saying you'll have to talk to the manager. Let alone the man did not smell very friendly. I would not recommend anyone go here.", "pics": null, "resp": {"time": 1474471450128, "text": "Enrique  I’m sorry to hear about your bad experience. Your disappointment is our disappointment, NAME. You deserve to be provided with a completely efficient, professional, value-for-money experience each time you stop by, and we'd like to wholeheartedly apologize for falling short of your expectations. Please either email details to info@ifixandrepair.com or stop in and allow our manager to see if we can help you.\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "114524270122844542866", "name": "avelincoln", "time": 1496868096930, "rating": 5.0, "text": "Elena and Shelby are always trying to boost the stores sales and customer satisfaction is at 100%! Great products.", "pics": null, "resp": {"time": 1515169125684, "text": "Hey, we're so glad happy you get to share this experience from Elena and Shelby's hard work!\nHere at iFixandRepair we happy to offer the best technology customer service there is. We'll make sure they both get recognition from this. Did you know we have social media where you can keep track of our products, and tech tips? Here is our Facebook and Instagram page  @ifixandrepairofficial\nNext time we hear from you we hope is with a follow!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "100956939414211503528", "name": "Amber Davis", "time": 1529533151695, "rating": 5.0, "text": "Great customer service, quick repairs, friendly atmosphere, and reasonable prices.", "pics": null, "resp": {"time": 1553878971234, "text": "Amber, thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service.\n\nHave a fantastic day!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "102385386999620999463", "name": "Natalie Mills", "time": 1495062692754, "rating": 5.0, "text": "AWESOME CUSTOMER SERVICE\nFRIENDLY AND HELPFUL STAFF\nQUALITY WORK DONE IN A TIMELY MANNER\nREASINABLE PRICING", "pics": null, "resp": {"time": 1515168522404, "text": "Dear natalie, we're so glad that you get to mention our staff's great work!\nHere at iFixandRepair we work really hard to offer the best technology customer service there is. We'll make sure to get recognition from this. Did you know we have social media where you can keep track of our products, and tech tips? Here is our Facebook and Instagram page  @ifixandrepairofficial\nNext time we hear from you we hope is with a follow!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "111800323859277184823", "name": "MSFT", "time": 1492219030534, "rating": 5.0, "text": "The screen looks great, they were on time and it was cheaper than i thought i highly recommend", "pics": null, "resp": {"time": 1492446735429, "text": "Thank you for giving us a perfect rating and for recommending #iFixandRepair We´re sure our entire staff enjoyed helping to fix your device. Take care!\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "102807104629766179345", "name": "Mary WHITMAN", "time": 1546553938795, "rating": 2.0, "text": "Couldn't help me with my problem.", "pics": null, "resp": {"time": 1553878664625, "text": "Mary, thank you for taking the time to give us a review.\n\nWe take our customer's feedback very seriously and we will really appreciate that you let us know the reason for your disappointment. We want to improve every day! So, Please email us at info@ifixandrepair.com.\n\nI'm sure once we've cleared things up, we'll win you back as a customer."}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "100306881572656424809", "name": "Son of Nun", "time": 1587310731525, "rating": 5.0, "text": "Fixed my iPad mini and iPhone 4s price was fair and turn around time was fast", "pics": null, "resp": {"time": 1493651818013, "text": "Thank you so much for taking the time to leave a Five Star Review, Philip. We appreciate the opportunity to repair your device and look forward to helping you again in the future. Thank you!\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "104425784222979182249", "name": "Jacy Bottoms", "time": 1497901690324, "rating": 5.0, "text": "Great repairs. Good knowledge of tech in store.", "pics": null, "resp": {"time": 1515169156688, "text": "Jacy, thank you for this great review and mentioning our tech knowledge!\nOur team here at iFixandRepair is thrilled to hear such positive feedback and because we appreciate your loyalty, we've created @iFixandRepairOfficial Page on Facebook and Instagram.\nDid you know you can keep track of our products, and tech tips?\nNext time we hear from you we hope is with a follow!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "109657669387519111066", "name": "John Luke Spurlin", "time": 1550429441773, "rating": 5.0, "text": "Great customer service and Speedy repair times", "pics": null, "resp": {"time": 1553878612295, "text": "John, thank you so much for taking the time to write this review. We hope to keep in touch through our social media, follow us on Facebook @ifardothan to get the most updated info about promotions and new products!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "108379001728399962383", "name": "Gammit123", "time": 1491098882435, "rating": 5.0, "text": "Stayed open late after calling in after hours, fixed quickly, great customer service", "pics": null, "resp": {"time": 1491234103814, "text": "Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "110892356174172011169", "name": "kokobitty", "time": 1550709818098, "rating": 5.0, "text": "Fast very friendly and helpful and has a lifetime warranty for repairs and 1year for batteries, unbeatable! Thanks Tyler!!!", "pics": null, "resp": {"time": 1553878427413, "text": "Kokobitty, thank you for taking the time to leave us this great review.\n\nWe hope to see you here again, thanks for your trust in us, and to help us to spread the word!\n\nPlease don't forget to follow us on Facebook @ifardothan.\n\nHave a great day!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "111267783981093272863", "name": "Tobyas Kanekoa", "time": 1565041205082, "rating": 5.0, "text": "Thank you Tyler for your dedication in helping people out!", "pics": null, "resp": {"time": 1569950972039, "text": "Thank you Tobyas for taking the time to leave this review. Follow us on Facebook @ifixdothan and @ifixandrepairofficial on Instagram.\n\nHave a nice day!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "100102670476169529802", "name": "Peggy Mcdaniel", "time": 1480480201833, "rating": 5.0, "text": "Great customer service from jakel. He was very patient with me and very helpful", "pics": null, "resp": {"time": 1480522141365, "text": "Peggy, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future.\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "103197241209349959597", "name": "Lisa Burnham", "time": 1495824211871, "rating": 5.0, "text": "Great and prompt service! Very nice as well", "pics": null, "resp": {"time": 1515168959747, "text": "Lisa, thank you for this great review and mentioning our efficiency!\nOur team here at iFixandRepair is thrilled to hear such positive  feedback and we’re proud to be one of the top leading tech repair franchises. Did you know we have social media where you can keep track of our products, and tech tips? Here is our Facebook and Instagram page  @ifixandrepairofficial\nNext time we hear from you we hope is with a follow!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "102097474960487619274", "name": "Eciatto", "time": 1591929240565, "rating": 5.0, "text": "Friendly and helpful.", "pics": null, "resp": {"time": 1596323641206, "text": "Thank you for your business!!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "112920032703670280010", "name": "Yanira Coleman", "time": 1481830215301, "rating": 5.0, "text": "Ifixandrepair is the place to go if you want your device repaired , great service, timely manner and reasonable price you can't beat it. Thanks Jakel for my repair", "pics": null, "resp": {"time": 1481833471893, "text": "Yanira, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future.\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "109123831373516675998", "name": "Nicki Norris", "time": 1495061494957, "rating": 5.0, "text": "Completely satisfied with this unbelievable service that was very quick and for the very best price!!", "pics": null, "resp": {"time": 1515168461185, "text": "Nicki, thank you for this great review and mentioning our great service! For us your satisfaction is all that matters.\nHere at iFixandRepair we are thrilled to hear such positive  feedback and we’re proud to be one of the top leading tech repair franchises. Did you know we have social media where you can keep track of our products, and tech tips? Here is our Facebook and Instagram page  @ifixandrepairofficial\nNext time we hear from you we hope is with a follow!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "110260543312499799799", "name": "fiend drift", "time": 1492298886753, "rating": 5.0, "text": "Great experiance great work definatly would reccomend.", "pics": null, "resp": {"time": 1492446760963, "text": "Shean. Thank you for giving us a perfect rating and for recommending #iFixandRepair We´re sure our entire staff enjoyed helping to fix your device. Take care!\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "107045490158821150674", "name": "Nathan Newsome", "time": 1495215047411, "rating": 5.0, "text": "Tony was awesome and extremely helpful you gotta check them out!!!!!", "pics": null, "resp": {"time": 1515168583378, "text": "Dear Nathan, we're so glad that you enjoyed Tony's work!\nHere at iFixandRepair we work really hard to offer the best technology customer service there is. We'll make sure Tony gets recognition from this. Did you know we have social media where you can keep track of our products, and tech tips? Here is our Facebook and Instagram page  @ifixandrepairofficial\nNext time we hear from you we hope is with a follow!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "101510820282621826530", "name": "Lisa Sorrels", "time": 1548697183812, "rating": 5.0, "text": "John Luke was very nice ,he took care of my problem,great work,!!", "pics": null, "resp": {"time": 1553878632162, "text": "Lisa, thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service.\n\nHave a fantastic day!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "101270469090955693577", "name": "Kara Robinson", "time": 1495230463409, "rating": 5.0, "text": "Awesome staff and store . #1 place in Dothan for cell phone repair. Shelby rocks!", "pics": null, "resp": {"time": 1515168895313, "text": "Kara, WOW,  thank you for this great review and mentioning your loyalty to us!\nOur team here at iFixandRepair is thrilled to hear such positive feedback regarding our work and we’re proud to be one of the top leading tech repair franchises in the USA. We would love to keep communication with you, did you know we have social media where you can keep track of our products, and tech tips? Here is our Facebook and Instagram page  @ifixandrepairofficial\nNext time we hear from you we hope is with a follow!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "113441584264303428024", "name": "Ryan Pace official", "time": 1557082285205, "rating": 5.0, "text": "Great service, very quick!", "pics": null, "resp": {"time": 1557347801776, "text": "Ryan, thank you so much for taking the time to leave us a five-star review!\n\nWe'll make sure the store gets recognition from this. Please do visit us again, we love having you as a customer.\n\nDon't forget to follow us on Facebook @ifardothan.\n\nCheers!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "111378141428032088046", "name": "Dodge Nerbonne", "time": 1493066707609, "rating": 5.0, "text": "Fast well worth the wait needed to fix the cracked screen", "pics": null, "resp": {"time": 1493131833359, "text": "Dodge Nerbonne. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "117407402653337758844", "name": "Asa Sellers", "time": 1491766029112, "rating": 5.0, "text": "Very efficient. I was in and out plus very friendly customer service.", "pics": null, "resp": {"time": 1491838338361, "text": "Asa, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future.\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "108151488235466935342", "name": "Ivey Terry", "time": 1499139220841, "rating": 5.0, "text": "Awesome customer service! All my questions answered.", "pics": null, "resp": {"time": 1515169344724, "text": "Ivey, thank you for this great review and mentioning your experience!\nHere at iFixandRepair we are thrilled to hear good comments like this.\nFor any future questions, did you know we have social media where you can keep track of our products, and tech tips? Here is our Facebook and Instagram page  @ifixandrepairofficial\nMake sure you give us a follow and tell your friends about it!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "105691484492747729032", "name": "sans undertale", "time": 1582060866171, "rating": 4.0, "text": "Hmm good", "pics": null, "resp": {"time": 1582576873918, "text": "Hello, thank you so much for taking the time to write this review."}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "112423672318497644128", "name": "Kristen Miller", "time": 1492729466747, "rating": 5.0, "text": "Very friendly and great service!", "pics": null, "resp": {"time": 1492789773067, "text": "Kristen. We appreciate your positive feedback about us. We are always providing the best for our customers. If you're traveling to our area again soon, don't hesitate to call us.\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "117825280944218530205", "name": "Jana Calhoon", "time": 1529862343725, "rating": 5.0, "text": "Tyler has been nothing but great when I call or stop by with a problem . I’m hard on phones but I know I’m in good hands when dealing with him !! Thank you for everything", "pics": null, "resp": {"time": 1553878922235, "text": "Jana, thank you so much for taking the time to leave us a five stars review!\n\nWe'll make sure the store gets recognition from this. Please do visit us again, we love having you as a customer.\n\nDon't forget to follow us on Facebook @ifardothan.\n\nCheers!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "105075333367320925222", "name": "Elaine Golden", "time": 1498498016727, "rating": 5.0, "text": "Awesome quick customer service", "pics": null, "resp": {"time": 1515169217774, "text": "Elaine, thank you for this great review and mentioning our efficiency!\nOur team here at iFixandRepair is thrilled to hear such positive feedback and because we appreciate your loyalty, we've created @iFixandRepairOfficial Page on Facebook and Instagram.\nDid you know you can keep track of our products, and tech tips?\nNext time we hear from you we hope is with a follow!\nWishing you a great star of the year. #iFixandRepairLove2"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "106951774027510460966", "name": "Cindy Womack", "time": 1529167825303, "rating": 5.0, "text": "They r awesome!!! Did a wonderful job!!", "pics": null, "resp": {"time": 1553879000663, "text": "Cindy, thank you for this friendly review. We hope to see you again soon! Please bring your friends and family! follow us on Facebook @ifardothan.\n\nBest regards!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "101693310789680391955", "name": "Hayden Lacy", "time": 1495653071588, "rating": 5.0, "text": "Great customer service!", "pics": null, "resp": {"time": 1515168940227, "text": "Hey, thank you for this great review and mentioning our great customer service!\nOur team here at iFixandRepair is thrilled to hear such positive feedback and because we appreciate your loyalty, we've created @iFixandRepairOfficial Page on Facebook and Instagram.\nDid you know you can keep track of our products, and tech tips?\nNext time we hear from you we hope is with a follow!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "109746705377576421459", "name": "Jonathon Frye", "time": 1492128083169, "rating": 5.0, "text": "Very very helpful me and a friend are outta town and we came down to Dothan both phones messed up and Tony the guy who works there really really helped me and a friend out and if you need a phone fix up go see Tony!!", "pics": null, "resp": {"time": 1492446719318, "text": "Jonathon, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future.\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "115531651112463103916", "name": "Wiregrass Mall", "time": 1496786450116, "rating": 5.0, "text": "Awesome service ! Quick service !", "pics": null, "resp": {"time": 1515169037477, "text": "Hey, thank you for this great review!\nOur team here at iFixandRepair is thrilled to hear such positive feedback and because we appreciate your loyalty, we've created @iFixandRepairOfficial Page on Facebook and Instagram.\nDid you know you can keep track of our products, and tech tips?\nNext time we hear from you we hope is with a follow!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "105472276594735849059", "name": "David S", "time": 1474597495574, "rating": 1.0, "text": "STAY AWAY! Staff is very unfriendly and rude!", "pics": null, "resp": {"time": 1553879256809, "text": "Good morning David, We sincerely apologize for taking so long to respond. Thanks for sharing your feedback. We’re sorry your experience didn’t match your expectations. It was an uncommon instance and we’ll do better.\n\nPlease feel free reach out to info@ifixandrepair.com with any further comments, concerns, or suggestions you wish to share. We would love to make things right if you give us another chance.\n\nHave a great day! #iFixandRepair"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "111973560558466809091", "name": "Christian Cribbin", "time": 1524061211342, "rating": 5.0, "text": "I wouldn’t trust anyone else with my phones.", "pics": null, "resp": {"time": 1553879097523, "text": "Thank you for the kind words, Christian! We’re so happy your visit to iFixandRepair - Dothan Walmart went so smoothly. Would you mind sharing with your friends who are in need of a Device check-out, too? We’d love to continue providing great service to awesome customers like you. Thanks again!\n\nPlease follow us on Facebook @ifardothan.\n\nHave a great day!"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "118096921924507760781", "name": "Sabrina Critten", "time": 1499036624611, "rating": 5.0, "text": "Very much satisfied", "pics": null, "resp": {"time": 1515169263318, "text": "Sabrina, your satisfaction is all that matters to us! Thank you for letting us know about your experience with us.\nOur team here at iFixandRepair is thrilled to hear such positive feedback and because we appreciate your loyalty, we've created @iFixandRepairOfficial Page on Facebook and Instagram.\nDid you know you can keep track of our products, and tech tips?\nNext time we hear from you we hope is with a follow!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "101072368984779712681", "name": "DJPakMan1", "time": 1492108483954, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": {"time": 1492446704617, "text": "Thank you so much for taking the time to leave a Five Star Review. We appreciate the opportunity to repair your device and look forward to helping you again in the future. Thank you!\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "109339270891051008733", "name": "Marissa Gagliano", "time": 1472832205038, "rating": 5.0, "text": "Great staff,  fast and reliable!", "pics": null, "resp": {"time": 1472847120051, "text": "Rissa, thank you so much for the kind words and the loyalty! We love being able to help!\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "112143907747052889209", "name": "Mayia Williams", "time": 1484002428996, "rating": 1.0, "text": "Terrible customer service they gave had my phone since Christmas", "pics": null, "resp": {"time": 1553879225642, "text": "Hi Mayia, we apologize for taking so long to respond. We appreciate you for bringing this situation to our notice. This is not by any means reflective the #iFixandRepair standards of service and customer satisfaction.\n\nPlease email us at info@ifixandrepair.com with your contact info and details about your case. We will do our best to fix this for you.\n\nHave a nice day! #iFixandRepair"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "101852204195966223814", "name": "Doctor Sandpaper", "time": 1495057076418, "rating": 5.0, "text": "Cheap, quick, and easy...", "pics": null, "resp": {"time": 1515168396076, "text": "Alex, thank you for this great choice of words to describe us!\nOur team here at iFixandRepair is thrilled to hear such positive  feedback and we’re proud to be one of the top leading tech repair franchises. Did you know we have social media where you can keep track of our products, and tech tips? Here is our Facebook and Instagram page  @ifixandrepairofficial\nNext time we hear from you we hope is with a follow!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "114859622411964723187", "name": "Johnny Wolfe", "time": 1630189332930, "rating": 5.0, "text": "Had exactly what I was looking for. Great price on cases.", "pics": null, "resp": null, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "103836708130330232562", "name": "Adam Collins", "time": 1630184836165, "rating": 5.0, "text": "Kind and knowledgeable staff", "pics": null, "resp": null, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "101933880559603653629", "name": "Lily Shepard", "time": 1630184148696, "rating": 5.0, "text": "Fast and easy. No complaints.", "pics": null, "resp": null, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "109407292512564735052", "name": "tesha sneed", "time": 1480480772826, "rating": 5.0, "text": "(Translated by Google) Great customer service with jacket\n\n(Original)\nGreat customer service with jakel", "pics": null, "resp": {"time": 1480522245715, "text": "Thank you so much for taking the time to leave a Five Star Review, Tesha! We appreciate the opportunity to repair your device and we hope to help you again in the future. We know your time is valuable so again....Thank you!\niFixandRepair - Dothan Northside Walmart (334) 521-1112"}, "gmap_id": "0x88928dfecbb52f7f:0x144275ddcd996f93"}
{"user_id": "113797312064259664752", "name": "Usagi Tsukino", "time": 1616803213042, "rating": 5.0, "text": "My #1 place to get all my things fixed. Cody was very nice and professional when assisting me and explained in detail what the fixes were. You don’t get that anywhere else these days, it’s all just fix it and hand it back to the customer. Not here though. Ifixitandrepair is the best place to go.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107997659756833032141", "name": "Merle Cureton", "time": 1614022817430, "rating": 5.0, "text": "I was in there last week and bought a phone charger the employees were very professional and helpful. Cody the one that help was great, very friendly like we’ve known each other. Will definitely be back.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107223197651041293365", "name": "Bruce Parmele", "time": 1614635113748, "rating": 5.0, "text": "Awesome shop! Very friendly and professional.  Was in and out in less than 10 minutes.  Wife needed a new screen protector and got it with no hassle or sales pressure.  We will use them again!", "pics": null, "resp": {"time": 1614654809229, "text": "Bruce, thank you for taking the time to leave us this great review.\n\nWe hope to see you here again, thanks for your trust in us, and to help us spread the word!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111583176828310746105", "name": "Rhonda Bullock", "time": 1615674356561, "rating": 5.0, "text": "I urge anyone with any electronic needs, phone repairs, etc to go here. Definitely the place to visit.\nThanks again", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "100644798905232499953", "name": "Frank Deveroux", "time": 1616803459322, "rating": 5.0, "text": "Fixed my grandson’s device quite well. Returned it clean as well. His device is “thinking” better now.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "110778433006058668542", "name": "Sam Revells", "time": 1612648025871, "rating": 5.0, "text": "Adam and Cody are amazing!!!!!! They had my phone fixed in 10 minutes and was very informative and professional!!!! If you guys ever need your phone fixed this is the place to go. You can tell they truly love what they do. Thanks again guys!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104525410868995398080", "name": "Robert Eckenroth", "time": 1607197457272, "rating": 5.0, "text": "I took my ipad pro there today. One of the keys wasn't working correctly.  Thought I had to have glass replaced. The person working there said would repair it and said she would try different things first to make sure. When I got the call I was shocked it took so short of time to repair. Instead of replacing glass she tried resetting cables.  This worked great. My many thanks to her for fixing another local business error. Great service and attitude. Recommend...", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102851066894935737250", "name": "Derrick Johnson", "time": 1619375709349, "rating": 5.0, "text": "This was the best service ever.  She saved me $250.00", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107807899651533722805", "name": "Diamond Lewis", "time": 1609813863305, "rating": 5.0, "text": "Ms. Cayce was very helpful with fixing my phone. I was very desperate and she knew it and still gave me a very good price. I would recommend this I fix company to anyone", "pics": null, "resp": {"time": 1610168215534, "text": "Thank you so much for your kind words, Diamond. We really appreciate you taking the time out to share your experience with us — and we agree, Ms Cayce is truly a gem to have on our team! We count ourselves lucky for customers like you. We look forward to working with you again in the future! Have a nice Day :D"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105430321246744659572", "name": "Lauren Brown", "time": 1611256898146, "rating": 5.0, "text": "Caycy was so sweet and professional! Thank you so much for your help!! ❤️", "pics": null, "resp": {"time": 1611279190038, "text": "Thank you so much for taking the time to rate your experience with us Lauren! We work hard to meet expectations like yours, and we’re happy to read we hit the mark for you :D See you again when you need to!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113177985149269400683", "name": "Dakotah Hyatt", "time": 1604968801040, "rating": 5.0, "text": "Amazing screen protector replacement. Needed a new protector after mine got scraped up. Great service and very happy with my new protector.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113997558880952570704", "name": "Khamis Bilbeisi", "time": 1602876117517, "rating": 5.0, "text": "The staff are very helpful and professional. They care for their customers and always ready to help on a timely fashion. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113844019148039137461", "name": "Aylin Turkoglu", "time": 1602097797538, "rating": 5.0, "text": "I was worried about finding the right place to fix my phone and then a friend told me about iFixitandRepair right here in the local mall! Everyone there was very welcoming and Cody, who fixed my phone, was polite and helpful! He explained to me step by step what was wrong with my phone and what he’s going to do to fix it. I’ve never felt more comfortable getting my phone fixed and it’s thanks to him :) definitely recommend!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117821390451963167988", "name": "Eric Hyatt", "time": 1603559008108, "rating": 5.0, "text": "Cayce was amazing and immediately helped me with my issue. Kind, professional and knowledgeable. I would recommend to anyone for phone repair.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "100984471134324186822", "name": "Sterling Wade", "time": 1610829925075, "rating": 5.0, "text": "Great customer service higly recommended\nCasey went above beyond to help!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101770990496332421105", "name": "GD Kirby", "time": 1606079386011, "rating": 5.0, "text": "The lady working today was very helpful and was able to fix my phone in no time.  Would recommend", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102967729641288391311", "name": "clint collins", "time": 1608403199815, "rating": 5.0, "text": "Cayce was very quick and knowledgable about not only my phone and accessories but all of them. She even loaned me one of her personal phones while we were waiting for my screen to come in! If you want services for your phone, go see Cayce at Wiregrass Commons Mall.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114109639971013731107", "name": "alex brackin", "time": 1595450211061, "rating": 5.0, "text": "My experience was absolutely amazing! So fast, and so helpful! I am so excited about my phone being fixed! Cody, has the best personality and the best manners! Thank you so much! :)", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112821295912525653998", "name": "Tonya Lynn", "time": 1603399894928, "rating": 5.0, "text": "Very professional and welcoming!!! Fast service, the lady working there is exceptionally nice and had great customer service!!! Will definitely be using them again for any repairs!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107186389345712705090", "name": "Tbuggy Bitch", "time": 1604090103004, "rating": 5.0, "text": "Cody, Adam,, & Casey Were Wonderful With Me! They Were very respectful To Me!! They Are GREAT people !\n-Jonathan Myhand", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101282896767615776473", "name": "Nyomi Daniels", "time": 1608520151175, "rating": 5.0, "text": "Amazing took only 15 mins and my phone is brand new THANK YOU!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106407308056008295758", "name": "Joe Camden", "time": 1589579212509, "rating": 5.0, "text": "Great staff. Clean store, friendly and knowledgeable. I would definitely recommend this location for anyone who needs a cell phone repaired. Was super impressed with the fact it only took about 20 minutes. So I had lunch while I waited. Thank you guys", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113354556983471301640", "name": "Samuel Lynon", "time": 1619970098891, "rating": 4.0, "text": "I believe the service to exceptional.", "pics": null, "resp": {"time": 1620274784293, "text": "Hi Samuel. Thank you so much for your amazing feedback 🙏 Hope to see you again !"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103040191077242173475", "name": "Elizabeth Brown", "time": 1620869408587, "rating": 3.0, "text": "I found cheaper  at other places in the mall!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105001348575238424561", "name": "Doug Thornton", "time": 1603834728603, "rating": 5.0, "text": "The girl here was amazing. She was professional and was able to fix my moto", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103774994391123209048", "name": "Destiny Oliver", "time": 1601848267044, "rating": 5.0, "text": "Great service! Appreciate the technician providing options to fix my screen, instead of just saying I need a whole new screen to make a sale.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101712709697900025490", "name": "Steven Williams", "time": 1606225389003, "rating": 1.0, "text": "My ear speaker was not working. Took it in to the Ifixandrepair at Wiregrass Commons in Dothan, AL for repair. They installed a part I didn’t need and charged me $98.10. NOT FIXED! Took my phone to another cell phone repair shop in the mall. The repairman was very professional and discovered a missing screw and bracket that Ifixandrepair had left out. Not only did he have the correct part, he also had a replacement screw and bracket. My phone was fixed for $32.70.  Bad business Ifixand repair 😡\nUpdate: 1 month later, and the part I did not need stopped working...", "pics": null, "resp": {"time": 1601945309661, "text": "Hi Steven,  thank you for bringing this situation to our notice. This is not by any means reflective of the #iFixandRepair standards of service and customer satisfaction.\nPlease email us at info@ifixandrepair.com or go to https://ifixandrepair.com/contact with your contact info and details about your case.  We would love to make things right if you give us another chance."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116195045145343971794", "name": "Seth Goodson", "time": 1602810934968, "rating": 5.0, "text": "The staff members were very friendly and very helpful and know exactly what they’re doing!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111582394860634670476", "name": "Samantha Skipper", "time": 1590697196691, "rating": 5.0, "text": "I came to iFix and repair to get protection pro put on my phone. There is a color/pattern for everyone. I also purchased a speck case from here and it’s the best quality case for the best price I’ve had. The team is super chill, sweet, and so willing to help!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113870371996102693024", "name": "Rikki Williams", "time": 1598896854140, "rating": 5.0, "text": "I came in here with a broken iPad, and Adam was helpful with the whole process and explaining what needed to be done. Overall great customer service.", "pics": null, "resp": {"time": 1600826889024, "text": "Hi Rikki, thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109936344976656002470", "name": "Shane MCCULLOUGH", "time": 1600481410249, "rating": 5.0, "text": "Impeccable customer service and extremely fair prices at a convenient speed. In and out in an hour thank yall so much for the screen replacement", "pics": null, "resp": {"time": 1600827063295, "text": "Thank you, Shane! We really appreciate you taking the time to leave us such a nice review! We hope to see you again soon!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114393867060149748976", "name": "Christina Hill", "time": 1597088252592, "rating": 5.0, "text": "Cody was my tech and he is AMAZING no upgrade or contract for me he restored my Note8 to it's former glory LOVE THEM", "pics": null, "resp": {"time": 1600827105395, "text": "Cristina, thank you for taking the time to leave us this great review. We hope to see you here again, thanks for your trust in us, and to help us spread the word!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116721094067660343133", "name": "clay pace", "time": 1601316956641, "rating": 5.0, "text": "They fixed my iPhone is less than 20 minutes.. definitely would recommend", "pics": null, "resp": {"time": 1568479315208, "text": "Thanks for your five stars rate Clay! Have a nice day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108901897336556587141", "name": "Devin Smith", "time": 1600977208616, "rating": 5.0, "text": "Replaced my note 9 screen in about 30 minutes.  Would recommend this location.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106342717230679104508", "name": "zech judy", "time": 1598841306382, "rating": 5.0, "text": "very professional well spoken polite ahead made me feel valued like a close friend", "pics": null, "resp": {"time": 1600827030079, "text": "Thank you, Zech! We really appreciate you taking the time to leave us such a nice review! We hope to see you again soon!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "110874267666405708721", "name": "Tashika Smith", "time": 1605395194648, "rating": 5.0, "text": "Adam was absolutely amazing helping me fix my tablet. Thanks Adam!!!!! Absolutely recommend!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116659892371881668967", "name": "Jeremy Hall", "time": 1593574316253, "rating": 5.0, "text": "Adam was nice and fixed my phone quickly. Very professional. 10/10 would recommend to a friend.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117489069736680911805", "name": "Jonathan Bradley", "time": 1584913562023, "rating": 5.0, "text": "I had a fantastic experience with the manager. She was working on her own was able to help me out immediately while still managing another customer. Quick responses with great results.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116984817199755470438", "name": "Carly Edwards", "time": 1590700678283, "rating": 5.0, "text": "Absolute life savers! 10/10 would recommend. Also the new remodel on the store looks amazing. 😍", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101636561221256685180", "name": "Lacy gullett", "time": 1602360571390, "rating": 5.0, "text": "Had me in and out in 5 mins tops !! AMAZING service", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109809093332009156631", "name": "Mary Ann Earnest", "time": 1592249031852, "rating": 5.0, "text": "Cayce and Cody were great at helping me with my device. Each time I come in they are very helpful", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104142898310067571252", "name": "ryan cinfici", "time": 1595832563072, "rating": 5.0, "text": "Cayce and staff are great and helpful. I would recommend this location.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108407512267180593109", "name": "Tony Robinson", "time": 1590189865541, "rating": 5.0, "text": "Great service, impressed they had my phone fixed in under 30 minutes. If you need your phone fixed this is definitely the place.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117921336085316017735", "name": "Tara Kirkland", "time": 1598896636935, "rating": 5.0, "text": "Excellent customer service. Adam was helpful and polite.", "pics": null, "resp": {"time": 1600827041635, "text": "Thank you, Tara! We really appreciate you taking the time to leave us such a nice review! We hope to see you again soon!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101500761369158661549", "name": "Drew Dewitt", "time": 1600981057277, "rating": 5.0, "text": "Got my phone fixed in around 20 minutes.. definitely the place to go if your screen is cracked", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102157312301795723479", "name": "Jahniro Hicks", "time": 1611440068152, "rating": 5.0, "text": "Brought my PS4 in for a fan repair. Had me ready to go in a hurry", "pics": null, "resp": {"time": 1611449765086, "text": "Great to hear that Jahniro! Thank you so much for taking the time to rate your experience with us! We work hard to meet expectations like yours, and we’re happy to read we hit the mark for you."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117872489852331953502", "name": "Oli Elaine", "time": 1598854529320, "rating": 5.0, "text": "Wonderful staff! So friendly.", "pics": null, "resp": {"time": 1600827086397, "text": "Oli, thank you for taking the time to leave us this great review. We hope to see you here again, thanks for your trust in us, and to help us spread the word!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108669938442286874317", "name": "Brittney Simpson", "time": 1597191630341, "rating": 5.0, "text": "Casey was VERY patient and helpful!!! She was such a blessing!! Thank you Casey!!! You rock!!!!", "pics": null, "resp": {"time": 1600826999372, "text": "Hi Brittney, thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117872489852331953502", "name": "Oli Elaine", "time": 1598854529320, "rating": 5.0, "text": "Wonderful staff! So friendly.", "pics": null, "resp": {"time": 1600827086397, "text": "Oli, thank you for taking the time to leave us this great review. We hope to see you here again, thanks for your trust in us, and to help us spread the word!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108669938442286874317", "name": "Brittney Simpson", "time": 1597191630341, "rating": 5.0, "text": "Casey was VERY patient and helpful!!! She was such a blessing!! Thank you Casey!!! You rock!!!!", "pics": null, "resp": {"time": 1600826999372, "text": "Hi Brittney, thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105121278633300895748", "name": "Chris Wren", "time": 1571956956584, "rating": 5.0, "text": "Amazing work!  Quick, friendly, personable and took great care of me and my device.  Will definitely be back for any further cell phone work I need!", "pics": null, "resp": {"time": 1572537439733, "text": "Thanks for the awesome review, Chris! We work hard to meet expectations like yours, and we’re happy to read we hit the mark for you. Come back and see us soon. Please follow us on Facebook @ifixwiregrassdothan\n\nHave a wonderful day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117485337897586428264", "name": "Jenny Smith", "time": 1601010422078, "rating": 5.0, "text": "Excellent Staff. Fast service.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "115987588586398854141", "name": "Tyler Brown", "time": 1594509302093, "rating": 5.0, "text": "The guy who works there was friendly and really good at what he does. A good experience all around.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102622530806530453951", "name": "Sandy Cherry", "time": 1575773388424, "rating": 5.0, "text": "The gentleman who worked tonight was Awesome!! Very knowledgeable and kind to boot! He fixed the sound by cleaning the inside and outside and now I hear great!!", "pics": null, "resp": {"time": 1576008102033, "text": "Hello Sandy, thanks for taking the time to write this nice review. We will make sure the staff get recognition from this. We hope to see you in the future. Have a nice day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104014854315501940829", "name": "Keisha", "time": 1601063455705, "rating": 5.0, "text": "Fast, good quality work and excellent customer service!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107633330225922743430", "name": "Dixie Normous", "time": 1590433158273, "rating": 4.0, "text": "Very helpful  Cayce and John luke helped me find a case for my tablet and I  will be coming back to  get my telephone fixed with yall", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104110827718087660390", "name": "Samantha Bradley", "time": 1584587700461, "rating": 5.0, "text": "The woman who helped us at the desk was so caring and understanding of my troubles! She took the time to help describe and fix our issue even during a stressful time! I would highly recommend!", "pics": null, "resp": {"time": 1589316718824, "text": "Hello Samantha, thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service.\n\nHave a fantastic day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109877023194202066959", "name": "Coffee with Beans", "time": 1582042328904, "rating": 5.0, "text": "This is where you go if you want your phone ACTUALLY fixed. Manager is polite and doesn't mind explaining and showing you what she's doing. Worth the nearly one hour drive. 🤗", "pics": null, "resp": {"time": 1582296656765, "text": "Hello,  thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service.\n\nHave a fantastic day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "110377225033139362526", "name": "Ellen Murphy", "time": 1565465955292, "rating": 5.0, "text": "WOW! what great service.  Because my screen was cracked, I couldn't use my favorite iPhone, I bought a new one at an astronomical price.  I was so unhappy with the new phone, I carried the cracked one around in hope of finding a solution.  In the Wiregrass Commons Mall , I found my answer at iFixandRepair store near the food court.  I was so pleased that my phone was restored, like new, in a few minutes at a fraction of the price another store had quoted for the same repair.  Call me Customer for Life!!!!!!!", "pics": null, "resp": {"time": 1566332421762, "text": "Hello Ellen Murphy, hank you for taking the time to leave us a five-star review.\n\nPlease do visit us again, we love having you as a customer.\n\nHave a wonderful day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109877023194202066959", "name": "Coffee with Beans", "time": 1582042328904, "rating": 5.0, "text": "This is where you go if you want your phone ACTUALLY fixed. Manager is polite and doesn't mind explaining and showing you what she's doing. Worth the nearly one hour drive. 🤗", "pics": null, "resp": {"time": 1582296656765, "text": "Hello,  thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service.\n\nHave a fantastic day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111653670766932262451", "name": "James Brown", "time": 1590431034080, "rating": 5.0, "text": "Great customer service and friendly staff, loving my vinyl she cut for my front screen", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "110299074225976583813", "name": "joe johnson", "time": 1583601234728, "rating": 5.0, "text": "Very good experience here! Not only was Cayce very knowledgeable and professional, she fixed my device QUICKLY! I would HIGHLY recommend coming here!", "pics": null, "resp": {"time": 1584033564071, "text": "Thanks for the awesome review, Joe! We work hard to meet expectations like yours, and we’re happy to read we hit the mark for you. Come back and see us soon."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108676004676638247178", "name": "Jatin D. Patel", "time": 1581701672440, "rating": 5.0, "text": "Cayce has always been professional and able to help me with my devices. Great store", "pics": null, "resp": {"time": 1582296789792, "text": "Hello,  thank you for this awesome review. We'll make sure the store and Cayce get recognition from this."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "118416198979323315364", "name": "Willis Aybar", "time": 1601991178953, "rating": 1.0, "text": "Tyler Jordan says he works here, he said he showed up to a repair, did not show up to the repair, lied to us about his performance and made us look really bad. He signed up under Ifixandrepair so this rating goes to you. Next time, please do what you say you are going to do", "pics": null, "resp": {"time": 1602032225584, "text": "Hi Willis,  thank you for bringing this situation to our notice. This is not by any means reflective of the #iFixandRepair standards of service and customer satisfaction.\nPlease email us at info@ifixandrepair.com or go to https://ifixandrepair.com/contact with your contact info and details about your case. We will do our best to fix this for you."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117006503330215302834", "name": "anne barker", "time": 1595448023831, "rating": 5.0, "text": "Great helpful. I would definitely return", "pics": null, "resp": {"time": 1600827114745, "text": "Anne, thank you for taking the time to leave us this great review. We hope to see you here again, thanks for your trust in us, and to help us spread the word!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106411570406766347755", "name": "Husain Amreeka", "time": 1579291935068, "rating": 5.0, "text": "Brought my phone in they were very quick and efficient.  Will always bring my devices to them !\n\nMarissa is great!", "pics": null, "resp": {"time": 1579628913553, "text": "Husain, thank you so much for taking the time to write this review. We will make sure Marissa get recognition from this!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "115155754527747556450", "name": "Tina Mcneill", "time": 1581101719426, "rating": 5.0, "text": "Cayce and Marissa we're awesome, they helped me get my device working and o would recommend this location to everyone", "pics": null, "resp": {"time": 1581365186968, "text": "Hello Tina, thank you for this awesome review. We'll make sure Cayce and Marissa get recognition from this."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101644720221073556753", "name": "timothy cook", "time": 1601004619925, "rating": 5.0, "text": "Thank you for taking care of my ps4, will be using guys from now on.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106434192431269539975", "name": "Annette Nguyen", "time": 1562721682573, "rating": 5.0, "text": "Very fast and professional. I came in and stated my problem, which was that my phone wasn’t responding to my touch. The employee said it was my screen and that it was $95 plus tax to get my screen replaced. She said it would take about 20 minutes. It didn’t take 15 minutes. Would recommend. 👏🏼🙌🏻", "pics": null, "resp": {"time": 1562775732619, "text": "Annette, thank you so much for taking the time to leave this great review!\n\nHere at iFixandRepair, our dedicated staff works very diligently to make sure you love our work. This provides us with great encouragement to keep doing what we do!\n\nHave an awesome day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107347653127189174168", "name": "Gary", "time": 1581961387482, "rating": 5.0, "text": "I had dropped my phone and cracked the screen, took it right in the next morning and they had it repaired and ready to go in 20 minutes, the price was very reasonable. Service technician was super nice and very informative.", "pics": null, "resp": {"time": 1582296706831, "text": "Gary, thank you for this friendly review. We hope to see you again soon! Please bring your friends and family! . Best Regards."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111436590865723533641", "name": "cody townes", "time": 1580601511213, "rating": 5.0, "text": "Cayce and John Luke were awesome and helped me get my device fixed.", "pics": null, "resp": {"time": 1580828390761, "text": "Hello Cody, thank you for this awesome review. We'll make sure the store, Cayce and John get recognition from this."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108251893876270361359", "name": "Jasmine Hightower", "time": 1561135217149, "rating": 5.0, "text": "Marissa Simmons was so helpful. She made sure my iPhone screen was on there correctly, and it didn’t take her long to do it. I will go back to her anytime I have a issue with my phone.", "pics": null, "resp": {"time": 1561222883735, "text": "Jasmine, thank you so much for taking the time to leave us a five-star review!\n\nWe'll make sure the store gets recognition from this. Please do visit us again, we love having you as a customer.\n\nCheers!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109055227442207639282", "name": "Paige Majors", "time": 1593548301150, "rating": 5.0, "text": "The staff here are professional and know what there doing. I would recommend this location. They fixed my phone in about 20 mins and it looks brand new.", "pics": null, "resp": {"time": 1572537451548, "text": "Paige, thank you so much for taking the time to write this review. We hope to keep in touch through our social media, follow us on Facebook @ifixwiregrassdothan to get the most updated info about promotions and new products!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113483186673157153298", "name": "Javid Hill", "time": 1584304056411, "rating": 5.0, "text": "Excellent, perfect, could not be better. Will be back", "pics": null, "resp": {"time": 1589316898916, "text": "Javid, we appreciate your positive feedback about us. We are always providing the best service for our customers. Thank you very much!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116165210283237373664", "name": "rick bell", "time": 1604419536021, "rating": 5.0, "text": "Great but not cheap", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114209570508787708093", "name": "Joel Watkins", "time": 1566416053808, "rating": 5.0, "text": "Cayce was fantastic.. not only did she fix my phone but made sure it was activated before I left.. would highly recommend this location", "pics": null, "resp": {"time": 1566420092379, "text": "Thank you so much for your kind words,Joel. We really appreciate you taking the time out to share your experience with us and we agree, Cayce is truly a gem to have on our team!\n\nWe count ourselves lucky for customers like you. We look forward to working with you again in the future!. Have a nice day."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103366563925326976259", "name": "mckenzie smith", "time": 1578510992052, "rating": 5.0, "text": "Cayce and John were great when I needed help with my cell phone.", "pics": null, "resp": {"time": 1578588239976, "text": "Hey, thanks for your review. We will make sure Cayce and John get recognition from this."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "118322032400217443804", "name": "Jb Jb", "time": 1560114617085, "rating": 5.0, "text": "Cayce was awesome, fast and professional. Very down to earth and explained everything she did with me. Highly recommend visiting her for all your phone repair needs.", "pics": null, "resp": {"time": 1560357611438, "text": "Jb, thank you for your review. We do appreciate your business. Have a great day."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116037380342452703490", "name": "Nick Capitanelli", "time": 1567207661934, "rating": 5.0, "text": "Was able to help me transfer my information over from a phone that no longer worked.... Great help", "pics": null, "resp": {"time": 1567261790447, "text": "Thank you for this friendly review Nick. We hope to see you again soon! Please bring your friends and family!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112850208210837430855", "name": "Sherida Bennett", "time": 1621386853966, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107990975666349411290", "name": "Scott Lancaster", "time": 1558203174331, "rating": 5.0, "text": "Just wanted to say these are by far the best staff in Florida, Georgia and Alabama! Knowledge is key to o technology and they are awesome!!!! If they cant fix it, nobody can!!!! Marissa and Cayce are the bomb!", "pics": null, "resp": {"time": 1558552808646, "text": "Thank you so much for your kind words, Scott. We really appreciate you taking the time out to share your experience with us — and we agree, Marissa & Cayce are truly a gem to have on our team! We count ourselves lucky for customers like you. We look forward to working with you again in the future!\n\nPlease follow us on Facebook @ifarwiregrass.\n\nHave a lovely day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106473975457311240371", "name": "Kayla Smith", "time": 1433277531975, "rating": 1.0, "text": "The most unprofessional manager I've ever seen or had to the deal with. She's not only rude to the customers, but she cant keep her nose out of her phone long enough to make eye contact. The numerous times I've been in there along with  my colleagues, I've never actually seen her do a repair let along do actual work. Not to mention repairs she has done she has messed up. What kind of manager doesn't know how to do her job and do it well. I refuse to walk in this store for business and will take my devices else where as long as she's working and if the Tech guy isn't there. She seems very withdrawn from her work, an lacks motivation skills! Also very hard to take someone serious working on my devices with a big piece of metal sticking out of their lip.\n\nNow as for the ACTUAL TECHS, I've had nothing but great customer service, devices done an ready when they are said to be ready. And always courteous and professional. Very helpful when it comes to explaining what's wrong with the devices. For someone who has done several reviews for several stores on their performances and what they can do to fix it to welcome more business, The manager needs to get some Professional act right, this is a Booming business all over the country not many people can handle this kind of work and all it takes is ONE person to make it to be a bad place of business.", "pics": null, "resp": {"time": 1462910907186, "text": "Hello Kayla I’m sorry to hear about your bad experience. Your disappointment is our disappointment, Kayla. You deserve to be provided with a completely efficient, professional, value-for-money experience each time you stop by, and we'd like to wholeheartedly apologize for falling short of your expectations. Please either email details to info@ifixandrepair.com or stop in and allow our manager to see if we can help you.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111387108999831210807", "name": "Bill Cassiday", "time": 1581287490292, "rating": 5.0, "text": "Great service fixed phone very quickly would use again", "pics": null, "resp": {"time": 1581365125569, "text": "Bill, thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service.\n\nHave a fantastic day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "115236890294725596106", "name": "Todd Nunno", "time": 1567766132400, "rating": 5.0, "text": "Cayce did a great job replacing my iPad Mini 4 battery and did not break the screen.  Highly recommended!", "pics": null, "resp": {"time": 1567779731651, "text": "Hello Todd. Thanks for this nice review and we will make sure Cayce get a recognition from this. Have a nice weekend!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102591406021795075669", "name": "Bridgett Glenn", "time": 1525231412567, "rating": 5.0, "text": "KJ is the BEST. I wouldn’t take my phone to anyone else. The experience was great. He made me feel like top priority and got the job done in a timely manner. I will definitely be coming back to him for all of my phone repairs from here on out!", "pics": null, "resp": {"time": 1527356410469, "text": "Bridget, thank you so much for taking the time to leave this great review!.\n\nHere at iFixandrepair, our dedicated staff works very diligently to make sure you love our work. This provides us with great encouragement to keep doing what we do!\n\nWe'll make sure the store gets recognition from this\n\nPlease do visit again, we'd love to have you as a customer.\nDon't forget to follow us on Facebook @ifarwiregrass\n\nCheers!/ Have a good day!\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109855411272548064779", "name": "Caleb Harris", "time": 1566839655665, "rating": 5.0, "text": "Marissa is very helpful . Came in with my charger not working and she fixed it fast .  Definitely will come back!", "pics": null, "resp": {"time": 1566926523300, "text": "Hello, thanks for taking the time to share your experience. We'll make sure Marissa and the store get recognition from this. Have a nice day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101494161042148628543", "name": "Jessica Miller", "time": 1550971242824, "rating": 1.0, "text": "Terrible. That about sums it up. Paid $100 to fix the screen but what’s so great about a fixed screen if the camera on neither side works, the light doesn’t work, and you can’t hear anything if someone calls? Not a thing. But to make matters worse you take it back for them to fix their mess up but wait, they tell you it’s not their fault it’s a censor and you can give them $60 more and they’ll fix it. I think not. It was working when I brought it in and when I walked out it wasn’t. So if you want more problems than you currently have then sure I’d recommend you take your electronics here.", "pics": null, "resp": {"time": 1551122815313, "text": "Hi Jessica, thank you for bringing this situation to our notice.\nThis is not by any means reflective the #iFixandrepair standards of service and customer satisfaction.\n\nPlease email us at info@ifixandrepair.com with a picture of your invoice/receipt, contact information and the details of your case.\nI'm sure once we've cleared things up, we'll win you back as a customer.\n\nHave a good day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "100935301677263746879", "name": "Elysia York", "time": 1544901128405, "rating": 5.0, "text": "Very impressed with the service I received from Casey. I walked in and told her my problem, she dove right in and had it fixed in less than 5 minutes! She was very friendly and attentive! Will definitely be back if I have any more issues!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116185836570796903084", "name": "Kelley Whitaker", "time": 1503095224909, "rating": 5.0, "text": "KJ  is by far the best employee. Literally rebuilt the inside of my phone and did a great job! I will always make sure I go back to him when I need another repair. Very patient and respectful! Also very fun to be around! Highly recommend him!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116321356136536349203", "name": "Latia Baxter", "time": 1564175704744, "rating": 5.0, "text": "John was quick and friendly and was able to get my phone up and running in under 20 mins. I would recommend this location to everyone", "pics": null, "resp": {"time": 1564250614994, "text": "Thank you, Latia! We really appreciate you taking the time to leave us such a nice review! We hope to see you again soon!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102044039066375529475", "name": "Cindi Mathis", "time": 1566930437803, "rating": 5.0, "text": "Cayce has always been able to get my phones up and going pretty quick, I would recommend this location", "pics": null, "resp": {"time": 1567261926790, "text": "Thanks for taking the time to share your experience with us. Cheers!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106565619816790664616", "name": "David Bradshaw", "time": 1540059537580, "rating": 5.0, "text": "I had my iPhone X repaired by Cassie. I am very impressed at the personal experience I had. She was very friendly and knowledgeable. It took about 20 minutes and she talked to me the whole time, super friendly. HopefuIly I won't need their services again but if I do I will definitely go back.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "100329743774068226043", "name": "Willie Stroker", "time": 1564516619548, "rating": 5.0, "text": "Professional and fast Adam and john helped me get my screen and battery fixed up and put on a temper glass on my device", "pics": null, "resp": {"time": 1564611865842, "text": "Thanks for the awesome review, Willie! We work hard to meet expectations like yours, and we’re happy to read we hit the mark for you. Come back and see us soon.\n\nHave a wonderful day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "110051868791501256998", "name": "megan cornelius", "time": 1541693641176, "rating": 5.0, "text": "These are the best people they are so nice and no just what they are talking about.  I wouldn't take my devices anywhere else!!!  Prices are very reasonable and services done swiftly!! I will definatley be back!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101278537687749690248", "name": "lycan'thrope", "time": 1547920712646, "rating": 5.0, "text": "Marissa was a tremendous help.  Was going to get my phone replaced for a couple of what i thought was hardware malfunctions, but she knew immediately what the issues were and promotly fixed them with no fuss. Great customer service from both employees, extremely freindly, and incredibly helpful! Thank you", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111834132974261146288", "name": "adrianna hollowell", "time": 1598841256371, "rating": 5.0, "text": "Cayce was professional and quick.", "pics": null, "resp": {"time": 1600826983833, "text": "Hi Adrianna, thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "115518135253126550115", "name": "Kayla Morales", "time": 1546125718393, "rating": 5.0, "text": "What a wonderful place of business! They are extremely helpful and skilled in what they do. Definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113650284528644169835", "name": "KayBae !", "time": 1562449440228, "rating": 5.0, "text": "Awesome staff.. Cayce was great on finding a solution for my problem. Would recommend", "pics": null, "resp": {"time": 1562689255365, "text": "Thanks for your comment. We do appreciate your business. Have a wonderful day."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114406944693668043415", "name": "John Ryals", "time": 1560787080629, "rating": 5.0, "text": "Just got my phone repaired.excellent service from Marissa.very knowledgeable and great at what she does.", "pics": null, "resp": {"time": 1561222912718, "text": "John, thank you very much."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "115558878464148669068", "name": "dalton skinner", "time": 1532738848947, "rating": 5.0, "text": "Eric did a great job repairing my screen. Very knowledgeable and professional. Will use him again if needed in the future!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112815880007347203972", "name": "Ginger Cofer", "time": 1565634635940, "rating": 5.0, "text": "Marissa, very helpful and informative. Great customers service and attitude.", "pics": null, "resp": {"time": 1566332363250, "text": "Hey, thank you so much for your kind words. We really appreciate you taking the time out to share your experience with u."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107832907893946834844", "name": "Tyler JN", "time": 1562440269911, "rating": 5.0, "text": "Cayce is an awesome tech and friendly... I wouod recommend thus location to anyone who needs cell repairs....", "pics": null, "resp": {"time": 1562689241505, "text": "Tyler, thank you so much for taking the time to leave this great review!\n\nHere at iFixandRepair, our dedicated staff works very diligently to make sure you love our work. This provides us with great encouragement to keep doing what we do!\n\nHave an awesome day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112545357910875042815", "name": "Carla Cainion", "time": 1530316879153, "rating": 5.0, "text": "Great customer service & the staff there are very personable. Eric, who fixed my phone, made my day !! They’re efficient and the results are awesome ! I recommend them, esp due to the fact that they are a reliable business, therefore you know the work they do is legitimate !", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103780445690543565131", "name": "Lena Sadiwskyj", "time": 1532392328544, "rating": 5.0, "text": "Eric did a great job replacing my screen.  He’s knowledgeable and personable. I’d highly recommend him for his professionalism.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105332956552100761145", "name": "Robert Gilman", "time": 1539968051026, "rating": 5.0, "text": "Josh was absolutely amazing in helping me fix my phone. It needed to be updated and I didn’t know how but you can count on them to help you out!! Thank you guys so much!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109766995625657722979", "name": "Paul Twocock", "time": 1564515858682, "rating": 5.0, "text": "Theses people know there stuff! I came in with my xr and they had it fixed and ready to go within  30 mins and it looks exactly like it did when it cmae out of the box thank you guy's for the speedy but solid repair", "pics": null, "resp": {"time": 1564611845154, "text": "Paul, thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service.\n\nHave a fantastic day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112194219756512927591", "name": "Stephen Phillips", "time": 1553711285649, "rating": 5.0, "text": "Quick friendly professional service.  I would happily recommend them and use them again .", "pics": null, "resp": {"time": 1553811418809, "text": "Stephen, thank you for taking the time to leave us a five stars review.\n\nWe hope to see you here again and please bring your friends and family.\n\nDon't forget to follow us on Facebook @ifarwiregrass.\n\nHave an awesome day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112553985574993276672", "name": "Raymond Ojeda", "time": 1490619727634, "rating": 5.0, "text": "Staff was polite and very knowledgeable. Overall a great experience and you can't beat the 10% discount for military, government, student and policemen. Would recommend to anyone.", "pics": null, "resp": {"time": 1490628835656, "text": "Thank you so much for taking the time to leave a Five Star Review, Raymond! We appreciate the opportunity to repair your device and we hope to help you again in the future. We know your time is valuable so again....Thank you!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "115326301494749893540", "name": "Erica Brackin", "time": 1475098682175, "rating": 5.0, "text": "It was great! We came in and got out in a matter of 30 minutes or less with the workers fixing my friend's cracked screen and battery to her phone. I would recommend ifix and repair to anyone. It's affordable and quick service.", "pics": null, "resp": {"time": 1475160223703, "text": "Erica, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103713807513852906227", "name": "Danny lee Chopper", "time": 1580201466622, "rating": 4.0, "text": "Great repair time and awesome customer service!", "pics": null, "resp": {"time": 1580828734520, "text": "Hello Danny,  thank you so much for taking the time to rate your experience with us! We will work even harder to get Five Stars from valuable customers like you!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108834720595857152372", "name": "Jonah Overall", "time": 1537233236052, "rating": 5.0, "text": "Cayce did a great job getting my phone working again. I would recommend this location to anyone who needs there device repaired.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105090440023511070788", "name": "Kaylee Vaughn", "time": 1509765139337, "rating": 5.0, "text": "Kj did a great job on repairing my phone! We were in a bind on getting it fixed quick and e went above and beyond to fix my phone! Highly recommend!", "pics": null, "resp": {"time": 1509811998331, "text": "Thanks for submitting your review, we appreciate so much your kind words. :)"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "115961387039342416608", "name": "Ken sikes", "time": 1513113686214, "rating": 5.0, "text": "Awesome service. I came in with a cracked screen and an hour later it was fixed and working perfectly. I highly recommend them. Ken Sikes satisfied customer", "pics": null, "resp": {"time": 1513114438810, "text": "This is great, we appreciate it so much, thanks!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "110483687542688486359", "name": "Rebekka Hataway", "time": 1530326639248, "rating": 5.0, "text": "Eric was fantastic! Great service even stayed after close to fix my problems. Great guy. I will be back and recommend him to anyone who needs repairs!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "118429521318459969709", "name": "Collista Hinton", "time": 1580599211198, "rating": 5.0, "text": "Very helpful and will definitely recommend this location to everyone", "pics": null, "resp": {"time": 1580828445014, "text": "Thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service.\n\nHave a fantastic day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111948619527215881938", "name": "Amber Richardson", "time": 1530919984189, "rating": 5.0, "text": "Eric is amazing. Hes super cool. He did a wonderful job. Hes a great employee. Give him a raise.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111098312936550162704", "name": "Karin Lainez", "time": 1549907630233, "rating": 5.0, "text": "Came in with an issue on my camera lence and Marissa was quick to get it resolved. :) super sweet. Highly recomend. :)", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107184102826937703132", "name": "Emily Watson", "time": 1568238903299, "rating": 5.0, "text": "My speaker was very quiet and not working right so I brought my phone in. Marissa and cayce took excellent care of me and were able to fix my issue! Excellent customer service!!!! Very pleased!!!", "pics": null, "resp": {"time": 1576008488391, "text": "Emily, thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service.\n\nHave a fantastic day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111373320761804306905", "name": "Big Pappa", "time": 1561679055182, "rating": 5.0, "text": "Fast and furious these people got my screen done in less than 15 mins! I still had time to eat on my break", "pics": null, "resp": {"time": 1562189049587, "text": "Thank you!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "118106903395109221936", "name": "gmomey ninja cool The goat", "time": 1511670194341, "rating": 5.0, "text": "Went here to get my cell phone repaired and they said my phone will be ready in 1 hour on a black friday and it was. Everybody was really friendly and personable and down to business. If I needed another cell phone pair I would definitely go here again.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113087579168236604264", "name": "Michael McBride", "time": 1552512004887, "rating": 5.0, "text": "Got my iPad 6th gen screen replaced here and everything was great. Great staff.", "pics": null, "resp": {"time": 1553188856350, "text": "Thanks for the awesome review, Michael! We work hard to meet expectations like yours, and we’re happy to hear we hit the mark for you. Come back and see us soon. Please follow us on Facebook @ifarwiregrass.\n\nHave a wonderful day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107875846118991935332", "name": "camron walker", "time": 1545950023757, "rating": 5.0, "text": "Amazing customer service and out in less then an hour! Very efficient store with the best customer service I’ve seen!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108648207513937750109", "name": "King Howard", "time": 1561147476092, "rating": 5.0, "text": "Marissa is a great help fast friendly and very knowledgeable!!  Thank you for saving my daughters phone with water damage!!", "pics": null, "resp": {"time": 1561222864723, "text": "King Howard, thank you for taking the time to leave us a five-star review.\n\nWe hope to see you here again and please bring your friends and family.\n\nHave an awesome day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105251156450355782070", "name": "Serencia Martin", "time": 1553187630291, "rating": 5.0, "text": "Cayce is very good at what she does and helps out a lot THANK YOU THank You", "pics": null, "resp": {"time": 1553188675361, "text": "Thank you so much for your kind words, Serencia. We really appreciate you taking the time out to share your experience with us — and we agree, Cassandra Craven is truly a gem to have on our team! We count ourselves lucky for customers like you. We look forward to working with you again in the future!\n\nPlease follow us on Facebook @ifarwiregrass.\n\nHave a lovely day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104288144591960193616", "name": "James Cloud", "time": 1551839834238, "rating": 5.0, "text": "Cayce was professional and was able to get me up running quick. I would recommend this location to everyone", "pics": null, "resp": {"time": 1553189094783, "text": "James, thank you so much for taking the time to leave us a five stars rate!\n\nPlease do visit us again, we love having you as a customer.\n\nDon't forget to follow us on Facebook @ifarwiregrass.\n\nCheers!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117373444905090563421", "name": "Josh Joseph", "time": 1546022392582, "rating": 5.0, "text": "Great service and professional, knowledgeable staff that repaired my phone with precision and timeliness!  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101438144860501624193", "name": "Nathaniel Hughes Slong", "time": 1580201997768, "rating": 5.0, "text": "Even tho i decided not to go thru with the repair the Technicians were very knowledgeable and helpful", "pics": null, "resp": {"time": 1580828708378, "text": "Nathaniel, thank you for this awesome review. We'll make sure the store get recognition from this."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117830881164606872727", "name": "shanna bedgood", "time": 1498596293547, "rating": 5.0, "text": "I had a great experience today for the first time visiting. I bought a wallet case and the employee even put my glass screen protector on. She was very sweet and patient with me. I will be going back soon.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113087579168236604264", "name": "Michael McBride", "time": 1552512004887, "rating": 5.0, "text": "Got my iPad 6th gen screen replaced here and everything was great. Great staff.", "pics": null, "resp": {"time": 1553188856350, "text": "Thanks for the awesome review, Michael! We work hard to meet expectations like yours, and we’re happy to hear we hit the mark for you. Come back and see us soon. Please follow us on Facebook @ifarwiregrass.\n\nHave a wonderful day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102491274770982106704", "name": "Chuck Barrios", "time": 1604668755219, "rating": 2.0, "text": "Poor service and rude.", "pics": null, "resp": {"time": 1604790718301, "text": "Dear Chuck, thanks for sharing your feedback. We’re sorry your experience didn’t match your expectations. It was an uncommon instance and we’ll do better. Please feel free to reach out to info@ifixandrepair.com with any further comments, concerns, or suggestions you wish to share. We would love to make things right if you give us another chance."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112916248737733529877", "name": "Laura", "time": 1524800736268, "rating": 5.0, "text": "KJ is the man! Great to deal with and great advice! Unfortunately we ended up having an Apple product defect issue, but he tried everything possible to help us, and was awesome to chat with! Highly recommend this place - and KJ!!", "pics": null, "resp": {"time": 1527355991109, "text": "Laura, thank you so much for taking the time to leave this great review!.\n\nHere at iFixandrepair, our dedicated staff works very diligently to make sure you love our work. This provides us with great encouragement to keep doing what we do!\n\nWe'll make sure the store and KJ gets recognition from this!!\n\nPlease do visit again, we'd love to have you as a customer.\nDon't forget to follow us on Facebook @ifarwiregrass\n\nHave a good day!\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113308534212589865883", "name": "Porky Junior", "time": 1519352907777, "rating": 5.0, "text": "Marissa fixed my iPhone very fast and helped me pick protection for my phone! She's awesome.", "pics": null, "resp": {"time": 1521497245019, "text": "Hey Marissa, hope all is well!\n\nThank you for taking your time and leaving this five star review. iFixandRepair appreciates your business.\n\nWe would also like to invite you to follow us on Facebook @ifarwiregrass .\n\nRemember we got really good promos and we wouldn't want you to miss out on them.\n\nCheers!\n#iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111107801675707455440", "name": "Jimmy Wilson", "time": 1459543629964, "rating": 5.0, "text": "Took my daughters phone to get fixed and I couldn't have ask for better service. Very friendly and helpful atmosphere. Would recommend this place to anyone needing work done ..", "pics": null, "resp": {"time": 1459604090389, "text": "Thank you so much for taking the time to leave a Five Star Review, Jimmy. iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102398638045712383209", "name": "Ann Hauss", "time": 1570403943200, "rating": 5.0, "text": "Great service at great prices", "pics": null, "resp": {"time": 1570469444613, "text": "Thank you so much Ann! We hope to see you again, and please bring your friends and family.\n\nCheers!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111931000503844336737", "name": "Anthony Kenward", "time": 1468090469898, "rating": 5.0, "text": "The folks must have been trained at Disney World. EXTREMELY friendly and helpful, she opened up my phone right in front of me. I think I was there all of 15 min and bought a used case for $5. Sweet", "pics": null, "resp": {"time": 1468255387257, "text": "Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108272925513507803768", "name": "David Daniels", "time": 1521400032222, "rating": 5.0, "text": "Great work highly recommend to anyone who needs repairs on their phones.. Cayce was professional and quick. Thank you", "pics": null, "resp": {"time": 1521497664176, "text": "Hey David, hope you're having a good day.\n\nWe understand how important time can be and it means so much that our customers notice the dedication we put into efficiency.\n\niFixandRepair wants to thank you for this honest review.\n\nEven though we have repaired your device, we would like to keep in touch.\n\nTo enjoy our really low prices, don't forget to follow us on Facebook @ifarwiregrass .\n\nCheers!\n#iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108711924909909665453", "name": "Buddy Haas", "time": 1481661395143, "rating": 5.0, "text": "I brought in an iPad in for a screen replacement and these guys were super helpful.  The staff was friendly and screen was replaced faster than I expected.  I'd recommend them to anyone who has a cracked screen issue.", "pics": null, "resp": {"time": 1481665211217, "text": "Buddy. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117373444905090563421", "name": "Josh Joseph", "time": 1546022392582, "rating": 5.0, "text": "Great service and professional, knowledgeable staff that repaired my phone with precision and timeliness!  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109192002299578730669", "name": "Nakia Carroll", "time": 1521250997821, "rating": 5.0, "text": "Ever grateful to KJ for all of his efforts in repairing my iPhone!!! He went above and beyond to make sure my phone worked and looked great!", "pics": null, "resp": {"time": 1521497648817, "text": "Hey Nakia, we hope all is well.\n\nThank you for taking your time and sharing your experience! Wow!! Our team here at iFixandRepair is thrilled to hear such positive  feedback about one of our employees. We'll make sure to give the store recognition from this compliment.\n\nEven though we have repaired your device, we would like to keep in touch.\n\nTo enjoy our really low prices, don't forget to follow us on Facebook @ifarwiregrass .\n\nCheers!\n#iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "115294954773693012872", "name": "James Smith", "time": 1565802823435, "rating": 5.0, "text": "The ladies were great, service outstanding thanks.", "pics": null, "resp": {"time": 1566332269295, "text": "Thank you for your comment. We love taking care of all customer's issues with their devices. Have a good day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102398638045712383209", "name": "Ann Hauss", "time": 1570403943200, "rating": 5.0, "text": "Great service at great prices", "pics": null, "resp": {"time": 1570469444613, "text": "Thank you so much Ann! We hope to see you again, and please bring your friends and family.\n\nCheers!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "100142613733427999458", "name": "Dylan Cole", "time": 1545255094827, "rating": 5.0, "text": "Cayce was great in helping me get my phone back up and running I would recommend this location to everyone.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "118378638975052347028", "name": "Mel and Steven Jacobson", "time": 1472314769476, "rating": 5.0, "text": "The iPad mini had a cracked case. The young woman who is always there told us it would be one of two prices depending how it went. Was returned to us the same day and we brought it back not working. She explained what happened and had to ship it somewhere and when it returned it still wasn't right. She explained what was now needed and had the part shipped in. She installed the part and it now seems to work again. I commend her for the diligence she displayed during our issues getting it right. She conducted herself very professionally.", "pics": null, "resp": {"time": 1472487687439, "text": "Mel and Steven Jacobson, Thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service. They're amazing technicians. I appreciate you for recognizing our team. Have a fantastic day!!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111931000503844336737", "name": "Anthony Kenward", "time": 1468090469898, "rating": 5.0, "text": "The folks must have been trained at Disney World. EXTREMELY friendly and helpful, she opened up my phone right in front of me. I think I was there all of 15 min and bought a used case for $5. Sweet", "pics": null, "resp": {"time": 1468255387257, "text": "Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112055796018033878311", "name": "Teresa Hallford", "time": 1567024140376, "rating": 5.0, "text": "Cayce and Adam were great at helping me with my problem..", "pics": null, "resp": {"time": 1567261892739, "text": "Thank you so much for this nice review. Have a good day Nathan!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108272925513507803768", "name": "David Daniels", "time": 1521400032222, "rating": 5.0, "text": "Great work highly recommend to anyone who needs repairs on their phones.. Cayce was professional and quick. Thank you", "pics": null, "resp": {"time": 1521497664176, "text": "Hey David, hope you're having a good day.\n\nWe understand how important time can be and it means so much that our customers notice the dedication we put into efficiency.\n\niFixandRepair wants to thank you for this honest review.\n\nEven though we have repaired your device, we would like to keep in touch.\n\nTo enjoy our really low prices, don't forget to follow us on Facebook @ifarwiregrass .\n\nCheers!\n#iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114841546948005321688", "name": "Demetrice Womack", "time": 1523128780632, "rating": 5.0, "text": "Cayce was great... was able to fix my phone in no time... I would recommend this location", "pics": null, "resp": {"time": 1527355788285, "text": "Hey Demetrice, hope all is well!\n\nWe understand how important time can be and it means so much that our customers notice the dedication we put into efficiency.\n\niFixandRepair wants to thank you for this honest review.\n\nEven though we have repaired your device, we would like to keep in touch.\n\nTo enjoy our really low prices, don't forget to follow us on Facebook @ifarwiregrass\n\nHave a good day!\n\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "100561183647777494559", "name": "Travis Porter", "time": 1474580498917, "rating": 1.0, "text": "Took my iPhone 6 Plus to have the screen replaced due to a very small crack. The associate working said no problem would take about 20 minutes. After 1 1/2 hours later the associate informs me he thinks he shorted out my back light and that my phone would have to be sent off for repair. I am somewhat of an understanding person until he informed me it would take weeks for me to get my phone back. I am a professional in my field of work and 100% rely on my phone to make a living. I was told sorry and that sending it off was the only option for me.. PLEASE BEWARE & DO YOUR HOMEWORK BEFORE GOING TO THESE GUYS FOR WORK. Guess I should have done my homework and read the reviews on facebook first.\n\nPlease see above and notice I said nothing about a payment! Today is now Thursday and I am still without a phone! I will also be sure to leave my review with them as well seeing my bad customer service experience has extended to your location as well as your corporate office.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112916248737733529877", "name": "Laura", "time": 1524800736268, "rating": 5.0, "text": "KJ is the man! Great to deal with and great advice! Unfortunately we ended up having an Apple product defect issue, but he tried everything possible to help us, and was awesome to chat with! Highly recommend this place - and KJ!!", "pics": null, "resp": {"time": 1527355991109, "text": "Laura, thank you so much for taking the time to leave this great review!.\n\nHere at iFixandrepair, our dedicated staff works very diligently to make sure you love our work. This provides us with great encouragement to keep doing what we do!\n\nWe'll make sure the store and KJ gets recognition from this!!\n\nPlease do visit again, we'd love to have you as a customer.\nDon't forget to follow us on Facebook @ifarwiregrass\n\nHave a good day!\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114439280144614166664", "name": "Brandy Murrah", "time": 1543177406133, "rating": 5.0, "text": "Cayce was VERY helpful and polite today and repaired my phone within minutes! I would highly recommend the mall location OVER the north side Wal-Mart location!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104981508054389548844", "name": "Meisha Becraft", "time": 1459705733505, "rating": 5.0, "text": "Great atmosphere and service was phenomenal. Especially since I live out of state. It was great to have a store to help me while visiting family...", "pics": null, "resp": {"time": 1459787828595, "text": "Thank you so much for taking the time to leave a Five Star Review, Meisha! We appreciate the opportunity to repair your device and we hope to help you again in the future.  We know your time is valuable so again....Thank you!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108929387025854600315", "name": "Ziantoni Bennett", "time": 1500153608686, "rating": 1.0, "text": "First of all people do not spend 10 minutes here. Me and my sister actually spend 1 hour waiting on our phones to get done and then the next month then a couple of weeks later the phones messed up again . They do have great customer service but I still wounder never go back to get my phone Fixed there again. They mess up people phone. Then my phone starting glitching and they didn't want to give me my free warranty to get it fixed when it was their fault. I have been there more than three times to get my phone Fixed and they always mess it up worse. I will never go back to this place anymore", "pics": null, "resp": {"time": 1500407625767, "text": "Good afternoon dear Ziantoni,\n\nWe are just pretty sure that your experience was on the Dothan Walmart Location, not on the Wiregrass which is this. We check for your invoice on our system and the address of the store was 4310 Montgomery Highway\nDothan, AL 36303-1576. So we ask you to please undo this review because it affects the scorecard of the store. We now proceed to make the necessary correctives with the store where you had the bad experience and hope that this will not happen again.\n\nWe appreciate your help. Have a nice day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111107801675707455440", "name": "Jimmy Wilson", "time": 1459543629964, "rating": 5.0, "text": "Took my daughters phone to get fixed and I couldn't have ask for better service. Very friendly and helpful atmosphere. Would recommend this place to anyone needing work done ..", "pics": null, "resp": {"time": 1459604090389, "text": "Thank you so much for taking the time to leave a Five Star Review, Jimmy. iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108832465526000710043", "name": "Johnny Harmsen", "time": 1535485574795, "rating": 5.0, "text": "Adam is knowledgeable and friendly. He looks like a hippy. You can’t miss him. Great service.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109798552951905159040", "name": "J LH", "time": 1517017533676, "rating": 5.0, "text": "KJ was very fast and very helpful with my phone on repairing it. He is amazing at what he does. I'll come back and see him again!!!!!!", "pics": null, "resp": {"time": 1518125184715, "text": "Hello, thank you for this great review and mentioning our good service!\nOur team here at iFixandRepair is thrilled to hear such positive  feedback and we’re proud to be one of the top leading tech repair franchises in USA. Did you know we have social media where you can keep track of our products, and tech tips? Here is our Facebook and Instagram page  @ifixandrepairofficial\nNext time we hear from you we hope is with a follow!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114593507339769612064", "name": "Andrew Sinsel", "time": 1496456940804, "rating": 5.0, "text": "KJ  stayed after hours to fix my phone.  Great service at a great price. He is a great guy and a great entertainer. I was not bored at all while waiting for my phone to get fixed. Thank you again KJ for fixing my phone for a great price and keeping a smile on my face. 😀😀😀", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117606641774966987736", "name": "MIRANDA WILLIAMS", "time": 1523550273928, "rating": 5.0, "text": "Cayce was awesome had my s8 plus fixed in no time. Friendly and professional.. I would recommend this location", "pics": null, "resp": {"time": 1527355810403, "text": "Hey Miranda, hope all is well!\n\nWe understand how important time can be and it means so much that our customers notice the dedication we put into efficiency.\n\niFixandRepair wants to thank you for this honest review.\n\nEven though we have repaired your device, we would like to keep in touch.\n\nTo enjoy our really low prices, don't forget to follow us on Facebook @ifarwiregrass\n\nHave a good day!\n\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112688852214970680785", "name": "C.A. Risden", "time": 1534631288287, "rating": 5.0, "text": "Great customer service, fast repair. Would definitely recommend this location.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107303867375265598836", "name": "Karachi Pakistan", "time": 1579291864779, "rating": 5.0, "text": "Shouts out to Marissa she fixed my phone very fast .  She deserves a raise !", "pics": null, "resp": {"time": 1579628969798, "text": "Thank you so much for your kind words, Karachi!. We really appreciate you taking the time out to share your experience with us — and we agree, Marissa is truly a gem to have on our team! We count ourselves lucky for customers like you. We look forward to working with you again in the future!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112394213484025072568", "name": "William Cherry", "time": 1496536083469, "rating": 5.0, "text": "Kj did a great job cleaning my charge port. phones charging great. But if I ever need one repaired, he will take care of it for me said. Thank you so much Kj", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114770082138147481796", "name": "Alexis Texas", "time": 1580202740186, "rating": 4.0, "text": "Very friendly and very quick", "pics": null, "resp": {"time": 1580828604552, "text": "Alexis, thank you so much for taking the time to rate your experience with us!\n\nHere at iFixandRepair, our dedicated staff works very diligently to make sure you love our work. This provides us with great encouragement to keep doing what we do and hoping next time to get a Five Stars valuation!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112167453548459828564", "name": "Duncan Mills", "time": 1546119162640, "rating": 1.0, "text": "I’m calling you out IFixandRepair - Wiregrass Commons Mall (NOT the Dothan Walmart Location). In particular, the manager at this location.\n\nI work for a phone carrier in the same mall and I had a customer approach my stand, asking if the “Apple Airpods” you just sold her were really a legit Apple product. From a few feet away, they looked legit, but upon further inspection, they were definitely a counterfeit. I sell plenty of Apple products out of my store on a daily basis and have for 5+ years. I can tell just by the fit/finish, packaging, font, etc that these are definitely not a real Apple product, or even a refurbished unit.\n\nFrom what your customer told me, you reassured her that they were a legitimate product, and refused to offer her a refund, only store credit until she threatened to get mall management and the police involved.\n\nShame on you for preying on elderly and unknowing customers trying to get Christmas gifts for their families. She told me she spent the last $90 of her fixed income to get these for her daughter as a late Christmas gift.\n\nYou are selling items under false pretenses and not disclosing the authenticity of the products. Makes me wonder how many other people you have ripped off with this same scam. This is some shady business practices and unfortunately it can tarnish the customer’s trust in cellular/mobile vendors and repair companies alike.\n\nPictured is the “Apple AirPods” you sold her and the last picture is a stock image of the legitimate product from Google from a trusted device review source.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111128913983183916802", "name": "Rylee Thomas", "time": 1511566605507, "rating": 5.0, "text": "Kj is awesome he fixed my phone. Also, I love my case. Thank you!", "pics": null, "resp": {"time": 1511809629838, "text": "We appreciate it so much, thanks!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "110572291584965648220", "name": "Greg Gibson", "time": 1529109779887, "rating": 5.0, "text": "Awesome experience. Marrissa was great. I recommend iFix to anyone!", "pics": null, "resp": {"time": 1530049134193, "text": "Greg, thank you for mentioning our efficiency! It means a lot to us to read this kind of messages. Wishing you a great week! #iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105382943882293726702", "name": "Nice Guy", "time": 1561678747102, "rating": 5.0, "text": "Helpful staff and great prices", "pics": null, "resp": {"time": 1562189051383, "text": "Thank you very much."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101982922957225941192", "name": "michael parish", "time": 1603484554547, "rating": 5.0, "text": "Casey is the best!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116680790705951689438", "name": "Sam Gilligan", "time": 1528906383306, "rating": 5.0, "text": "Best service in Dothan 100% will recomend and this is for the second time the service is always good and they always get the job done", "pics": null, "resp": {"time": 1527356607514, "text": "Thank you for taking the time to leave us a five stars  review!\n\nWe hope to see you here again, thanks for your trust in us, and for help us to spread the word!\nPlease don't forget to follow us on Facebook @ifarwiregrass\n\nHave a good day!\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "115474384178582105441", "name": "Jaren King", "time": 1499129244590, "rating": 5.0, "text": "KJ is a major genius at fixing phones. He did my battery with no problems. Very fast service. Thank you KJ so much", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102876937706326423796", "name": "Modesta Epote", "time": 1444693539641, "rating": 1.0, "text": "Don't waste your time going there. Worst experience ever! bad customer service. They don't tell you all the perks before fixing your phone until after the (supposed) fix. they messed up my camera and voice box and said there is no guarantee with electronic devices. AS IF. They just do not know their job. They don't do refunds they said. Better off buying a new phone with that wasted money.", "pics": null, "resp": {"time": 1462910850464, "text": "Hello Modesta I’m sorry to hear about your bad experience. Your disappointment is our disappointment, Modesta. You deserve to be provided with a completely efficient, professional, value-for-money experience each time you stop by, and we'd like to wholeheartedly apologize for falling short of your expectations. Please either email details to info@ifixandrepair.com or stop in and allow our manager to see if we can help you.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "110073317358517481690", "name": "Jessica Jones", "time": 1460040354283, "rating": 5.0, "text": "Quick and professional service. Super friendly and knowledgeable. I'll definitely be back 😁", "pics": null, "resp": {"time": 1460054576639, "text": "Thank you so much for taking the time to leave a Five Star Review, Jessica. iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112189831491211376961", "name": "McKinsey Sherrill", "time": 1530040913481, "rating": 5.0, "text": "Cayce was friendly and was able to get my phone repaired. I would recommend this location to everyone", "pics": null, "resp": {"time": 1530049230183, "text": "McKinsey, thank you for mentioning our efficiency! It means a lot to us to read this kind of messages. Wishing you a great week! #iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "110637628956574297181", "name": "Lilla Woodham", "time": 1552511092338, "rating": 5.0, "text": "Great staff and I would recommend this location", "pics": null, "resp": {"time": 1553188895012, "text": "Jamie, thank you so much for taking the time to write this review. We hope to keep in touch through our social media, follow us on Facebook @ifarwiregrass to get the most updated info about promotions and new products!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "110238276009432408055", "name": "Lisa Dockery", "time": 1525133652284, "rating": 5.0, "text": "Kj was awesome! I will use this service again. Great job. I would recommend KJ to anyone", "pics": null, "resp": {"time": 1527356156731, "text": "Lisa, thank you so much for taking the time to leave this great review!.\n\nHere at iFixandrepair, our dedicated staff works very diligently to make sure you love our work. This provides us with great encouragement to keep doing what we do!\n\nWe'll make sure the store and KJ gets recognition from this!!\n\nPlease do visit again, we'd love to have you as a customer.\nDon't forget to follow us on Facebook @ifarwiregrass\n\nHave a good day!\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111325638306805480816", "name": "S. M.", "time": 1543282559415, "rating": 5.0, "text": "They are an amzing help. I greatly appreciate them", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "100107662744952381860", "name": "Jessica Davis", "time": 1532460686149, "rating": 5.0, "text": "Cayce and Adam are awesome at what they do. I recommend this location", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106318465813105299793", "name": "David Sherrill", "time": 1530033021484, "rating": 5.0, "text": "Cayce should be a brain surgeon, lol! Fixed my phone soooo fast and efficiently, and for such a reasonable price!! Thanks again so much, just awesome!!", "pics": null, "resp": {"time": 1530049218436, "text": "David, thank you for mentioning our efficiency! It means a lot to us to read this kind of messages. Wishing you a great week! #iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117504293279026706660", "name": "Lucious Bentley", "time": 1501716594095, "rating": 5.0, "text": "KJ.... it's a great dude. Real fast and efficient guy. Super knowledgeable!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116535691857726547976", "name": "Chris Guy", "time": 1489624231632, "rating": 5.0, "text": "KJ stayed extra to fix my iPhone6 that I need for work.  He and Adam kept me engaged as I waited and excused themselves to care for other guests.  I am impressed!!! That's a level of customer service that got me talking.  KJ displayed a quality that's hard to teach.\n\nThanks Again,\nChris Guy", "pics": null, "resp": {"time": 1489700651163, "text": "Chris, Thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service. They're amazing technicians. I appreciate you for recognizing our team. Have a fantastic day!!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101024566236027393702", "name": "k bye", "time": 1498955181694, "rating": 5.0, "text": "KJ is very cool and did a great job and looking at my phone. He is the best technician I've ever dealt with in my entire life. Very friendly and educate as well. Thank you KJ and I fix!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109174522796719860938", "name": "Elliott Jones", "time": 1515195367336, "rating": 5.0, "text": "Super friendly people. KJ and Marissa hooked me up with a great repair.", "pics": null, "resp": {"time": 1518124952830, "text": "Elliot, thank you for this great review and mentioning our great service!\nHere at iFixandRepair we are thrilled to hear good comments like this.\nDid you know we have social media where you can keep track of our products, and tech tips? Here is our Facebook and Instagram page  @ifixandrepairofficial\nMake sure you give us a follow and tell your friends about it!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "110466213840555894411", "name": "Jan Barron", "time": 1485210530899, "rating": 5.0, "text": "My husband's phone would no longer charge and my iPad screen was cracked. We went in Sunday and they were both fixed in short order. Cassandra was extremely nice and knowledgeable. She was patient not only with us but with customers and phone calls that came in as she was tediously working. Very glad iFix was recommended to us!", "pics": null, "resp": {"time": 1485274289519, "text": "Jan, Thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service. They're amazing technicians. I appreciate you for recognizing our team. Have a fantastic day!!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "115122193664507372292", "name": "Rodney Hamilton", "time": 1494896218915, "rating": 5.0, "text": "Kj is the coolest!!! Didn't take him long to fix my phone. Love his service!!! Will be back to see him again if I need him.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108764052107699289063", "name": "Lyndsey McMillan", "time": 1512272552771, "rating": 5.0, "text": "KJ great guy. Should totally give him a raise!! Such a great helper and the service was great.", "pics": null, "resp": {"time": 1512399845993, "text": "We appreciate it so much, thanks! This is Awesome."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104192884935980095747", "name": "P. Dianne Hampton", "time": 1485008378718, "rating": 5.0, "text": "Very, very knowledgeable, extremely helpful and pleasant.  Had my iPhone  repaired in short order. I would recommend iFixandRepair without hesitation.", "pics": null, "resp": {"time": 1485016850270, "text": "P. Dianne, Thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service. They're amazing technicians. I appreciate you for recognizing our team. Have a fantastic day!!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117927559358735971741", "name": "Mary Collins", "time": 1545510295988, "rating": 5.0, "text": "Cayce and Adam did a great job repairing my daughters iPhone 7+ and was done before we could even finish lunch. A+++", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "115179780295989411811", "name": "Amber Beck", "time": 1504397854231, "rating": 5.0, "text": "Cayce is awesome when it comes to screen repairs. Did have a couple of issues with my screen but every time I've gone in she has made it right and save me tons of money.", "pics": null, "resp": {"time": 1504543294549, "text": "Thanks Amber, we are glad you had the best experience in our store. Have a nice day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113022338070494113573", "name": "Steven Jones", "time": 1530042500300, "rating": 5.0, "text": "Cayce and Marissa are awesome at what they do. I would recommend this location to everyone.", "pics": null, "resp": {"time": 1530049241211, "text": "Steven, thank you for mentioning our efficiency! It means a lot to us to read this kind of messages. Wishing you a great week! #iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109824171155446526663", "name": "Robert Wenner", "time": 1525907364268, "rating": 5.0, "text": "Fast, friendly, and the price was affordable compared to other screen repair places I've used", "pics": null, "resp": {"time": 1527356570787, "text": "Hey Robert, hope all is well!\n\nWe understand how important time can be and it means so much that our customers notice the dedication we put into efficiency.\n\niFixandRepair wants to thank you for this honest review.\n\nEven though we have repaired your device, we would like to keep in touch.\n\nTo enjoy our really low prices, don't forget to follow us on Facebook @ifarwiregrass\n\nHave a good day!\n\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116293484011047641630", "name": "Marcus Jackson", "time": 1531756069055, "rating": 5.0, "text": "Amazing and fast before u get rid of phone bring it to I fix it for repairs", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108759007921628656162", "name": "Mark Motes", "time": 1530891543656, "rating": 5.0, "text": "Awesome experience, broke my screen on my phone, drove to Dothan store, walked in and Cayce had me fixed up and back in business in 30 minutes. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117858784116051531231", "name": "Sudena Finney", "time": 1560112553342, "rating": 5.0, "text": "Best Cellphone  Etc. Repair In Dothan Alabama ✅", "pics": null, "resp": {"time": 1560357578525, "text": "Sudena, thank you so much for your review. Have a nice day."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107018804196172895045", "name": "Robert Floyd", "time": 1539620640847, "rating": 5.0, "text": "She has been the best representative I have ever seen at I fix", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102001577408477694907", "name": "D. Miree", "time": 1546029350617, "rating": 5.0, "text": "They were really friendly and helpful. I will return for my needs.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113298783263858972231", "name": "Suzanne Suckow", "time": 1459455925434, "rating": 1.0, "text": "Worst customer service experience to date.   My son dropped his phone off for a simple screen repair.   When we pickec up the phone 10 days later the home button didn't work.   Returned the phone the same day.  We were told that with in a week we should have it back.   A month later the phone that their techs broke still wasn't repaired.   After numerous phone calls the \" manager\" offered to refund the cost of the screen.   No compensation for destroying my sons phone.   Wouldn't allow us to leave with the phone until she could have someone remove the parts she had replaced ( which her techs broke).   This place is a joke.", "pics": null, "resp": {"time": 1459542394395, "text": "Hello Suzanne  I’m sorry to hear about your bad experience. Your disappointment is our disappointment, Suzanne. You deserve to be provided with a completely efficient, professional, value-for-money experience each time you stop by, and we'd like to wholeheartedly apologize for falling short of your expectations.\n\nPlease either email details to info@ifixandrepair.com or stop in and allow our manager to see if we can help you.\n\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117867081817052419794", "name": "candy w", "time": 1493774293873, "rating": 5.0, "text": "KJ is so amazing. My God, the customer service is so miraculous. Thank you so much KJ and thank you I fix. Never lose this man. He is amazing.", "pics": null, "resp": {"time": 1493827648966, "text": "Candy, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109921607000145190082", "name": "Bobby Norris", "time": 1547920662397, "rating": 5.0, "text": "Marissa and Cayse are awesome!!! Great customer service and very knowledgeable!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116086199663214466089", "name": "ted folsom", "time": 1498075300787, "rating": 5.0, "text": "Excellent job, Cayce went above and beyond to help me with my phone. I would recommend this location for your phone needs.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105605224755254688072", "name": "Al Lane", "time": 1531183878503, "rating": 5.0, "text": "I had my iPhone screen replaced at ifixit in Wiregrass Commons and Erick done a excellent job. Thanks", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106965495342201677496", "name": "Candice Austin", "time": 1517014237417, "rating": 5.0, "text": "kJ is an amazing guy wow he helped me a lot and fast I’m definitely coming back!!!!", "pics": null, "resp": {"time": 1518125164220, "text": "Candice, thank you for this great review and mentioning Kj's good work!\nHere at iFixandRepair we are thrilled to hear good comments like this.\nDid you know we have social media where you can keep track of our products, and tech tips? Here is our Facebook and Instagram page  @ifixandrepairofficial\nMake sure you give us a follow and tell your friends about it!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "115304382361786711237", "name": "Daniel Strickland", "time": 1530829752783, "rating": 5.0, "text": "This is the second time I have used this store. The staff were absolutely Amazing and had my device fixed and ready to go in approx 30 mins.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107386863101497493121", "name": "Hayden Bush", "time": 1502751278878, "rating": 5.0, "text": "KJ thank u for taking the time to clean my charge port. Phone works perfect now. KJ did a great job!! A++++ 100%", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107923934746021512142", "name": "Randy", "time": 1494291779635, "rating": 5.0, "text": "Took my daughters iPhone6 for glass replacement. KJ went above and beyond troubleshooting to a failed touch IC board. He also pointed out that the phone was bent and the issues that might be present going forward. Unfortunately; the phone has seen better days. Opting to go with a new phone for immediate needs. Top notch service!!", "pics": null, "resp": {"time": 1494341492682, "text": "Randy. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "115940727496404507566", "name": "Jessi-Alex Brandon", "time": 1515030383248, "rating": 5.0, "text": "Fast service and the people there are very friendly and helpful! Repairs are also at a very reasonable and affordable price!", "pics": null, "resp": {"time": 1515179893688, "text": "Jessi, thank you for this great review and mentioning not only our great service but also commenting on our amazing prices!\nHere at iFixandRepair we are thrilled to hear good comments like this.\nDid you know we have social media where you can keep track of our products, and tech tips? Here is our Facebook and Instagram page  @ifixandrepairofficial\nMake sure you give us a follow and tell your friends about it!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111795015550874180102", "name": "Quinton Craven", "time": 1598372508178, "rating": 5.0, "text": "Helpful, friendly..", "pics": null, "resp": {"time": 1598405305233, "text": "Hi Quinton, Thank you! We really appreciate you taking the time to leave us such a nice review! We hope to see you again soon!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112166815201831319982", "name": "Brandy Padgett", "time": 1459631865020, "rating": 5.0, "text": "Friendly staff with lots of knowledge, skills and experience to fix my device. My service provider couldn't get the job done. IFixandRepair did an amazing job!", "pics": null, "resp": {"time": 1459787639626, "text": "Thank you so much for taking the time to leave a Five Star Review, Brandy! We appreciate the opportunity to repair your device and we hope to help you again in the future.  We know your time is valuable so again....Thank you!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106097972219085929188", "name": "Tim Saulsberry", "time": 1539620704624, "rating": 5.0, "text": "Cayce was pretty great and helpful. She got us up and running in no time...", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114731111671293338915", "name": "Bobby Smith", "time": 1504896096751, "rating": 5.0, "text": "Kj  gave excellent advice and rapid service in the store today. I'm happy to refer to my family and friends.", "pics": null, "resp": {"time": 1504901386295, "text": "We are glad you had the best experience with us. Have an excellent day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109986492019303147624", "name": "Mohammed Alsultan", "time": 1510879421611, "rating": 5.0, "text": "KJ is awesome he's super friendly and so smart maaan he's knowledge is extraordinary trust me if you have any tech issues he's the one 🙏", "pics": null, "resp": {"time": 1510929927576, "text": "Good morning Mohammed, we appreciate it so much! Thanks for submitting your valuable review."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103712662195132834074", "name": "Jeremiah Davenport", "time": 1530144568243, "rating": 5.0, "text": "Marissa and Eric helped me tremendously with my Samsung phones! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "110322150992014709322", "name": "Megan Stevenson", "time": 1463153226942, "rating": 5.0, "text": "Cayce is definitely an A+ when it comes to customer service. Will definitely be contacting her if I need to. Highly recommended!!!", "pics": null, "resp": {"time": 1463168862718, "text": "Megan, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future. iFixandRepair - Wiregrass Common Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104588518011181742105", "name": "keshoundra white", "time": 1520642719975, "rating": 5.0, "text": "KJ did an amazing serving me and my family member I really appreciate it. Thanks", "pics": null, "resp": {"time": 1521497391015, "text": "Hey Keshoundra, we hope all is well.\n\nThank you for taking your time and sharing your experience! Wow!! Our team here at iFixandRepair is thrilled to hear such positive  feedback about one of our employees. We'll make sure to give the store recognition from this compliment.\n\nEven though we have repaired your device, we would like to keep in touch.\n\nTo enjoy our really low prices, don't forget to follow us on Facebook @ifarwiregrass .\n\nCheers!\n#iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116314489872639715624", "name": "Sarah Wasdin", "time": 1510954159507, "rating": 5.0, "text": "Very nice polite, knowledgeable. Would recommend to everyone", "pics": null, "resp": {"time": 1510954972187, "text": "We appreciate it so much, thanks!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105918325121078100603", "name": "La'Keyvia Siler", "time": 1512524809553, "rating": 5.0, "text": "Kj is a great service employee. I love IFix. They have a positive attitude and they can fix ANYTHING!! IFix is the BEST!!", "pics": null, "resp": {"time": 1512569010934, "text": "We appreciate it so much, thanks for submitting your awesome review!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109292285577784641556", "name": "Mary Hunter", "time": 1524794543470, "rating": 5.0, "text": "KJ awesome customer service. He helped us out a lot and was very patient. Thank you KJ.", "pics": null, "resp": {"time": 1527355953700, "text": "Mary, thank you so much for taking the time to leave this great review!.\n\nHere at iFixandrepair, our dedicated staff works very diligently to make sure you love our work. This provides us with great encouragement to keep doing what we do!\n\nWe'll make sure the store and KJ gets recognition from this!!\n\nPlease do visit again, we'd love to have you as a customer.\nDon't forget to follow us on Facebook @ifarwiregrass.\n\nHave a good day!\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "118295280057331722388", "name": "Logan B. Fairbanks Logan", "time": 1499301978387, "rating": 5.0, "text": "KJ was very friendly and did a great job my phone. Incredible service. Thank you KJ", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113833511906162631176", "name": "William Mcewen", "time": 1499124006101, "rating": 5.0, "text": "KJ was very awesome with his service and patient. Thanks for the battery repair kit. You are gifted!!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109582214343778436339", "name": "blauren98", "time": 1483649267529, "rating": 5.0, "text": "Kj was very helpful and informative! Did a great job fixing my screen. 10/10 job", "pics": null, "resp": {"time": 1483720609802, "text": "Blauren, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107749254886417425988", "name": "111", "time": 1530575532617, "rating": 5.0, "text": "Eric was loads of help! i highly recommend him and the store to anyone that needs help with their phones!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111437261336774132865", "name": "Dino Tampary", "time": 1518922281116, "rating": 5.0, "text": "My fiancé and I got to the mall 30 mins before the store closed and KJ promptly looked at her phone that was having screen issues. He was awesome and did not act rushed at all on a Saturday night. We can’t say enough great things about him and his store!", "pics": null, "resp": {"time": 1521497197032, "text": "Hey Dino, we hope all is well.\n\nThank you for taking your time and sharing your experience! Wow!! Our team here at iFixandRepair is thrilled to hear such positive  feedback about one of our employees. We'll make sure to give the store recognition from this compliment.\n\nEven though we have repaired your device, we would like to keep in touch.\n\nTo enjoy our really low prices, don't forget to follow us on Facebook @ifarwiregrass .\n\nCheers!\n#iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109102052529885154424", "name": "Melissa Sanera", "time": 1504392376778, "rating": 5.0, "text": "Cayce was awesome!! Had my cracked screen repaired in less than 15 minutes. Highly, highly recommend her and iFix!", "pics": null, "resp": {"time": 1504544597656, "text": "We are very happy you had an awesome experience at our store. Please come again soon."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114928585182953382273", "name": "Charles Lewis", "time": 1468356616603, "rating": 5.0, "text": "Busted my LCD on my S3 again,  and once again iFixandRepair (Cayce) inDothan provided quick and efficient service!  Thanks gal! Much appreciated! If you're having problems with your phone and such,  this is the place to go!", "pics": null, "resp": {"time": 1468435917264, "text": "Thank you so much for taking the time to leave a Five Star Review, Charles! We appreciate the opportunity to repair your device and we hope to help you again in the future. We know your time is valuable so again....Thank you!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116964448796065762418", "name": "Hudson G", "time": 1537319019886, "rating": 5.0, "text": "Great help from Josh and Adam. Got exactly what I needed", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109708408747928965700", "name": "jaquell russaw", "time": 1488597076907, "rating": 5.0, "text": "Kj, no words can express the amazing services that this man has given us. We surely do appreciate it. Thank you again KJ. You are the best!!!!!!!", "pics": null, "resp": {"time": 1488812845187, "text": "Jaquell, Thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service. They're amazing technicians. I appreciate you for recognizing our team. Have a fantastic day!!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111822714422865644482", "name": "Alison Mitchell", "time": 1505671480578, "rating": 5.0, "text": "Excellent customer service... Cayce was a great tech and I would recommend this location", "pics": null, "resp": {"time": 1505748513013, "text": "We're glad you had the best experience on our store. thanks!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104346694796441043098", "name": "Ilene Bloxsom", "time": 1438741170170, "rating": 1.0, "text": "This place has the worse customer service. The manager is rude and overly impressed with herself and has no definition of customer service. I DO NOT recommend this place. I took my ipad 3 to get the charger fixed and when I call they each have a different story when the part is coming in...... This is 2015 it does not take 3 weeks to get a part from Apple, Amazon etc. Take your expensive tech to Wiregrass Technologies. This place is ridiculous.", "pics": null, "resp": {"time": 1462910888471, "text": "Hello Ilene I’m sorry to hear about your bad experience. Your disappointment is our disappointment, Ilena. You deserve to be provided with a completely efficient, professional, value-for-money experience each time you stop by, and we'd like to wholeheartedly apologize for falling short of your expectations. Please either email details to info@ifixandrepair.com or stop in and allow our manager to see if we can help you.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104875742813352194278", "name": "Courtney Smith", "time": 1556134300815, "rating": 5.0, "text": "Marissa & Cayce are very nice and knowledgeable.", "pics": null, "resp": {"time": 1558552830189, "text": "Thanks for the awesome review, Courtney! We work hard to meet expectations like yours, and we’re happy to read we hit the mark for you. Come back and see us soon. Please follow us on Facebook @ifarwiregrass.\n\nHave a wonderful day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103090428026161401577", "name": "Rebecca Canfield", "time": 1481591004264, "rating": 5.0, "text": "Very helpful and friendly. Would definitely recommend for anyone that needs help with questions or repairs on their phones.", "pics": null, "resp": {"time": 1481639985058, "text": "Thank you so much for taking the time to leave a Five Star Review, Rebecca! We appreciate the opportunity to repair your device and we hope to help you again in the future. We know your time is valuable so again....Thank you! iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104788102096182216401", "name": "Tony Smith", "time": 1488669050611, "rating": 5.0, "text": "Kj is the master of fixing phones and taking care of his customers. Definitely go see him at ifix. He is awesome!!!!!", "pics": null, "resp": {"time": 1488812862100, "text": "Tony. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109303798411533926898", "name": "Stephanie Schisler", "time": 1495317958353, "rating": 5.0, "text": "KJ Took the time to check my Dell touchscreen. Great customer service. Turns out I have to buy another one. Thank you KJ!!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103220445827135384190", "name": "Kevin Brown", "time": 1500166845208, "rating": 5.0, "text": "KJ is the bomb. Such a hard worker when taking care of his customers and their devices. Thank you again KJ for helping us out we really appreciate it. Hope to see you again soon. Go KJ!!!!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103356060776516959605", "name": "Joe Maxwell", "time": 1460577558906, "rating": 5.0, "text": "Took my iPhone 6 in to have the screen repaired. I was expecting them to have to order the part however they had it in stock and fixed my screen and I had my phone back to me in 20 minutes. Great service would highly recommend !", "pics": null, "resp": {"time": 1460662421671, "text": "Joe Maxwell, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future. iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101275398240951764830", "name": "Sandy Kiger", "time": 1465315576240, "rating": 5.0, "text": "IFix and repair is a great place to take care of all your phone problems.  They are very reasonably priced,  cheaper than replacing it.  They fix anything from cosmetic repairs to internal malfunctions.  I would recommend them to all my friends and family.", "pics": null, "resp": {"time": 1465398473763, "text": "Thank you so much for taking the time to leave a Five Star Review, Sandy! We appreciate the opportunity to repair your device and we hope to help you again in the future. We know your time is valuable so again....Thank you!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114640349275606075001", "name": "Daveion Thomas", "time": 1511732498366, "rating": 5.0, "text": "OOOOMG This was the BEST service Ever I highly recommend going here if your phone is messed up! They made sure I was taken care of! Honestly the best in Dothan! 🔥🔥🔥🔥", "pics": null, "resp": {"time": 1511802451484, "text": "That's excellent we love to hear that. Please visit us anytime soon!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104044553346788321118", "name": "Lauren Laney", "time": 1523048695643, "rating": 5.0, "text": "Marissa and cayce helped me so much! Got a case and screen protector for a low price, very helpful .", "pics": null, "resp": {"time": 1527355769892, "text": "Hey Lauren, hope all is well!\n\nWe understand how important time can be and it means so much that our customers notice the dedication we put into efficiency.\n\niFixandRepair wants to thank you for this honest review.\n\nEven though we have repaired your device, we would like to keep in touch.\n\nTo enjoy our really low prices, don't forget to follow us on Facebook @ifarwiregrass\n\nHave a good day!\n\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105268495797409135358", "name": "Edris Allen", "time": 1498513292829, "rating": 5.0, "text": "Cayce was great and went above and beyond I would recommend this store to everyone", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117696796865307965189", "name": "Delaney Davenport", "time": 1502913454605, "rating": 5.0, "text": "AMAZING WORK with super amazing and friendly staff. 110% recommend!", "pics": null, "resp": {"time": 1502915243409, "text": "We are so happy you like our job. Thanks for the positive review."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114214221933204142447", "name": "Floyd Boi", "time": 1495752888735, "rating": 5.0, "text": "KJ is the man. He help me out so much my charge for it. Thank you so much Kj", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "115639473201888006791", "name": "Mason Monday", "time": 1546200900290, "rating": 5.0, "text": "Got it done in a short amount of time.  Looks great", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103090428026161401577", "name": "Rebecca Canfield", "time": 1481591004264, "rating": 5.0, "text": "Very helpful and friendly. Would definitely recommend for anyone that needs help with questions or repairs on their phones.", "pics": null, "resp": {"time": 1481639985058, "text": "Thank you so much for taking the time to leave a Five Star Review, Rebecca! We appreciate the opportunity to repair your device and we hope to help you again in the future. We know your time is valuable so again....Thank you! iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116953204813782245825", "name": "Francisco Vega", "time": 1459550686986, "rating": 5.0, "text": "Total fix that was smooth as pudding hats off to the staff up there ...it's all Greek to me and they shot straight and to the point a breath of fresh air to know how well they know and understand the customer thank you Ms Cayce and your Crew", "pics": null, "resp": {"time": 1459604110340, "text": "Thank you so much for taking the time to leave a Five Star Review, Francisco. iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109129900234270039291", "name": "Markesha Warren", "time": 1513041886316, "rating": 5.0, "text": "KJ did an excellent job on repairing my iPhone 7plus ...", "pics": null, "resp": {"time": 1513091195652, "text": "Awesome, we really appreciate it so much, thanks!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114214221933204142447", "name": "Floyd Boi", "time": 1495752888735, "rating": 5.0, "text": "KJ is the man. He help me out so much my charge for it. Thank you so much Kj", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114315239774495485054", "name": "Anne Phillips", "time": 1488234644371, "rating": 5.0, "text": "KJ help me put on my case and tempered glass. awesome experience. Thank you KJ. Him and Adam have great hair!!!!!", "pics": null, "resp": {"time": 1488296245614, "text": "Thank you so much for taking the time to leave a Five Star Review, Anne! We appreciate the opportunity to repair your device and we hope to help you again in the future. We know your time is valuable so again....Thank you!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105969057495158726237", "name": "Alan Hathaway", "time": 1495831615032, "rating": 5.0, "text": "KJ  did great service would recommend to anyone who need phone repairs .", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111795015550874180102", "name": "Quinton Craven", "time": 1598372508178, "rating": 5.0, "text": "Helpful, friendly..", "pics": null, "resp": {"time": 1598405305233, "text": "Hi Quinton, Thank you! We really appreciate you taking the time to leave us such a nice review! We hope to see you again soon!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "100556601901943859098", "name": "Jonah Chitty", "time": 1462133240877, "rating": 5.0, "text": "Extremely fast service! My iPad was fixed within 1 hour and is working perfectly! Thank you", "pics": null, "resp": {"time": 1462215114994, "text": "Thank you so much for taking the time to leave a Five Star Review, Jonah.  We appreciate the opportunity to repair your iPad and look forward to helping you again in the future.  Thank you!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "115639473201888006791", "name": "Mason Monday", "time": 1546200900290, "rating": 5.0, "text": "Got it done in a short amount of time.  Looks great", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116256076801525615957", "name": "tony kopkie", "time": 1463151715162, "rating": 5.0, "text": "My experience with cayce was great!  She was very helpful. The next time I have a problem she's my girl!!", "pics": null, "resp": {"time": 1463168785592, "text": "Tony, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future. iFixandRepair - Wiregrass Common Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116708376431823895136", "name": "Johanna Mount", "time": 1499994210445, "rating": 5.0, "text": "Cayce was fantastic. She was patient and made sure we got the case we needed \"lifeproof\" and fixed my Siri mic. I would recommend this location to everyone", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112391938996340261349", "name": "Kristy Williamson", "time": 1492548697298, "rating": 5.0, "text": "Kj is very patient working on phones and he did a great job fixing my iPhone 7 Plus thank you so much for getting it flawless!!!!!!", "pics": null, "resp": {"time": 1492614778135, "text": "Kristy. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105969057495158726237", "name": "Alan Hathaway", "time": 1495831615032, "rating": 5.0, "text": "KJ  did great service would recommend to anyone who need phone repairs .", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109129900234270039291", "name": "Markesha Warren", "time": 1513041886316, "rating": 5.0, "text": "KJ did an excellent job on repairing my iPhone 7plus ...", "pics": null, "resp": {"time": 1513091195652, "text": "Awesome, we really appreciate it so much, thanks!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111307849538915502016", "name": "Andrea Toland", "time": 1559938724825, "rating": 1.0, "text": "They want 90 to 100 bucks to fix a screen. That is a new phone or two depending on what phone you have. Price gouging at its finest.", "pics": null, "resp": {"time": 1560357648458, "text": "Andrea, thank you for taking the time to give us a review.\n\nWe take our customer's feedback very seriously and we will really appreciate that you let us know the reason for your disappointment. We want to improve every day! So, Please email us at info@ifixandrepair.com.\n\nI'm sure once we've cleared things up, we'll win you back as a customer."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107214325300060395487", "name": "Ryan Cunningham (rjcfilms)", "time": 1459642178914, "rating": 1.0, "text": "Had a broken tablet took it to I fix in the mall and they said they would order the part and it would be a same day repair when it came in. A week or so passed and they called and said the part was in. I took my tablet in for repair they said they may not get to it that day because they were busy... understandable. Well I came back late the next day and they said they still haven't got to it and they would leave a note to do it first thing the next day. Well the next afternoon I called and they still didn't have it ready. So a few more days passed and they called and said they had broken the screen and had to order a whole new screen. Told us we had to wait for the tech to get paid because he had to pay for the new replacement parts. It took more than 1 month to get the new parts and for them to finally call us and say it's ready. We get to the store and ask to pick up the tablet and it is in horrible condition the back panel wasn't even put back on properly and had spots where it was raised up enough I could see the internals on the tablet. We refused to take it that time because it was not repaired. We also learned the the money we origanally paid them to fix it was refunded to the tech who had broken the tablet. The employee/tech refused to try to repair the tablet saying \"I'm not going to try to press that together and break that tablet.\" She was referring the the back panel I mentioned was raised up in places. We told her to contact the manager and she pulled out her cell phone called the manager and said \"These people are refusing to take the tablet and I'm so mad I'm about to just walk out\" the manager told her to tell us she would take a look at it tomorrow. A few days passed they called again and said it was ready so we went to get it and it was better condition but still it is very scuffed up on the trim all the way around the screen and the back is still slightly raised up in a few places. We took it anyway out of pure frustration with the employees and the manager. This place is a joke DO NOT take anything here to be fixed or you will regret it. This is the first time I've ever written a review but this place was so bad I felt like I needed to put it out there that this place is not a professional establishment and they treat their customers like garbage after you hand them your money.", "pics": null, "resp": {"time": 1459787711858, "text": "Hello Ryan  I’m sorry to hear about your bad experience. Your disappointment is our disappointment, Ryan. You deserve to be provided with a completely efficient, professional, value-for-money experience each time you stop by, and we'd like to wholeheartedly apologize for falling short of your expectations.\nPlease either email details to info@ifixandrepair.com or stop in and allow our manager to see if we can help you.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105769657513054076492", "name": "Drew Thomas", "time": 1493082405139, "rating": 5.0, "text": "KJ is very great at what he does. Great customer service. Thank you so much KJ!!!!!", "pics": null, "resp": {"time": 1493130508000, "text": "Drew, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116953204813782245825", "name": "Francisco Vega", "time": 1459550686986, "rating": 5.0, "text": "Total fix that was smooth as pudding hats off to the staff up there ...it's all Greek to me and they shot straight and to the point a breath of fresh air to know how well they know and understand the customer thank you Ms Cayce and your Crew", "pics": null, "resp": {"time": 1459604110340, "text": "Thank you so much for taking the time to leave a Five Star Review, Francisco. iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114315239774495485054", "name": "Anne Phillips", "time": 1488234644371, "rating": 5.0, "text": "KJ help me put on my case and tempered glass. awesome experience. Thank you KJ. Him and Adam have great hair!!!!!", "pics": null, "resp": {"time": 1488296245614, "text": "Thank you so much for taking the time to leave a Five Star Review, Anne! We appreciate the opportunity to repair your device and we hope to help you again in the future. We know your time is valuable so again....Thank you!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116256076801525615957", "name": "tony kopkie", "time": 1463151715162, "rating": 5.0, "text": "My experience with cayce was great!  She was very helpful. The next time I have a problem she's my girl!!", "pics": null, "resp": {"time": 1463168785592, "text": "Tony, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future. iFixandRepair - Wiregrass Common Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111470882839603514743", "name": "Dalton Chavis", "time": 1504465815341, "rating": 5.0, "text": "Cayce was very helpful and I would recommend her and this location to everyone", "pics": null, "resp": {"time": 1504541289656, "text": "Thank you very much for posting your review, we are glad you had the best experience!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101180286535615396070", "name": "Regina Lacaze", "time": 1463165542194, "rating": 5.0, "text": "FANTASTIC customer service, speedy repair with no issues at all!! Will deff be returning if and future issuse!! Awesome store environment, FANTASTIC PRICES!!", "pics": null, "resp": {"time": 1463169248947, "text": "Thank you so much for taking the time to leave a Five Star Review, Regina! We appreciate the opportunity to repair your device and we hope to help you again in the future. We know your time is valuable so again....Thank you! iFixandRepair - Wiregrass Common Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104875742813352194278", "name": "Courtney Smith", "time": 1556134300815, "rating": 5.0, "text": "Marissa & Cayce are very nice and knowledgeable.", "pics": null, "resp": {"time": 1558552830189, "text": "Thanks for the awesome review, Courtney! We work hard to meet expectations like yours, and we’re happy to read we hit the mark for you. Come back and see us soon. Please follow us on Facebook @ifarwiregrass.\n\nHave a wonderful day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117554502065136230189", "name": "Marcus Jones", "time": 1489803084098, "rating": 5.0, "text": "Kj really cool guy helped us out a lot. Me and the family. Thank you KJ", "pics": null, "resp": {"time": 1490024583540, "text": "Marcus. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108616597836864991189", "name": "Pamela Johnson", "time": 1489202096210, "rating": 5.0, "text": "Kj what so kind of to stay after hours to repair my phone. I thank you so much KJ for the Epic services!!!!!", "pics": null, "resp": {"time": 1489416044110, "text": "Pamela. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future. iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104788102096182216401", "name": "Tony Smith", "time": 1488669050611, "rating": 5.0, "text": "Kj is the master of fixing phones and taking care of his customers. Definitely go see him at ifix. He is awesome!!!!!", "pics": null, "resp": {"time": 1488812862100, "text": "Tony. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105769657513054076492", "name": "Drew Thomas", "time": 1493082405139, "rating": 5.0, "text": "KJ is very great at what he does. Great customer service. Thank you so much KJ!!!!!", "pics": null, "resp": {"time": 1493130508000, "text": "Drew, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "115550098967434538676", "name": "chase maddox", "time": 1507858532566, "rating": 5.0, "text": "KJ Is by far the most talented and gifted employee and I fix repair. Thanks a lot 🤙🏻🤙🏻katie fIs by far the most talented and gifted employee and I fix repair. Thanks a lot 🤙🏻🤙🏻katie for helping out my screen a picture my camera. Is crystal clear now", "pics": null, "resp": {"time": 1507909019704, "text": "We appreciate it so much, thanks for submitting your valuable feedback. Have a nice weekend!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107889003930171705320", "name": "M Walker", "time": 1500910215774, "rating": 5.0, "text": "Cayce was able to get my phone working and it was awesome service.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106737191232133829331", "name": "caroline williams", "time": 1491005828354, "rating": 5.0, "text": "Kj he's very epic at what he does. He is so good it is customer service and he did a good job my temper glass. Thank you KJ.", "pics": null, "resp": {"time": 1491231933772, "text": "Caroline, Thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service. They're amazing technicians. I appreciate you for recognizing our team. Have a fantastic day!!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106737191232133829331", "name": "caroline williams", "time": 1491005828354, "rating": 5.0, "text": "Kj he's very epic at what he does. He is so good it is customer service and he did a good job my temper glass. Thank you KJ.", "pics": null, "resp": {"time": 1491231933772, "text": "Caroline, Thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service. They're amazing technicians. I appreciate you for recognizing our team. Have a fantastic day!!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104803146745872817117", "name": "Juice", "time": 1469742993555, "rating": 5.0, "text": "Everytime I go in to have my phone rebooted Kasey is always very kind and helpful. I recommend her for all of your technical needs :)", "pics": null, "resp": {"time": 1469803123611, "text": "Thank you so much for taking the time to leave a Five Star Review, Emerald. We appreciate the opportunity to repair your device and look forward to helping you again in the future. Thank you!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101884915540834057170", "name": "TWalker Photography", "time": 1536939733131, "rating": 5.0, "text": "Casey was simple and fast! Great service!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114910552969518717833", "name": "Jello:D", "time": 1465055558075, "rating": 5.0, "text": "Was fast service every thing is working on my phone highly recommend for people who don't want to send there phones off to get it fixed.", "pics": null, "resp": {"time": 1465239594012, "text": "Anthony. Thank you for giving us a perfect rating and for recommending #iFixandRepair.  We´re sure our entire staff enjoyed helping to fix your device. Take care! iFixandRepair - Wiregrass Common Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101424769721606182971", "name": "Stephen Smith", "time": 1404270525944, "rating": 1.0, "text": "I would strongly recommend against allowing anyone at this location to attempt to repair your property.  I took in my iphone 5s for a cracked screen.  Up front they were very confident stating that it would only take about 45 mins and for a somewhat reasonable price.  The first screen they put on they said was \"glitchy\".  The second screen had screws that were so over-tightened they pushed through to the glass.  The third screen worked but somewhere along the way several other items were damaged.  When first checking in the phone they did a thorough checklist noting that everything worked properly.  Now I have a phone that doesn't have a vibrate function anymore, the earpiece only works sometimes, and it drops calls all of a sudden now.  They told me that they aren't sure what is wrong and they will order a part and maybe that will work.  I told them I didn't want anyone else trying to work on my phone anymore (3 different people already messed up different parts of the phone).  I asked for a refund and was told that if they got approval from the district manager, they might be able to install a broken screen  on my phone and give me my money back.  Do yourself a favor and read the reviews on Yelp, and the BBB.  This business has shown that they will damage your property and keep your money.", "pics": null, "resp": {"time": 1462910946559, "text": "Hello Stephen I’m sorry to hear about your bad experience. Your disappointment is our disappointment, Stephen. You deserve to be provided with a completely efficient, professional, value-for-money experience each time you stop by, and we'd like to wholeheartedly apologize for falling short of your expectations. Please either email details to info@ifixandrepair.com or stop in and allow our manager to see if we can help you.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107889003930171705320", "name": "M Walker", "time": 1500910215774, "rating": 5.0, "text": "Cayce was able to get my phone working and it was awesome service.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106366718817800973924", "name": "Ciara Jackson", "time": 1501801431684, "rating": 5.0, "text": "KJ was able to figure out what was wrong with my phone quickly and had it fixed and working within an hour!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109986106040991410760", "name": "BobMac", "time": 1510272731994, "rating": 5.0, "text": "KJ super service! Got me taken care of fast", "pics": null, "resp": {"time": 1510324678121, "text": "Thanks we appreciate it so much!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103989696653488327305", "name": "willie ivey", "time": 1462238069760, "rating": 5.0, "text": "Took my iPhone there and it was fixed within 15 minutes and the young lady casandra was very nice.", "pics": null, "resp": {"time": 1462302231992, "text": "Thank you so much for taking the time to leave a Five Star Review, Willie! We appreciate the opportunity to repair your iPhone and we hope to help you again in the future.  We know your time is valuable so again....Thank you!\niFixandRepair - Wiregrass Common Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113022672203565935864", "name": "Yvonne Hickox", "time": 1498515974386, "rating": 5.0, "text": "Cayce did a great job getting my sons phone working", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116069581718546320392", "name": "Cheri Ward Wilks", "time": 1510367165573, "rating": 5.0, "text": "Kj Great job. Very honest customer service. Thank you KJ!!!!!", "pics": null, "resp": {"time": 1510592100750, "text": "That's great to hear, we really appreciate the positive comments from our customers."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114910552969518717833", "name": "Jello:D", "time": 1465055558075, "rating": 5.0, "text": "Was fast service every thing is working on my phone highly recommend for people who don't want to send there phones off to get it fixed.", "pics": null, "resp": {"time": 1465239594012, "text": "Anthony. Thank you for giving us a perfect rating and for recommending #iFixandRepair.  We´re sure our entire staff enjoyed helping to fix your device. Take care! iFixandRepair - Wiregrass Common Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108971506007720625734", "name": "Cameron Edward", "time": 1513475122319, "rating": 5.0, "text": "Kj Efficienct and fast and courteous. Will return for a future repairs with KJ!!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101212483822421127718", "name": "Trish Mathis", "time": 1508017005461, "rating": 5.0, "text": "Cayce was awesome... she was able to transfer my information from one of my broke Samsung's to another when it was too broke to see the screen, she's a life saver.", "pics": null, "resp": {"time": 1508261922257, "text": "That's incredible. Thanks for submitting your review on our system."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117032379857651787670", "name": "Zhanaria Harris", "time": 1489289700592, "rating": 5.0, "text": "Kj was awesome at customer service,he was being entertaining and fixed my phone overtime thanks kj", "pics": null, "resp": {"time": 1489416074630, "text": "Thank you so much for taking the time to leave a Five Star Review, Zhanaria! We appreciate the opportunity to repair your device and we hope to help you again in the future. We know your time is valuable so again....Thank you! iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101424769721606182971", "name": "Stephen Smith", "time": 1404270525944, "rating": 1.0, "text": "I would strongly recommend against allowing anyone at this location to attempt to repair your property.  I took in my iphone 5s for a cracked screen.  Up front they were very confident stating that it would only take about 45 mins and for a somewhat reasonable price.  The first screen they put on they said was \"glitchy\".  The second screen had screws that were so over-tightened they pushed through to the glass.  The third screen worked but somewhere along the way several other items were damaged.  When first checking in the phone they did a thorough checklist noting that everything worked properly.  Now I have a phone that doesn't have a vibrate function anymore, the earpiece only works sometimes, and it drops calls all of a sudden now.  They told me that they aren't sure what is wrong and they will order a part and maybe that will work.  I told them I didn't want anyone else trying to work on my phone anymore (3 different people already messed up different parts of the phone).  I asked for a refund and was told that if they got approval from the district manager, they might be able to install a broken screen  on my phone and give me my money back.  Do yourself a favor and read the reviews on Yelp, and the BBB.  This business has shown that they will damage your property and keep your money.", "pics": null, "resp": {"time": 1462910946559, "text": "Hello Stephen I’m sorry to hear about your bad experience. Your disappointment is our disappointment, Stephen. You deserve to be provided with a completely efficient, professional, value-for-money experience each time you stop by, and we'd like to wholeheartedly apologize for falling short of your expectations. Please either email details to info@ifixandrepair.com or stop in and allow our manager to see if we can help you.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102538893181783607674", "name": "Jaida Dykes", "time": 1540086729869, "rating": 5.0, "text": "Marissa was a huge help.  Very knowledgeable!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109218504960703382330", "name": "s w", "time": 1502594829436, "rating": 5.0, "text": "Kj did great and stayed until 10:00pm to fix it", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103989696653488327305", "name": "willie ivey", "time": 1462238069760, "rating": 5.0, "text": "Took my iPhone there and it was fixed within 15 minutes and the young lady casandra was very nice.", "pics": null, "resp": {"time": 1462302231992, "text": "Thank you so much for taking the time to leave a Five Star Review, Willie! We appreciate the opportunity to repair your iPhone and we hope to help you again in the future.  We know your time is valuable so again....Thank you!\niFixandRepair - Wiregrass Common Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106188382734761771277", "name": "LaKiah McClain", "time": 1501897008032, "rating": 5.0, "text": "KJ is a very awesome helper. Very knowledgeable and gifted with talents. Thanks KJ!!!!!!", "pics": null, "resp": {"time": 1501944986631, "text": "Good morning Klah,\n\nThanks for your review, we hope to see you back soon! Have and excellent weekend."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117032379857651787670", "name": "Zhanaria Harris", "time": 1489289700592, "rating": 5.0, "text": "Kj was awesome at customer service,he was being entertaining and fixed my phone overtime thanks kj", "pics": null, "resp": {"time": 1489416074630, "text": "Thank you so much for taking the time to leave a Five Star Review, Zhanaria! We appreciate the opportunity to repair your device and we hope to help you again in the future. We know your time is valuable so again....Thank you! iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104582831971193536475", "name": "Eric Faulx", "time": 1506030378533, "rating": 4.0, "text": "***EDIT***\n\n***Ms. Casey had everything fixed for me once this post was made, 4 starring it for everything that happened. Would recommend to friends, and will go back if I ever need quality work.***\n\nThey charged me $120+tax to repair my broken screen and BREAK MY HOME SCREEN BUTTON! Two days ago I took my iPod 5 in to get the screen replaced on it. The home button still worked on it prior to me dropping it off. Once I got my iPod Touch back with the screen repaired my home button no longer worked. Casey, the owner, claimed it to be a result of the damage that occurred to it prior and I had come to found out that it actually was a result of her improperly removing the button. She tore the conductive ribbon strip from the home button that lets it depress and click the dome switch underneath. She claimed that it was not her fault did not offer any kind of apology and told me it was unfixable. I have also been told this kind of repair is not fixable by any conventional means and that the iPod might as well be replaced. DO NOT GET YOUR DEVICES \"REPAIRED\" AT THIS ESTABLISHMENT. Extremely dissatisfied with this business and it's practice -Eric Faulx", "pics": null, "resp": {"time": 1502925122910, "text": "Good afternoon Eric,\n\nSorry to hear that. We are reviewing your case with our DM. In short we will give you a quick answer."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108663398135492654296", "name": "Snupe B", "time": 1466269623187, "rating": 5.0, "text": "I love this place . Kasey is literally the best !! She always takes good care of me when I have to come in for problems with my phone . I highly recommend asking for her when you come in.", "pics": null, "resp": {"time": 1466439499207, "text": "Emmy. Thank you for giving us a perfect rating and for recommending #iFixandRepair to other users.  We´re sure our entire staff enjoyed helping to fix your device. Take care!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116788716555352307031", "name": "Kristen Pressley", "time": 1490228004970, "rating": 5.0, "text": "kJ was worked very hard on my LGG5 for the first time . He was patient and had wonder customer service. Thank u KJ.", "pics": null, "resp": {"time": 1490286592824, "text": "Kristen, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109218504960703382330", "name": "s w", "time": 1502594829436, "rating": 5.0, "text": "Kj did great and stayed until 10:00pm to fix it", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "118440951528242288786", "name": "Katie Towns", "time": 1489003778285, "rating": 5.0, "text": "Kj was really helpful finding the right adhesive for my iPad2 battery replacement.", "pics": null, "resp": {"time": 1489071591066, "text": "Katie, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103567179921035921945", "name": "Harrison Barnes", "time": 1504220351099, "rating": 5.0, "text": "Kj & Caycee were great. Thx ok for fixing my phone!!!!!!!", "pics": null, "resp": {"time": 1504280330195, "text": "Good morning Harrison,\n\nThanks for sharing your awesome experience with us. Have a nice day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102631703835627833534", "name": "Jimmy Sanders", "time": 1468120130814, "rating": 5.0, "text": "My first experience breaking an iPhone was not all bad. I had the pleasure of meeting the owner of ifix, Kaci, and she repaired my iPhone in less than 20 minutes. After I left, I found that I had a problem with the phone and then I had to go back and met Marissa. She, along with Kaci, fixed it promptly and were incredibly helpful. Thanks to you both. -Jimmy Sanders", "pics": null, "resp": {"time": 1468255541509, "text": "Jimmy. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "100519363500445347499", "name": "Moises Colon", "time": 1536007467773, "rating": 5.0, "text": "They do an excellent job and I recommend them!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111030664650261482703", "name": "Astoldby CL", "time": 1489528517795, "rating": 5.0, "text": "Kj Was helpful and knowledgeable. Thank you for repairing my battery. And being  with my child!!!", "pics": null, "resp": {"time": 1489589787923, "text": "Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future. iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109293214882338479311", "name": "James Jones", "time": 1510779408393, "rating": 1.0, "text": "DO NOT TAKE YOUR PHONE HERE! Awful experience from a person that claims to be a manager! The individual clearly had no idea how to repair the phone and would not admit it prior to damaging the phone beyond repair. First the \"manager who has so much experience\" proceeds to pry the back of the custom bamboo backing on my wife's phone warping it where it will not lay flat. Then when doesn't know how to take the last screw out and breaks the ribbon cable that powers the phone. While she did offer to order the part that she broke she did not disclose that she had already damaged the back of the phone and then when confront just casually says well I have to get it off and it is just a piece of plastic. It was fine when it left here. Clearly there was no real concern for damaging someone else's property when she order a $12.00 part \"out of her own pocket\" and act like that makes up for damaging the phone without recourse", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117199042089794301615", "name": "Tutorialpage 2", "time": 1485649630250, "rating": 5.0, "text": "Kj awesome awesonm job in record time. we will definitely be back for KJ.", "pics": null, "resp": {"time": 1485701443149, "text": "Thank you so much for taking the time to leave a Five Star Review, Jason! We appreciate the opportunity to repair your device and we hope to help you again in the future. We know your time is valuable so again....Thank you!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102538893181783607674", "name": "Jaida Dykes", "time": 1540086729869, "rating": 5.0, "text": "Marissa was a huge help.  Very knowledgeable!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "100865963840745943582", "name": "Travis Turvin", "time": 1511314607341, "rating": 5.0, "text": "KJ amazing job  fixing a “unfixable phone “ !!", "pics": null, "resp": {"time": 1511377529445, "text": "We appreciate it so much, Thanks for submitting your review."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113748511863162981271", "name": "Julian", "time": 1524801191229, "rating": 5.0, "text": "KJ would fight Darth Vader himself if there was a chance it could fix your iPhone. The force is strong with this one.", "pics": null, "resp": {"time": 1527356072014, "text": "Julian, thank you so much for taking the time to leave this great review!.\n\nHere at iFixandrepair, our dedicated staff works very diligently to make sure you love our work. This provides us with great encouragement to keep doing what we do!\n\nWe'll make sure the store and KJ gets recognition from this!!\n\nPlease do visit again, we'd love to have you as a customer.\nDon't forget to follow us on Facebook @ifarwiregrass\n\nMay the force be with you!\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109651001651911144860", "name": "David Gilligan", "time": 1525912003944, "rating": 5.0, "text": "Best service in the wiregrass mall 100% in and out in a flash", "pics": null, "resp": {"time": 1527356588898, "text": "Thank you for taking the time to leave us a five stars  review!\n\nWe hope to see you here again, thanks for your trust in us, and for help us to spread the word!\nPlease don't forget to follow us on Facebook @ifarwiregrass\n\nHave a good day!\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108922283609542311861", "name": "Alexis Powell", "time": 1506566146117, "rating": 5.0, "text": "Kj was excellent , I recommend everyone to go to him !!!! ASK FOR KJ", "pics": null, "resp": {"time": 1506611756451, "text": "That's great to hear, thanks for your feedback."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102165934224410615288", "name": "Selina Ikner", "time": 1501573107386, "rating": 5.0, "text": "KJ, was very polite and did a very awesome job fixing my son's ✆.Very pleased with his work. Will return again.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113084363443060360668", "name": "Eddie Culver", "time": 1502243710834, "rating": 5.0, "text": "KJ good service got my charger going again yay!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107001252792098377797", "name": "Grace Hardrick", "time": 1484966698293, "rating": 5.0, "text": "Kj was hiliarious and kept me entertained while quickly and efficiently perfecting my phone again ! Highly recommend !!!!", "pics": null, "resp": {"time": 1485016787901, "text": "Grace. Thank you for giving us a perfect rating and for recommending #iFixandRepair We´re sure our entire staff enjoyed helping to fix your device. Take care!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102631703835627833534", "name": "Jimmy Sanders", "time": 1468120130814, "rating": 5.0, "text": "My first experience breaking an iPhone was not all bad. I had the pleasure of meeting the owner of ifix, Kaci, and she repaired my iPhone in less than 20 minutes. After I left, I found that I had a problem with the phone and then I had to go back and met Marissa. She, along with Kaci, fixed it promptly and were incredibly helpful. Thanks to you both. -Jimmy Sanders", "pics": null, "resp": {"time": 1468255541509, "text": "Jimmy. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101200124903166312651", "name": "Denny Holloway", "time": 1491589720789, "rating": 5.0, "text": "KJ greeted me as soon as I walked into store and immediatly began helping me with my problem. He took my iPad and had the headphone problem repaired in less than 5min. Best service I've ever had. I'll return and recommend him and the store to all my friends with all electronic devices!! Thank you KJ and iFix!!!!!!!", "pics": null, "resp": {"time": 1491836907894, "text": "Denny, Thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service. They're amazing technicians. I appreciate you for recognizing our team. Have a fantastic day!!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114217849374164839366", "name": "Mark Wisniewski", "time": 1459638501534, "rating": 5.0, "text": "Fast service and quality work.. you won't be disappointed.", "pics": null, "resp": {"time": 1459787669573, "text": "Mark, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future.  iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102165934224410615288", "name": "Selina Ikner", "time": 1501573107386, "rating": 5.0, "text": "KJ, was very polite and did a very awesome job fixing my son's ✆.Very pleased with his work. Will return again.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107001252792098377797", "name": "Grace Hardrick", "time": 1484966698293, "rating": 5.0, "text": "Kj was hiliarious and kept me entertained while quickly and efficiently perfecting my phone again ! Highly recommend !!!!", "pics": null, "resp": {"time": 1485016787901, "text": "Grace. Thank you for giving us a perfect rating and for recommending #iFixandRepair We´re sure our entire staff enjoyed helping to fix your device. Take care!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109149744668918276710", "name": "Daniel Miller", "time": 1566092311511, "rating": 5.0, "text": "Marissa is very knowledgeable and helped me with my broken screen.", "pics": null, "resp": {"time": 1566332226098, "text": "Daniel we appreciate your positive feedback about us. We are always providing the best service for our customers. Thank you very much!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104460473846071285153", "name": "Myranda Burton", "time": 1475098436373, "rating": 5.0, "text": "Came in to get my screen repaired and not only did they replace my screen but they noticed my battery was swollen and would cause the screen to lift and or crack the lcd. Thank you for the awesome service and being quick and friendly", "pics": null, "resp": {"time": 1475243273972, "text": "Thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service. They're amazing technicians. I appreciate you for recognizing our team. Have a fantastic day!!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103939030119607077358", "name": "Brittany Jackson", "time": 1487986568594, "rating": 5.0, "text": "Kj is the coolest person ever. Fixed my phone fast and super friendly!!!!!", "pics": null, "resp": {"time": 1488207620023, "text": "Thank you so much for taking the time to leave a Five Star Review, Brittany! We appreciate the opportunity to repair your device and we hope to help you again in the future. We know your time is valuable so again....Thank you!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102153251393350820281", "name": "noah saunders", "time": 1529110439781, "rating": 5.0, "text": "Marissa is awesome. quick at repairs ! thanks!", "pics": null, "resp": {"time": 1530049149420, "text": "Noah, thank you for mentioning our efficiency! It means a lot to us to read this kind of messages. Wishing you a great week! #iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117840202489892130784", "name": "Rick McCommon", "time": 1500073718440, "rating": 5.0, "text": "KJ and Caycee great service and helpful with everything. Good prices!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102153251393350820281", "name": "noah saunders", "time": 1529110439781, "rating": 5.0, "text": "Marissa is awesome. quick at repairs ! thanks!", "pics": null, "resp": {"time": 1530049149420, "text": "Noah, thank you for mentioning our efficiency! It means a lot to us to read this kind of messages. Wishing you a great week! #iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113596296012657227129", "name": "Chris Closson", "time": 1470263572893, "rating": 5.0, "text": "Prompt repair. Great customer service. Highly recommend!!", "pics": null, "resp": {"time": 1470323297525, "text": "Chris. We appreciate your positive feedback about us. We are always providing the best for our customers. If you're traveling to our area again soon, don't hesitate to call us.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101610045064438993907", "name": "Josh Pryor", "time": 1521210004677, "rating": 5.0, "text": "Quick and knowledgeable service. Thanks for the help KJ!", "pics": null, "resp": {"time": 1521497558318, "text": "Hey Josh, we hope all is well.\n\nThank you for taking your time and sharing your experience! Wow!! Our team here at iFixandRepair is thrilled to hear such positive  feedback about one of our employees. We'll make sure to give the store recognition from this compliment.\n\nEven though we have repaired your device, we would like to keep in touch.\n\nTo enjoy our really low prices, don't forget to follow us on Facebook @ifarwiregrass .\n\nCheers!\n#iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109206264331141366168", "name": "Power Max1000", "time": 1488509206423, "rating": 5.0, "text": "Kj was very helpful. Did awesome job getting my phone fixed!!!!!", "pics": null, "resp": {"time": 1488573496844, "text": "Camella. Thank you for giving us a perfect rating and for recommending #iFixandRepair We´re sure our entire staff enjoyed helping to fix your device. Take care!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109772744581976359254", "name": "Michael Dorminy", "time": 1469029791656, "rating": 5.0, "text": "Easy and fast repairs! Replaced my screen and phone glad in less than 30 min!", "pics": null, "resp": {"time": 1469111861904, "text": "Michael, Thank you for giving us a perfect rating.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105693934728575748158", "name": "Ariana Ramirez", "time": 1494127062268, "rating": 5.0, "text": "KJ was kind enough to stay after hours and went above and beyond to fix ny iphone 7!!!!!! thanks kj!!!!!!", "pics": null, "resp": {"time": 1494254985592, "text": "Ariana, Thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service. They're amazing technicians. I appreciate you for recognizing our team. Have a fantastic day!!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109149744668918276710", "name": "Daniel Miller", "time": 1566092311511, "rating": 5.0, "text": "Marissa is very knowledgeable and helped me with my broken screen.", "pics": null, "resp": {"time": 1566332226098, "text": "Daniel we appreciate your positive feedback about us. We are always providing the best service for our customers. Thank you very much!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117840202489892130784", "name": "Rick McCommon", "time": 1500073718440, "rating": 5.0, "text": "KJ and Caycee great service and helpful with everything. Good prices!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108266189776333727752", "name": "Kenny Joiner", "time": 1487465913360, "rating": 5.0, "text": "Kj KJ gave me excellent service and am greatly appreciative", "pics": null, "resp": {"time": 1487607803047, "text": "Kenny. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "110093165173910532581", "name": "Dennis Cobb", "time": 1475710933755, "rating": 5.0, "text": "Outstanding service from Cayce. Phone works great.", "pics": null, "resp": {"time": 1475788979318, "text": "Thank you so much for taking the time to leave a Five Star Review, Dennis. We appreciate the opportunity to repair your device and look forward to helping you again in the future. Thank you!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "100240452719049741669", "name": "Adam Sullivan", "time": 1531501527149, "rating": 5.0, "text": "Great, friendly, and knowledgeable customer service!  Satisfied customer", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106107285204610247868", "name": "Tim Phillips", "time": 1536358120316, "rating": 5.0, "text": "Quick service, informative, Eric and Camrron were great!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114886208463289276464", "name": "Carol Hobart", "time": 1501886809715, "rating": 5.0, "text": "KJ was very helpful and I will return to see him for all my phone repairs. Thanks KJ!!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105282507930955123657", "name": "Liz Stuart", "time": 1481926278067, "rating": 5.0, "text": "Very friendly and helpful. KJ was very considerase and kniwledgable. Thanks much.", "pics": null, "resp": {"time": 1482154772091, "text": "Liz. We appreciate your positive feedback about us. We are always providing the best for our customers. If you're traveling to our area again soon, don't hesitate to call us.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111556717342141565372", "name": "kayleigh sayles", "time": 1486080939877, "rating": 5.0, "text": "KJ so epic. Very miraculous. Awesome service. Highly recommend!!!!!!", "pics": null, "resp": {"time": 1486131347515, "text": "Kayleigh. Thank you for giving us a perfect rating and for recommending #iFixandRepair We´re sure our entire staff enjoyed helping to fix your device. Take care!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116026395064751495724", "name": "Carolanne Smith", "time": 1525738893121, "rating": 5.0, "text": "KJ is amazing & is going to be famous one day!! he’s awesome!!!", "pics": null, "resp": {"time": 1527356530524, "text": "Carolanne, thank you so much for taking the time to leave this great review!.\n\nHere at iFixandrepair, our dedicated staff works very diligently to make sure you love our work. This provides us with great encouragement to keep doing what we do!\n\nWe'll make sure the store gets recognition from this\n\nPlease do visit again, we'd love to have you as a customer.\nDon't forget to follow us on Facebook @ifarwiregrass\n\nCheers\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "115599572200351815943", "name": "Briauna Gilbert", "time": 1519692969758, "rating": 5.0, "text": "KJ took care of us with our phone. Pinpointed the issue very professionally!!!", "pics": null, "resp": {"time": 1521497309241, "text": "Hey Briauna, we hope all is well.\n\nThank you for taking your time and sharing your experience! Wow!! Our team here at iFixandRepair is thrilled to hear such positive  feedback about one of our employees. We'll make sure to give the store recognition from this compliment.\n\nEven though we have repaired your device, we would like to keep in touch.\n\nTo enjoy our really low prices, don't forget to follow us on Facebook @ifarwiregrass .\n\nCheers!\n#iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102795870920556087878", "name": "bobby brewer", "time": 1481164282367, "rating": 5.0, "text": "KJ is FANTASTIC!!! Bring your phone to KJ. And stay away from these other places which are shade tree phone phonies!!! Thank you KJ!!!", "pics": null, "resp": {"time": 1481204967255, "text": "Bobby. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future. iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "100694189240397282802", "name": "Corbin Gradic", "time": 1451637927657, "rating": 1.0, "text": "The manager is Very unprofessional and didn't even remember what was done to my phone. The guy that was working said my battery was fried Bc he could smell it. Took it to wiregrass technologies and he had it running in 2 hours! Nothing wrong with the battery.", "pics": null, "resp": {"time": 1462910831003, "text": "Hello Corbin  I’m sorry to hear about your bad experience. Your disappointment is our disappointment, Corbin. You deserve to be provided with a completely efficient, professional, value-for-money experience each time you stop by, and we'd like to wholeheartedly apologize for falling short of your expectations. Please either email details to info@ifixandrepair.com or stop in and allow our manager to see if we can help you.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108660054445220925751", "name": "jose Delgado", "time": 1494127243568, "rating": 5.0, "text": "KJ helped my woman and fixed her phone after hours. great service and patience!!! thanks KJ!!!!", "pics": null, "resp": {"time": 1494254997662, "text": "Jose. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101553515781790761012", "name": "Faith Lucas", "time": 1486170877825, "rating": 5.0, "text": "KJ is awesommmmmmmme loveeeeeed it! Phone is back working! Give him a raise!!!", "pics": null, "resp": {"time": 1486390213478, "text": "Faith, Thank you for taking the time to share your experience with us! we're pleased to read that our staff made you smile!! We strive to provide fast and friendly service. They're amazing technicians. I appreciate you for recognizing our team. Have a fantastic day!!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107740212396468130575", "name": "Hunter Thompson", "time": 1471036547999, "rating": 5.0, "text": "K.J. Was really nice and helpful and showed me what was wrong and was nice about it", "pics": null, "resp": {"time": 1471276027390, "text": "Hunter. We appreciate your positive feedback about us. We are always providing the best for our customers. If you're traveling to our area again soon, don't hesitate to call us.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117489460514562230125", "name": "Dreama Cassady", "time": 1506033254457, "rating": 5.0, "text": "Fixed my son's iphone 6 plus LCD screen- reasonably priced excellent / fast service!  Thanks!!!", "pics": null, "resp": {"time": 1506034235438, "text": "Thanks for sharing your experience with us. Have a great day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111340904999008471416", "name": "Donna Mott", "time": 1411589558488, "rating": 1.0, "text": "I would not recommend this store to dust off the screen of a phone or tablet much less attempt to repair it.  If I could give less than 1 star, I would.  We took an iPad 3 to iFix on December 20th to have a broken screen replaced.  We called later that evening and went to pick it up after they said it was complete.  We tested the iPad while at the store in front of Tyler, an iFix employee, and the power button wouldn't work, the magnetic closure to put the iPad to sleep wouldn't work, and you couldn't lock/unlock the iPad.  They also scratched the body of the iPad around the edges when they replaced the screen.  Tyler made a note of the issues and agreed we could bring the iPad back for repair after the Christmas holiday.  While we had it, the screen detached from the iPad body.\n\nWe took it back to iFix on or about January 9th.  We had to swipe (erase all content) off the iPad for them to repair it, so we had to buy a new one to replace this one in the interim.  We have received NO communication from anyone with iFix since that time unless we've called for a status.  We have called numerous times to speak with the manager, David and Tyler the original employee dealing with us on this.  Each time it's the same story...they're working on it and since that time, David is no longer with them.  I emailed all of the contacts on the Corporate iFix website and never received a response.  The employee we were dealing with, Tyler, can't tell us anything and he said the district manager was now handling our case.\n\nAmber Wells, the District Manager with iFix, and they would not agree to refund the $196.19 we paid for the screen replacement and she said they can't repair it.  I filed a Better Business Bureau complaint in March and iFix never responded to it.  The leasing manager, Rhonda Clark, at Wiregrass Commons Mall has attempted to get this resolved with the owner but has not been successful.  Apparently there are other customers who have complained to the mall management because iFix won't stand behind their work, lack of work, or whatever you wish to call their shoddy attempt at service.\n\nAt the very minimum, they should have refunded what I paid for the repair.  Unfortunately now, I have no confidence that the iPad will ever work the same even if someone else replaces the screen.  PLEASE don't make the mistake of taking any devices to this store.\n\nAs of September 24, 2014 they STILL have my iPad.  Nearly 9 months later and nothing from them...no attempt at resolution at all.  iFixandrepair has yet to contact me.  Apparently they have no interest in resolving the issue.  I'm taking them to small claims court to try to get this resolved.  Again, I would NOT recommend them for repairs of any sort based on my personal experience and the lack of concern of their staff.", "pics": null, "resp": {"time": 1462910926173, "text": "Hello Donna I’m sorry to hear about your bad experience. Your disappointment is our disappointment, Donna. You deserve to be provided with a completely efficient, professional, value-for-money experience each time you stop by, and we'd like to wholeheartedly apologize for falling short of your expectations. Please either email details to info@ifixandrepair.com or stop in and allow our manager to see if we can help you.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116981265104882441173", "name": "Leslie Collins", "time": 1482190077907, "rating": 5.0, "text": "Kj is awesome. I recommend him to anyone.", "pics": null, "resp": {"time": 1482246728820, "text": "Leslie. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107083464429272582030", "name": "Jacob Harden", "time": 1522111985067, "rating": 5.0, "text": "Kj Great customer service. Thank you", "pics": null, "resp": {"time": 1527355274286, "text": "Jacob, thank you so much for taking the time to leave this great review!.\n\nHere at iFixandrepair, our dedicated staff works very diligently to make sure you love our work. This provides us with great encouragement to keep doing what we do!\n\nWe'll make sure the store gets recognition from this\n\nPlease do visit again, we'd love to have you as a customer.\nDon't forget to follow us on Facebook @ifarwiregrass\n\nHave a good day!\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114857135210663235733", "name": "Kijuana Smith", "time": 1567658345785, "rating": 5.0, "text": "Very knowledgeable and fast..", "pics": null, "resp": {"time": 1567779406002, "text": "Hey Kijuana, thank you for taking the time to write this review. We hope to see you again! Cheers!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109991047636737568877", "name": "Dylan Smith", "time": 1503089830506, "rating": 5.0, "text": "KJ did a great job on my iPhone", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101972991203774347673", "name": "Timbo Tolbert", "time": 1520727721141, "rating": 5.0, "text": "KJ gives great customer service and fixed my phone fast!! Thanks KJ!!!!!!", "pics": null, "resp": {"time": 1521497417661, "text": "Hey Timbo, we hope all is well.\n\nThank you for taking your time and sharing your experience! Wow!! Our team here at iFixandRepair is thrilled to hear such positive  feedback about one of our employees. We'll make sure to give the store recognition from this compliment.\n\nEven though we have repaired your device, we would like to keep in touch.\n\nTo enjoy our really low prices, don't forget to follow us on Facebook @ifarwiregrass .\n\nCheers!\n#iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "100747756571817556339", "name": "Viola Hollis", "time": 1512263793840, "rating": 5.0, "text": "KJ wonderful man and wonderful service. Thank you KJ!!!!!", "pics": null, "resp": {"time": 1512399882150, "text": "This is really cool, thanks!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107443713056308806852", "name": "Leslie Blondell", "time": 1487360818995, "rating": 5.0, "text": "Cayce was over the top helpful and went above and beyond for me. Thank you!", "pics": null, "resp": {"time": 1487607785908, "text": "Leslie, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106312046743583985190", "name": "Daniel Brewer", "time": 1488506216179, "rating": 5.0, "text": "Kj excellent service and great job on take care my phone for me!!!!!", "pics": null, "resp": {"time": 1488573477401, "text": "Daniel. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107852950025297859677", "name": "Liz Martin", "time": 1501280478559, "rating": 5.0, "text": "Went in today for a screen replacement and KJ went above and beyond to help me.  Thanks KJ.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114546911858813891582", "name": "Brandon Wilson", "time": 1462152668347, "rating": 4.0, "text": "Took my iPhone 6+ to get the screen replaced and it worked great for a few weeks! Although I was upset about the life of the screen the staff was very helpful when I went back within my warranty date.", "pics": null, "resp": {"time": 1462215173503, "text": "Thank you so much for taking the time to leave a Five Star Review, Brandon! We appreciate the opportunity to repair your device and we hope to help you again in the future.  We know your time is valuable so again....Thank you!   iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116802546542334937576", "name": "charice shackelford", "time": 1520382804399, "rating": 5.0, "text": "He is excellent!!! Cut his thumb but it didn’t stop him💪🏾", "pics": null, "resp": {"time": 1521497358161, "text": "Hey Charice, we hope all is well.\n\nThank you for taking your time and sharing your experience! Wow!! Our team here at iFixandRepair is thrilled to hear such positive  feedback about one of our employees. We'll make sure to give the store recognition from this compliment.\n\nEven though we have repaired your device, we would like to keep in touch.\n\nTo enjoy our really low prices, don't forget to follow us on Facebook @ifarwiregrass .\n\nCheers!\n#iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113042541470948436917", "name": "Fire wolf", "time": 1552165266055, "rating": 5.0, "text": "They were fast and amazing people", "pics": null, "resp": {"time": 1553188986911, "text": "Krysy, thank you for taking the time to leave us a five stars review.\n\nWe hope to see you here again and please bring your friends and family.\n\nDon't forget to follow us on Facebook @ifarwiregrass.\n\nHave an awesome day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117569822019751564275", "name": "Shaye Worlds", "time": 1516845628498, "rating": 5.0, "text": "Kj Is great at what he does. Has great hair too!!!!!!", "pics": null, "resp": {"time": 1518125148289, "text": "Dear Shaye, we're so glad that Kj is putting the work in!\nHere at iFixandRepair we work really hard to offer the best technology customer service there is. We'll make sure to get recognition from this. Did you know we have social media where you can keep track of our products, and tech tips? Here is our Facebook and Instagram page  @ifixandrepairofficial\nNext time we hear from you we hope is with a follow!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113317252288563925988", "name": "Hanging With DP", "time": 1487125583272, "rating": 5.0, "text": "KJ did a really good job customer service was awesome", "pics": null, "resp": {"time": 1487169151949, "text": "Devin. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106689422232978544035", "name": "Sharon Marchionni", "time": 1516729684401, "rating": 5.0, "text": "Excellent service!!! Friendly and knowledgeable staff!! Thanks Cayce!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105011963585191707059", "name": "Jared Stokes", "time": 1496979666438, "rating": 5.0, "text": "Get down to ifix and repair and see my boy KJ.  Any phone issue you have he can take care of for you.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113890595346230558530", "name": "Chelsey Hobbs", "time": 1496965605733, "rating": 5.0, "text": "KJ is an amazing technician and very friendly. Thank you KJ!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "110431819559609872233", "name": "Joseph Buggs", "time": 1500164297463, "rating": 5.0, "text": "KJ very supportive and helpful!!!! Thx kj!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108241360742573219875", "name": "Amber dye", "time": 1507565520813, "rating": 5.0, "text": "Wonderful and quick service! Highly recommend!!!", "pics": null, "resp": {"time": 1507566488050, "text": "That's so awesome to hear, we love your feeedback, dear Amber!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106129835402622425264", "name": "AE Consortium", "time": 1459915111723, "rating": 5.0, "text": "Very nice, helpful, and informative!! Easy to work with.", "pics": null, "resp": {"time": 1460054641746, "text": "Jason, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future.  iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108660984681925381764", "name": "Lyle Caughran", "time": 1512345402712, "rating": 5.0, "text": "K J was very helpful and informative.", "pics": null, "resp": {"time": 1512399473998, "text": "Thanks for contacting us, have a nice day!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109657669387519111066", "name": "John Luke Spurlin", "time": 1553617779890, "rating": 5.0, "text": "Great service and amazing staff!", "pics": null, "resp": {"time": 1553811455038, "text": "John, thank you so much for taking the time to leave us a five stars review!\n\nWe'll make sure the store gets recognition from this. Please do visit us again, we love having you as a customer.\n\nDon't forget to follow us on Facebook @ifarwiregrass.\n\nCheers!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "116995325848755566979", "name": "Denise Pruitt", "time": 1522360881023, "rating": 5.0, "text": "Awsome service!  Quick and professional!", "pics": null, "resp": {"time": 1527355652286, "text": "Hey Denise, hope all is well!\n\nWe understand how important time can be and it means so much that our customers notice the dedication we put into efficiency.\n\niFixandRepair wants to thank you for this honest review.\n\nEven though we have repaired your device, we would like to keep in touch.\n\nTo enjoy our really low prices, don't forget to follow us on Facebook @ifarwiregrass\n\nHave a good day!\n\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113920648917092530479", "name": "RichquanYT anderson", "time": 1460052697605, "rating": 5.0, "text": "I love Cayce Craven, her customer service skills are the best!!!", "pics": null, "resp": {"time": 1460054538404, "text": "Shedricka, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future.  iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108015165724564451370", "name": "Brandon Hughes", "time": 1527540047368, "rating": 5.0, "text": "Marissa is awesome she helped me so much! !", "pics": null, "resp": {"time": 1527718511063, "text": "Brandon, thank you so much for taking the time to leave this great review!.\n\nHere at iFixandrepair, our dedicated staff works very diligently to make sure you love our work. This provides us with great encouragement to keep doing what we do!\n\nWe'll make sure the store gets recognition from this\n\nPlease do visit again, we'd love to have you as a customer.\nDon't forget to follow us on Facebook @ifarwiregrass.\n\nHave a good day!\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105735335493758149787", "name": "Michael Welejski", "time": 1502585753388, "rating": 5.0, "text": "KJ did a great job.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105210341974718773883", "name": "Mckenzie Smith", "time": 1494904180866, "rating": 5.0, "text": "KJ stayed after hours like he did for my sister my fixed phone!!!! He's the best!!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105735335493758149787", "name": "Michael Welejski", "time": 1502585753388, "rating": 5.0, "text": "KJ did a great job.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "118131479281719370212", "name": "Paule Pupelyte", "time": 1492478011890, "rating": 5.0, "text": "KJ did an amazing job! Thank you!", "pics": null, "resp": {"time": 1492527140153, "text": "Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113920648917092530479", "name": "RichquanYT anderson", "time": 1460052697605, "rating": 5.0, "text": "I love Cayce Craven, her customer service skills are the best!!!", "pics": null, "resp": {"time": 1460054538404, "text": "Shedricka, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future.  iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114402915355918995300", "name": "Malorie Thompson", "time": 1497922931467, "rating": 5.0, "text": "KJ awesome service and excellent repair. Saved the day!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112907160638870095498", "name": "Hailey Brunson", "time": 1501379567573, "rating": 5.0, "text": "KJ great A+++++ service fixing my phone!!!! Thanks KJ!!!! :))))))", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "100397445193219242999", "name": "PBO Property Bigfoot organization", "time": 1459704368286, "rating": 5.0, "text": "Came in to get my screen replaced,  had great service, didn't take that long and the staff was very friendly and helpful!   I will be back with all my wireless repairs!", "pics": null, "resp": {"time": 1459787794500, "text": "Charlie, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106229802940362090449", "name": "Amanda Mclard", "time": 1459617868460, "rating": 5.0, "text": "She was super nice and informative. Fixed my phone in no time!", "pics": null, "resp": {"time": 1459787527150, "text": "Thank you so much for taking the time to leave a Five Star Review, Amanda! We appreciate the opportunity to repair your device and we hope to help you again in the future.  We know your time is valuable so again....Thank you!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112249253916731831045", "name": "Jimmy Garrett", "time": 1467984625065, "rating": 4.0, "text": "From the reviews sounds like i found some new help.i am clumsy the new phones really dont fit a guys hand.its like you doomed to drop...lol", "pics": null, "resp": {"time": 1467990144144, "text": "Jimmy. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104319135861409100701", "name": "Corteland Quattlebaum", "time": 1525574693995, "rating": 5.0, "text": "K.J is super chill and was super committed to getting the job done", "pics": null, "resp": {"time": 1527356511144, "text": "Thank you so much for taking the time to leave this great review!.\n\nHere at iFixandrepair, our dedicated staff works very diligently to make sure you love our work. This provides us with great encouragement to keep doing what we do!\n\nWe'll make sure the store gets recognition from this\n\nPlease do visit again, we'd love to have you as a customer.\nDon't forget to follow us on Facebook @ifarwiregrass\n\nCheers!/ Have a good day!\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103952042237938307490", "name": "Morgan Sumner", "time": 1489618275156, "rating": 5.0, "text": "KJ and Adam did a great job!", "pics": null, "resp": {"time": 1489700637272, "text": "Thank you so much for taking the time to leave a Five Star Review, Morgan. We appreciate the opportunity to repair your device and look forward to helping you again in the future. Thank you!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112249253916731831045", "name": "Jimmy Garrett", "time": 1467984625065, "rating": 4.0, "text": "From the reviews sounds like i found some new help.i am clumsy the new phones really dont fit a guys hand.its like you doomed to drop...lol", "pics": null, "resp": {"time": 1467990144144, "text": "Jimmy. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113479808836983543200", "name": "Dometrice Baker", "time": 1482437393663, "rating": 5.0, "text": "Marissa is so awesome !! iFix would be nothing without her !!", "pics": null, "resp": {"time": 1482504880248, "text": "Thank you so much for taking the time to leave a Five Star Review, Dometrice.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109590046453638752964", "name": "Daniel Meissner", "time": 1547153620118, "rating": 5.0, "text": "SUPER friendly, helpful & welcoming!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106761065668430121832", "name": "Joseph Simmons", "time": 1527459415709, "rating": 5.0, "text": "Very professional.. helped me with all my needs !", "pics": null, "resp": {"time": 1527718489019, "text": "Joseph, thank you so much for taking the time to leave this great review!.\n\nHere at iFixandrepair, our dedicated staff works very diligently to make sure you love our work. This provides us with great encouragement to keep doing what we do!\n\nWe'll make sure the store gets recognition from this\n\nPlease do visit again, we'd love to have you as a customer.\nDon't forget to follow us on Facebook @ifarwiregrass\n\nHave a good day!\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104601997098363876808", "name": "Chance Drawdy", "time": 1509758653715, "rating": 5.0, "text": "KJ is the man!! Really helpful and truthful!", "pics": null, "resp": {"time": 1509812543997, "text": "We appreciate it so much! That's incredible to hear that."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104319135861409100701", "name": "Corteland Quattlebaum", "time": 1525574693995, "rating": 5.0, "text": "K.J is super chill and was super committed to getting the job done", "pics": null, "resp": {"time": 1527356511144, "text": "Thank you so much for taking the time to leave this great review!.\n\nHere at iFixandrepair, our dedicated staff works very diligently to make sure you love our work. This provides us with great encouragement to keep doing what we do!\n\nWe'll make sure the store gets recognition from this\n\nPlease do visit again, we'd love to have you as a customer.\nDon't forget to follow us on Facebook @ifarwiregrass\n\nCheers!/ Have a good day!\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112630980256708772170", "name": "Nadia Kay", "time": 1560790427221, "rating": 5.0, "text": "Great service!!!", "pics": null, "resp": {"time": 1561222902714, "text": "Thank you, Nadia. Have a nice day."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109837101536015225242", "name": "Jim Bass", "time": 1459785218282, "rating": 5.0, "text": "Good atmosphere, great customer service, and clean looking store.", "pics": null, "resp": {"time": 1459787853732, "text": "Thank you so much for taking the time to leave a Five Star Review, Jlbass72. iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108590446326580525081", "name": "Father Goat", "time": 1518314958488, "rating": 5.0, "text": "Kj is amazing😂", "pics": null, "resp": {"time": 1521496930405, "text": "Hey Christian, hope all is well!\n\nThank you for taking your time and leaving this five star review. iFixandRepair appreciates your business.\n\nWe would also like to invite you to follow us on Facebook @ifarwiregrass .\n\nRemember we got really good promos and we wouldn't want you to miss out on them.\n\nCheers!\n#iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103504037824120406941", "name": "Emma Daniel", "time": 1530318938145, "rating": 5.0, "text": "Eric was lit. Cool dude.", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117934838216007959184", "name": "Stephen Davis", "time": 1533864549019, "rating": 5.0, "text": "Eric is awesome!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102636999579458033454", "name": "Dianna Thomas", "time": 1488052937627, "rating": 5.0, "text": "Kj did an amazing job with the phone. Highly recommend!!!!!!!!", "pics": null, "resp": {"time": 1488207636599, "text": "Dianna. Thank you for giving us a perfect rating and for recommending #iFixandRepair We´re sure our entire staff enjoyed helping to fix your device. Take care!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108182061348425341879", "name": "Mr Slong", "time": 1561679284400, "rating": 5.0, "text": "Best in town by far", "pics": null, "resp": {"time": 1562189043519, "text": "Thank you very much."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113539961969384002500", "name": "Matthew Murphy", "time": 1532795330645, "rating": 5.0, "text": "She was very fast and friendly", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "115889859870341698165", "name": "michael steger", "time": 1514342807688, "rating": 5.0, "text": "KJ.... helped us out when no other place could", "pics": null, "resp": {"time": 1514384866431, "text": "Thanks for letting us know about KJ, we appreciate the time you take to share with us your experience, this is great! Have a very nice day."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102367825168111697812", "name": "Sallie Garrson", "time": 1527958188599, "rating": 5.0, "text": "Wonderful service and quick turnaround.", "pics": null, "resp": {"time": 1528400839178, "text": "Hey Sallie, hope all is well!\n\nWe understand how important time can be and it means so much that our customers notice the dedication we put into efficiency.\n\niFixandRepair wants to thank you for this honest review.\n\nEven though we have repaired your device, we would like to keep in touch.\n\nTo enjoy our really low prices, don't forget to follow us on Facebook @ifarwiregrass\n\nHave a good day!\n\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108744076250734716487", "name": "Chad Cornell", "time": 1465331010964, "rating": 5.0, "text": "Had a great experience the staff was awesome and quick with repairs", "pics": null, "resp": {"time": 1465398943470, "text": "Chad. Thank you for giving us a perfect rating and for recommending #iFixandRepair to other users.  We´re sure our entire staff enjoyed helping to fix your device. Take care!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108020580342845964122", "name": "kate andrews", "time": 1485990983089, "rating": 5.0, "text": "kj did great job. fast service!!!!!!", "pics": null, "resp": {"time": 1486131274029, "text": "Thank you so much for taking the time to leave a Five Star Review, Kate.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114715366963594762339", "name": "Allen Killjoy", "time": 1498516223080, "rating": 5.0, "text": "Cayce was awesome, quick and efficient", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102354306362790529975", "name": "joseph arnold", "time": 1488586222751, "rating": 5.0, "text": "Kj did an amazing job", "pics": null, "resp": {"time": 1488812806252, "text": "Joseph. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113435193957040713328", "name": "Deo Sherrod", "time": 1520733287052, "rating": 5.0, "text": "KJ excellent customer service and repair!!!!", "pics": null, "resp": {"time": 1521497524922, "text": "Hey Deo, we hope all is well.\n\nThank you for taking your time and sharing your experience! Wow!! Our team here at iFixandRepair is thrilled to hear such positive  feedback about one of our employees. We'll make sure to give the store recognition from this compliment.\n\nEven though we have repaired your device, we would like to keep in touch.\n\nTo enjoy our really low prices, don't forget to follow us on Facebook @ifarwiregrass .\n\nCheers!\n#iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "100314944601800345111", "name": "Brett F", "time": 1514682174772, "rating": 5.0, "text": "KJ was very helpful when we needed an assist on an iPhone problem.", "pics": null, "resp": {"time": 1515179827487, "text": "Dear Brett, we're so glad to hear KJ provided an outstanding service!\nHere at iFixandRepair we work really hard to offer the best technology customer service there is. We'll make sure KJ gets recognition from this. Also, did you know we have social media where you can keep track of our products, and tech tips? Here is our Facebook and Instagram page  @ifixandrepairofficial\nNext time we hear from you we hope is with a follow!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114841052494881155891", "name": "Jordan Gilley", "time": 1525833916089, "rating": 5.0, "text": "Kj thanks for the help", "pics": null, "resp": {"time": 1521497340653, "text": "Hey Jordan, we hope all is well.\n\nThank you for taking your time and sharing your experience! Wow!! Our team here at iFixandRepair is thrilled to hear such positive  feedback about one of our employees. We'll make sure to give the store recognition from this compliment.\n\nEven though we have repaired your device, we would like to keep in touch.\n\nTo enjoy our really low prices, don't forget to follow us on Facebook @ifarwiregrass .\n\nCheers!\n#iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "107738797811757199891", "name": "Jo Anna Jordan", "time": 1524855597905, "rating": 5.0, "text": "Kj is the king service!!!!", "pics": null, "resp": {"time": 1527356113791, "text": "Jo Anna, thank you so much for taking the time to leave this great review!.\n\nHere at iFixandrepair, our dedicated staff works very diligently to make sure you love our work. This provides us with great encouragement to keep doing what we do!\n\nWe'll make sure the store and KJ gets recognition from this!!\n\nPlease do visit again, we'd love to have you as a customer.\nDon't forget to follow us on Facebook @ifarwiregrass\n\nHave a good day!\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "101914571892345582518", "name": "Dwyane Randall", "time": 1524685575229, "rating": 5.0, "text": "Excellent service", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102250495017914898805", "name": "Jp Wilson", "time": 1540086863337, "rating": 5.0, "text": "Marissa was a huge help.", "pics": null, "resp": {"time": 1540402158478, "text": "Jp, thank you for this awesome review. We'll make sure the store and Marissa gets recognition from this. Don't forget to follow us on Facebook @ifarwiregrass."}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113051685655205507250", "name": "Jesse Bryson", "time": 1520037755710, "rating": 5.0, "text": "KJ is the man!!!!!!!!!!!", "pics": null, "resp": {"time": 1521497328141, "text": "Hey Jesse, we hope all is well.\n\nThank you for taking your time and sharing your experience! Wow!! Our team here at iFixandRepair is thrilled to hear such positive  feedback about one of our employees. We'll make sure to give the store recognition from this compliment.\n\nEven though we have repaired your device, we would like to keep in touch.\n\nTo enjoy our really low prices, don't forget to follow us on Facebook @ifarwiregrass .\n\nCheers!\n#iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103836708130330232562", "name": "Adam Collins", "time": 1543371045829, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103991760313852055034", "name": "Mary Beth", "time": 1516482247845, "rating": 5.0, "text": "Kj is awesome very helpful!!!!!!!", "pics": null, "resp": {"time": 1518125122235, "text": "Mary, thank you for this great review and mentioning our good work!\nHere at iFixandRepair we are thrilled to hear good comments like this.\nDid you know we have social media where you can keep track of our products, and tech tips? Here is our Facebook and Instagram page  @ifixandrepairofficial\nMake sure you give us a follow and tell your friends about it!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117206979656598110126", "name": "Wesley Hale", "time": 1512434187754, "rating": 5.0, "text": "KJ did great work", "pics": null, "resp": {"time": 1512485077070, "text": "We appreciate it so much, this is awesome!!!!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112350245069650094780", "name": "Bryce Walters", "time": 1527633414566, "rating": 5.0, "text": "I needed a couple small screws and Adam helped even though it was an odd request I'll come back if I need my phone fixed", "pics": null, "resp": {"time": 1527718537033, "text": "Hey Bryce, hope all is well!\n\nWe understand how important time can be and it means so much that our customers notice the dedication we put into efficiency.\n\niFixandRepair wants to thank you for this honest review.\n\nEven though we have repaired your device, we would like to keep in touch.\n\nTo enjoy our really low prices, don't forget to follow us on Facebook @ifarwiregrass.\n\nHave a good day!\n\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106965565977097044958", "name": "Mandy Bost", "time": 1511048911174, "rating": 5.0, "text": "KJ awesome job!!!!!!thanks!!!!", "pics": null, "resp": {"time": 1511194520353, "text": "Good morning Mandy,\n\nWe appreciate it so much!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112647252125753818321", "name": "devin louder", "time": 1508458121405, "rating": 5.0, "text": "Kj is dope", "pics": null, "resp": {"time": 1508511447577, "text": "That's awesome, we love you had a great experience on our store. Please come back anytime!!!!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114276889678318960504", "name": "Shelia Clifton", "time": 1530326473389, "rating": 5.0, "text": "Eric was great!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "108454592242062971610", "name": "Bandrunna Gotti", "time": 1523573834443, "rating": 5.0, "text": "KJ is the man 💯💯💯💯", "pics": null, "resp": {"time": 1527355841714, "text": "Jaylan, thank you so much for taking the time to leave this great review!.\n\nHere at iFixandrepair, our dedicated staff works very diligently to make sure you love our work. This provides us with great encouragement to keep doing what we do!\n\nWe'll make sure the store and KJ gets recognition from this!!\n\nPlease do visit again, we'd love to have you as a customer.\nDon't forget to follow us on Facebook @ifarwiregrass\n\nHave a good day!\n#iFixandRepairLove\n#WeCanFixIt"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "118393946068344002754", "name": "Laura Kubica", "time": 1504224020511, "rating": 5.0, "text": "Kj fabulous service!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112628567795480541157", "name": "Cindy Hulen", "time": 1503949880383, "rating": 5.0, "text": "KJ is absolutely awesome!!!!!", "pics": null, "resp": {"time": 1503951149067, "text": "Good morning Cindy,\n\nThanks for submitting your review. We are happy you had the best experience with us. Hope to see you gain!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104666907775208334682", "name": "Paige Watson", "time": 1499120586662, "rating": 5.0, "text": "KJ did a good job and great service!!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111286184379313676754", "name": "ThatGuyInRed", "time": 1495493863885, "rating": 5.0, "text": "KJ service was great and dope!!!!!!!! I give him a 10!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "115702660761034292301", "name": "Sarah Flynn", "time": 1494901068631, "rating": 5.0, "text": "KJ stayed longer to fix my phone!!!! THANK YOU!!!! A+++++++*** SERVICE!!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "110392864956622594031", "name": "Enedina Garcia", "time": 1511396448133, "rating": 5.0, "text": "Kj good job!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103262683021467591452", "name": "Shetavia’s Arcadia", "time": 1494031343222, "rating": 5.0, "text": "Kj was awesome. Awesome service!!!!!!", "pics": null, "resp": {"time": 1494254937877, "text": "Thank you so much for taking the time to leave a Five Star Review, Tays. We appreciate the opportunity to repair your device and look forward to helping you again in the future. Thank you!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114228395007423854937", "name": "Brittany Gray", "time": 1493082210121, "rating": 5.0, "text": "Kj fixed my phone real fast!!!! Thank you Kj!!!!!!@@", "pics": null, "resp": {"time": 1493130482865, "text": "Brittany. We appreciate your positive feedback about us. We are always providing the best for our customers. If you're traveling to our area again soon, don't hesitate to call us.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113612066834994348808", "name": "Scarlett Riley", "time": 1492474326108, "rating": 5.0, "text": "KJ awesome service!", "pics": null, "resp": {"time": 1492527127945, "text": "Thank you so much for taking the time to leave a Five Star Review, Derron and Scarlett.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "113740704252118457358", "name": "Alec Davis", "time": 1508804378339, "rating": 5.0, "text": "Kj is the man", "pics": null, "resp": {"time": 1508854824597, "text": "Thanks for submitting your review, we appreciate it so much, nice :D"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "100752683266072962220", "name": "Krystal Levatt", "time": 1507946229659, "rating": 5.0, "text": "KJ IS AWSUUUUUUUUUUMMMMMMM!!!!!!!!!", "pics": null, "resp": {"time": 1507992408815, "text": "That's so wonderful, we love you enjoy your visit at our store. Thanks!"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "103781552101622773208", "name": "Murad Khan", "time": 1483392986460, "rating": 5.0, "text": "Kj is awesome.", "pics": null, "resp": {"time": 1483459409553, "text": "Murad Khan. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "117225304637519972326", "name": "Ja'lia Watkins", "time": 1517876969588, "rating": 5.0, "text": "Kj fixed while he had the flu!!!💪🏻", "pics": null, "resp": {"time": 1518125221167, "text": "Ja'lia, thank you for this great review and mentioning our efficiency!\nOur team here at iFixandRepair is thrilled to hear such positive  feedback and we’re proud to be one of the top leading tech repair franchises in USA. Did you know we have social media where you can keep track of our products, and tech tips? Here is our Facebook and Instagram page  @ifixandrepairofficial\nNext time we hear from you we hope is with a follow!\nWishing you a great star of the year. #iFixandRepairLove"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "111103986716180716493", "name": "Stephen Baine", "time": 1486777518695, "rating": 5.0, "text": "KJ rocks", "pics": null, "resp": {"time": 1486995904364, "text": "Stephen, thanks for choosing us -- it's seriously awesome to know you were so well taken care of, because that's all you deserve! We appreciate the kind words, and hope you know that we're always here should you need us in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "110709236616196890733", "name": "Scott Lewis (7slotadventures)", "time": 1485998914233, "rating": 5.0, "text": "Kj rox!!!", "pics": null, "resp": {"time": 1486131314670, "text": "Scott. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "102937054067590106400", "name": "Tommy Eldridge", "time": 1484961233492, "rating": 5.0, "text": "Kj great customer service!!!!! Number 1!!!!!!", "pics": null, "resp": {"time": 1485016772057, "text": "Tommy. Thank you for your review and for choosing us. We´re happy that you enjoyed our customer service and We´re looking forward to having you again in the future.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114639718121633166848", "name": "Sean McKeague", "time": 1466119104679, "rating": 5.0, "text": "Great job", "pics": null, "resp": {"time": 1466198531076, "text": "Thank you so much for taking the time to leave a Five Star Review, Sean.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112812300581169927422", "name": "Dawauntae Wilson", "time": 1466081968991, "rating": 2.0, "text": "i took an iphone 4 there and after a certain amount of days if something happens to your phone or device they will not fix unless you pay again terrible!!", "pics": null, "resp": {"time": 1466089400526, "text": "Hello Dawauntae Wilson  I’m sorry to hear about your bad experience. Your disappointment is our disappointment. You deserve to be provided with a completely efficient, professional, value-for-money experience each time you stop by, and we'd like to wholeheartedly apologize for falling short of your expectations. Feel free to write us at info@ifixandrepair.com with your invoice number (and store location of repair) or leave us your email. We will be glad to have someone contact you to see if there is anything we can do to help. Have a great day and we look forward to chatting soon. - Team iFixandRepair"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "105075958498172378396", "name": "alex bellamy", "time": 1463705744640, "rating": 5.0, "text": "AWESOME!!!!", "pics": null, "resp": {"time": 1463751601335, "text": "Thank you so much for taking the time to leave a Five Star Review, Alex. iFixandRepair - Wiregrass Common Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "114164676337505979900", "name": "Quez", "time": 1463611878409, "rating": 4.0, "text": "They work fast", "pics": null, "resp": {"time": 1463687411191, "text": "Thank you so much for taking the time to leave a Five Star Review, Mark. iFixandRepair - Wiregrass Common Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "104681466216099563647", "name": "India Mcnealy", "time": 1459618841678, "rating": 5.0, "text": "MY SCREE WAS A MESS AND I TOOK INTO THERE STORE AND THEY FIXED IT IN NO TIME, SO FAR IM PLEASED", "pics": null, "resp": {"time": 1459787573893, "text": "Thank you so much for taking the time to leave a Five Star Review, India! We appreciate the opportunity to repair your device and we hope to help you again in the future.  We know your time is valuable so again....Thank you!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "106337002804342334748", "name": "Alex Blevins", "time": 1474054869642, "rating": 5.0, "text": "Kj give me outstanding service!!!! If i need further service, he will be the one to seek out!!!!!", "pics": null, "resp": {"time": 1474310907109, "text": "Thank you so much for taking the time to leave a Five Star Review, Alex.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112990452987026465690", "name": "Sabrina Ward", "time": 1468513761256, "rating": 5.0, "text": "Great service very nice and helpful", "pics": null, "resp": {"time": 1468594500540, "text": "Thank you so much for taking the time to leave a Five Star Review, Sabrina.\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112780608702407651517", "name": "Ronald Pugh", "time": 1466632590060, "rating": 5.0, "text": "Very helpful, great service and sense of humor!", "pics": null, "resp": {"time": 1466692233899, "text": "Ronald. Thank you for giving us a perfect rating.  We´re sure our entire staff enjoyed helping to fix your device. Take care! iFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "118418736065163285902", "name": "KJ Vega", "time": 1462578375340, "rating": 5.0, "text": "Love this store", "pics": null, "resp": {"time": 1462806434289, "text": "Thank you so much for taking the time to leave a Five Star Review, Kathy. iFixandRepair - Wiregrass Common Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "109339270891051008733", "name": "Marissa Gagliano", "time": 1453334072898, "rating": 4.0, "text": "Quick repairs, under new management.", "pics": null, "resp": {"time": 1455916053167, "text": "Thank you so much for taking the time to leave a Five Star Review, Rissa G.  We appreciate the opportunity to repair your device and look forward to helping you again in the future.  Thank you!\n\niFixandRepair - Wiregrass Commons Mall\n(334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
{"user_id": "112476124797853447102", "name": "Mike Bozeman", "time": 1377894010193, "rating": 5.0, "text": "Great folks, fast repairs, very helpful!!!! 5 *****", "pics": null, "resp": {"time": 1462910994183, "text": "Thank you so much for taking the time to leave a Five Star Review, Mike. We appreciate the opportunity to repair your device and look forward to helping you again in the future. Thank you!\niFixandRepair - Wiregrass Commons Mall (334) 357-6349"}, "gmap_id": "0x889292125aff38e7:0x6260c591fe0e3f11"}
