{"user_id": "100562186329956044322", "name": "Sarah Antonelli", "time": 1630075830265, "rating": 5.0, "text": "We had All Safe Inspections inspect four houses for us.  Doug was very timely, professional, and his reports were very detailed.  He did a great job.", "pics": null, "resp": {"time": 1630175154086, "text": "Thank you Sarah for the review and kind words."}, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "109629247999484870101", "name": "Malcolm Jacobs", "time": 1609371661922, "rating": 5.0, "text": "Very informative, Doug did a great job.", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "115818931647662559323", "name": "Michael Matheny", "time": 1569588627230, "rating": 5.0, "text": "If you want thorough and professional service.....Doug is your guy. He works for the homeowners best interest and is safety conscience. I highly recommend him for all your inspection needs!", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "102862379235376780378", "name": "Diesel Alegrand", "time": 1568410232276, "rating": 5.0, "text": "A big thank you to Chris for doing my home inspection. Chris was incredibly responding to The timing of the inspection and was very detailed. I would highly recommend using allsafe  services for your home Inspection. 👍👍👍", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "105121331409730241866", "name": "Christina Patterson", "time": 1559166647590, "rating": 5.0, "text": "Doug was \"hands down\" a great help with our home and structural inspections. He was very professional, thorough, prompt and kind. I highly recommend him to anyone. Thanks for all of your help.", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "105804226500707038098", "name": "Al Bradford", "time": 1532442387610, "rating": 5.0, "text": "All Safe Inspections provided assistance in determining the condition of homes, under consideration for purchase, that would not be visible or identifiable to the buyer. Items were identified in either a positive or negative light for the buyer. Doug Thornton, inspector,chief was extremely easy to work with and made the inspection process clear and understandable. I will definitely recommend All Safe Inspections to all my friends and family desiring to purchase a home in the Montgomery, Alabama area.", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "111072128514318301084", "name": "Rob Anderson", "time": 1538163870486, "rating": 5.0, "text": "Mr. Thornton was incredibly responsive to all my emails, very thorough, and priced reasonably. I would highly recommend using his services for your home inspection needs!", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "107497760964233445597", "name": "Kayla J Brown", "time": 1532536122212, "rating": 5.0, "text": "I was referred to use Doug Thornton as my home inspector by a coworker and was not disappointed. He was very thorough in his report and helped me negotiate items to be fixed in my home before purchase. Definitely would recommend him!", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "112436989812886881297", "name": "Hannah Thornton", "time": 1569637598705, "rating": 5.0, "text": "Best inspector your find in the tri-county area!", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "108270056495968577919", "name": "J M", "time": 1566263011568, "rating": 5.0, "text": "We've used this company for several homes. Very thorough and complete with aerial pics.", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "109711361592251142133", "name": "Alicia Da Twincesses Mommy", "time": 1526745589233, "rating": 5.0, "text": "Friendly, Detailed, and Thorough", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "111375603342594806671", "name": "Tammy Hollingsworth", "time": 1616622665622, "rating": 5.0, "text": "I am so grateful that my Realtor recommended this company!  The response was fast, the employee's were on time, polite and extremely professional.  The work was completed as promised and the area was left extremely clean after they finished.  This company thought of every little detail and completed the work exactly like the Structual Engineer wanted his drawings.", "pics": null, "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "109186440012422279427", "name": "Lauren Murphy", "time": 1616415968860, "rating": 5.0, "text": "Southern Home Structural has always given me piece of mind when is comes to major foundation issues in my own home and all of my client’s homes. They are always professional and reliable. I know I can always trust their work!", "pics": null, "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "109700150407783453643", "name": "Nicholas Koe", "time": 1592848109759, "rating": 5.0, "text": "Mr. Caudle and his team installed (2) tie-back rods into one of my retaining walls that was beginning to lean. Although I didn't observe the installation, the work was performed quickly and Mr. Caudle returned to my residence after completion to ensure I was satisfied. I noticed how unsightly the rods were and Mr. Caudle had them painted to be slightly less noticeable. Planting hedges will do the rest. Overall, I am very pleased with Mr. Caudle and his work.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO53ZiICNAAB_e_bodIpOiXw3N0h9FCwCtpzH9j=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "103516139791677304285", "name": "Matt S", "time": 1616359824949, "rating": 5.0, "text": "Extremely prompt response to my inquiries and very knowledgeable.  Thanks for your help!", "pics": null, "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "100790669450779826183", "name": "Clay A. McCollum", "time": 1596648609999, "rating": 5.0, "text": "I highly recommend Matt and the entire team! They were always prompt and on time, and I always felt like a priority. They had done some work for a previous owner in 2003, then in 2020 finished the job for me. Reasonable prices and customer focused. I had moisture coming into the house as well, and their work stopped that. Remain happy with the work.", "pics": null, "resp": {"time": 1597171271557, "text": "Clay, thanks for taking the time to leave us a review.  We are glad that we were able to resolve the moisture issue.  We wish you and your home the best!"}, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "117020321952121598410", "name": "Time Machine", "time": 1610863836854, "rating": 1.0, "text": "I’m in Lineville, AL. My first inspection appointment was in early July 2020. Matt showed up to inspect and was very polite but was unable to inspect entire crawl space because of narrow clearance. He took pictures and measurements and recommended some things we could do to make the foundation more secure. I was told to expect a quote with pictures on Monday. After not hearing anything from him for 3 MONTHS after emailing him through the website and leaving messages on the office answering machine. I Finally heard back from Matt on October 14th, and I agreed to another inspection with him bringing along another smaller sized worker that would be able to inspect the entire crawl space. Second inspection was November 5th 2020, they were very polite and found a few more things that could be improved. I was told to expect a quote on Friday. It is now January 17th and I have not heard anything from this company. Very frustrating and I will not be using them in the future.", "pics": null, "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "104805819854497959953", "name": "harrykat 0ne", "time": 1532618686478, "rating": 5.0, "text": "This  business is the absolute best! Garland and his crew were efficient, on time, did the work promised and cleaned up when they left. I thought the basement wall was un-repairable, but after they worked their magic ....it might be the best room in the house. It is really unbelievable what a great job they did. Would highly recommend this company for any size job!     Jeff", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMwF2Mo_qxAkSMnr2IUQokJRFGBhRvaZ0zKXbpk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO2OCr0RnqXgURhc6rUE8YPmgaYNMDFBuzRa7Mj=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "116531250599788074647", "name": "Carrie Richardson", "time": 1603120303964, "rating": 5.0, "text": "Always professional, honest and helpful. Very thankful for their solutions! I’ve used Matt and his team twice now personally.", "pics": null, "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "101889260437742836043", "name": "Jennifer Johnson", "time": 1594857490165, "rating": 5.0, "text": "I highly recommend Matt Caudle and his team. They were a pleasure to work with! That is really saying something, given the gravity of my foundation Issues.\nThe foundation was cracking, racking, and flooding with every rain. The repair was not a straightforward job, as the damage was really severe.\nMatt walked me through the entire process with excellent communication. He is trustworthy and honest.\nWhen the Sheetrock was removed and wall fully exposed, A major prior attempt to repair wall was revealed.  Bulging of wall was significant.\nMatt and team made a plan to remove existing wall supports by section, ensuring the safety of the project.\n5 Additional steel beams were needed, for a total of 13 Steel beams and 10 helical tie backs.  The ability to problem solve and secure the wall in this state was impressive. I was very pleased with the way the whole repair was handled.  The end result looks very nice!\nMatt gave me an unexpected discount on the additional beams, which was going a step beyond.\nThe excellent communication with Matt and team made even this “difficult” job go smoothly.\nThe crew arrived daily on time, worked hard, and the job was completed in the stated time frame.\nMatt and his dad have built a company that does excellent work and truly cares about the customer.\nI would recommend them to any friend or family member. Thank you Matt Caudle and team!", "pics": null, "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "116507683392335394804", "name": "Peter Baren", "time": 1582942184249, "rating": 5.0, "text": "I had some moisture in basement cracks after recent heavy rains; a friend recommended Garland Caudle. Garland came over the very next day, after hours due to my schedule, he diagnosed the problem as a gutter issue and not a foundation problem. He could have claimed the cracks needed work but he was honest and did not charge me at all. I highly recommend Garland for his skill and his honesty.", "pics": null, "resp": {"time": 1584389221442, "text": "Hey Peter! Thank you for your feedback! We pride our business on having highly dependent, honest employees. We hope to do business again in the future."}, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "102160428086093406574", "name": "Joel Cannon", "time": 1568722848452, "rating": 5.0, "text": "I have engaged with Southern Home Structural Specialists for two projects now.  Matt Caudle and his team are very professional and do great work for a reasonable price.  It's refreshing to work with a contractor who shows up when he says he will and gets the job done.  My most recent need had a short fuse.  I know how busy these guys are and Matt was able to quickly come out to my house, assess the need, propose a plan, and get the work done in time for my deadline.  I would highly recommend Matt and the rest of the Southern Home team for your home foundation needs.", "pics": null, "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "116424911007789560160", "name": "Austill Barrett", "time": 1565478376727, "rating": 5.0, "text": "Matt came to out to look at our foundation after another company suggested we should spend $26,000 for foundation repairs. Matt explained what needed to be done to remedy the problem, offering to do the project for a SIGNIFICANTLY lower price. He then taught my husband exactly how to fix the problem if he preferred to do it himself. He was efficient, knowledgeable, and honest, which is hard to come by. Highly recommend using this company and Matt!", "pics": null, "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "107387173375711575364", "name": "Timothy Richey", "time": 1583872045994, "rating": 5.0, "text": "Didn't use their services. But I did get a flat tire next to their building and the workers came over and asked if I need any help or some air for the tire. Unfortunately the tire was shredded due to a pothole, but they still asked and wanted to help and that says something. Good people", "pics": null, "resp": {"time": 1584389288721, "text": "Hi Timothy! We're so sorry to hear about the flat tire, that's a huge bummer! We appreciate you taking the time to leave feedback regardless of receiving service or not. We'd love to work with you in the future."}, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "115480924815641444283", "name": "David Villanueva", "time": 1589498204780, "rating": 5.0, "text": "Garland came the same day, assured me I did not have a structural problem, showed me ways to improve water runoff myself, and referred me to a mason without charging me for his expertise. Very impressed!", "pics": null, "resp": {"time": 1590432002879, "text": "Thanks, David!  We are glad that Garland was able to help you with your structural needs.  We wish you the best!"}, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "108904904359935788201", "name": "Garland Caudle", "time": 1489785634905, "rating": 5.0, "text": "RESPONSE TO MR. JAMES MARDIS REVIEW: Southern-Home Structural Specialists was employed to stabilize a rear corner of the foundation wall that had settled prior to the purchase of the home by Mr. Mardis. Shortly after Mr. Mardis did purchase & move into the home, he called and stated that we had damaged the drain line and causing water to enter into the basement through the wall. This could only be his assumption due to the fact that the drain line was buried and covered with soil and not visible to see the assumed damages. Once the soil was removed and the wall exposed, by a waterproofing contractor hired by Mr. Mardis, there were no visble damaged to the wall or drain line. However, there was a visble horizontal crack more than 10 feet in length within the wall which is consistent with soil shrinkage allowing a foundation wall to settle. The waterproofing contractor stated the foundation wall & the water drain lines were not damaged by our company and that the horizontal crack was the entry point of the water. After viewing the photographs, a local Structural Engineer stated that the crack within the wall was indeed an ongoing settlement problem and a entry point for water seepage into the  basement even prior to Mr. Mardis purchase of the home. He felt that the water seepage into the basement may have been a pre-existing condition prior to the home purchase and was not caused by the recent foundation wall repairs performed by this company.\nAgain , this company does regret that Mr. Mardis purchased a home with pre-existing water entry conditions, and feel that his assumed negative customer referral comments were not valid or truthful.\n\nGarland Caudle, Proprietor", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOjWx-X6PzIJZQ3wTiliqShz5N4LpPHiPMsFsuW=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "100464838691526951960", "name": "James Rutherford", "time": 1571417372101, "rating": 5.0, "text": "Southern Home Structural have done 15 projects for my company over the past 4 years. Matt and his father constantly come in on budget and on schedule. The relationship however is the most important aspect of their business, they treat everyone with respect and are diligent with making sure the work/project is done to the specifications given, but typically go beyond to ensure their warranted work. I don’t call anyone else and nor should you.", "pics": null, "resp": {"time": 1582744810990, "text": "Hi James! Thank you for taking the time to write this, we appreciate any and all feedback! We always want to build a genuine relationship with our clients. We look forward to working with you again soon!"}, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "106224057650310460686", "name": "geniew1", "time": 1533046257043, "rating": 5.0, "text": "I highly recommend Southern Home Structural Repair for any foundation issues.  Garland and his crew performed beyond our expectations.  The price quoted was exactly what we paid with no hidden costs.  We were kept informed on every step of the repairs on our basement walls and start-to-finish everyone was friendly and respectful and never left any kind of mess to clean up.  We were particularly pleased with the metal supports they installed and feel confident that we will never have future problems in our basement.  Thank you for the peace of mind and the job well done!     Jon & Genie Woodard", "pics": null, "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "113905685463118742776", "name": "Meg Hawley", "time": 1568386869560, "rating": 5.0, "text": "Trustworthy workers. They came when they said they would come and finished on time, actually a day early. Recommend them highly.", "pics": null, "resp": {"time": 1582744993568, "text": "Hi Meg! Thank you for working with us at Southern Home. We always strive to exceed expectations. We look forward to working with you again in the future."}, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "107240873852822102108", "name": "Sam Maalouf", "time": 1570115020480, "rating": 5.0, "text": "Matt and his team did a great job. They are professionals, and showed up on time and cleaned up after they got done. I would highly recommend them.", "pics": null, "resp": {"time": 1582744892601, "text": "Sam, thank you for leaving this review. We always want to make sure our professionals arrive on time, and that our customers are satisfied with they work they do! We hope to work together again in the future."}, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "106110526533849459331", "name": "Greg Glover", "time": 1508270960152, "rating": 5.0, "text": "I live in Portland, Oregon and wanted to get an opinion on a house I was looking to purchase near Birmingham, AL. Matt was kind enough to make the 25 minute drive to look at the house and give me his opinion. Turns out the house didn't need any foundation work. Matt was honest about it and didn't even charge me for his time. He must carry a moral compass with him each day. A rare thing indeed. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "103424394194085224746", "name": "Heather Brownlee", "time": 1533143079661, "rating": 5.0, "text": "Family owned business that has been going for 20+ years! The employees are all respectful and very nice!! They don’t try to upsale you! Best prices and customer service around!  Highly recommended", "pics": null, "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "100849135583942064765", "name": "Steve Johnston", "time": 1521123623327, "rating": 5.0, "text": "The Caudles have performed several jobs for me and were always fair, on time and most professional.  They know their business and are fine people to work with.  The last job was when I was selling a home and moving out of state.  While it was likely I would not need their services again, they treated me no differently than if I were moving next door to them.", "pics": null, "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "105599503878740850864", "name": "Sarah Ball", "time": 1492184960027, "rating": 5.0, "text": "We had a crazy high repair quote from another company in town and I called Garland and he was out within 24 hours and calmed our nerves and was so patient and kind! He was able to repair our problem within a week. His crew just left and walked us through the repair after completion and were just as kind as Garland. I would recommend them 100% to anyone because foundation repairs are stressful!!! Thank you so much Southern Home!", "pics": null, "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "113598524366830888558", "name": "Blake Westbrook", "time": 1554212530808, "rating": 5.0, "text": "Garland and his team did a fantastic job!  If you have structural issues with your home, Southern Home Structural Specialist should be your only call!", "pics": null, "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "118428310904356404882", "name": "Ben Turner", "time": 1530168699055, "rating": 5.0, "text": "Very pleasant experience!\n\nWas referred to these guys by my realtor when I purchased my home.  I have 2 other estimates. One was 40% higher and the other was over 100% higher.  Both of the other estimates included work that Matt said was not necessary for our specific situation but he was willing to do the extra if I wanted to (and charge me more, lol)\n\nSeldom do you see a company who will not try to upsell you to take more of your money.\n\nThanks to Matt and the team for the great job and for making our new home safe and livable! BH", "pics": null, "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "110229326240888684445", "name": "Ashley Dempsey", "time": 1521900356091, "rating": 5.0, "text": "Very friendly people, quick turnaround, and they did a great job putting support beams under the addition in our home.", "pics": null, "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "112366013645459752684", "name": "Michael Bruce", "time": 1458765846075, "rating": 5.0, "text": "They did a great job installing a beam in the crawlspace of my house the floors now feel very solid. The crew was very professional, fast and always on time.", "pics": null, "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "112621109298339938994", "name": "Jason Mardis", "time": 1486600591725, "rating": 1.0, "text": "If you need to get foundation work done, avoid this company at all costs. The owner is rude and will never return your calls. We had work done on our house and while they were digging they broke our drainage system causing a leak in the basement. We had to go through another company fix the issue this company caused. So please use someone else, or you will regret it.", "pics": null, "resp": null, "gmap_id": "0x88891c0aec8297e9:0x6cc7560106d0b002"}
{"user_id": "117539998977259260948", "name": "Aaron Rea", "time": 1623848720519, "rating": 5.0, "text": "Alicia and Hannah are amazing!  Super fast and professional service.  A+", "pics": null, "resp": null, "gmap_id": "0x889bb4b3a35b94c7:0x6946c4fe9b502cdd"}
{"user_id": "107317983663779951558", "name": "robert darnell", "time": 1608253638514, "rating": 5.0, "text": "Great customer service! Alonzo was extremely helpful in getting our gold fortified certificate quickly. Highly recommended this company.", "pics": null, "resp": null, "gmap_id": "0x889bb4b3a35b94c7:0x6946c4fe9b502cdd"}
{"user_id": "104419019530736839483", "name": "Patrick Vowell", "time": 1617913454800, "rating": 5.0, "text": "Within one hour of posting problem Mr. LaCosta took care of issues immediately.  Thanks", "pics": null, "resp": {"time": 1617904062813, "text": "Patrick,  This is Vince LaCoste, the owner of Bethel Engineering.  I am sorry that you had this experience and I am getting to the bottom of this quickly.  I will be calling you soon."}, "gmap_id": "0x889bb4b3a35b94c7:0x6946c4fe9b502cdd"}
{"user_id": "116446613678565538923", "name": "Brian Lancaster", "time": 1599084676811, "rating": 5.0, "text": "Vince and his staff were great to work with! They were very professional and extremely responsive to all my requests and questions! I would highly recommend Bethel Engineering!", "pics": null, "resp": null, "gmap_id": "0x889bb4b3a35b94c7:0x6946c4fe9b502cdd"}
{"user_id": "114080193782483890934", "name": "Ronnie Toomey", "time": 1493407089869, "rating": 5.0, "text": "Great staff to work with.  Fast and efficient.", "pics": null, "resp": null, "gmap_id": "0x889bb4b3a35b94c7:0x6946c4fe9b502cdd"}
{"user_id": "109807495399620929802", "name": "Mark Byrd", "time": 1518486834354, "rating": 5.0, "text": "Gets it done.! Wonderful to work with.", "pics": null, "resp": {"time": 1520601442139, "text": "Thanks Mark! We appreciate you."}, "gmap_id": "0x889bb4b3a35b94c7:0x6946c4fe9b502cdd"}
{"user_id": "107949397909962746071", "name": "David Cummings", "time": 1611195804906, "rating": 4.0, "text": "Quality customer visits and professional engineers and PM's.", "pics": null, "resp": null, "gmap_id": "0x889a4fda01f25f2f:0xec0f048ea2c50a12"}
{"user_id": "112188633637164924658", "name": "D Empfield", "time": 1591372508558, "rating": 5.0, "text": "Engineering design firm in the heart of Mobile", "pics": null, "resp": null, "gmap_id": "0x889a4fda01f25f2f:0xec0f048ea2c50a12"}
{"user_id": "109644199034661765725", "name": "Eric McClure", "time": 1572560759222, "rating": 1.0, "text": "Poor customer service. Wouldn’t recommend to anyone", "pics": null, "resp": null, "gmap_id": "0x889a4fda01f25f2f:0xec0f048ea2c50a12"}
{"user_id": "103416107581467980530", "name": "Marla Billante", "time": 1518997867205, "rating": 5.0, "text": "Best Engineering Firm in Mobile!!", "pics": null, "resp": null, "gmap_id": "0x889a4fda01f25f2f:0xec0f048ea2c50a12"}
{"user_id": "117878732408209427154", "name": "Monika Glennon", "time": 1625707471935, "rating": 5.0, "text": "We just purchased our home and called Kennedy and Sons because they came highly recommended over and over by friends. We were NOT disappointed!! Once we got on their schedule,  the communication was awesome.  They sent people to fix our issue and actually checked in multiple times making sure we were happy with the work. The guys who did the work were amazing. So very professional and keeping us abreast on all they were doing.  They also were kind enough to put up with our dogs 🐕! We highly recommend Kennedy and Sons for all your structural work!!", "pics": null, "resp": {"time": 1626708834649, "text": "Thank you so much for the wonderful review! We are happy to serve and definitely appreciate your patience with our schedule."}, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "110132040127167670418", "name": "Brian Mckelvey", "time": 1620578830361, "rating": 5.0, "text": "Don Kennedy and Sons repaired the Lintel over my garage door. The lintel was sagging from the weight of the brick above the garage door. They installed a system they call 'Lintel Lift'. This was the best solution I found for a PERMANENT and good looking repair. It was also approved by my 2-10 Warranty company. Their installation team did the installation in less than a day and it looks perfect. They were professional and left my property in a clean state. I highly recommend them for this permanent solution for a sagging lintel.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM9mVO-FRdJJyJ5iCMrUKMzAQZlVSyfKQ0UPnjk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "111112907983135864233", "name": "Dr. Mitch Robertson", "time": 1627004414722, "rating": 5.0, "text": "I contacted Kennedy and Sons regarding structural issues caused by water damaged. Kennedy and Sons immediately contacted me and scheduled and appointment to assess the damage and to estimate the cost to make repairs.. After Terry Kennedy assessed the damage, he wrote a detailed estimate of the cost of repairs for me to submit to my insurance company. He met with the insurance company's adjuster, at their request, to answer their questions regarding the work to be completed. Terry Kennedy was in close contact during the process of insurance approval and the structural work. I would highly recommend Kennedy and Sons.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "117320334583118395599", "name": "Hannah", "time": 1611677962658, "rating": 5.0, "text": "Josh and Kyle at Don Kennedy and Sons and their team did an installation of a foundation pier system and exterior drain tile system to reinforce the exterior of our home against further settling and damage and move water away from that area. The whole team was very efficient and extremely hard working. We had to adjust the plan a bit as digging revealed issues that could not have been foreseen, the whole team was flexible and rolled with the punches to get the installation completed and make sure it would function well in the long term. We would certainly call them again if we needed their services in the future.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "118292718622778837651", "name": "Heather Woodard", "time": 1610397295889, "rating": 5.0, "text": "Was very impressed with the professionalism and help that Ian provided me with over the phone. I felt like an appreciated customer and will definitely continue to do business with this company!", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "102593765492540195918", "name": "Len Burton", "time": 1610404250280, "rating": 5.0, "text": "I called to get an evaluation for my foundation. Ian was professional and courteous while setting up my appointment, and answered all questions I had about the process and pricing. The team was quick and professional.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "105707572891702091059", "name": "Li Major", "time": 1605753976502, "rating": 4.0, "text": "We were very pleased with the quality of the foundation repair and lintel lift service.  The entire team - Tim, Adam, Kyle, Diego and Alex - were very professional and pleasant!  We highly recommend Don Kennedy and Sons Structural Solutions.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "112683094645672734449", "name": "Brandi Taylor", "time": 1610398116863, "rating": 5.0, "text": "Ian was super helpful and friendly. He was able to answer all my questions and help me figure out a solution to my problem. Highly recommend Fon Kennedy and Sons!", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "111103086827134936586", "name": "Tim Knox", "time": 1571748550244, "rating": 5.0, "text": "As a residential real estate agent my clients are faced with structural issues all the time. There is one company that I call and that is Kennedy & Sons. They are responsive, professional, and I can always count on them to be honest and reliable. When I show my clients a report with the Kennedy & Sons name on it they know they've been served by the best and can rely on the results. I highly recommend Jeff and his team for any structural issues your home may have.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "111228370924005596005", "name": "Dakota Hancock", "time": 1610396387399, "rating": 5.0, "text": "Great price, great people, and great work all around.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "112218458870077815689", "name": "Teri Hunt", "time": 1558627591975, "rating": 5.0, "text": "Kennedy and Sons performed foundation work on my home 15 years ago and did a terrific job. In the process of selling my home the inspector recommended an analysis by a structural engineer. I called Kennedy and Sons and, at no charge and within 48 hours, they sent Grant Collins to assess my home. Grant was very professional, courteous and clearly competent. I highly recommend Grant and Kennedy and Sons for this type of work. They are very good to work with and they stand by their work (even when 15 years have elapsed!).", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "107813139176715633834", "name": "Savannah Ann Bull", "time": 1557238335894, "rating": 5.0, "text": "Just wanted to pass on huge kudos to your representative Grant who came out to a house we are looking to buy yesterday.  What a professional and what a nice guy!  He really put us in our comfort zone by telling us the house - basement and crawlspace - was in great shape, tight, no issues.  He did not try to sell us on things we do not need - very hard to find these days!  Grant is an honest and professional broker who WELL represents your company.  He gained you a future client yesterday as we will be back on other properties as we are real estate investors!", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "110214647509746543384", "name": "Tim Lewis", "time": 1549484841387, "rating": 5.0, "text": "Don Kennedy and Sons has worked on my house twice.  The first time it was to correct a foundation \"repair\" that was botched by another company who would not cover their work.  Kennedy and Sons excavated the old work and tied the piers and our foundation to deep rocks in the mountain, and that part of our house has been solid ever since.  Unfortunately, a different corner of our house needed repair a couple years later, and I called Kennedy and Sons again.  They put in push piers and again tied the foundation to deep rocks.  It remains to be seen how this new work will stand the test of time, but based on the prior work, I'm confident that it will.  The price on the work was very good, and they got to it quickly and were done within a week.  They didn't mess up my property.  When they left, it was surprising to me how well they covered their work, given the amount of digging they'd done.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "110715824806642227132", "name": "Drew Helveston", "time": 1557115709079, "rating": 5.0, "text": "My wife and I are selling our house and we wanted to see if there were any issues with the foundation.  A friend referred us to Kennedy and Sons Structural Solutions.  My wife called to make an appointment.  They were able to come out the following day which was amazing.  The technician who came out to our house was Grant Collins.  He arrived on time and was a joy to work with.  He took time to listen to our needs, questions, and thoughts.  After he was able to inspect the house, he met back with me and discussed his thoughts regarding our house.  He had his report emailed by the following day.   So to sum it up.  Within three days, we were able to get in touch with a expert who looked over our house, answered our questions, and sent us an emailed report.   Grant is the man and someone we would (and will) definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "118128964199815283879", "name": "Tara Gibson", "time": 1591462454200, "rating": 1.0, "text": "This is a HORRIBLE company to work with. They did $20,000 worth of work that I later found out I could have had done for $5,000 - my bad, but I was trying to go with a \"reputable\" company and have a so called lifetime warranty for any future homeowners that bought my home. Now they \"can't find where they ever did any work on my home\" . And was told that they don't want to be held liable because they can't find where they ever did the work.  Do not use this company. You WILL REGRET IT", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "117054355822473310748", "name": "Lioubov Florinskaia", "time": 1601502298856, "rating": 2.0, "text": "Didn't do the job right the first time. Took almost a month,  dozens of emails and phone calls to get them to finish.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "113923014045986528483", "name": "Frankie Cole (snowjr21)", "time": 1557231374655, "rating": 4.0, "text": "I was referred to Don Kennedy and Sons by my selling agent to address foundation issues with the house. It was very pleasant working with them from start to finish on my repairs. All of my questions were answered and the work was completed on schedule and for a reasonable cost. Will certainly recommend them to friends and family for any foundation needs!", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "106810739486359309562", "name": "Kelly Wells", "time": 1583769703167, "rating": 5.0, "text": "I had the best experience with Kennedy and Sons. I purchased a rental house with horrible sagging floors and they were able to raise all of the floors to where they were originally.. On top of that, they guaranteed the work to keep my floors level from settling for 25 YEARS!!!  They kept in contact with me the entire time.  I will only use Kennedy and Sons in the future. They are very honest and they care about customer satisfaction. Prior to hiring them, I had a horrible experience with AFS. Kennedy and Sons came to my rescue!!", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "104795885671131455458", "name": "Jeff Simmons", "time": 1571920993839, "rating": 5.0, "text": "I had another foundation company come and worked in my basement. Afterwards I started having moisture and efflorescence appear on the floor. I need another opinion and advice so I called Don Kennedy and Sons. They were great to work with and very knowledgeable. Gave me several recommendations and even looked outside the house and found several areas of concern that I did not know. Thanks so much", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "111679696567079981021", "name": "James Wyatt", "time": 1490989456189, "rating": 5.0, "text": "I have to say that I am genuinely impressed with Kennedy and Sons Structural Solutions. Very innovative and, from what I can tell, a leader in the industry.  I believe their name sums it up.\nOur neighbors hired Kennedy to work on their foundation last fall, and we ended up hiring them to fix the droop in the brick above our garage door that had been getting consistently worse for several years. We got estimates from two other companies and the prices were not that far apart.  The reason we chose to go with Kennedy was because of the technique proposed.  As an engineer, it just made the most sense to me. The repair was minimally invasive and took only a few days.  It is hard to find honest and reliable contractors these days, but that is what we found in Kennedy.  The finished product is better than we expected.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "118135244015187831778", "name": "Michael Osborn", "time": 1585672631714, "rating": 1.0, "text": "Don Kennedy was extremely rude when issues came up and did a very poor job in communicating with me. For the amount of money you are paying a foundation company, you expect great service and these guys will not deliver.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "114268081613676206788", "name": "benjamin rhyne", "time": 1555194721598, "rating": 5.0, "text": "I was very pleased with Grant Collins in helping me get a sump pump and French drain lined up for install. He was prompt, and always answered my calls, in meeting me to discuss what I wanted, and was very helpful with financing the project. Can't wait to see the finished product. Thanks Grant", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "109998641774701046063", "name": "Trudie Gruman", "time": 1562165909136, "rating": 1.0, "text": "I gave them my money (a little over half of estimate) and no work has been done. It’s been over a month and they won’t give my money back.                                                                   The 2 salesmen that came out were very nice and helpful. But after they left there was some confusion about what needed to be done. I got a call from Jeff Kennedy.  He was nice at first but then tried to bully me and became disrespectful as the conversation progressed.  I am elderly and feel like I’m being taken advantage of.                                                          It looks like I’m going to have to take legal action to get my money back.  I certainly would not recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "112879013432916429179", "name": "Chelsea McKinney", "time": 1551215680664, "rating": 5.0, "text": "The best price I received and fantastic work! They even gave me the option of their guys filling my own personal dump trailer with everything they cleaned out from under the house so they wouldn't have to charge me their dump fee! Would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "113572913917792697200", "name": "Lori McNamee", "time": 1610422033910, "rating": 5.0, "text": "Great work, excellent people!", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "115847838105166143071", "name": "John Briscoe", "time": 1577976435600, "rating": 5.0, "text": "Excellent job, they repaired foundation issues that I was having and installed lintel lift to raise lintel and fix the brick issue I was having over garage door. Showed up early and worked extremely hard . Highly Recommend.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "100743984001834163100", "name": "Tammy Roberts", "time": 1552325057741, "rating": 5.0, "text": "I contacted Don Kennedy and Sons to repair a leak from ground water entering my finished basement. Grant came out and explained the process, provided a quote and time frame for job completion. He answered all my questions. The work was completed in 3 days as stated. The workers were polite, worked hard and left the job site clean. I highly recommend this company!", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "103567894734742851311", "name": "Sonya Hayes", "time": 1536967420105, "rating": 2.0, "text": "Work was done in time frame. Customer service was beyond awful. The workers completely destroyed the yard beyond the need to do the work. Workers were pouring concrete (quick Crete) at 8pm using basically headlamps for light, the work was shoddy we ended having to buy equipment to smooth the surface. Work had to be redone. A worker actually came to the hospital while my husband sat with a family who was going through major family illness  to collect final payment . The work cost 20,000 and cost us at least another 3,000 to make our yard useable again. We sent a pictures via a certified letter expressing our disappointment and requesting some help in fixing the problems a phone call from the owner assuring us he wanted us to be satisfied customers, well he failed. Today after three months we have finally gotten the warranty transferred to the new home owners. This took a three hour drive on our part to see someone face to face. We were given promise after promise that we could handle this via mail. Pick a different company for your foundation work. Oh and the check my husband for warranty transfer at noon today cleared the bank before my husband drove the three hours back home. I have nothing good to say about our experience", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "111243225847392807933", "name": "Jason Palmer", "time": 1605906835439, "rating": 5.0, "text": "They installed the garage lintel and went above and beyond to finish the job when promised.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "106085084617249691197", "name": "Matthew Montes", "time": 1549639994634, "rating": 5.0, "text": "I called Kennedy and Sons to inspect my crawl space. Grant came right away, and was there in less then 30 min. He inspected my crawl space and provided a very honest assessment. Honesty is difficult to find amongst most contractors. I definately recommend Grant and the Kennedy and Sons team. They will be the first people I call if needed again.", "pics": null, "resp": {"time": 1551282295945, "text": "Mr. Montes, we thank you for your review and kind words. It would be an honor should you ever need us with any future work. Thank you for putting your trust in Grant and Don Kennedy and Sons."}, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "111515344380832647375", "name": "Chris Bramon", "time": 1564508281886, "rating": 4.0, "text": "I had a foundation problem, part of my house needed to be stabilized. The wok done was good, things are looking good to date. Grant Collins, the rep I worked, with did a great job.\n\nUpdate, talking to the company now because of a failure on the work. Still waiting for an answer, warranty says they cover, but haven't heard from them yet.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "113468235790636302027", "name": "JT Wood", "time": 1550097323710, "rating": 5.0, "text": "Your crew were efficient, prompt, and left the work site spotless. A fine improvement, the plastic cladding and caulking in particular. In all, more than a body would hope for. Recommended highly.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "101139448903030791293", "name": "Robert Hamer", "time": 1604965816795, "rating": 5.0, "text": "Amazing people amazing place", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "105308698676791092274", "name": "MJ Dil", "time": 1582580009087, "rating": 5.0, "text": "Did the work quickly and completly. Priced well", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "115429420364566333578", "name": "Dennis Liuzzo", "time": 1419740298952, "rating": 5.0, "text": "Kennedy and Sons Moved the Outbuilding in our Back Yard and They Did a Great Job Very Fast and Affordable. They Also Fixed our Foundation Settling in the Kitchen. Jeff Is a really Great guy I can tell he is a Family man and Really loves what he Does.\n\nThanks Jeff and Lisa", "pics": null, "resp": {"time": 1432911581391, "text": "Hello Dennis,\n\nWe appreciate the kind words and we also appreciate your business.\n\nThank you,\n\nJeff Kennedy\nDon Kennedy & Sons"}, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "108834297506437461431", "name": "Robert Reeves", "time": 1564091234135, "rating": 1.0, "text": "Terrible experience with Jeff and company. Took 2 months to get my lintel that was too short the first time they brought it out. Jeff employs workers that speak no English which makes,you wonder. No communication. Overall terrible experience. Dont make the same mistake I did by choosing DKS.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "104228403262771999949", "name": "Dewayne Gray", "time": 1437772823239, "rating": 5.0, "text": "Jeff and his crew does a tremendous job at what they do. He is very professional and informative to the customer on what is going on with the job. I would recommend these guys to any and every one.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "101612670906066095608", "name": "Ben C", "time": 1485986470287, "rating": 2.0, "text": "I cannot recommend Don Kennedy and Sons. It's been a very bad experience with them. A year ago I got in touch with them for an estimate on joists that support a sinking foundation. The person I spoke with initially was fired after I paid upfront and I was told that paperwork had gotten mixed up. They postponed working for at least a month resulting in at least 3 reschedules. The work they did lasted for around 7 months before I noticed the issue wasn't resolved. In November 2016 I scheduled an appointment for February 1st, their earliest opening, because they agreed to honor a warranty of their work. And today, February 1st, I was rescheduled again. Terrible service.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "103488350413373679737", "name": "mike locke", "time": 1503690625084, "rating": 1.0, "text": "I arranged a meeting at the company's convenience for a foundation repair estimate. I arranged for a family member to travel to my house to meet them since I was unable to make it. They never called or showed up. Very disappointed because I expected more.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "114026387695528038064", "name": "Karen Posey", "time": 1552409820533, "rating": 5.0, "text": "They came when they said and completed the work in a timely manner.  I would highly recommend them for any work.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "110388879368251244441", "name": "Donna Buffington", "time": 1542138548237, "rating": 1.0, "text": "After reading some of the reviews, I feel fortunate that this company did not  to do the foundation repair at our storage facility. They are disorganized, unreliable and unprofessionally. We received an estimate from Jeff and when we reached out to hire the company for the job, he couldn't find the estimate, we emailed him the estimate he had sent to us, with a request for the company to do the work. That has been 4 months ago and we have not heard from him.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "106507718240478177866", "name": "Renee Thomas", "time": 1543149569540, "rating": 1.0, "text": "BEWARE!!!!!\n\nDO NOT TRUST  DON KENNEDY AND SONS STRUCTURAL SOLUTIONS, JEFF AND HIS TEAM!!!!!\n\nREAD THE FOLLOWING SITUATION AND DECIDE FOR YOURSELF!!\n\nCOMPLAINT STARTED IN AROUND 2013 OR BEFORE THROUGH 2017\n\nNOW AT THE END OF 2018 STILL NO REPAIRS COMPLETED\n\nNOW ENDING 2018\n\n3-26=17 Called your office,identified myself, and left a message for you. The young lady that I spoke to told me the best way to get in touch with you was by email.  You can call me at your earliest convenience to discuss the structural issues that still exist, a time for you to come out and/or a date for repair.\n\n3-29-17 Ok sounds great and I am so sorry your problem did not get taken care of. My parents always said that all one can do is hire what we believe to be good Godly character and monitor the results. We did have a couple we let go since your job, and its no excuses for your job to go unsatisfied\n\nBEWARE!!!!! Do not use Don Kennedy and Sons. They know nothing about correcting structural/ foundations. Hired them years ago, paid them and my structural issues still exist. I have been calling them to come and correct my issues and complete\n\nJeff,\nI have to start from the beginning.  Years ago I contacted you for a specific issue. The issue was the floor area around one of my dining room corners was dipping downward. You can out assessed the issue and gave me a price to repair the issue.  You told me that my issue was repaired but it would take time to correct itself. Over what? 10 years? or close to it, the issue was never corrected or never corrected itself.  You are supposed to be the professional concerning foundations. All the work you did or what you had to do doesn't involve me. You did this, or that, MY ORIGINAL ISSUE WITH MY FLOORING STILL EXIST TODAY BUT WORST. Whatever you did under the house, has created another issue, meaning now there is a hump in another area of my flooring, which I pointed out to you. So, your text about it would take 7 working hrs under my house in April, 2017 to correct my original issue with my flooring, and the now hump in another area did and has not happened. I was here when your work team arrived and when then left. You told me while they were working under the house, you would be inside the house directing them and to make sure of leveling.  Well, you were not here to direct so none of that happened and nobody told me to call the office for anything. Attached, is where you try to blame the builder.  I hired you correct my original flooring issue well after the builder.  Your correction should have included ALL THE REPAIRS TO CORRECT my flooring issues whether it what the builder did or did not do RIGHT?  So, here we are 12 May 2017 with my original flooring issues still existing, sagging and humped flooring.  So, Where do we go from here?", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "111344322851879445762", "name": "William McNeese", "time": 1483071287156, "rating": 4.0, "text": "Don Kennedy and Sons just completed major structural repairs on a home in preparation for a home’s appraisal and inspection for closing. The work involved Foundation Support Piers under brick footings to fix cracks in brick veneer and Stable Lift Piers with 2x8 girders in the crawlspace to fix sagging floors.\n\nTony was referred to me by my real estate agent and he was absolutely fantastic. Tony came right on time when he said he would be there and his communications were prompt and professional. It was a pleasure to work with Tony during the proposal phase and the work itself. He is technically knowledgeable and dependable. I highly recommend him! He is the reason I contracted with Don Kennedy & Sons.\n\nThe foundation support piers did exactly what they were supposed to do. The stair step cracks in the brick closed right up as we had hoped. There was a little more impact to the yard and soil than I had expected, but not a major issue.\n\nThe Stable Lift Piers and 2x8 girders also did their job. They are not as elaborate of a solution as the adjustable “Smart Jacks” on top of poured concrete pads from AFS, but they do work and they are a little less expensive. I recommend that consumers understand what they are purchasing on major repairs like this and get someone to help if they don’t. I did an internship with a home inspector, and I have structural improvements at my main residence, so I was able to spot some minor issues which Tony readily and proactively agreed to correct once I explained them on the phone. The laborers came right over, understood my concerns, and fixed them right away. Some additional materials were added at no expense/no questions. I think if Tony had been available to inspect before I did he would have corrected these on his own. My own inspection was prematurely hurried by the office manager – see below.\n\nAdministratively this business has some improvements to make. At 2:00 on Friday I was called by the administrative assistant that my work was complete and asking for immediate payment. I kindly asked for a chance to see the work first over the weekend and that I would pay on my way to work first thing Monday morning. I was told that they would have to ask the office mgr. This made sense and I agreed. Surprisingly, Jordan called me back promptly explaining that this was not acceptable per her manager and that I needed to leave my own job and arrange for payment with Jordan ASAP. I immediately left a voice mail for Tony. Thankfully he straightened it all out. I was never given an apology by the office manager.\n\nSo, I ran over first thing Saturday morning to inspect and observed the minor corrections needed to be made. The office mgr’s insistence on paying right after they were done Friday seemed underhanded (and downright strange too), but Tony made it all right. The office manager needs to get better at being reasonable conducting business, treating people respectfully, and resolving business issues firsthand with customers. However, administrative assistant Jordan worked very hard to provide great, positive customer service. I remained with the laborers on Saturday to make sure everything was fixed to spec, and it was. The laborers worked hard and were very friendly.\n\nI’d recommend to Don Kennedy and to their customers that a 7-10 business day payment period be part of the contract to allow the customer time to inspect repairs, Tony to inspect, and/or get a buddy to inspect after completion of the work. This will also take a lot of stress off the payment-hungry front office and the customer. I’ve contracted lots of work over the years and I’ve never been pressed for payment so urgently – despite a 50% down payment before starting the work.\n\nIn summary I do recommend Don Kennedy & Sons for residential structural repairs and especially if you work with Tony.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "112780716638599606460", "name": "Eduard Boeckmann", "time": 1529784856586, "rating": 5.0, "text": "Don's crew came out to my house and did exactly the work that i asked for and more. They did a great job!", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "112231808865903125451", "name": "Claire Roth", "time": 1444049411945, "rating": 2.0, "text": "I would not use them again and will continually tell friends and family about the headache we went through for over a week.\n\nThe construction workers are great; however, the owner and crew manager are extremely disorganized. We started calling Wednesday over a potentially huge concern. We finally halted work Monday afternoon since Todd and Jeff were not getting back to us or addressing concerns in a timely manner. Jeff's schedule miraculously cleared up to come address our concerns the very next morning--almost an entire week after first calling!\n\nOverall, my main take away is the lack of communication, especially when spending so much money on foundation work. Our problem was misdiagnosed and we ended up owing more than the estimate as well.\n\nI was shocked because I had heard good things and they were even suggested by our realtor. Needless to say, we're going elsewhere for additional work.", "pics": null, "resp": {"time": 1446654127888, "text": "Hello Clair\nThanks for expressing your frustration working with my company.  It is too bad you feel the need to \"continually tell friends and family\" about this experience but that is certainly your right to do so.\nAs I discussed with your husband we certainly want to ensure that every customer we serve has a great experience.\n\nI can not do anything to help you by posting on the internet, however,  if we can help you at all please call me directly at (256) 533-1100 and I will do anything I can to help you.\n\nWe work hard everyday to ensure the work we do is done right and that all our customers are treated well. I do apologize that we did not meet your expectations. Thank you, Jeff Kennedy Don Kennedy & Sons"}, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "111970776628379698616", "name": "sonny S", "time": 1442513054410, "rating": 5.0, "text": "Jeff is easy to work with and his dedication to his work shows. Would recommend.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "101201641675458895983", "name": "Bob Vasile", "time": 1421945156615, "rating": 1.0, "text": "Terrible service. I asked for an estimate in mid-November but still haven't received one. It's clear this company doesn't want the the business but don't have the courage to tell me. Luthor is the guy I've been dealing with.", "pics": null, "resp": {"time": 1432911526415, "text": "Hello Bob,\nI appreciate you taking the time to express your experience and certainly want to ensure that every customer we serve has a great experience.  If we can help you at all please call me directly at (256) 533-1100 and I will do anything I can to help you.\n\nWe work hard everyday to ensure the work we do is done right and that all our customers are treated well.  I do apologize that we did not meet your expectations.\n\nThank you,\n\nJeff Kennedy\nDon Kennedy & Sons"}, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "112634699658045400545", "name": "Chuck Swafford", "time": 1553871374669, "rating": 5.0, "text": "great experience!", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "100144665140157628600", "name": "Big Worms", "time": 1583281535073, "rating": 5.0, "text": "Good Dependable company", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "105084007779945421205", "name": "Jose Renato Winter Vidaurre", "time": 1441116023823, "rating": 5.0, "text": "(Translated by Google) I like that company, I remember it whenever God bless you today and always.\n\n(Original)\nMegusta esa empresa la recuerdo siempre que Dios los bendiga hoy y siempre.", "pics": null, "resp": null, "gmap_id": "0x88626a2e738087eb:0x38d226941a1e4b83"}
{"user_id": "100658337560987992246", "name": "Erin Jaxon", "time": 1448377458039, "rating": 5.0, "text": "I work for a property preservation and repair management company and often have to find structural engineers to assess out properties. I called in to Christy/Cobb and spoke with Lowell. She is very polite and friendly, kept me updated through the entire process and she delivered a quality report in a timely manner with excellent service. Highly recommend this firm, they will make your life ten times easier.", "pics": null, "resp": null, "gmap_id": "0x88891bceb390321d:0x2a70f1ebabad492a"}
