{"user_id": "113407345509368831661", "name": "tallson bunch", "time": 1629701542096, "rating": 5.0, "text": "Good experience. Clean dorms and nice students.", "pics": null, "resp": null, "gmap_id": "0x888602bca9bc647b:0xea4862bf1afda6e5"}
{"user_id": "111091799847295636939", "name": "Kina Lucious", "time": 1629583922806, "rating": 5.0, "text": "Friendly workers, and a very clean place.", "pics": null, "resp": null, "gmap_id": "0x888602bca9bc647b:0xea4862bf1afda6e5"}
{"user_id": "111081557260904803010", "name": "Alexandria Gauntt", "time": 1557864758853, "rating": 4.0, "text": "It's honestly very nice and spacious. The only complaint is the bathroom is so small, but I'll live.", "pics": null, "resp": null, "gmap_id": "0x888602bca9bc647b:0xea4862bf1afda6e5"}
{"user_id": "108589069971362439643", "name": "Edwin H Kluge Jr", "time": 1605805529034, "rating": 5.0, "text": "Ty from Driver Edwin", "pics": null, "resp": null, "gmap_id": "0x888602bca9bc647b:0xea4862bf1afda6e5"}
{"user_id": "108472483029212242826", "name": "Crawfish King", "time": 1472143051387, "rating": 5.0, "text": "This is the best dorm in the entire University. I have a private room here.", "pics": null, "resp": null, "gmap_id": "0x889bb29f77367bc5:0x451a0cfb747c4ff4"}
{"user_id": "112280078289655904293", "name": "Langford Langford", "time": 1628028175111, "rating": 5.0, "text": "The dorm rooms are wonderful. And the staff on hand to help with information and the physical move were just what we needed. Thank you for making a good impression on a freshman's first time.", "pics": null, "resp": null, "gmap_id": "0x88844cc062da6a53:0xcc3cb8abb7be41c2"}
{"user_id": "110053307876269353262", "name": "Jessica Fowler", "time": 1628368295689, "rating": 5.0, "text": "Great RA's! I think my oldest will have a great freshman year!", "pics": null, "resp": null, "gmap_id": "0x88844cc062da6a53:0xcc3cb8abb7be41c2"}
{"user_id": "102554088446460911252", "name": "angela thompson", "time": 1597366636705, "rating": 5.0, "text": "My son just moved in. It's so clean and the staff are very helpful and very kind and patient. I totally enjoyed my trip there to Gilbert Hall. I know my son is just going to love staying at Gilbert Hall considering he's far from home now. It truly felt like his' new home'. Very comfortable and again super clean. Go Tigers!", "pics": null, "resp": null, "gmap_id": "0x88844cc062da6a53:0xcc3cb8abb7be41c2"}
{"user_id": "106597619324904924499", "name": "Kathryn “Legalkm76” Malone", "time": 1597265572156, "rating": 5.0, "text": "Great Students, Clean,  Great Staff!!!", "pics": null, "resp": null, "gmap_id": "0x88844cc062da6a53:0xcc3cb8abb7be41c2"}
{"user_id": "113031116746629067500", "name": "Regina Evins-Lee", "time": 1539196575134, "rating": 5.0, "text": "My daughter live there during her Freshman year", "pics": null, "resp": null, "gmap_id": "0x88844cc062da6a53:0xcc3cb8abb7be41c2"}
{"user_id": "101084634336716831119", "name": "Rhonda Ellison", "time": 1534285919048, "rating": 5.0, "text": "Beautiful dorm , clean and campus beautiful!", "pics": null, "resp": null, "gmap_id": "0x88844cc062da6a53:0xcc3cb8abb7be41c2"}
{"user_id": "108962255597505042985", "name": "Charlie Tate", "time": 1626115150340, "rating": 1.0, "text": "0/5 Stars is more accurate. The office manager is very condescending to tenets and her employees. She can't handle the pressure. Just passing through the office a few times, I saw her scream profanity at employees. The only thing that made my time bearable at this trap complex were my roommates. Nearly every appliance was broken and the furniture was not in renting shape. We ended up getting our own couch. The Beacon = No place any human should live.", "pics": null, "resp": {"time": 1626293467510, "text": "Charlie, we are very sorry to hear about the circumstance you've described in your review. We have two brand new managers at the property who have neither engaged this way nor know of a situation like this taking place within our leasing office. As it stands, we'd like to learn more about the specifics of your review to ensure it's investigated and handled in the proper venue. Please give our office a call utilizing the number on our Google listing, or email our new GM Mallory at msanda@thebeaconauburn.com. Thank you, Charlie."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "108008217307082888798", "name": "Angie Sides", "time": 1618780851855, "rating": 5.0, "text": "Staff was very helpful in the tour of the apartment! I fell in love with the apartment as they were showing it to me loved the floor plan and convenience to Auburn University. The kitchen was spacious and set up in the most efficient way I've ever seen when looking at apartments.", "pics": null, "resp": {"time": 1619455112233, "text": "We truly think the kitchen matters so much - honestly great to see you feel the same way, Angie! Thanks for coming by and letting us talk your ear off about how much we love to cook."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "110044590475703250596", "name": "Seth Plimpton", "time": 1627311631916, "rating": 4.0, "text": "I wasn't killed when I lived there. I also agree with Charlie on those ppl y'all used to have in the office. The redhead with frizzie hair spoke to me like a dog. Don't bother responding to me on this thread. I know it's fake </3", "pics": null, "resp": {"time": 1627309608056, "text": "Thanks for your review, Seth. While we appreciate your candor, your review isn't one any business would ignore, or try not to help with. If you would care to have a conversation with actionable next steps about how you were spoken to or treated at The Beacon, please give us a call, email the leasing department or stop in. However \"fake\" this may appear to you, it is serious, and even past employee interactions can affect the future of life at The Beacon for residents. Thank you again."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "103833213196153455313", "name": "Kevin Hosecloth", "time": 1618777916748, "rating": 4.0, "text": "I love living here! The staff is super friendly and connects well with the residents! Maintainence can be a little slow to fix things sometimes, but it’s never too bad.", "pics": null, "resp": {"time": 1619454789244, "text": "Appreciate the honesty about the hospitality, Kevin. We're glad The Beacon offers up an above-average experience for you!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "103814588608565958570", "name": "Kerri Holmes", "time": 1623777558581, "rating": 1.0, "text": "Literally had issues every since i moved in here. Do not recommend, Was very close to suing them. Then they decide to Transfer for me a month before my lease is up to a new apartment and quell me i have to move ASAP like i don’t have a job and not in school. Worst apartments in auburn.", "pics": null, "resp": {"time": 1625078174685, "text": "Kerri - thank you for your perspective regarding your stay at The Beacon. We don't wish for any resident or guarantor to have the experience you've described here, and it's on us to make things better for you here. We know the situation with the leak had been solved, but a member of our team will be reaching out to you today/tomorrow to connect further about what more we can do to assist. Please be on the lookout for a phone call - we hope to chat soon. :)"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "102165122260069371178", "name": "Lemuel Swindle", "time": 1618780934680, "rating": 5.0, "text": "Must say that the beacon has got so much to offer it’s residents! I was more impressed by the staff and how knowledgeable they were, and with all the amenities available I’m thinking BEACON SPRING “22", "pics": null, "resp": {"time": 1619455165769, "text": "Lemuel says Beacon '22 and we are READY! Thanks for coming by to chat with us and see what's the what. Any questions between now and then, you know who to call."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "104305502295138808184", "name": "Coulson Barfield", "time": 1616622054808, "rating": 5.0, "text": "Amazing staff. They were more than willing to work with me in my living situation 10 out of 10 just go into the office and they will make sure your taken care of!", "pics": null, "resp": {"time": 1617036299655, "text": "We're just glad we could be of assistance, Coulson. Thanks for taking a chance on us to help out - let us know if there's anything further we can do for you!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "106775198084810897887", "name": "Kizzie Likes This", "time": 1618780815473, "rating": 5.0, "text": "Had a great tour here, definitely has professional and educated staff members and they were extremely helpful when it came to all the questions I had!", "pics": null, "resp": {"time": 1619455057839, "text": "If Kizzie Likes This, we LOVE this! ;) Thanks for coming by to learn about all things The Beacon with us."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "103166442702874544012", "name": "Jennies Doan", "time": 1605044199670, "rating": 5.0, "text": "The Beacon is a really nice place. Kendra is very helpful when it comes to meeting my needs. Highly recommend talking to her about your issues. She’s culturally competent and client-oriented. She’ll will make sure your needs are fulfilled!", "pics": null, "resp": {"time": 1609880200187, "text": "Kendra is BEAMING reading all of these! Thank you so so much, Jennies!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "106259775580517498566", "name": "Riley Nunley", "time": 1618780106847, "rating": 5.0, "text": "The Beacon is pretty great place to live! I love how close it is to campus and the staff are always really friendly :)", "pics": null, "resp": {"time": 1619454994697, "text": "Great proximity, friendly staff... We love to see it. Thanks for the love, Riley!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "116614564580064724437", "name": "Tall Muffin", "time": 1614462645102, "rating": 5.0, "text": "Lovely experience. There’s is always someone to help, if you need it. 10/10 recommend because a lot of improvements to customer care has been made.", "pics": null, "resp": {"time": 1614619628916, "text": "Thanks for the love, Tall Muffin! Love seeing that you're happy about the changes we're making at The Beacon. :)"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "100354925150156641036", "name": "Steven Soriano", "time": 1614628341252, "rating": 4.0, "text": "Stayed here for two years. I enjoyed staying here the entire time. Also was very conveniently close to campus and the football stadium. Made living here very worth it", "pics": null, "resp": {"time": 1614792534368, "text": "So glad we could accommodate a great environment for you these past two years, Steven. Thanks for your positive outlook on The Beacon!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "112801271873631891292", "name": "PComputers", "time": 1627405384765, "rating": 1.0, "text": "Rude staff, no after-hours emergency number, call you every day and leave a voicemail for over a month if you make the mistake of calling once (clueless at best as to whether anyone wants their overpriced apartment rentals)", "pics": null, "resp": {"time": 1628537619707, "text": "Thanks for that feedback, PComputers. As your username prevents us from reaching out to learn more of the issue, we'd like to offer some resources for you as a follow-up opportunity to learn about our after-hours policies and leasing practices. This could also be an opportunity for your to share any details about your staff interactions that were less than pleasant, should you wish to. Please email our General Manager Mallory at msanda@thebeaconauburn.com or call our office at 334-459-9855. Thank you for your time!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "113880725132942243006", "name": "Abby Kryscuk", "time": 1618779224444, "rating": 5.0, "text": "Great staff! Very accommodating and informative to all my questions and concerns!", "pics": null, "resp": {"time": 1619454911363, "text": "We're happy to hear you feel this way, Abby. Let us know if there's another Q we can A for ya. :)"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "115215477743981230096", "name": "Catherine Quinley RMHOA VP", "time": 1605560104337, "rating": 5.0, "text": "My college son and his 3 potential roommates signed up for the 4 BR weekend special .  The ordeal with 4 parents, 4 18 year olds and one very patient leasing agent was like herding  cats in a 48 hour period.  My son who struggles with anxiety was the only one available to tour the unit and Victoria made him feel valued, important and confident in his decision to choose for all 4 boys . He did not feel taken advantage of or looked over due to his age.  The text option that The Beacon offers when you call their number was amazing and worth using to get the quickest responses from Victoria at The Beacon! While she managed all other customers , she still provided us with top shelf service ...ultimately leading to a successful 4 BR completed lease.  I highly recommend The Beacon for their service and workability with distant parents and  teenage college students !  Victoria understands !", "pics": null, "resp": {"time": 1605629904400, "text": "We are so thankful for your insight on Victoria's resident care and how the situation was handled overall, Tanya. Thanks for trusting The Beacon to deliver an experience you felt comfortable with, and one we hope to continue providing for your son and his roommates for their college years to come. Anytime you need something, please feel free to give us a ring. Welcome to The Beacon community, Tanya. :)"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "108711156620959530611", "name": "Abigail Judkins", "time": 1614795202433, "rating": 5.0, "text": "An awesome place!! We love the Beacon! They always take care of their residence.", "pics": null, "resp": {"time": 1614897032114, "text": "We love to see you enjoying life with us at The Beacon, Abigail!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "102863975597438308995", "name": "Tatyana Hall", "time": 1614641203070, "rating": 5.0, "text": "Rent is a great price ! Staff is really nice ! . Jay is the coolest ever he’s awesome !! If you need a place to stay that’s great with give aways and rent payments are low THIS IS THE PLACE !!!✨☺️", "pics": null, "resp": {"time": 1614788587772, "text": "You heard it here first! Thanks for the illustration of how awesome The Beacon is, Nicole. We're glad you feel so strongly about it!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "115976256868013538135", "name": "Debreana Burney", "time": 1614641154388, "rating": 5.0, "text": "I highly recommend here , it’s a very beautiful and quiet environment, friendly office worker I personally love jay ❤️", "pics": null, "resp": {"time": 1614788626010, "text": "People like Jay work every day to ensure we have reviews of this sort come through as often as possible. Thanks for being an incredible part of our story, Debreana."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "118193292134029330629", "name": "Khadijah Rembert", "time": 1605044420857, "rating": 5.0, "text": "I have been impressed and happy with my time here. The staff has been fabulous, especially Kendra Carpenter she goes above and beyond with making sure everything is perfect and meets my expectations! I have enjoyed how kind everyone is, and how quiet the neighborhood is.", "pics": null, "resp": {"time": 1609880181562, "text": "Honestly we're so happy to see you're enjoying things here at The Beacon, Khadijah! Thank you for a blessed review and for shouting out Kendra. :)"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "108554610251723451795", "name": "Isaac Nikhil", "time": 1611786068212, "rating": 5.0, "text": "I absolutely love the beacon they put in extra effort and worked with me to move in even when their office was closed.My experience with beacon has been absolutely amazing so far.", "pics": null, "resp": {"time": 1611939929225, "text": "Thanks for your valued insight, Isaac. We're excited to see The Beacon experience for you has been worthy of five stars thus far. :)"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "104527381695295310453", "name": "Gianni Parello", "time": 1610749580745, "rating": 1.0, "text": "I’ve lived here for a semester so far and dear god live ANYWHERE ELSE. My apartment flooded, after my roommate moved out they moved TWO PEOPLE WITH DOGS into the apartment with me without telling me about it at all so one day I just walked in to two random people in my apartment. I now pay for the water bill and electricity of 3 people and a dog as opposed to just two people. The gym has not been 24/7. There is NOT a hot tub despite them advertising one. The study area has not been 24/7. The pool was rarely clean. Often I would order packages and they would say they couldn’t be delivered because the people working weren’t there so I wouldn’t receive packages and still haven’t received them. All around an awful living experience and I would not recommend it. Live somewhere like 191, midtown, or creek side instead.", "pics": null, "resp": {"time": 1611081938858, "text": "Gianni, thank you for taking a moment to express your frustrations with The Beacon and it's corresponding amenities/staff. We want to make sure to answer to some elements of your review, while also inviting you to correspond with our GM Philip (phrinehart@thebeaconauburn.com) about the concerns regarding your unit/roommates. The hot tub was taken out as a decision by ownership, and an upgrade to the area was done with stamped concrete and a pool table with green area. The amenities were closed for a while along with the office due to COVID exposure, but emails and communication went out about that. They are all currently open at this time. During the shut-down, the delivery companies were asked to deliver packages to the tenants' doors. We were not able to collect them at the time of the shut down. Packages are logged now, and the system does work correctly. Again, our efforts here are to help continue a conversation that can better facilitate the changes you wish to see to your living space. Thank you for your time, Gianni."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "108809979502618601295", "name": "Hill Morgan", "time": 1605053836810, "rating": 5.0, "text": "Great Property. Amazing staff. Love the GYM!!Kendra is so amazing every time I call. War Eagle!!!", "pics": null, "resp": {"time": 1609864958111, "text": "Kendra is truly a star pupil of The Beacon crew. Thank you for the Google love, Hill!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "104916089613377308516", "name": "Arthur Whitt", "time": 1605043239709, "rating": 5.0, "text": "Went to visit a friend and they lived here. Majorly impressed at the attentiveness of the staff and readiness of maintenance. Definitely will be applying to live here once I enter grad school.", "pics": null, "resp": {"time": 1609880517013, "text": "We're doing what we can and sincerely appreciate you witnessing that (and saying so in your review!), Arthur. We look forward to seeing you here!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "105962750087965645896", "name": "Jacqueline Worley", "time": 1605058920257, "rating": 5.0, "text": "I have a friend who lives at the Beacon and I am always there because I love it, I almost want to live there but my lease isn’t up just yet! But stay there it’s amazing!", "pics": null, "resp": {"time": 1609864913363, "text": "Haha, well if you're ever in the market Jacqueline, come on by and we can have a talk about leases! ;) Until then, you're always welcome!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "104843229387309213384", "name": "Filaizha Thompson", "time": 1605042766583, "rating": 5.0, "text": "Loved the amenities. Staff was very friendly & everything was nice. Definitely would recommend.", "pics": null, "resp": {"time": 1609880581973, "text": "All great things in our eyes - thanks for the high praise, Filaizha!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "100903036926906581446", "name": "Zylan Miles", "time": 1605044173777, "rating": 5.0, "text": "Great place for students or people just trying to save money great amenities and also excellent maintenance", "pics": null, "resp": {"time": 1609880216171, "text": "We couldn't agree more. ;) Thanks for the love, Zylan."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "103636586855006059304", "name": "Phoebe Judkins", "time": 1614795171026, "rating": 5.0, "text": "Beacon is an awesome place! They have lots of fun events!!!", "pics": null, "resp": {"time": 1614897054392, "text": "Doing what we can to keep things fun and exciting - thanks for recognizing the effort, Phoebe!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "117612404714204383000", "name": "Chris Pierce", "time": 1605043456635, "rating": 5.0, "text": "It’s for sure gotten way better than when it used to be the reserve the staff is on point and way friendlier and before.", "pics": null, "resp": {"time": 1609880403547, "text": "Improvement is a forward-thinking community, and we're glad to be on that path with you, Chris."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "112974848335645054990", "name": "Haley Flowers", "time": 1604961649234, "rating": 5.0, "text": "I have been staying in the beacon for 3 years now. Soon graduating and I must say it has been so enjoyable!", "pics": null, "resp": {"time": 1605041151706, "text": "We will miss you when you go Haley, but so glad you could spend a quality three years with us at The Beacon. :)"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "103597555599574008649", "name": "Ashley Miles", "time": 1591895147476, "rating": 2.0, "text": "I have lived at The Beacon for two years and I can say that I really enjoyed my first year of living here. The staff was always nice to me and the maintenance team always fixed any problem that I had in a timely manner. However, something changed during my second year here. The gym was often dirty and provided no disinfectant spray or paper towels. I notified the office and they cleaned the gym and provided supplies, but within a couple of weeks the gym was dirty again and out of supplies. As a result, I started going to another gym. On another occasion, I was having recurring noise problems from a neighbor. I contacted the office four times about this issue and they did not do anything about it until I was able to email them a video of how loud the noise was. Lastly, in the middle of my lease, the business started using a new payment system that charges the residents almost $20 as a “service fee” to simply pay their bill. The worst part about this was that The Beacon did not tell the residents about this new policy. It was up to the residents to figure it out. This second year at the Beacon has left me feeling like the business takes advantage of college students. They brush off the residents and do not take their comfort seriously.", "pics": null, "resp": {"time": 1591975459060, "text": "We appreciate your dialogue here, Ashley; thank you for chiming in on how your experience of The Beacon has taken a turn. It is never our intention to take advantage of our residents here, and we want to do our best to support the community our residents thrive in. We've intro'ed new cleanliness measures across the property to ensure we don't assist the spread of COVID, as well as maintaining the quality of life. The noise situation concerns use and we'd like to talk more about that; give us a call and ask for April at 3344599855; just mention your review. We also utilize a service for online payment that provides a secure payment portal for all residents. We can show you how to avoid the service fees in-office if you'd like. Thank you, Ashley; we look forward to chatting more."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "109920688011875944694", "name": "Erick Borrego", "time": 1605303920096, "rating": 5.0, "text": "Had a great first year at the Beacon, the fitness gets the job done. The staff is friendly, renewed my lease. Looking forward to next year.", "pics": null, "resp": {"time": 1609863704411, "text": "As are we, Erick! Thanks for the quick highlights of what makes The Beacon work for you."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "118322425704646715204", "name": "Will Brown", "time": 1605048227620, "rating": 5.0, "text": "Nothing bad to say, had a great experience. Kendra was a lot of help with all my questions", "pics": null, "resp": {"time": 1609866457409, "text": "Thanks for stopping in and hanging out with Kendra and our team, Will!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "102670536936577660533", "name": "Dante Smith", "time": 1605300598365, "rating": 5.0, "text": "I enjoy staying at the beacon, it provides a great atmosphere with very helpful CA's.", "pics": null, "resp": {"time": 1609863731836, "text": "We love seeing you around the office, Dante. Thanks for chiming in about the environment you enjoy so much."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "112893836174372867403", "name": "Hanna", "time": 1605250042978, "rating": 1.0, "text": "For the first year, I really had a good experience living here. But from August this year(2020), The Beacon started to use Simplebills and it would mandatory charge a “monthly fee” for no reason. It seems like If I don’t creat an account of Simplebills, I can’t get my new parking permit card. I went to the office and asked once, the manager just seems like didn’t want to solve it(monthly fee) seriously, and just told me to call the Simplebills’s service people. Before went to the office, I emailed them twice to ask about the “monthly fee”, but got no reply. I was very disappointed. For now I still will be charged a “monthly fee” every month.\nAnd the most important thing is that the microwave in my apartment doesn’t work for over three months, the maintenance staff came to fix it twice but still doesn’t work. If I turn on the microwave for about 10 seconds, I will smell like something burnt. Anyway, this year at The Beacon has left me a sense of disappointment. Hoping the next few months will be better.", "pics": null, "resp": {"time": 1609864010367, "text": "Thank you for providing your feedback and letting us know about this issue with SimpleBills, Hanna. Please get in touch with us at (334) 826-1202 and we'd be happy to help you out if lingering issues persist.\n\nCheers,\n\nThe Beacon"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "110387030020954168696", "name": "E. F", "time": 1605109455413, "rating": 5.0, "text": "Absolutely this pace! The staff is extremely friendly and always on top of things.", "pics": null, "resp": {"time": 1609864777346, "text": "Glad to have you as a part of our Beacon community, Edgar!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "113576263908919744470", "name": "Franny Voltaire", "time": 1605318317520, "rating": 5.0, "text": "The staff is very friendly. Miah gave me a really good tour and she is really nice.", "pics": null, "resp": {"time": 1609863068634, "text": "We're so glad you could find the time to stop in and chat with us, Franny. :)"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "107335633765506505715", "name": "Wyatt Jennings", "time": 1605484669483, "rating": 5.0, "text": "Great place to stay for college students and great location.", "pics": null, "resp": {"time": 1605539343948, "text": "Thanks for the short and sweet sentiment, Wyatt. A pleasure to have you at The Beacon!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "112369570710069859422", "name": "ali alghanim", "time": 1597258597253, "rating": 1.0, "text": "They are the worse management. I thought they are better but clearly not. The manager never wants to meet with us at all because the apt I got is completely trash. Same your money ppl. The worse Place and Management.", "pics": null, "resp": {"time": 1597336742144, "text": "Ali, we're so sorry to hear about this experience at our community. Our new general manager Philip is aptly making the time to field concerns exactly like this and would love to hear more about your concerns. If you have a moment today or in the next few, please give him a call at 334-826-1202 or send a quick email over to him at phrinehart@thebeaconauburn.com alluding to your Google review. We look forward to hearing more from you, Ali."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "110505266685029974195", "name": "Kei Sid", "time": 1605043014502, "rating": 5.0, "text": "I’ve had great service and experience here.", "pics": null, "resp": {"time": 1609880527762, "text": "We've had a great time providing it, Kei!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "105512415732615044962", "name": "lauren dVID", "time": 1604961445041, "rating": 5.0, "text": "I love my apartment, the great staff, and the giveaways are amazing.", "pics": null, "resp": {"time": 1605041124203, "text": "We love that you love these things! Thanks for the short and sweet sentiment, Lauren."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "107394190356450040202", "name": "Sarah Asher", "time": 1572053352703, "rating": 5.0, "text": "I love living at The Beacon! All of the office staff is super helpful and willing to go above and beyond for you. Bria was so kind and helped me get my lease secured for this year. Come live at The Beacon!", "pics": null, "resp": {"time": 1572274309794, "text": "Bria knows how to show the best of The Beacon for sure! Thank you for this wonderful review, Sarah. We appreciate you!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "106316104219168605123", "name": "Mihir Malik", "time": 1605045543092, "rating": 5.0, "text": "Lived here for a semester, wonderful place!", "pics": null, "resp": {"time": 1609866570169, "text": "And what a semester it was. ;) Thanks for the love, Mihir - hope all is well!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "112713689276700883942", "name": "J Marie", "time": 1566781551766, "rating": 5.0, "text": "Among a very smooth move in, the apartment complex has been wonderful thus far. I have been impressed and happy with my time here.\nThe staff has been fabulous, and I have enjoyed how kind everyone is, and how quiet the neighborhood is.", "pics": null, "resp": {"time": 1566835350394, "text": "We're so glad you had a smooth move-in experience, J Marie! We're constantly working to make sure that first impression reigns true for the rest of your time with us. We appreciate the insightful review!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "104482911635434387378", "name": "Monifah Lucas", "time": 1559299770496, "rating": 5.0, "text": "I love my apartment! Not only is the staff and maintenance workers very nice, but I never have to be afraid to ask stupid questions. It comes as a plus that I have my own bathroom too. This place is still amazing!", "pics": null, "resp": {"time": 1541188817651, "text": "You're the best, Monifah! Thank you so much for the awesome rating."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "116690456499725687214", "name": "Jasmine Conaway", "time": 1548704017434, "rating": 3.0, "text": "The apartments are nice and clean but the staff here is slow when it comes to handling anything. Maintenance takes a while and then you usually have to keep calling them because they never fix things correctly. The package room is a good idea but the staff is ridiculously slow with putting your packages in the room so you're waiting extra long to get a package that you know has already been delivered. I've had multiple problems with the electronic keys and I keep having to go to the leasing office and the issue is still not resolved.", "pics": null, "resp": {"time": 1548863651036, "text": "Thanks for the clarity in your review, Jasmine. We'd love to fully resolve the situation with your key with either a re-program or a new one altogether; if you can stop by the office and ask for\nAngel, she's been made aware of your review. We're in the process of working with the delivery companies to start logging them upon delivery, which for the time being has had to be done by staff which extends the process; for this, I'm very sorry. We're hoping the solution comes sooner than later and we can get mail to residents quicker than it currently takes. We care deeply about giving every resident the experience they desire and pay for, so thank you for giving us the road map on how to make your time at The Beacon better."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "110218327619287918811", "name": "Kristen Tolbert", "time": 1605043269014, "rating": 5.0, "text": "Awesome! I love it...", "pics": null, "resp": {"time": 1609880443305, "text": "You know, we love it too... ;) Thanks so much, Kristen!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "113111798559955731464", "name": "Kait Shields", "time": 1525137978489, "rating": 5.0, "text": "I don't understand any of these bad reviews- I have had nothing but great experiences here at the Beacon! My roommates and I have only had to put in two maintenance requests ever and both were our own faults, but they were still dealt with and resolved pretty much right away. I love the staff, everyones super nice and personable and do an awesome job with resident events (pretty much weekly events with free food or fun artsy activities- super cute)!  I would definitely recommend for anyone to live here and have nothing but good things to say!", "pics": null, "resp": {"time": 1525186811471, "text": "Thank you so much for the five star review Kait! We take pride in providing a positive experience for our residents.\n\nBest,\nThe Beacon Management"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "106020493523687486256", "name": "Joe Reich", "time": 1520373899137, "rating": 2.0, "text": "The place is satisfactory at best. For starters the room came with half the furniture we were told it came with. Upon multiple requests to the front desk and maintenance nothing has been done. Second, the 7 or so maintenance requests where they enter whether you're there or not, have not fixed any of the nonworking lights or helped the issue stated above. Needless to say, i'm happy to be leaving this summer.", "pics": null, "resp": {"time": 1520442005060, "text": "Hello Joe,\nWe are very disappointed and surprised to receive this review. Per our system, it appears that you have not placed a work order. Our General Manager will be reaching out to you right away to resolve this situation.\nBest,\nThe Beacon Management"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "114471358385090948287", "name": "Taylor Boutwell", "time": 1524861309432, "rating": 5.0, "text": "Absolutely love The Beacon! The staff is extremely friendly and always on top of things. I lived here for three years and couldn’t have imagined a better experience. 10 out 10, would recommend to a friend!", "pics": null, "resp": {"time": 1525057205704, "text": "Thank you so much Taylor for the five stars! So glad you loved living here.\nBest,\nThe Beacon Management"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "101271604354609731381", "name": "Grayson Dabbs", "time": 1532378684759, "rating": 5.0, "text": "I have lived here for the past year and I have nothing but good things to say! The office staff and maintenance crew are beyond helpful and will always greet you with a smile. I am extremely satisfied with how they handled all my questions, concerns, and living adjustments the past year (and I had TONS). They work very hard to keep the community a safe, clean, and friendly place. I would recommend for almost any college student who is looking for a good cost of rent to 'what you get out of it' ratio. PLUS It is also very close to the nursing/forestry side of campus so if you have class in that direction then it makes it very convenient to hop on a bike and ride to class", "pics": null, "resp": {"time": 1532448013754, "text": "Thank you for the five stars, Grayson! We are so glad that you have had such a positive experience! We appreciate the great feedback!\nBest,\nThe Beacon Management"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "102314253637603243620", "name": "Arthur Bruce Jr", "time": 1416241907323, "rating": 4.0, "text": "The location is great and the tiger transit route is very fast!The pool is a really cool place to hangout during the summer. There are also lots of resident events that allow for plenty of chances to meet other people living here There are students from Auburn, Tuskegee and Southern Union that live here! ! I was very impressed with the newly renovated 3 bed 3 bath model and am and looking forward to all of the great changes! The only downfall is the card keys, but I here that they are being replaced as the renovations continue! I would definitely recommend this apartment complex to anyone looking for housing at Auburn, Tuskegee, or Southern Union.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "110840073962205016814", "name": "The Scrub Life", "time": 1416259619312, "rating": 4.0, "text": "Absolutely love this place! The staff is amazing and always wanting to meet your needs and I am excited to see the new renovations of the property. This place is already great and I cannot imagine to see what the apartments will look like after these tweaks are made!", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "114544803929011922010", "name": "Jennifer Herrera", "time": 1614626908597, "rating": 5.0, "text": "Friendly staff and maintenance.", "pics": null, "resp": {"time": 1614792698829, "text": "Appreciate this more than you know, Jennifer. Thanks for your great review."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "116732117089814053262", "name": "Thanh Truong", "time": 1597598288848, "rating": 1.0, "text": "Living room, and kitchen were trashed. U have many other options with that price!", "pics": null, "resp": {"time": 1597782050192, "text": "Thanh, we're very sorry to hear about this issue you've had upon move-in. We're sure there is a better explanation for what's happened and would love the time to discuss it in more depth than a Google review could merit. If you have some time this week, please stop in the leasing office and chat with our general manager Philip. Thanks, Thanh!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "111452181566549838850", "name": "savannah vick", "time": 1560380079369, "rating": 1.0, "text": "I’ve lived here for less than a year. Since I’ve started living they’ve had 3 different general managers. Their assistant manager left so they went without one from November until April. This property is completely unorganized. Once one general manager leaves they don’t leave hardly any notes for the new general managaer to work off of. I had a terrible roommate for most of this time. She was breaking the lease and I brought it to their attention and they didn’t want to handle it. The last general manager Angel was awesome. She handled everything exactly how it should be. The new general manager April is amazing also. She handles everything in a timely manner and makes you feel like she cares and actually listens to you. Some of the community assistants are fantastic but others aren’t. Luke is amazing and will treat you with kindness and respect no matter what. He’s always super nice and very willing to do whatever he can do to help you. There is a community assistant who is very rude and isn’t very helpful. This person was nice at first when I got my tour but when this person was handling the issues I would have they would tell me that they would get back to me on a certain day and wouldn’t. I would have to reach back out to this person to get them to fix whatever issue was present. This person also refused to let my stepmother talk to a manager. This person left my stepmother on multiple holds to talk to the manager when this person should’ve let my stepmother (who’s name is on the lease) talk to the manager herself like she asked to. This person also doesn’t really make an effort to listen to you or show that they care in any capacity. Very cold individual and very emotionless. I wouldn’t live at this property ever again unless they cleared out all office staff except for a few individuals like Luke, April, and a couple of other community assistants who’ve actually been helpful and kind. The maintenance staff is impeccable. The 2 men I’ve worked with in the past have been wonderful and awesome. One of the men had to come to my apartment at around 10PM for an emergency and I never felt uncomfortable or wary of him being in my apartment  late because he is super kind, respectful, and will get the job done and do it well! The older man who is on the maintenance crew is also super kind and helpful... he’s never come into my apartment to do any maintenance while I was home but he did when I wasn’t there and he did an amazing job and got my new washer/dryer in super quickly, locked my door back, and didn’t leave a mess!! If you plan on living at this community with someone you know well and won’t have issues with and don’t need to go to the office for anything you will be good but if not I do not reccomend living here. I’m moving in August and I’m disappointed because I like and appreciate so many members of the staff there but a couple of rude employees will ruin your experience especially if you have issues with anything big. But I do have a feeling that April is here to stay and she is a wonderful general manager so you might could get her help instead of a couple of the rude community assistants. Rooms are small. Bathrooms are gross. The lining between the bottom of my bathtub and floor was coming off when I moved in. There was dead bugs in my room when I moved in. There are paint brush strokes on the granite and on the white baseboards and also on the floors. The desk was stained with some white stuff. The grout in the shower was dirty. The kitchen was disgusting. Living room is a nice size. The kitchen is tiny. Not enough space for anymore than 2 people to live happily in one of these apartments. I lived in a 3 bedroom and we were constantly all over each other. There simply isn’t enough space in the kitchen for 3 people and all their food. The pantry is also too small. Hardly any storage space. The bottom of the cabinet under the sink is rotting because of a water leak and has been that way since I moved in. It smells absolutely disgusting. I wouldn’t recommend living here unless you had no other choice.", "pics": null, "resp": {"time": 1560804679142, "text": "Thank you for speaking with me over the phone, Savannah. It was great to have a chance to sit down and really dial in on what about The Beacon was making you unhappy. I would like to extend the offer for a follow-up discussion should you feel the need to talk through any other aspects you feel we didn't get a chance to touch on. Just give me a call at your convenience; thank you! -Amy Verner, GM"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "103486923440201779278", "name": "Megan Hodges", "time": 1424279052774, "rating": 5.0, "text": "I really love it here at Eagles Reserve. The office staff and maintenance staff are so friendly and always get to my service requests really quickly. Plus I feel super safe here and that was a real concern for me and my parents when I moved to Auburn. Definitely plan on staying here until I graduate college!!", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "112959600030432221084", "name": "demon stallion", "time": 1504534837157, "rating": 5.0, "text": "Pretty good place to live. wish the grill had gas more often but other than that there is really not much wrong with this place at all. the staff is friendly and the manager is understanding.", "pics": null, "resp": {"time": 1507120576199, "text": "Thanks for the great review!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "111054137748079270162", "name": "Morgan Robinson", "time": 1535991141789, "rating": 4.0, "text": "I enjoy living here. The room is nice and a decent size. living room and kitchen area are nice. there could be more parking. and the wifi has been out for a few days.", "pics": null, "resp": {"time": 1536098407955, "text": "Thank you for the 4-star rating, Morgan! We are so glad to learn that your experience has been positive! We encourage you to please visit the office, or call us, so we can address your concerns and get it taken care of as soon as possible. We would love to earn the remaining fifth star!\nBest,\nThe Beacon Management"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "109820974688469199214", "name": "Joseph McGlawn", "time": 1580225156789, "rating": 2.0, "text": "The college students working on the Beacon's staff are SO sweet. The general manager acts pretty annoyed with you when you have issues with your apartment and I've had plenty.\n\nThis is a review from 2019 - and I was told Amber is no longer there!", "pics": null, "resp": {"time": 1540328412269, "text": "Joseph, we appreciate you taking the time to leave us some comment online! As Amber is no longer with the company, we'd love to take some one-on-one time with you to address your concerns directly, and see where to go from here. Just stop in and mention your review whenever you get the chance. Thank you!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "114301747885224381626", "name": "MIN SEOK SONG", "time": 1564632333333, "rating": 3.0, "text": "I was never able to enter back door of the clubhouse in the night to workout or get my package. I went to ask more than seven times to address the issue, and the staff always told me they would fix it but it never worked. My rent payment was occasionally not processed after I paid and so I had to go back to the office again with my receipt, which was time consuming and frustratinh. Good but slow maintenance. There were cockroaches when I lived first floor. Internet is ok but sometimes stopped working in the bad weather. Overall clean/decent place but keep those things in mind in your worst case.", "pics": null, "resp": {"time": 1564689229709, "text": "Thank you for the honest and thorough review, Min Seok. We will be utilizing this feedback, primarily the lack of initiative to fix the doors and the maintenance speeds, in our next team meeting to better understand why this occurred. We genuinely appreciate the balanced feedback you've provided here."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "104568430244766380732", "name": "Brandon Lee Ray", "time": 1475173375237, "rating": 5.0, "text": "This is in response to Nick Turner's review. I am so sorry that you had a less than ideal experience at The Beacon! I would like to clarify a couple of the comments that you made in your review. I am not saying that the event you described didn't happen, but I can assure you that I was not the employee that was involved in the situation you described. I have never called the police on any one, I have never identified someone for the police, and I have never filed a formal complaint against a person. Normally I would not respond to a review, but since you have explicitly mentioned my name on such a public forum, claiming that I was the cause of such a horrid event, I wanted a chance to rectify my name. Again, I am not claiming that this event did not occur, but I want to make it clear that I was never apart of it.\n\nThank you,\n\nBrandon Ray", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "115388528681835172274", "name": "Eddie Crosbie", "time": 1430963929671, "rating": 3.0, "text": "Although the rooms may be a bit dingy, and the internet can be slow, the staff and attempts of the management to make the Reserve an enjoyable place to live are well meant. They're always friendly and polite while management is accepting and flexible. They're online pay system did give me quite a bit of trouble, but they accepted all of their mistakes and made it very easy for me to fix them. Honestly, the worst thing about it is probably the lack of organization within their system, but this is understandable seeing as though they're reworking everything. Probably a bit pricey for what you're getting but you could definitely do worse.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "108972390537961737654", "name": "Conner Badger", "time": 1568603029193, "rating": 1.0, "text": "The fact that you have to get a visitor pass that expires every three days and they have to park in visitor is so much more work than it needs to be. It’s annoying to have to go to the office every three days and especially when they close.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "109847021694702431498", "name": "Cor Fre", "time": 1557642461597, "rating": 2.0, "text": "The worker who came to fix the appliances left halfway through my dryer and never came back. My dryer still doesn't work until now. It makes a lot of noise", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM0lvvS6JyjFDfYddcRZjfrbZGw_5fOv52LrWLa=w150-h150-k-no-p"]}], "resp": {"time": 1551123926494, "text": "Hey there, 卢立奇. Thank you for getting in touch regarding the internet! This is an Auburn University Master Lease building. We'l shoot an email over to our service provider to see if they can offer any assistance on the matter. In the meantime, feel free to stop by and place a work order if you're still experiencing issues."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "105014535258613286348", "name": "Jerry Yu", "time": 1569368009050, "rating": 1.0, "text": "The first day I move in, the toilet seat, lightbulb, air conditioner and the main door lock weren’t working; then I found bugs, dead roaches and food in the kitchen’s cupboard. The toilet flusher broke after a week. And the key for getting into the mailroom, computer lab and the gym never work. When the fk are those going to be fixed?", "pics": null, "resp": {"time": 1571086198474, "text": "Thank you for your review, Jerry. Unfortunately, Auburn Global was understaffed until a few weeks before turn. Therefore, a large period of time pasted without us knowing there was any maintenance issues in any of the units. Shortly after AUG hired someone we received over 150 work orders from them. This was shortly before turn, and during this time we also lost our maintenance supervisor. This is not an excuse for not taking care of their problems, however, if we don’t know about the problems we cant fix them. Since everyone is fully staffed we have put procedures in place to prevent this from happening in the future."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "100373294005081819065", "name": "Tiffani Bryant", "time": 1469418196042, "rating": 1.0, "text": "This is a review coming from someone who lived here 2012-2013 and 2015 through the end of my lease which will be 7/2017 and also worked here. HONESTLY, I would not live here unless it is a last resort. The prices they are asking people to pay, considering the size and age of the apartments here, is absolutely ludicrous. Maintenance is decent, but sometimes the delays result from things the management can't help (i.e. waiting for parts from an outside source, requiring contractors, etc.). Management isn't the best and will absolutely do their best to screw you. (I.E. I renewed for an unfurnished apartment - the new management told me they were going to put furniture of their own in the apartment. I e-mailed and told them that I had signed for an unfurnished apartment so I would not allow any of their furniture into the apartment (because of pets). Amber, the GM, e-mailed and said that nowhere in my lease specified that I had an unfurnished apartment. She said this because she wasn't aware that I had a copy of the lease which clearly displayed an X beside an unfurnished lease.) I sincerely recommend ANYWHERE else to live because the cost and headache of the management just isn't worth it. My water bill for one month was $80, another was $60 and they are still working on reimbursing me. (The water bill is split between the four people, so there is no way we racked up a $320 water bill).  They have a record of losing payments, and charging late fees because management was too lazy to process the payments on time. I implore you not to live here. Their computer lab printer HARDLY ever works, and they've decided to start making residents supply their own paper. The community events are nice, but also a staple of every other apartment complex in Auburn.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "102745428056934353783", "name": "amanda hanley", "time": 1524858601578, "rating": 5.0, "text": "I have lived here for 2 years now, I am bery happy with how the grounds are kept. The staff is very friendly and welcoming and always has fun activities and parties for the residents!", "pics": null, "resp": {"time": 1512450993598, "text": "Thank you Amanda for the five stars! Glad you like our community.\nBest,\nThe Beacon Management"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "115665748210659234631", "name": "Lukas B", "time": 1482445307683, "rating": 4.0, "text": "I lived here for 4 months and it wasn't that bad at all. I stayed in a 3 bedroom apartment. I liked the size of the bedrooms with an own bathroom and a big closet. Also, the pool area and the gym were nice. The staff was always very friendly and helpful.\nSince I was an exchange student, I only needed the room for 4 months, from Aug 13 until Dec 09. What I didn't like was that I had to rent the apartment for 5 months (including the whole August and the whole December). Also, I had to pay $100 each month for a \"short term lease\", but I kind of understand that because they probably can't rent the apartment during the year again.\nThe only thing I had a lot of problems was the electric bill: I only charged my tablet and my phone, while my roommates were always on the playstation and the computer, were listening to music through a big stereo and their TVs were always on. The Beacon doesn't charge the power directly, in every room somebody has to sign up at Alabama Power. Of course, my roommates wanted to split the bill even (which already brought a lot of discussions)... And one roommate just left in the middle of the semester without saying anything and, of course, without paying the electric bill. In the end, Alabama Power cutted off our power and I had no choice but to pay a lot of the others' power..... It would be nothing but fair if The Beacon could charge everybody directly based on their own usage.", "pics": null, "resp": {"time": 1483552294328, "text": "Hi Lukas, We greatly appreciate your feedback and glad you enjoyed your time at our community, despite the noted concerns. I will be in contact with you directly via e-mail to discuss options in which I can assist you with the electricity. Speak to you soon! Sincerely, Amber, General Manager at The Beacon"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "106171694614025710074", "name": "Elliott J Diggs", "time": 1554135215917, "rating": 5.0, "text": "I love living here so much that I renewed my after living here for just 3 months!", "pics": null, "resp": {"time": 1544814018673, "text": "Seriously, the best kind of feedback we can get. Thank you so much Elliott! We look forward to serving you for years to come."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "101276989479447047606", "name": "Patrick Williams", "time": 1605044658946, "rating": 5.0, "text": "👍", "pics": null, "resp": {"time": 1609880115789, "text": "👍👍👍👍👍  ;)"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "100928790429504207058", "name": "Tide Holobaugh", "time": 1434246591559, "rating": 1.0, "text": "Wish I could give it a zero. Honestly these people don't care about anything. My friends AC went out for 2 months and the answer the manager gave him was \"why don't you leave the windows open at night\". My hot water heater busted and flooded my living room for close to two weeks and after waiting 8 days they came and fixed the heater but told us the clean up was not their responsibility.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "103381396839323844638", "name": "Sarah Spear", "time": 1370380651536, "rating": 3.0, "text": "I've lived here for 4 years and have enjoyed my experience for the most part. Rent is never the same price year to year which can be very frustrating if you live in the same apartment. I don't see why I had to pay $50 more one lease year for the exact same place. The management is very helpful and maintenance is very good at getting to your request within a few days. The pool is nice but could use to be cleaned more. The exercise room is nice but needs more treadmills because one of them is either broken or always in use. The tanning bed is awesome and they are even nice enough to provide goggles if you need them. The only negative thing about this apartment is the card keys you use instead of regular door keys. You might think it's great at first, but trust me, you'll grow to hate them by the end. You can't just close your door to walk your dog without your card. If you forget your card, you have to get a lock out key and if the office is closed, you have to call the after hours number and it can take a while for someone to get back to you about a lockout. I wish I could have a normal lock on my door with a normal key. It's nice to have a tiger transit and we are the second stop which is great because it can fill up in the mornings and you don't want to have to be standing on your way to campus. Just keep in mind, you get what you pay for. It's on the cheaper end as far as price goes, but the appliances are dated and it could use a good sprucing.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "117614123925834405250", "name": "Ashley Wilkins", "time": 1494001506399, "rating": 1.0, "text": "The best word that I can use to describe, not only this place, but also the new management is sleazy. Do your self a favor and if you are considering living here, don't. I lived here for two years, and I am beyond happy that I moved. Even with the new management and the few remodels they have accomplished it is not worth the price, and overall unhappiness that you will experience by living here. The only positive thing I can say about it is that the sketchiness of the neighborhood was entertaining. Free entertainment on Friday nights include fights in the parking lot, residents passed out drunk next to their cars while police interrogate anyone walking to their car, police patrolling with guns out for their safety. If you are a parent considering letting you child live here, please keep looking. I learned a lot, but mostly I learned that I should have listened to the reviews I read online, and that just because it is easy to renew, that doesn't mean you should.\n\nAlso, can I just note that all the profiles who have left positive reviews about the reserve have only left one review, and do not have any information on their profile. Looks to me like someone is creating profiles just to have some positive feedback. This is a good example of how they operate their business.", "pics": null, "resp": {"time": 1500056280993, "text": "Hi Ashley, I'm sorry to read about this experience you have had at The Beacon. I am working with the property to get more detail on the issues you faced while living at the community. We take your feedback very seriously and want to ensure that all open issues are resolved. If you have any additional information, please contact me directly at manager@thebeaconauburn.com. Thank you."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "114456016865080281314", "name": "Kelsey Turner", "time": 1458858686221, "rating": 4.0, "text": "It is much different since the new management took over. My experience has been great, and all of the maintenance people are very friendly.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "102600857142852005108", "name": "Kaylee Thigpen", "time": 1472481159148, "rating": 1.0, "text": "0 Stars. TERRIBLE MANAGEMENT. They literally tried to lock me out of my apartment. Management randomly decided to change all the locks on the bedroom doors and they expected you to come get your new key on their terms. They left one note in the door saying it would be done the next week but didn't tell you what day your apartment was going to be changed and expected you to pick up your key that day during business hours. I work out of town a lot and didn't come home sometimes for a couple days at a time and got home very late sometimes so I didn't even see the notice until the day before this was done. There was no email or phone call (even though they made sure to call/email me at least 4 times a week asking if I wanted to renew my freaking lease.) So I call the office, from out of town, the day the lock is changed and told them that I wouldn't be home before the office closed and tried to see if I could get my key given to my roommate (who works in the office and I've lived with for 6 years, so I trust) or maybe get it put in the mailbox. They wouldn't let me do anything and I left several messages for the manager who refused to call me back. Finally after calling over and over again I get the manager, Amber, on the phone and she tells me that I can call the on call number when I get home that night and pay the $50 fee to get let into my room. So you mean to tell me that I pay $555 to rent this room and because you decided you want to randomly change the locks for no reason I now have to pay $50 more for you to let me in? I don't think so. After arguing with Amber about not paying the fee she finally agreed to let me sign a piece of paper stating that I consented to let her leave my bedroom door unlocked and she would personally do the change so she would make sure to leave it unlocked and I would just have to pick up the new key the next day. I wrote it up and emailed it to her immediately after getting off the phone with her and she confirmed that it was received. Fast forward to later that night, I get home and the damn door is LOCKED.  I also tried to call the parent company to speak with someone higher up about this issue while not being able to get in touch with Amber all day and the receptionist there told me \"she didn't know what I wanted her to do about it, she was getting off in 15 minutes\" then after telling her that she needed to do SOMETHING about it TODAY, she said she would have someone call me and I never heard from anyone from there again, so don't even bother trying to go higher up. This is one of many problems we faced, I would strongly advise to live literally anywhere but here.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "112894526343741449128", "name": "Jennifer Lucas", "time": 1372629778741, "rating": 2.0, "text": "You get what you pay for is exactly right!\nGood things:\nSuper cheap rent, the only bill you'll have is power which will be split with your roommates(internet, cable, water all included), pool, computer room, and fitness center, and parking is nice (you can always park in front of your building), w/d in unit, the maintenance guys are super nice and will help you with whatever issue you have. Pet friendly\n\nBad things:\nThe apartments are VERY small, good luck fitting a bed larger than a full in the rooms. Whoever manages this property doesn't care too much about making sure the units are kept up. You can tell each year when they repaint the walls they just paint over the plug plates instead of removing them. As a result you can't use every plug because it'll be too caked in paint for the plug to fit. There is also painting drippings around the border of the room, from them not putting anything down to cover the carpet before painting. This wouldn't be an issue, but the carpets are a brown/black fabric so the white spots stand out like a chocolate sprinkle on vanilla ice cream.The appliances are old. The kitchen is literally stuffed in a corner, and the counter space is awful. If you have a microwave on the counter good luck fitting much else. Pest control, if they even come, must use water when they spray because you will have bugs!!! They'll come from everywhere, the windows, the shower, the sink, wherever! So if you don't like bugs I'd suggest finding another place to live. They recently painted the buildings and claim to have renovated the apartments, this isn't true. All they did was put in new mattresses and living room furniture. The walls are paper thin....so thin I can hear my roommate snoring in the next room. And if you have someone above, forget everyday being peaceful and quiet. They could be walking from the kitchen to their bedroom and it'll sound like a herd of cattle are moving around above you. Not only are the units noisy for lack of insulation, this place is like the party spot. So if you like to spend your nights studying at home, you might as well hang it up here. Someone will always be partying, riding around with loud music, yelling, whatever. But at the same time this can be expected from a lot of living places in a college town.\n\nI lived here very briefly and moved on to somewhere nicer and quieter. I would never live there again, you couldn't pay me to live there again. In all I'd look around for somewhere else to live, and come here only as a last resort.\nHope this helps!", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "117265389111356274877", "name": "Haley Nixon", "time": 1409883324542, "rating": 1.0, "text": "I've lived here going on 3 years now, and the only great thing about it is the price (which is relatively good but still goes up every year) and the convenience. There's a Tiger Transit stop, and it only takes about 15 minutes to get to class, so it doesn't get much better than that. Other than that, the apartment you'll be living in is nothing like the model they show you. It's pretty much luck of the draw: I got one of the nicer apartments where mostly everything worked, but my boyfriend's apartment had the linoleum coming up in the bathroom and mushrooms growing out of his bathroom wall because of the mold. Management does not care about fixing any damages; in one apartment, the crown molding had been scratched off because of a past resident's dog, but all they did was paint over it. The space you're getting is nice, but be prepared for something to break, and I've had instances where my roommate and I both put in over 5 maintenance requests for just one issue before they came to fix it, and we've even had to call the office. Walls are paper thin, and you can hear your neighbor's conversations through the walls; you can even hear the person above you using the bathroom. The place uses key cards, like a hotel, instead of actual keys, which seems cool at first but eventually, it's a nightmare. You'll lose them, or they'll break, in which case you're charged money for a new one. God forbid the front office is closed because the person who is on call to come and help you usually takes a long time and seems more bothered than anything that you called. As a resident, I've had my car towed before (even though there was a parking permit in my car), and I had to pay $100 to get it back, but the office didn't seem to care. People who don't even live at the complex come here to throw parties or use the pool, and once again, the office doesn't check or care. I've seen bunches of young children in the pool during the summer who I know are not college students living here. Parties are constantly being thrown after hours, but the person on call seems more annoyed that they're being bothered to do their job, so the police usually end up getting called. Amenities are pretty cool, and there are always fun events being had for residents, but the printer in the computer lab, never, EVER works, and even if it does, there are residents who use the computers in the front office to watch movies, listen to loud music, or play games for days on end, and nothing is ever done about it. In short, pros are convenience, price and events for residents, and cons are just about everything else. Your money would be better spent elsewhere.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "102471916024414604980", "name": "Brett Todd", "time": 1431360777934, "rating": 1.0, "text": "Overall, it's been a terrible experience ever since the new management arrived. The maintenance staff is unprofessional, messy, and terrible at doing their job correctly the first, second, etc. number of times. My roommates and I had to move apartments during finals week, and during that same week, we were consistently woken up early to the sound of hammers and yelling of the construction workers. I had to live without working air-conditioning for at least 2 months, after repeated requests for the problem to be fixed. The management appears to have little or no experience doing there jobs and show little talent in general. For the increased and pricey number they want to charge for such few benefits, I would highly recommend that anyone look elsewhere for a quality apartment experience.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "114772132024234201728", "name": "Amber Sprayberry", "time": 1549391342363, "rating": 5.0, "text": "Absolutely love living at the beacon the staff and housing are amazing", "pics": null, "resp": {"time": 1549409179284, "text": "Absolutely love having you with us, Amber! Thank you for stopping your busy schedule to give us some digital love."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "116571219054549076159", "name": "Ian Trobaugh", "time": 1542253678164, "rating": 1.0, "text": "Edit to this review: The Beacon responded below as well on other social media platforms saying that they would reach out to me about this issue but months later I have still heard nothing. The time I went into the office to ask about this the person at the desk was extremely dismissive and seemed annoyed that I was asking. I have, however, been asked multiple times a week for the past month if I wanted to renew my lease. That answer remains an absolute no until this issue is actually addressed.\n\nGood location and apartments. However, the internet is so terrible that I could never recommend that anyone lives here. I regularly have issues where I can't even check my emails. After contacting the management staff I was directed to the ISP and their customer service blamed my computer despite it working fine everywhere else I've lived. Management said that they \"upgraded\" the service over the summer, but that hasn't improved the quality of the internet at all and has only made the service even worse.", "pics": null, "resp": {"time": 1535382009005, "text": "Ian,\nWe are disappointed to learn that you are still having issues with your internet. We are working diligently to ensure that our residents' expectations are met. We are looking into this, and we will be reaching out to you shortly. We appreciate your feedback!\nBest,\nThe Beacon Management"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "116563844137004172642", "name": "Jay Dayton", "time": 1451770314598, "rating": 1.0, "text": "This place sucks. Before living here I overlooked the reviews as its just people complaining about the little things and honestly if there was something wrong here or there it wouldn't be a big deal but there is a lot that goes into this place being terrible. Out kitchen seems to have been made from the cheapest plywood available and then spray painted. The living room is small and there are marks where paint dripped off the walls all over the floors. The doors aren't fitted into place properly and seriously alter the temperature of the apartment. The thermostat doesnt work. In one semester our water heater broke twice. The carpets are decent but again they are poorly stapled down and i can pretty much pull it up if i wanted to. We had a serious bug problem for a little while that was resolved by spraying a ton of raid everywhere. The hot water heater, besides breaking, is also tiny and many times if my room mate just showered i would have cold water. The bar and countertops are terrible. Outside the sprinklers run every night regardless of if it had been raining the entire day which isn't really that bad it was just really annoying because when i would walk my dog i would be avoiding puddles constantly, not to mention a waste of money for the complex. Don't even look here you will regret living here.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "114991788012273764191", "name": "Ty Shontice", "time": 1449071926394, "rating": 1.0, "text": "Needs new management ASAP!  Even with a parking permit they still towe your car! Worst apartments ever they get over on you and just want your money! Please do not move here", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "103418833031814782136", "name": "Madeleine Griffin", "time": 1463695957205, "rating": 4.0, "text": "No complaint other than the management. They need to be more professional.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "112143835586682914149", "name": "Shayan Budhwani", "time": 1538079316583, "rating": 5.0, "text": "Great place to live There's always something going on at The Beacon", "pics": null, "resp": {"time": 1538146808828, "text": "Glad to see you enjoy getting involved where you live, Shayan! Thanks for leaving us a great review.\n\nBest,\nThe Beacon Mgmt."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "114571320534297017192", "name": "Ly Truong", "time": 1597353356981, "rating": 1.0, "text": "Rude, nasty and unhelpful staff.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "106739202340125208364", "name": "Kellie Jones", "time": 1402705044465, "rating": 1.0, "text": "They only got that star because you can't give them none. There is always some issue or another with this place and if you have class or work until 5 PM like most normal people do good luck getting any help. Staff after 5 PM is completely useless for anything other than an awful attitude and incompetency. They refuse to contact management since they say they can lose their jobs over it. As soon as my lease is up I will be going somewhere else because this place is awful. Management even went so far as to come into my apartment without calling me because I had roommates moving in and left trash in my bed! GO ANYWHERE BUT HERE!", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "105939550286708514854", "name": "Laurin Coley", "time": 1464999100370, "rating": 1.0, "text": "This is the worst apartment complex in Auburn!!! I would have given zero stars but it wouldn't let me! I can't begin to tell you all the things that have gone wrong. From mud coming up from the bottom of the toilet - to the maintenance man dropping a desk on my daughters car and causing $2000.00 worth of damage. They did end up paying for it but it was a huge hassle! If you plan on signing a lease here be prepared to loose your mind every month that you have to deal with the management!!!!!!! Sign a lease anywhere in Auburn but here!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "105141940987092511590", "name": "Jackson Lawrence", "time": 1438324982392, "rating": 1.0, "text": "If you can avoid living here, do so. It's terrible. Maintenance is awful and the staff isn't very helpful either. My roommates and I moved into a unit with a broken washer and when maintenance came to replace it they gave us another broken washer. All in all it took about 2 1/2 months to get one that actually worked. Bottom line, don't live here.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "108928597154109895377", "name": "Feifan Cheng", "time": 1520066548514, "rating": 1.0, "text": "The air conditioner unit outside the windows is extremely noisy. I can’t fall asleep even at 3:00 am. I’m really disappointed when I reflect this problem, they don’t solve this. Write at angry night", "pics": null, "resp": {"time": 1517507800654, "text": "Feifan,\nWe regret that you have had a negative experience. Pease come by our office, or contact us by phone, so we can come to a positive resolution. We appreciate your feedback.\nBest,\nThe Beacon Management"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "110003202818413584669", "name": "Helen Colburn", "time": 1438175679576, "rating": 1.0, "text": "Maintenance is terrible. Apartment stays hot in summer and freezing in the winter. They let anybody live there including drug dealers. Charged me for paint upon move out and then remodeled the entire apartment. Customer service is just as bad. Look for some where else to live.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "107706422921574028086", "name": "e S", "time": 1431352594694, "rating": 1.0, "text": "The newly refurbished rooms are a big upgrade from the old ones. However the place is still built cheap so expect things to break and if you don't get it fixed they will charge you despite it being their poor build. The rental fee is highly overpriced for what you get. You're going to have get your own internet through Charter because their wifi is wildly inconsistent and when it works it's incredibly slow. If you get a roommate who refuses to pay his/her cut of the electricity bill theirs nothing you can do to make him/her pay it and the staff won't do anything but call them. If you use the AC unit expect your bill to be outrageous because this place has zero insulation so the machine will have to run non-stop to keep it at temperature. We had a $315 bill during the winter. As I mentioned they are refurbishing the place so your going to be hearing construction crews beating and working on things when your trying to sleep in the morning. If you don't care about the price it's a fine place to live but their are a lot nicer and cheaper places to live in Auburn. Find a Real Estate agent and let them find you a place. If you do choose to live here KEEP YOUR RECEIPTS from paying rent. They will try to accuse you of not paying rent. I know multiple people here who received letters instructing them to pay a bunch of late fees or be evicted when they had already paid rent. Their printers are always out of ink or paper, the pool area is a wreck, the hot tub is always broke, and the gym is a joke. Avoid this place if possible or prepare for a year of hell. BTW any good reviews on hear were most likely placed by the staff. If you really want truth just go around and talk to some of the residents. They will tell you everything you need to know about this awful place.***UPDATE*** Charter is no longer available here so you will have terrible internet. Yet another reason not live here.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "102117368062528542128", "name": "Peter Pan", "time": 1416812649826, "rating": 1.0, "text": "This apartment complex is deplorable. Honestly, when you walk into the office and go to sign a lease, you're signing yourself up for a year of awful conditions. The heating/cooling system is wildly inconsistent; somehow my room always ends up baking like an oven no matter how cold the AC is. The WiFi is a joke. I could accomplish more internet surfing with a 3G hotspot from any old phone. The maintenance staff is downright lazy and careless. The power kept going out and the hot water heaters always break. If you have a dog, don't get too excited over their so-called \"dog park\". It's just a really large crate. Eagles Reserve is just a terrible place to live, and not only do I not recommend it, but I strongly urge you to seek a better location. Your money should not go towards unbearable living conditions.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "106824398562712722964", "name": "China Clay", "time": 1493144404808, "rating": 1.0, "text": "To whom it may concern,\n\nThis process started 4/21/17 when i called to inquire about the apartments/rooms at the Beacon. In every conversation I had I let them know that I had a 1 Yr. old that would be living with me. The whole process was horrible because you would ask the employees questions and they never had the answer and during the weekend the manager was not there at least when I called. During this awful process I still kept going with the process. Fast forward to Monday I have spoken with that office over 10xs. I receive a call from Taylor saying everything was good to go and I can move in Tuesday 4/25/17 and I would just have to bring payment of 102.00. I was excited despite the issues with the process. I packed my car that night and was handing off my key today Tuesday 4/25/17 to my old place. Amber the General manager sends me an application for my son and I fill it out. I then arrive at the beacon with the money order ready to bring my stuff upstairs since I was already told I could move in. Amber then tells me since my Son is 13 months which still means he is a 1 yr. old I can not move in after yesterday I was told everything was approved and I could move in. Now I have my car packed with no where to go so Now I am homeless with a one year old. I have to spend money at a hotel so my son can have somewhere to sleep after the beacon told me I can move in and then takes it back. I wish someone would say sorry or not because sorry doesn't change my situation. You people are horrible and the worse and obviously everyone needs to be retrained including someone whop holds the title of General Manager.", "pics": null, "resp": {"time": 1493242288572, "text": "We are truly sorry for any miscommunication that lead to this unfortunate string of events. We have established policies in place to ensure that all current and prospective residents are treated equally. Once we became aware that your son was over 12 months old, we informed you that we would need to follow our policy regarding your accommodations and therefore would be unable to complete the signing of the type of lease you requested.\n\nThat said, our mission is to create successful communities, with safety and well-being as our primary concerns. Though you are not a member of The Beacon resident community, as a member of our greater community we reached out to make sure that you and your son have a safe and comfortable place to stay for the next two nights. We have contacted you to place you in a hotel for those days at our expense. We are also working to help you find a new home that will both fit you and your son’s needs and falls within your price range. We look forward to working with you to help you find a place you can call home."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "100878381929210697781", "name": "Ashley lucas", "time": 1415743421000, "rating": 1.0, "text": "Do Not Use This Apartment Complex!!! Maintenance is horrible, facility badly maintained. Reported problems for the 2 years I lived there with no response...then they charged me to \"clean\" what I had reported to them. Tried to discuss the situation with them and got no response, they just send you to a collection agency. DON'T LIVE HERE!", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "100903914535754312408", "name": "Miranda Reese", "time": 1468264731251, "rating": 1.0, "text": "I've been moved to different apartments 3 different times and have not been able to stay in the same place for over a year. My newest place floods every time it rains and each time the management has been very pissy with me. The money I saved on rent has not been worth the massive amounts of property damage I have experienced. This place isn't even 0 stars, This place is negative 5 stars.\n\nedit: after claiming they fixed the flooding problem, my roommates and I left for winter break, only to come back to half an inch of standing water and mold covering the walls and floors. They just painted over the walls and vacuumed the carpets, and did not clean my bathroom or closets, because they blew the fuse in my bathroom and did not come down to fix it no matter how many times I nagged them.\n\nI litterally can not describe how angry I am with this complex, please for the love of god, learn from my mistakes.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "115745094779453692838", "name": "Deja Atkins-Chambers", "time": 1524859120581, "rating": 5.0, "text": "Place is Great been an Awesome 2 years!!", "pics": null, "resp": {"time": 1525057204635, "text": "Thank you Deja for the five stars!\nBest,\nThe Beacon Management"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "116164922526361384150", "name": "Nick Turner", "time": 1472682829345, "rating": 1.0, "text": "This coming from a parent of two previous residents. At first glance the facility is well maintained and there was some upgrading going on the last time I was there, thats a positive. The negative I experienced was with  an individual who should have been representing the facility but instead discredited it. As a good father should I was loading my daughters furniture on my trailer to get her moved out of her apartment on 28 Jul 2016. While fastening the cargo down I saw a golf cart pull up behind me and a short round heavy set young man rolled off the cart and started running his mouth about something as he headed into the buildings breezeway. He stopped short of the building and started saying somethingto the effect of \"I bet your having a better day today then you did the other nite\" and\" I'll make sure you dont ever get the chance to,\" l continued with securing the load. I then asked my daughter what was that guy talking about and why was he taunting her. She said he lived above her and it was something that happened 2 or 3 nights earlier, I then asked is he a resident or does he work there, she said both. I told her if it wasnt for her moving out I would file a complaint with the office. It was as if he was trying to start a confrontation but let it be known he was in charge. He came out of the 2nd floor apartment headed towards the golf cart, mumbled something else, but before he could leave another young man standing on a scaffold at the building next to hers. He went back to the cart and left, a minute or so later my daughter and her friend left in her car and was behind them in my truck w/trailer. As I headed out of the complex an Auburn police vehicle was heading in. I stopped and waved the officer to pass in front of me, he waved back and continued. I got on College headed towards I-85 and was pulled over, questioned about making threats against an employee at the complex, told I was identified as the one that made the threats, my truck was identified as the vehicle that was involved, forced to stand outside of my vehicle while another officer went and got Mr Brandon Ray, the accuser, so he could identify me. Well long and longer story shortened, Mr Ray in his haste to re-inflate a situation from 2-3 nites earlier decided to call the police and put a new flame on a already extinguished iincident,  ironically against a wrong person. Not to mention that whatever had happened earlier was taken care of by the authorities nites earlier, the proper authorities !!! The whole thing was sorted out, the police explained the misunderstandings I said I understood however it was totally unnecessary, we shook hands and went our seperate ways. However, in my 90 minutes of unnecessary detainment and somewhat mild harassment I decided that Mr Ray should learn from the error in his ways. It was the \"right thing to do\" to use local law enforcement to handle non conforming residents or guests of residents a few nites earlier for whatever reason. When you represent a multi million dollar apartment complex always be a part of the solution and not the problem. It is the \"right thing to do\" to exercise the authorities to uphold and maintain rules and regulations of the property you work for and represent. It is \"not the right thing to do\" to taunt or badger residents or guests for any reason. It is \"not the right thing to do\" when you attempt to recreate a bad incident so you can change or control the outcome !!! I sincerely hope the owners of this complex takes a hard look at the many many negative things written in the reviews about the management team of the The Beacon. I hope they get proactive and make some necessary changes. I would not recommend spending money here until so. I would also recommend that if Mr Ray is going to continue working for them, he take some courses on professionalism, stay off that golf cart and do some walking. This will allow him to become better at dealing with the people who pay his wages.\nThis was my experience and my opinion.\nThanks, Contributing parent of the class 2017 & 2019", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "117614404125356300173", "name": "caleb covert", "time": 1429479538617, "rating": 1.0, "text": "Every year we have problem after problem starting from AC not working during the beginning of fall, work orders taking forever, and then with moving during the end of the semester. It honestly should of been done during the summer and not when school is at its busiest.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "105250128427454729380", "name": "Stuart Moon", "time": 1428084485640, "rating": 1.0, "text": "Impossible for me to decide where to begin the list of everything wrong with the management here. Completely inconsiderate from day one.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "100198971370535323836", "name": "Madison Brown", "time": 1428943623676, "rating": 1.0, "text": "Please do NOT live at Eagles Reserve.  My roommates and I are miserable living here.  Maintenance requests rarely even get filed, nonetheless actually resolved.  The property manager is not helpful and has lied to us on several occasions seemingly just to make us leave her alone when we complain.  Even the executive manager has been rude and said he does not care about their reputation.  When we first moved in, the apartment was DISGUSTING.  It had obviously not been cleaned at all, and we had to clean it ourselves before we could even begin moving furniture in, but the staff didn't seem to care.  We went the first two weeks without being able to cook or wash clothes because our appliances did not work, and it took that long for our requests to be filled.  We have had bug infestations, water damage, we've been forced to move apartments due to construction, and we were told we will be forced to move AGAIN by the end of the year, but they cannot tell us when because they are so unorganized.  While we are waiting to move again, they have begun construction on the building WE LIVE IN.  It is extremely loud, begins every morning at 8:00am, and lasts until around 6:00pm.  But, of course, the property manager does not care.  Nothing gets resolved no matter how many times we express our unhappiness. Everything about Eagles Reserve is awful. Just... don't sign a lease here.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "102141833193011774036", "name": "something something", "time": 1437621987952, "rating": 1.0, "text": "New management has been awful. Internet and television never work well. Gone at the end of the month", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "115079933738082267478", "name": "Suellen Toung", "time": 1469642727441, "rating": 1.0, "text": "Horrible management.  They make up the rules and change them at will.  If you try to pay rent in cash, which is legal tender in the US they will not take it.  If you  try to pay online with a debit/credit card they charge a $16 fee each time.  If you get it there on the due date, they charge a large late fee.  Basically, they want you to bring a check to them.  They are requiring each tenant in each apartment to have $100,000 of renters insurance with their name as the insured!!! So our 4 bedroom apartment will be insured for $400,000?!?!? For what?  When we moved in the painters had spray painted the apartment and not completely covered the floors so there was a haze of spray paint on the floor.  It looks like they tried to use paint thinner to clean the floor which stripped the finish.  There is an outline where they had things on the floor when they painted. . . like the table.  Worst management ever.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "101804753229081075142", "name": "Blake Diggs", "time": 1477007432102, "rating": 1.0, "text": "Management is terrible, Internet is spotty, and apartments themselves are renovated badly. Don't live here go to somewhere else", "pics": null, "resp": {"time": 1477605737675, "text": "Hi Blake, We’re sorry to hear about your disappointment with our community. We were not aware of any issues you had during your time here so we would appreciate the opportunity to hear about the unfortunate situations you’ve had with management to resolve them. We take current and former resident feedback very seriously and strive to make everyone feel accommodated. Please contact me directly at adukes@thebeaconauburn.com. Hope to hear from you soon!"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "111164822536047516633", "name": "Emily Self", "time": 1538061923712, "rating": 5.0, "text": "I LOVE THE BEACON", "pics": null, "resp": {"time": 1538146809214, "text": "THE BEACON LOVES YOU! Thanks so much for leaving us an awesome rating, Emily! We're lucky to have you.\n\nBest,\nThe Beacon Mgmt."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "109779961408501651100", "name": "Ariel Holland", "time": 1460726279703, "rating": 1.0, "text": "This was literally the worst experience I've had with renting an apartment. Anything and everything you could think of has went wrong with our apartment and it has still yet to be fixed since the beginning of the year when we reported things broke. Our washer and dryer has been broke for about a month now and we submitted a maintenance work form forever ago and guess what it has not been fixed yet either.I do not recommend this place to anyone. I don't want you to have the experience like we did.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "117332785803077672400", "name": "Jasmyn B", "time": 1405016875610, "rating": 1.0, "text": "This Place Is TERRRRIBBBLE. VERY unorganized. There is always a problem. there is mold in one of roommates bathroom. if you do decide to stay here, let them show you your apartment that you will be living in, BEFORE you sign for anything or PAY the rent!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "102626956426254619241", "name": "Jantzen Lee", "time": 1425428383296, "rating": 1.0, "text": "literally the worst apartment complex available. we had to move between a total of three apartment buildings over a year, refused to replace a broken washer/drier.", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "103080639254851524128", "name": "Austin Osborn", "time": 1479330395446, "rating": 4.0, "text": "Decent choice for an apartment in Auburn.", "pics": null, "resp": {"time": 1479416994265, "text": "We appreciate the 4 stars, Austin! Let us know if you have any feedback on how we can make the community even better."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "102234052720987403800", "name": "Shengkai Xu", "time": 1524859143541, "rating": 5.0, "text": "Very good place", "pics": null, "resp": {"time": 1525057205162, "text": "Thank you for the five stars Shengkai!\nBest,\nThe Beacon Management"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "113435675359045312234", "name": "Jessica Foy", "time": 1559091921495, "rating": 4.0, "text": "cool place", "pics": null, "resp": {"time": 1559143024357, "text": "Hi, Jessica! Thanks for the 4-star review! We'd love to earn that last remaining star, so please let us know if we can be of assistance in any way."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "108641697076889487942", "name": "foreign gamer", "time": 1538775633451, "rating": 5.0, "text": "the staff is cool", "pics": null, "resp": {"time": 1538956808798, "text": "Thank you so much for the five stars, William! We are so glad to learn that you have had a positive experience, and we'll be sure to pass on your kind words about our staff!\nBest,\nThe Beacon Management"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "109553673850843247458", "name": "Alexander Noal", "time": 1587432017557, "rating": 5.0, "text": "the place", "pics": null, "resp": {"time": 1593527189139, "text": "The review. :)"}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "111155257218135629750", "name": "Rock SunY", "time": 1500939282017, "rating": 1.0, "text": "so bad", "pics": null, "resp": {"time": 1501203473708, "text": "Hello, we're sorry to see you have had a negative experience at our community. We would love to hear your feedback.  Please email leasing@thebeaconauburn.com so we can discuss further."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "112693812076576047572", "name": "Zifan Chen", "time": 1470156146255, "rating": 1.0, "text": "Awful", "pics": null, "resp": null, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "113432797649185594503", "name": "Su K", "time": 1569384343871, "rating": 1.0, "text": "(Translated by Google) If you're coming through Global, you can go for a little bit more money; if you can't face the sudden cockroaches that emerged suddenly and can't withstand the spiders that come out of the way, try to repair your troubled machines Some of the staff are nice and can be repaired quickly, but they don't fix it right away. And on the map it looks like a school, but it's far from the school and far from marts like Wal-Mart. Please don't come. Beacon ,, live and know somewhere else, but real beacons are not a place to live.\n\n(Original)\n별 하나도 아까울정도입니다ㅎ어번글로벌 통해서 혹시 오실꺼면 돈 조금 더 내더라도 좋은 곳을 가세요;;언제 어디서 갑자기 생겨난 바퀴벌레를 마주하고 시도때도 없이 나오는 거미들을 견딜 수 없으면 당장 피하세요,,고장난 기계들 수리는 몇몇 직원분들은 착하셔서 빨리 수리되는 경우가 있지만 웬만하면 바로 고쳐주지를 않아요ㅎ 그리고 지도상으로는 학교랑 가까운듯처럼 보이지만 학교와 멀고 월마트같은 마트들과도 꽤 거리가 멉니다 보안도 별로 좋지않구요 그냥 피하세요 진짜 오지마세요 비컨,,,다른데 살아보고 알게되었지만 진짜 비컨은 살만한 곳이 못됩니다,,,", "pics": null, "resp": {"time": 1571086151836, "text": "(Translated by Google) Unfortunately, AUG was short on staff a few weeks before its turn. Therefore, it took a long time without knowing that all devices had maintenance problems. Soon after AUG hired someone, we received 150 work orders from them. This was on the verge of a transition and lost maintenance supervisors during this period. But it's not an excuse for not having solved the problem, but it can't be solved if it can't. Since all employees are fully employees, we have established procedures to prevent this from happening in the future.\n\n(Original)\n불행하게도, AUG은 차례가되기 몇 주 전까지 직원이 부족했습니다. 따라서 모든 장치에 유지 보수 문제가 있음을 알지 못한 채 오랜 시간이 걸렸습니다. AUG가 누군가를 고용 한 직후 우리는 그들로부터 150 개의 작업 지시를 받았습니다. 이것은 전환 직전이었으며이 기간 동안 유지 관리 감독자를 잃었습니다. 그러나 문제를 해결하지 못한 것에 대한 변명은 아니지만 문제를 해결할 수없는 경우에는 해결할 수 없습니다. 모든 직원이 완전히 직원이기 때문에 앞으로는 이러한 일이 발생하지 않도록 절차를 마련했습니다."}, "gmap_id": "0x888cf3bb507f5291:0x66f31486c15f55b2"}
{"user_id": "107300768138125334277", "name": "Ethan Bibby", "time": 1581212529900, "rating": 5.0, "text": "Lovely place", "pics": null, "resp": null, "gmap_id": "0x888a51e2a4d409cf:0xc8df78bd14b557c"}
{"user_id": "108095566621821301234", "name": "Helber Fuenmayor", "time": 1564706970959, "rating": 5.0, "text": "(Translated by Google) good\n\n(Original)\nbien", "pics": null, "resp": null, "gmap_id": "0x888a51e2a4d409cf:0xc8df78bd14b557c"}
{"user_id": "118363550671340189583", "name": "Bailey Fox", "time": 1560478889520, "rating": 5.0, "text": "A great dorm, though your roommate really makes the difference in your experience.", "pics": null, "resp": null, "gmap_id": "0x888a4e1d357d5da3:0x7a2b60730d8ab325"}
{"user_id": "113141920140897445838", "name": "Wayne Martin", "time": 1535151500645, "rating": 4.0, "text": "Satisfactory place to start a college education", "pics": null, "resp": null, "gmap_id": "0x888a4e1d357d5da3:0x7a2b60730d8ab325"}
{"user_id": "112284642926094728532", "name": "Whitney Weiss", "time": 1572027342837, "rating": 3.0, "text": "For the freshman dorms, its it's okay.", "pics": null, "resp": null, "gmap_id": "0x888a4e1d357d5da3:0x7a2b60730d8ab325"}
{"user_id": "114626472600583803064", "name": "Martin Garcia", "time": 1619461306621, "rating": 5.0, "text": "Great for incoming freshman, nice living quarters.. friendly people around you.", "pics": null, "resp": null, "gmap_id": "0x88860303e633f993:0xce78f6eb8fa78ca7"}
{"user_id": "109828064700105738431", "name": "bianca m", "time": 1597416574848, "rating": 5.0, "text": "nice facility very clean", "pics": null, "resp": null, "gmap_id": "0x88860303e633f993:0xce78f6eb8fa78ca7"}
{"user_id": "100428795450614047391", "name": "Brandy Lee", "time": 1535343457138, "rating": 5.0, "text": "Amazing location!!! Very clean and friendly environment. Owners are very attentive and kind. Cheapest place yet! Washers are dryers worked fantastic! All around amazing experience.", "pics": null, "resp": null, "gmap_id": "0x88892b5adebdea3f:0x126c8d36ec6aa58b"}
{"user_id": "106606782814311635219", "name": "goldie nelson", "time": 1574610464441, "rating": 1.0, "text": "This place is not open the hours described. It's Sunday, 9:47am and it is closed.", "pics": null, "resp": null, "gmap_id": "0x88892b5adebdea3f:0x126c8d36ec6aa58b"}
{"user_id": "116262173000978198638", "name": "June Howard Barr", "time": 1492650560864, "rating": 5.0, "text": "Great residence hall!!", "pics": null, "resp": null, "gmap_id": "0x887d486ed183cc63:0xc04d385f0c2f0921"}
{"user_id": "109044264693179136738", "name": "Lillith Mykals Kennedy", "time": 1531624179907, "rating": 3.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x887d486ed183cc63:0xc04d385f0c2f0921"}
{"user_id": "115399013445031593041", "name": "Yancy Morgan", "time": 1623936958006, "rating": 5.0, "text": "Great place for students", "pics": null, "resp": null, "gmap_id": "0x88891be87ab191cb:0x91d87290ee78337a"}
{"user_id": "113093615931730298638", "name": "Carolyn Maddox", "time": 1571795056947, "rating": 5.0, "text": "Home away from home!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNTVEGPzIV0_NDklhiBpoRdoSoWxB9E3BjvM8jz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN7-CC4rChTI0B0iTJDyEO8iOZ02oX13UUCG4UY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO2h2MwqqXrPowYBBk9D-7yVJBvZKm6sa4sPlHk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891be87ab191cb:0x91d87290ee78337a"}
{"user_id": "110614043025173186001", "name": "sean schofield", "time": 1535572565499, "rating": 5.0, "text": "I have a freshman staying here, she loves it.", "pics": null, "resp": null, "gmap_id": "0x88891be87ab191cb:0x91d87290ee78337a"}
{"user_id": "105739841685119473460", "name": "Xuan-nhi Nguyen", "time": 1555291885570, "rating": 1.0, "text": "It’s 6:30 in the morning and they evacuated the building because of a broken sprinkler. They won’t let anyone in the building for +3 hours because the building in NOT up to fire code. A CAMPUS DORM IS NOT UP TO FIRE CODE", "pics": null, "resp": null, "gmap_id": "0x88891be87ab191cb:0x91d87290ee78337a"}
{"user_id": "113912055112005276583", "name": "Beverly Holloway", "time": 1572961012813, "rating": 2.0, "text": "My daughter hates it the security harasses you there about parking to see your kid..or pick up....", "pics": null, "resp": null, "gmap_id": "0x88891be87ab191cb:0x91d87290ee78337a"}
{"user_id": "112902198555662779414", "name": "stacey wasilevich", "time": 1563055331062, "rating": 3.0, "text": "Just moving out for the summer", "pics": null, "resp": null, "gmap_id": "0x88891be87ab191cb:0x91d87290ee78337a"}
{"user_id": "105792702324704137604", "name": "Diane Andrews", "time": 1548786837629, "rating": 5.0, "text": "Grandson calls home", "pics": null, "resp": null, "gmap_id": "0x88891be87ab191cb:0x91d87290ee78337a"}
{"user_id": "117542877037314467623", "name": "Terry Willcutt", "time": 1544278176528, "rating": 5.0, "text": "Great Place", "pics": null, "resp": null, "gmap_id": "0x88891be87ab191cb:0x91d87290ee78337a"}
{"user_id": "111695085907743596951", "name": "Cole Zirbel", "time": 1627690656274, "rating": 1.0, "text": "Cannot stress this enough. Do. Not. Live. Here. From maintenance not responding to our fire alarms going off for 10 hours straight for no reason to maintenance coming into our locked rooms while we were asleep. Sinks and showers with mold to boot. Hot tub was green all year. Elevators broken on a consistent basis and bang around when they do work. Not worth it when you can stay almost somewhere else cheaper and better. Can’t wait to get out of here along with everyone else that has lived here.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOyJ4_LWBEO_Ez_s0YhY1c-vxV7zYjMCv3_0wBk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMSDVkuRWg3emQlmOW6FKYT6S0119y4Z3YuPQx6=w150-h150-k-no-p"]}], "resp": {"time": 1627919416068, "text": "Cole - thanks for your insight into living at West & Wright and providing your feedback about certain amenities/appliances. It is our apology to you that these aspects determined an unfortunate lifestyle for you and others. We recently acquired a new manager at this property who is hoping to utilize information just like this to accurately assess how to improve the quality of life onsite. If you'd care to provide more color to your concerns/issues, we'd be happy to hear them in-office or over the phone, or by emailing the GM Jamie at jmancine@westandwright.com. However works best for you. We hope to speak with you soon, Cole."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "116790256654842815932", "name": "Becca Bradford", "time": 1625669590569, "rating": 5.0, "text": "Going on my third year living here and you can't beat the location! I love being able to walk to work, class, and downtown. This is the perfect place to live with your close friends. They have great amenities and it's a good size for being downtown.", "pics": null, "resp": {"time": 1625674942036, "text": "Love to have you for round three, Becca! Thanks for your trust in our team to deliver a solid community experience that has access to so much. :)"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "108187171355092383883", "name": "Bailey Freeman", "time": 1625727937886, "rating": 5.0, "text": "West & Wright apartments is such a great complex!! It is an easy walk to campus and close to everything downtown. All of the amenities are great too!! The management, specifically Jay and Chelsea, are always super nice and extremely helpful!! Highly recommend this place to future students!", "pics": null, "resp": {"time": 1625850362102, "text": "So thankful for your support of our community at West & Wright, Bailey. Thanks for helping foster a place we all love to live!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "103176748244010277192", "name": "Grant Schurman", "time": 1614470356249, "rating": 5.0, "text": "Living at West and Wright has been a great experience. It’s been nice to have such a great location as well as be able to have so many fantastic amenities. Being steps from campus is a great perk that makes for going to classes a breeze. The leasing process is simple and doesn’t require a strenuous process, and getting maintenance done in your apartment is also simple. Overall living here has been a smooth experience and I recommend looking into living here to anyone.", "pics": null, "resp": {"time": 1614616925031, "text": "What a magnificent sentence-to-sentence journey this is, Grant! Thank you for your valued review and for speaking directly to the experiences you've had with our team."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "109375022984609905729", "name": "K B", "time": 1618704068416, "rating": 5.0, "text": "Really great complex for students. Lots of events for residents, very close to campus, and a very helpful staff. If you're looking for a great price and experience to live downtown, West & Wright is the place to go.", "pics": null, "resp": {"time": 1619197022217, "text": "Love to see you having such an amazing college experience with our community, KB! We're so thankful for your recommendation."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "114831632719296287995", "name": "Morgan Sims", "time": 1625602178442, "rating": 4.0, "text": "We signed a lease with west and Wright in October and we’ve had multiple questions about move in since then, and they’ve been super helpful to answer all of them! I’m excited to move in soon!", "pics": null, "resp": {"time": 1625692907883, "text": "Keep 'em coming, Morgan! That's what we're here for. :) Looking forward to your move-in date!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "115835279443587013953", "name": "Sam Harrison", "time": 1618703810944, "rating": 5.0, "text": "West & Wright is a great complex close to downtown and to campus. There are lots of fun events here too. The staff truly care about the residents and are always working to make sure all of the residents are happy. Definitely recommend west & wright if you’re looking for housing", "pics": null, "resp": {"time": 1619197059407, "text": "We love ourselves a good event! Thanks for taking time from your day to always participate in some fun West & Wright activity, Sam."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "101467168756104379577", "name": "Grace Martis", "time": 1618681212461, "rating": 4.0, "text": "West & Wright is super affordable for the proximity to campus and downtown Auburn. The hallways need some work but our apartment itself is perfect for a college student. It has everything we need and my roommates and I have enjoyed living here !", "pics": null, "resp": {"time": 1620311897303, "text": "Love the honesty and proactive approach to your feedback, Grace. Thank you for choosing West & Wright and making your pros and cons known!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "113593551918445115295", "name": "Sadie Stovin", "time": 1618690360663, "rating": 5.0, "text": "Living at west and wright has been so awesome!! The whole staff is great and the amenities are awesome. It’s in the best location, so close to campus and right in downtown.", "pics": null, "resp": {"time": 1619643049473, "text": "It's a pleasure to have you with us, Sadie! Thanks for being an essential member of our community."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "116615104892450168636", "name": "Lauren Andsager", "time": 1625609184489, "rating": 5.0, "text": "I give this apartment complex 5 stars 100%, it has the best location then most apartments in auburn, its downtown, its so homie and perfect place to live at!!!!! I highly reccomend", "pics": null, "resp": {"time": 1625692845451, "text": "We love this energy! Thanks for loving on W&W and commenting about it's proximity to some incredible Auburn spots. Thanks for the review, Lauren!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "101307386860923453300", "name": "Peyton Feemster", "time": 1618679664790, "rating": 5.0, "text": "Awesome student living close to campus! I love the pool and the gym amenities. They also have fun community activities every once in a white", "pics": null, "resp": {"time": 1620314766353, "text": "We love ourselves a good W&W event - thanks for participating, Peyton!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "105326264940155866909", "name": "Karlie Hughes", "time": 1618684541658, "rating": 5.0, "text": "Great location! Super close to campus and downtown (8 min to Lowder, 6 min to library, and 3 min to downtown). The pool area is always fun! W&W always has cool events going on to join as a resident!", "pics": null, "resp": {"time": 1619643234520, "text": "Karlie with the TIMESTAMPS! Thank you for the amazing details in your review!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "117963150453240035720", "name": "Greer Kelly", "time": 1618691167279, "rating": 5.0, "text": "West and Wright is a great place to live. The location is perfect and staff is super friendly. Maintenance is soooo helpful and always doing an awesome job. Glad I chose to live here.", "pics": null, "resp": {"time": 1619642865243, "text": "Great maintenance and staff is huge coming from you, Greer. Thank you for this incredible review!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "112339070868616078186", "name": "V K", "time": 1618679567919, "rating": 5.0, "text": "Wonderful apartments! The people working are so nice and very helpful. Highly recommend to anyone in the auburn area!", "pics": null, "resp": {"time": 1620314860298, "text": "We really appreciate that staff comment, VK. Thanks for leaving us your feedback!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "103762992220564264874", "name": "Zach Conte", "time": 1618516882801, "rating": 5.0, "text": "West and Wright has been nothing but helpful for me and my roommates. They respond fast and the amenities are great. Would highly recommend for anyone looking for somewhere to live in Auburn.", "pics": null, "resp": {"time": 1620315764290, "text": "Glad to uphold the standard of efficient and quality service for you, Zach. Thanks for the great review!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "107848024809298250218", "name": "Kate Bourke", "time": 1618681638944, "rating": 4.0, "text": "Awesome location and really well priced! I like the new renovations they’ve done especially to the study rooms and pool area. My roommates and I have nothing but good things to say!", "pics": null, "resp": {"time": 1620311811603, "text": "The new renovations really do put the cherry on top. Thanks for your great review, Kate!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "110724592539789095944", "name": "Haley Wilson", "time": 1614470793909, "rating": 5.0, "text": "A good spot to live and really nice people. Amenities are great when I’ve used them and staff has helped whenever I’ve asked them to. New renovations are super nice and the locations is unbeatable!", "pics": null, "resp": {"time": 1614615247903, "text": "Thanks for your excellent feedback and for choosing West & Wright, Haley!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "113095960987007586072", "name": "Catherine Klop", "time": 1613153339200, "rating": 4.0, "text": "For the most part I really enjoy living here. Appliances and apartments are nice and we have the best view of campus. The location is great!", "pics": null, "resp": {"time": 1613406391373, "text": "That view of campus tho! Thanks for the great remarks in your review, Catherine."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "101205114481505665489", "name": "Catherine Klop", "time": 1618680668467, "rating": 4.0, "text": "Loved my experience here! Can’t beat the location and  the view! Amnesties are a plus and the staff is great", "pics": null, "resp": {"time": 1620312079957, "text": "We're honored you feel that way, Catherine. :) Thanks for the great review!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "109230978565669896679", "name": "Hannah Bishop", "time": 1616168749979, "rating": 1.0, "text": "The only good things about this place are the maintenance staff and the location. Other than that I have not been pleased. The hallway carpets are stained, and when they are cleaned the stains slowly come back out. The rooms are not sound proof at all, not even the private study rooms. The trash chute sometimes overflows and people have to leave their trash in the middle of the hallway. The rooms are super tiny, and the place is just overall not well maintained by management. The only things they have updated are the common room and lobby, which people hardly use. Would not recommend, especially for the insane price you will be paying.", "pics": null, "resp": {"time": 1616610160610, "text": "Thank you for providing your feedback about West & Wright, and letting us know about the concerns you've had with the community/complex, Hannah. We set a high standard for ourselves here, and are truly sorry to hear that standard was not met in your time thus far with us. Please get in touch with us at (334) 350-3880 and we'd be happy to hold a more beneficial conversation than this review response allows.\n\nCheers,\n\nWest & Wright Apartments"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "101193116952916966146", "name": "Michaela Holt", "time": 1618872244144, "rating": 5.0, "text": "one of the best locations to live, so close to everything! Maintenance has always been so helpful and they are always so nice", "pics": null, "resp": {"time": 1619196896607, "text": "Love to hear this feedback, Michaela! Thanks for choosing West & Wright."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "100654689694611991452", "name": "Emily Kable", "time": 1618677462548, "rating": 4.0, "text": "The location is perfect for wanting to live in downtown Auburn. The apartment sizes are good and also have good amenities.", "pics": null, "resp": {"time": 1620315729420, "text": "Emily, thank you for the great review and letting us (and other Googlers) know what life's like at West & Wright!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "106965734655082298297", "name": "Matt Jenkins", "time": 1618677808387, "rating": 5.0, "text": "West and wright is a great place to live in a great location. Good amenities too and much better prices than any building around it", "pics": null, "resp": {"time": 1620315670350, "text": "Thank you for those high-quality accolades, Matt! We certainly love the area and glad to hear you do, too."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "116597639989092859909", "name": "Sean Leonard", "time": 1618682813144, "rating": 5.0, "text": "Great location, solid pool and gym, and for some reason the mirrors don’t fog up when you take a shower.", "pics": null, "resp": {"time": 1619643328760, "text": "We think it's gotta be some magic or something in there, we don't know... but we love it too, Sean. ;) Thanks for the love!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "103961269719709640502", "name": "olivia grey", "time": 1618680866808, "rating": 5.0, "text": "Location is unbeatable!! Awesome complex and amenities, great staff & really good price for living so close to campus and having all of the amenities you have!!!", "pics": null, "resp": {"time": 1620312037299, "text": "We gotta say, that location is pretty unbeatable - thanks for mentioning it, Olivia!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "118239339903542014830", "name": "Graves Aughtman", "time": 1618678255239, "rating": 5.0, "text": "This has been a great place to call home for the past year! The pool area is my favorite!", "pics": null, "resp": {"time": 1620314969734, "text": "That pool is about to be a big highlight for this summer weather rolling in! Thank you so much for reviewing us, Graves."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "112759218840153486838", "name": "Moni Fadamiro", "time": 1618679585216, "rating": 4.0, "text": "The staff is wonderful! The amenities are super nice and it is a walking distance to campus!", "pics": null, "resp": {"time": 1620314839966, "text": "And ain't that walk just something? ;) Thank you for your amazing insight, Moni."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "103297803925262151812", "name": "Traci Medina", "time": 1618679801305, "rating": 5.0, "text": "West & Wright is so close to campus with amazing amenities! The leasing staff are awesome and so helpful!!", "pics": null, "resp": {"time": 1620314651977, "text": "We love to hear it, Traci - thanks for the excellent commentary on your W&W experience!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "114737348290834726522", "name": "Brianna Kimble", "time": 1618678214973, "rating": 4.0, "text": "The location is great and by far my favorite part of living at west and wright", "pics": null, "resp": {"time": 1620315076220, "text": "Thanks for choosing our lil' community, Brianna. :)"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "116812873882860512185", "name": "sarah t", "time": 1618692570805, "rating": 5.0, "text": "Great place to live at. It’s walking distance from downtown Auburn and the University!", "pics": null, "resp": {"time": 1619642831800, "text": "Love that the convenience offered to the community is a highlight for you, Sarah!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "117381884855310548295", "name": "Landon Masters", "time": 1618678162187, "rating": 4.0, "text": "Kept very well and people are super friendly", "pics": null, "resp": {"time": 1620315595553, "text": "Thank you for this insight, Landon. Glad we can do right by our community at West & Wright!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "113817852732535140834", "name": "Haley Holleman", "time": 1618680787337, "rating": 5.0, "text": "Such a great location in downtown and so close to Auburn's campus!", "pics": null, "resp": {"time": 1620312060632, "text": "We love the locale so much! Great to see so many thriving within our area."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "101525404102965897717", "name": "Michaela Holt", "time": 1613151246792, "rating": 3.0, "text": "The renovated front office area looks really good & the maintenance is so sweet!", "pics": null, "resp": {"time": 1613406545603, "text": "So kind of you, Michaela - we're super proud of how it turned out! We'll let the maintenance team know they got some love in the reviews, too."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "108940125178258988020", "name": "Mitchell Smith", "time": 1618723225251, "rating": 5.0, "text": "Really nice staff and a great social media presence", "pics": null, "resp": {"time": 1619196912468, "text": "We try really hard so thanks for engaging with us, Mitchell!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "109263287627682681865", "name": "Marcus Baca", "time": 1614452838592, "rating": 5.0, "text": "Best location with amenities in all of Auburn. Definitely recommend!", "pics": null, "resp": {"time": 1614620375705, "text": "That's some high praise. Thanks for this, Marcus. A true pleasure to have you here!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "118289308619437948169", "name": "Elizabeth Escalera", "time": 1613150366375, "rating": 4.0, "text": "Such a great apartment for undergrad students! Great amenities and great staff!", "pics": null, "resp": {"time": 1613406599574, "text": "We couldn't agree more. Thanks for this, Elizabeth - West & Wright is better with you here!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "108297383632741977179", "name": "Peyton Martini", "time": 1618678568678, "rating": 4.0, "text": "Convenient location and great maintenance staff.", "pics": null, "resp": {"time": 1620314938977, "text": "Two essentials for any 5-star experience. Glad we can make it all work out for you at West & Wright, Peyton!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "103038767441544813607", "name": "Taylor Seay", "time": 1613156235976, "rating": 4.0, "text": "West and wright has a great location, which is by far the best thing. They are quick to fix problems within the apartment, but can sometimes take a while to fix/open up the amenities.", "pics": null, "resp": {"time": 1613406012431, "text": "Thanks for your humbling feedback, Taylor. We want to be as safe and careful as we can with the amenities (and certainly wish we could open them all to 100% again!) so we'll keep you posted as things change. We do appreciate the amazing review, though - thanks for living with us!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "109730081820455249609", "name": "Jacob Webb", "time": 1611709960777, "rating": 1.0, "text": "Terrible management staff. Nightly false fire alarms and the WiFi never works. Only people that do their jobs is the maintenance crew. Would recommend finding anywhere else to live West and Wright is wildly over priced for what you receive.", "pics": null, "resp": {"time": 1604420553296, "text": "Hey Jacob, we're very sorry to see your experience hasn't been the best at our property. We'd like to get you in touch with our property's regional specialist so that you can have a safe place for your concerns to be heard about the operations and staffing here. If you have time this week, please send an email over to Lo at lrobinson@campusadv.com. Thanks, Jacob - we look forward to chatting with you soon."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "101603689538457260809", "name": "YoWei Hsu", "time": 1613149977868, "rating": 5.0, "text": "Staffs so nice and also nice Resident Appreciation.", "pics": null, "resp": {"time": 1613408245041, "text": "Just doing what we know you deserve, YoWei! Thank you for the charming review and for choosing W&W."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "110423536408946359797", "name": "Frannie Gorham", "time": 1596586479483, "rating": 2.0, "text": "I am living here in the fall and so far the experience has been awful. When we signed the lease we were told we would get early move in and we needed it for recruitment. Now that it’s here they’ve completely messed us up and aren’t going to be able to move in early it seems. Awful communication on their part and poor management. If you’re looking for early move in, West and Wright is not a good choice! Only giving two stars because I’m hoping things get better as the year goes on.", "pics": null, "resp": {"time": 1596645590298, "text": "Thank you for providing your feedback and letting us know about this issue, Frannie. We set a high standard for ourselves and are truly sorry to hear that standard was not met in your interaction with us. Please get in touch with us on (334) 350-3880 and we'll see where the problem lies and do our best to fix it.\n\nCheers,\n\nWest & Wright Apartments"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "106135044546970759182", "name": "Ellen Marotta", "time": 1611719829836, "rating": 1.0, "text": "We were completely disappointed at move in. Hallway carpets are filthy. Only my son’s room was cleaned before move in since his roommate was a returning resident.", "pics": null, "resp": {"time": 1611777185278, "text": "Ellen, we are deeply sorry for the issues you and your son inherited upon move-in. As we're a bit beyond move-in, we'd love the chance to reconnect and discuss the lingering issues you or your son may have. Please reach out to our assistant general manager Sara at (334) 350-3880 and we can set some time aside to chat. Thank you, Ellen."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "101391118766039342424", "name": "Ambar Ashraf (ambar)", "time": 1596027585704, "rating": 1.0, "text": "Building is falling apart, the carpets are stained in the hallways, paint is chipped and drywall patches are poorly covered in units. when it rains, water leaks into the building near the windows by the elevators and they lay out towels to prevent water from spreading to the hallways. Walls are paper thin, after hours the security guard will OFTEN knock and tell you to be quiet or be reported even if you're just having a conversation or the TV is on too loud. Packages were often left out unsupervised in the lobby. I had a package worth $200 that was  lost in the building and the situation was barely handled by management, claiming no responsibility. Upside of this place is its relatively inexpensive for the location.", "pics": null, "resp": {"time": 1596051323739, "text": "Thank you for your feedback regarding the West & Wright unit you occupy, Ambar. We encourage any resident with living conditions that match or resemble anything in this review to please submit a work order as soon as possible so we can work to fix it. Our maintenance and in-office team are here 7 days a week to help our community, so please let us know what we can do to help your unit be the best it can be. This is not limited to problems with paint or appliances - we also have noise ordinances that we can review together to ensure you're not being held up late by erratic sound. Thank you, Ambar - we look forward to hearing from you soon."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "117424846488441055402", "name": "Adam Douglas", "time": 1585945722756, "rating": 1.0, "text": "My friend lived at West & Wright and I was interested in living there, but when I walked in I was far from impressed.  The floors look like they have never been cleaned, the carpet in the hallways has dark stains in it and they smell, the whole building smells like cigarette smoke, and whenever you walk outside the front door there's always people smoking.  The parking garage is very dark and there's a lot of dark corners.  I tried to walk in the office for a tour and while there were people in there, no one came out so I couldn't tour. The pool is usually green and full of trash/leaves. There are defiantly better and newer apartments in Auburn that I've seen with the same location to campus.", "pics": null, "resp": {"time": 1598546281752, "text": "Thank you for your feedback about your process with potential leasing at W&W, Adam. We apologize for the issues you'd experienced with receiving a tour and the subsequent condition of the grounds. We recently experienced a large shift in management, as well as navigating COVID-19 for tours and leasing so we feel you may have beheld the worst of that turnover - our sincerest apologies. If you have other questions about the work we've done beyond your time visiting us, please feel free to reach out to our manager Amy at 334-826-1202. Thanks again, Adam."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "104548319541774408463", "name": "Haley Howard", "time": 1551456288942, "rating": 4.0, "text": "I enjoy living here! It's so close to campus and at a great location. I love having a gym, pool, and tanning bed at my apartment. The study rooms are also great because the free printing is so convenient. The staff I have worked with have been very friendly and helpful. They also host lots of events for the residents to go to and often offer breakfast or bring snacks by our rooms on random occasions. I also love that the apartments are furnished!", "pics": null, "resp": {"time": 1551542561093, "text": "The furnishing is one of our favorite touches, too! Thank you so much for the wonderful review, Haley, and for choosing West & Wright!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "112004440391056154077", "name": "Jabari Christie", "time": 1613151289231, "rating": 5.0, "text": "Great place awesome CAs", "pics": null, "resp": {"time": 1613406432413, "text": "Great place awesome residents. ;)"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "101594517676341876031", "name": "Preston Hall III", "time": 1601408531844, "rating": 1.0, "text": "The parking lots and stair wellls are disgusting and the hot tub never works. I’ve stayed in better motel 6’s than this.", "pics": null, "resp": {"time": 1601498778761, "text": "Thank you for providing your feedback and letting us know about this issue, Preston Hall. We set a high standard for ourselves at W&W and are truly sorry to hear that standard for cleanliness hasn't been met for you. Please get in touch with us at (334) 350-3880 and a member of our team can learn more about what you're seeing and we can go from there.\n\nCheers,\n\nWest & Wright Apartments"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "106312837065631581906", "name": "Jack Meeks", "time": 1568773048858, "rating": 5.0, "text": "I enjoyed living here!  Staff is very friendly and helpful.  Maintenance was prompt and everything was up to par.  The amenities and location are great too.  It is a downtown location, so prices of course come at a premium and space may be less than what you'd get farther out of town.", "pics": null, "resp": {"time": 1568993835530, "text": "Thanks for highlighting how our location plays into the area surrounding us, Jack. Downtown living definitely comes at a price but we do our best to keep it affordable! We're glad you're enjoying your time with us so far, man."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "116821476601930065246", "name": "Nour Kamar", "time": 1618680331153, "rating": 5.0, "text": "Amazing staff and amenities!!", "pics": null, "resp": {"time": 1620314630989, "text": "Amazing residents and reviews, too! ;)"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "100885502725100497295", "name": "Breck B", "time": 1568296837042, "rating": 5.0, "text": "The West and Wright apartments themselves are so cute and elegant, and they look just like the model that you tour. With other apartment places around auburn, I’ve seen apartments that are horrendously ugly and in terrible condition, nothing like the model. This also has an optimal location, view, and lighting. The granite countertops make cooking SO much easier. The staff is so friendly and always willing to help, efficient with packages, and with putting in work orders. The only complaint I have is that sometimes certain outlets of ours go out but resetting them with the fuse box typically works.", "pics": null, "resp": {"time": 1568397495395, "text": "Thanks for this truly amazing review, Breck! The model is definitely what we hope to provide for every resident who joins our community. Thanks for detailing what you love about your unit!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "110479447658156381252", "name": "Emma Robinson", "time": 1576103570258, "rating": 5.0, "text": "I love living at West and Wright. I have a great view of the stadium and of Samford hall from my living room window. The location is perfect for walking to class, and going out downtown to bars, dinner, and shopping. The prices are the lowest in the area, and the amenities are great!", "pics": null, "resp": {"time": 1576518690290, "text": "All in all, exactly what we hope for every resident here at W&W! Thank you for this beautiful review, Emma!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "115665944744500041769", "name": "Emily Jenkins", "time": 1618678185776, "rating": 5.0, "text": "Great amenities and location", "pics": null, "resp": {"time": 1620315543373, "text": "We're of the same mindset, Emily! Thanks for your comments."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "106131727770179100522", "name": "Kendi Davis", "time": 1596843948443, "rating": 1.0, "text": "I lived in West & Wright for the 2019-2020 school term and I would not recommend this apartment to another Auburn student. The apartment common areas were not well maintained, and the garbage chute was backed up on the weekends. I could never seem to talk to management unless I went to the office directly and maintenance request always took a while to get a response.", "pics": null, "resp": {"time": 1597086322503, "text": "We're super thankful for your feedback regarding your '19-'20 term at West & Wright, Kendi. The communication and lack of response to your concerns is below our typical standard at W&W and we want to apologize firstly for this. We haven't had any recent issues with the garbage chutes or general common areas being cluttered, but understand there could have been times in the past where this was an issue for you. If there is a situation like this for any current or incoming residents, we encourage direct and immediate communication so that we can properly attend to it. Thank you again for your feedback, Kendi; we hope your future post-W&W has been magnificent!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "110828779133077237848", "name": "Burke Eaton", "time": 1613165479691, "rating": 5.0, "text": "Great place, location is ideal!!", "pics": null, "resp": {"time": 1613405923117, "text": "Love to see you enjoying the W&W complex and all that surrounds it, Burke!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "112325098437018524949", "name": "Jean Caroline Moffitt", "time": 1550715178111, "rating": 5.0, "text": "I like West and Wright because it is close to everything. I have quick access to the downtown shops and I can walk to class easily. It is like living on campus but better! I renewed and can’t wait for another year. Also, West and Wright has great parking and has lots of fun activities and perks for its residents. LOVE!", "pics": null, "resp": {"time": 1540832408661, "text": "Thanks so much, Jean! Happy we could provide a five-star experience for you."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "101642309145388498781", "name": "Isabel Barganier", "time": 1551211071375, "rating": 5.0, "text": "West and Wright is a fantastic place to live and I definitely suggest disregarding the ridiculously negative reviews! The staff is so sweet and they are constantly doing fun things for the residents. I use the fitness center almost daily and love it, it's such a blessing to have a full gym a few floors below me! The location is truly UNBEATABLE, it's awesome to have such a short walk to class. I really appreciate the parking deck (keeping my car cool in the heat and it's comforting to know my car is protected!) I have thoroughly enjoyed my apartment and look forward to living here next year too!", "pics": null, "resp": {"time": 1549857231052, "text": "Appreciate the great rating, Isabel! Let us know if there is anything else we can provide for you. :)"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "113283727970964140485", "name": "Ashley Barganier", "time": 1551212955941, "rating": 5.0, "text": "We have been very happy with our daughter’s experience at West and Wright. The apartment building is clean and inviting. There are always activities going on to make it feel like a community. The amenities are really nice and the location can’t be beat. Above all else we feel like it is a very safe place for her to live. She easily walks to classes and local restaurants. We definitely recommend these apartments as a great choice for your student.", "pics": null, "resp": {"time": 1551293658297, "text": "Thank you for the review of your daughter's and your experience with our complex and amenities, Ashley. It's so important that parents feel comfortable with the living situation, and we thrive on this feedback!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "116086065852681511172", "name": "Henry Hooner", "time": 1574457087429, "rating": 2.0, "text": "Wonderful location, BUT not without many other issues. For one, they have started locking the front doors at ALL times. It is impossible for a guest to enter the building without having to go downstairs and let them in. Elevators don’t have any visible certificate of operation. Hallways are often left dirty. Construction on the building has been going on forever and shows no signs of stopping soon. The actual units themselves are very nice though.", "pics": null, "resp": {"time": 1574693596196, "text": "West & Wright appreciates your feedback, Henry. Thank you for voicing your concerns about the security and construction around our complex. Our doors were always meant to operate in the fashion they now do; if you'd like us to explain the process for using the keypads to allow visitors in, come by and we'll gladly show you. We've also sent out weekly updates about the construction status to invite questions or concerns from residents. If there is anything directly we can do to help you understand the building schedule, we ask that you give us a call this week. Thank you, Henry!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "105155663301307795948", "name": "Madeline Williams", "time": 1551114897263, "rating": 3.0, "text": "The apartment is in a great location.  With the location comes with some noise, but worth it for the quick trips to class and downtown on the weekends.  Rooms are also a bit small due to the location, but the quality of the rooms are great.  It's one of the newer apartment complexes in Auburn so the appliances are modern, the bathrooms (showers) are gorgeous and it's fully furnished which makes move in a million times easier.  Haven't had to make many maintenance requests and whenever we do, they are answered quickly. The maintenance men are the nicest staff at West & Wright!!! Management has changed while I've lived here and the transition was a little rough because the new staff was not as friendly, but I think they are working on it because the two newer employees are very pleasant and helpful.   Also prices have dropped  significantly so if you are budget conscious this is definitely a great place to check out!", "pics": null, "resp": {"time": 1551224101296, "text": "Thank you so much for a great write-up, Madeline! We're definitely listening to the feedback we've heard in regards to staff and pricing, and we hope that the changes continue to excite new and current residents. Thanks for choosing West & Wright!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "106881751289427012151", "name": "Will Collins", "time": 1570391953485, "rating": 5.0, "text": "West and Wright is an amazing apartment to live in. Not only is the location amazing, but the staff is very friendly and helpful. The maintenance team is very fast acting and very friendly aswell.  The community pool, weight room, and clubhouse are just another benefit to living here. Prices are reasonable for the location, covered parking, and its premium apartment layouts and design.", "pics": null, "resp": {"time": 1570476389990, "text": "Thank you for the wonderful comments, Will. Always nice to see the amenities being put to good use. We love seeing you around, too!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "102568926217439368187", "name": "Emma Herbe", "time": 1613149983251, "rating": 4.0, "text": "Convenient place to live in Auburn.", "pics": null, "resp": {"time": 1613408218578, "text": "The convenience is a huge win here! Thanks for the comment, Emma."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "116979770417792734936", "name": "Hayley D.", "time": 1613149276252, "rating": 5.0, "text": "Great location and amenities!", "pics": null, "resp": {"time": 1613408303245, "text": "Glad you feel this way, Hayley! Thank you for your special review. :)"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "104238088499695108365", "name": "Prashanth M", "time": 1562242884192, "rating": 1.0, "text": "I had a really bad experience living here. I lived in a 5B5B and it made me feel miserable. Your room feels more like a jail cell. Its tiny and there's no room for any of your stuff. There's construction going on from early in the morning and if that doesn't wake you up, there's the train. To top it off, one of my roommates was an outright racist, used the N word several times a day in a degrading manner. I felt extremely uncomfortable to live in my apartment as a person of color. Cops rushed into my apartment to arrest the guy for reasons I'm still not aware of. I think some background checks would definitely help.\n\nFinancially, this place was an absolute disaster for me. Firstly, the units are grossly overpriced. Secondly, they charge $18 for any online method to pay rent including e checks which is preposterous. It feels like exploitation of the customer knowing well that people don't use paper checks in this digital age we live in. In the last year, I've paid over $200 in \"convenience fees\". I've personally never seen any institution charge fees for e checks in my life. Plus, there's no way to break your lease. And most people who would wanna sub lease would be put off by the price or the no pet policy. I ended up paying some $4500 without living there for the last few months. A lease break by paying 2 or 3 months' rent would've been a huge relief.", "pics": null, "resp": null, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "102516151335729629105", "name": "Angie Feemster", "time": 1585615598111, "rating": 2.0, "text": "There’s 2.8 stars for a reason. Do your research. Don’t move into a place just because it’s pretty and has pretty amenities.", "pics": null, "resp": {"time": 1598546352664, "text": "Hey Angie, we understand how you may feel about our reviews and property in accordance. We invite you and any other Google readers to give us a call directly to discuss any concerns you may have as provided in the reviews online. Our general manager Amy can be reached at 334-826-1202 at any time during office hours. Thank you for your comments."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "111753427957332847227", "name": "Maddie Luther", "time": 1551163218404, "rating": 4.0, "text": "This is my first year living at West and Wright, it has been the best place I have lived. It is the best location you can ask for and has great amenities. I love my apartment. There are a couple things that need changing (wifi and parking) but everywhere does. The staff is helpful. Glad that I resigned and now I get to see how much better it will get next year!!! The #wright place to live !", "pics": null, "resp": {"time": 1551209609378, "text": "We're so glad you renewed too, Maddie! Thank you for being an incredible resident and always engaging with our team whenever you need anything. Happy to have you with us!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "112472927322377412808", "name": "Meagan Kingren", "time": 1553111487296, "rating": 5.0, "text": "Great location! Love how close to campus it is. Kitchen is great for someone who loves to cook. Little pricey, but for the location and amenities, it is worth it!", "pics": null, "resp": {"time": 1551210273670, "text": "We're so delighted to see you feel it's all worth it, Meagan. Thank you for the amazing and insightful review!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "105442533557588830663", "name": "Madison Schoeberl", "time": 1551475111966, "rating": 5.0, "text": "I have lived at West and Wright for two years and I love it. The location is amazing for walking to class and downtown. The new staff is really great and always seem to be available. I especially love the community events they host!", "pics": null, "resp": {"time": 1551542596474, "text": "We've loved having you for those two years, Madison! Looking forward to seeing you around more of the community events this year. :)"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "117172282860368804778", "name": "Isabel Barganier", "time": 1551381144390, "rating": 5.0, "text": "West and Wright is the best! I have loved living here and can’t wait to live here again next year!!! I love the big windows in my bedroom, the nice kitchen, and of course the location!! The staff is really dedicated to making sure that the residents are happy and they are always working to improve our experience at West and Wright!", "pics": null, "resp": {"time": 1551387606240, "text": "Your excitement is palpable, Isabel! So happy to be able to serve you, and can't thank you enough for noticing our efforts. :) You made the #wright choice!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "100875966683839273980", "name": "Jordan Parker", "time": 1551128376062, "rating": 3.0, "text": "Great location and appliances are new and modern. Furniture is also decent and relatively nice. However, wifi, parking and elevators are very unreliable and reduce the quality drastically as those are quite essential. At this price point, those should be a non-issue. Staff has gotten much better and more service oriented for sure. Hopefully they can figure out the major issues and this place will be much better!", "pics": null, "resp": {"time": 1551224173000, "text": "Thank you for the great remarks, Jordan. We're definitely pushing to see these changes happen sooner than later, and really appreciate the valuable input you and other residents have given us. Thanks for weighing all of your pros and cons efficiently for us to use as insight moving forward."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "101639923364872094678", "name": "Helen Cornell", "time": 1551133609190, "rating": 5.0, "text": "I have lived in this apartment for two years now, but only one year under the name and management of West and Wright. It is a great location for students at Auburn University as it is walking distance from campus and the downtown area. I have had a wonderful experience during my time living here, and I would highly recommend scheduling a tour.", "pics": null, "resp": {"time": 1551221177327, "text": "Thank you so much, Helen! We couldn't agree more; stop in for a tour at any time and see what Helen is talking about!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "104284611667676233213", "name": "Bethany Johnson", "time": 1573840061181, "rating": 4.0, "text": "West and Wright is in a great option for off campus student housing. The location was one of its biggest draws for me personally. Its extremely close to campus and in the heart of downtown!", "pics": null, "resp": {"time": 1573855803478, "text": "Location, location, location! Thank you so much for choosing W&W, Bethany. We're glad it's made living here so convenient for your college years. :)"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "106228356445994633787", "name": "Kathryn Hamilton", "time": 1551539159821, "rating": 5.0, "text": "The location is perfect!! And the staff is always friendly and greets you with a smile! I love when amber works, she is always so nice and energetic! I would 10/10 recommend", "pics": null, "resp": {"time": 1551542937959, "text": "Amber is one of our faves, too! Thanks for the wonderful review, Kathryn. We always get bashful reading these kind-hearted resident reviews."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "118255073811198724247", "name": "John Oneal", "time": 1555509217077, "rating": 1.0, "text": "Service is great. Free snacks, breakfast and lunch on occasion are very nice. But, if you're living here next year, you better pray that the construction is over and sky bar closes early. I have been woken up at 6 every morning this semester because of the noise. W&W always has some construction going on and it sucks. Also, due to the paper thin windows, the noise emitting from sky will also keep you up until 2am, the \"great\" location is not worth it. If you enjoy staying up until 2am and getting woken up at 6am, only being able to use one working elevator, spotty wifi, and oh! their pool gets less than a couple hours of full sun light, then this is the place for you.\n\nThe one star is for the service and free gifts, its a 0 star for everything else.", "pics": null, "resp": {"time": 1555620938961, "text": "As a result of the cosmetic issues with the exterior bricks on the West and Wright building, the sidewalk on the east side of the building and the main entrance are temporarily closed in order to make necessary repairs. Until further notice, you may access the building through the garage entrance.\n\nOur priority is the safety and well-being of our residents and staff and to make this as least disruptive as possible. We will be sure to provide updates as needed and communicate once the main entrance is re-open.\n\nIn the meantime, please don’t hesitate to reach out if you have any questions. We appreciate your patience and understanding."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "104747361660398011059", "name": "fa knox", "time": 1551397636729, "rating": 4.0, "text": "despite the negative reviews, I think that west & Wright has definitely improved in terms of service. The staff is helpful and they’ve gotten better about enforcing a lot of policies that people tend to break. Also, the location is prime- you can’t get much closer to downtown and an easy walk to campus.", "pics": null, "resp": {"time": 1551462748726, "text": "Thanks for detailing your viewpoint so well, and including how we've grown as compared to the reviews from the past. We're so happy with the prime location, and it feels great to be on the right track towards resident satisfaction."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "104623904783364876997", "name": "Toby Snook", "time": 1551428869307, "rating": 3.0, "text": "The location is about as good as it gets in Auburn. The amenities are great and staff is very nice. Can be quite loud at times but not to bad.", "pics": null, "resp": {"time": 1551455824665, "text": "Appreciate the sincerity, Toby. We do our best to keep the noise levels down in the complex, but as you're aware, it can still get a bit much at times. Feel free to stop in and chat with us about the measures we've taken to help those who'd like to report excessive noise on property."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "112055873106058700510", "name": "Mackenzie VanSciver", "time": 1556664755322, "rating": 5.0, "text": "Great location and great facility! Very modern apartment and a good place to live. Many giveaways too!", "pics": null, "resp": {"time": 1556723315449, "text": "Love to see your review come through, Mackenzie! We are in love with the units, too. Keep plugged in to our social media accounts to see more about our giveaways!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "115473391906950978472", "name": "Kate Street", "time": 1533050066048, "rating": 1.0, "text": "Wouldn’t recommend living here to anyone. Location is nice and the workers at the front desk are willing to help but the apartment itself sucks and my WiFi never worked, my room was a five minute walk from the elevator, the size of my room was the size of a closet, the fines are ridiculous and walls are incredibly thin.", "pics": null, "resp": {"time": 1533243607281, "text": "Kate,\nWe are disappointed to learn that you have had a negative experience. We did have issues with the WiFi the first semester, but those issues were rectified by the installer over the holiday break. We thank all of our residents for their patience during that time. In addition, we do assess hefty fines for vandalism, as well as for causing the elevator to stop by jumping for example. The size of the units as well as the building we cannot control. We appreciate your feedback!\nBest,\nEvolve Auburn Management"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "107387320838538903780", "name": "Taylor Grant", "time": 1551628488540, "rating": 5.0, "text": "Great location and fabulous stuff! Amber is always so helpful! Best place to live in all of auburn", "pics": null, "resp": {"time": 1551714371676, "text": "Thank you so much, Taylor! We're glad to have Amber here with us, she's an essential component of our team. If she or any of us can ever do anything for you, please let us know!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "116374906500642379664", "name": "Sarah B", "time": 1542479895064, "rating": 5.0, "text": "The staff has been really nice this year and I like the events we have had. It's nice being so close to the bars and campus", "pics": null, "resp": {"time": 1542650429215, "text": "Glad to have you as a part of our W&W family, Sarah!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "115442948849520873851", "name": "Jessica Boone", "time": 1551288243259, "rating": 5.0, "text": "GREAT location to campus and downtown and there are a few food places right downstairs so if you’re feeling lazy food is only a few steps away!", "pics": null, "resp": {"time": 1551375781515, "text": "Definitely one of our favorite aspects about living here too, Jessica! Thank you for an excellent review, and for providing some direct resident input on how awesome the location is."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "108399239084044660529", "name": "Elizabeth Miles", "time": 1521071959170, "rating": 1.0, "text": "Horrible place. The entrance is sometimes clean, the rest of the place is not. The reviews of Facebook must be from employees, because I haven’t talked to anyone here that likes it. If you have a question about anything, you’ll get 5 different answers from different employees, none of them will be the correct answer. The manager will only let you meet possible roommates, if you sign up for a year, so you could get a psychopath for a roommate & it’s not there problem. Hopefully, the new apartments being built next to them will be ready for next year. Not staying here a minute longer than I have to, there are plenty of other options.", "pics": null, "resp": null, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "107856671181708242791", "name": "Emma Robinson", "time": 1568038670587, "rating": 4.0, "text": "Living downtown is so nice and convenient for walking to class!", "pics": null, "resp": {"time": 1568126091557, "text": "Thanks for choosing West & Wright for the convenience, Emma! We're glad you're enjoying your living space so much. :)"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "110820454180636331043", "name": "A Stubblefield", "time": 1551393761185, "rating": 5.0, "text": "I absolutely love living here!! Great location! Great kitchen and appliances! Really want that iPad!!", "pics": null, "resp": {"time": 1551462882864, "text": "Thanks for the great review! We love the location, too. :) We appreciate you making the #wright choice."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "115822809086890916391", "name": "Kassandra Mentlick", "time": 1551395237720, "rating": 5.0, "text": "The tour was great and the people there were really nice! Keeping this place in mind when thinking of places to live next year!", "pics": null, "resp": {"time": 1551458457909, "text": "Thanks for stopping to chat with us, Kassandra! We're happy to answer any other questions you may have along the way. :)"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "103335181640526488817", "name": "Chris B", "time": 1550646598618, "rating": 1.0, "text": "Haven't had cable since we moved in. Expect the internet to prevent you from doing homework sometimes. The overall quality of the building is bad, with bricks coming out or the wall already. Walls are paper thin. Place is always trashed, and there was a rotting pumpkin in the 6th floor hallway for 3 weeks. Elevators are under maintenance on almost a weekly basis. The only benefit is location. And if you want to have anyone over there is no real guest parking, they will tow anyone behind the gates without a pass despite the bottom floor having dozens of open spots year round.", "pics": null, "resp": {"time": 1550762255119, "text": "We sincerely appreciate your comments and concerns about your experience thus far with us, Chris. We’d love to meet with you to walk through some of these frustrations and get you the answers you desire, especially with that poor internet connection. Our maintenance crew has been hard at work identifying the causes for delay in trash and the elevator malfunctions. We also have new signage being added for parking in the next two weeks, which will include more options for guests. If you don’t have time to stop by and chat, you can always give us a call at (334) 350-3880 or email us atpjbeili@campusadv.com. Thanks again for the time you took to voice your concerns, Chris."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "116003846779948480358", "name": "olivia ryan", "time": 1539064636656, "rating": 1.0, "text": "WORST PLACE IN THIS COUNTRY. The fire alarms in our apartment have been going off for the past 8 hours and it is now midnight. This review is coming after several fire alarms and CARBON MONOXIDE alarms going off and two visits from the fire department because the maintenance and staff here just don't care. The emergency number listed is just the front desk voicemail which would be truly terrible if this entire place went down in flames or we all died of carbon monoxide poisoning. I have now had to pay several hundred dollars for hotel rooms because of these alarms. I could not recommend living anywhere less. Please for the love of all things do NOT live here.", "pics": null, "resp": {"time": 1539111611526, "text": "Olivia,\nWe apologize for the negative experience you've had concerning noise and our staff. We encourage you to come by the office and mention your review to our manager Christina, so she can better understand your specific issues and help you come to a resolve.\n\nBest,\nWest & Wright Mgmt."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "110647175672717052159", "name": "JMan PDog", "time": 1544556938252, "rating": 3.0, "text": "Location is great, building is okay, and people in the back are nice. The only problem is to get to the people in the back if you have to deal with the people in the front who are rude or don't know anything. The blonde one who goes by Lindsay is the rudest person I've ever met in my life. Will look and talk to you like you're not good enough to be in her self entitled presence... and if you call the after hours phone and she pics up, good luck.\nMaintenance is fine.\nThe events lately have been much better than the last when it was still called \"the evolve.\" Not renewing due to bad wifi and no short term leases.", "pics": null, "resp": {"time": 1544814012403, "text": "Thanks for your valuable insight concerning our staff and internet. We're using information like this to assess where we can improve our operations, and this is a major help. Thanks for staying with us for the time you have!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "111111241329299211582", "name": "Madison Boone", "time": 1516195324875, "rating": 2.0, "text": "Had the nicest maintence man come fix our apartment and the tanning beds are working!!! However, the garage gates are down, trapping those who still have to work in. The manual button on gates don’t work either and when I called maintence emergency, voicemail. I’m assuming everyone is taking off for the snow day.", "pics": null, "resp": null, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "115878190504730213698", "name": "Evan Foy", "time": 1524790707918, "rating": 1.0, "text": "1) parking deck gates are constantly broken\n2) the stairwells are disgusting and NEVER cleaned\n3) cheap appliances\n4) pretty sure the whole building is un-leveled.. my bedroom door closes on it's own and my bathroom door opens on it's own AND our balcony door had to be shaved because it started scraping the ground\n5) elevators are always gross and sometimes broken\n6) the trash shoot constantly overfills and therefore trash bags fill up the hallway and causes the hall to smell\n7) the walls are PAPER thin\n8) don't have a lot of major news channels\n10) the trash man comes at 4am EVERYDAY and wakes everyone up", "pics": null, "resp": null, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "101693985902961692185", "name": "Chris Kauffman", "time": 1548890691870, "rating": 1.0, "text": "Horrible place, built on a broken foundation, just built as soon as possible so they can provide terrible housing for a even more terrible price. Do not live here there is an abundance of better housing for a quarter of the price all around auburn.", "pics": null, "resp": {"time": 1549035116942, "text": "Thank you for your review, Chris. We are happy to explain the safety measures of our complex to you in office at any time, so please come by and speak with a manager if you feel that your unit or any others is insufficient. Thank you for taking the time to let us know how you feel about West & Wright!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "112126793555943586728", "name": "Sydney Mayson", "time": 1533766487236, "rating": 1.0, "text": "I would tell EVERYONE not to live here. The WORST place and employees I have ever met. The place was trashed the entire year, not kept up with, and the management was extremely rude with terrible customer service. My room was the size of a closet and I was told I would have a room twice as big. My WiFi went out everyday which made it extremely hard to do my homework each night. I ordered a dress and was told it never came in, so I asked management if they knew anything and they said they accidentally sent it back to where it came from. When I asked for help to track the package or a refund they told me that I signed a contract saying I couldn’t get any compensation even thought this was EVOLVES MISTAKE for sending the package back. The main manager Christina is the most horrible person I have encountered with the WORST terrible service. I would advice anyone to stay away from her and to not get involved because she will be extremely rude to you.", "pics": null, "resp": {"time": 1533844810115, "text": "Sydney,\nWe are disappointed to learn that you have had a negative experience. The size of the rooms cannot be controlled by us, and the WiFi was fixed over the winter holidays. In may we did accidentally send your package back. We went above and beyond trying to track down the package, while also speaking with the carriers in person about the package. in your signed lease agreement you agree to not hold us liable for any packages that may be damaged or lost that we received on your behalf. We appreciate your feedback!\nBest,\nEvolve Auburn Management"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "105588581095271707413", "name": "Julia Ruiz", "time": 1533306648414, "rating": 1.0, "text": "I lived in Evolve for a year, and I truly do not recommend this place. I have had numerous concerns with the building and management. A few problems began with the room size and furnishings. I signed a lease for a 175sqft bedroom. Upon a arrival, I received a bedroom that was 86 sqft. the room was so small, my closet door had to be removed because I could not open it with the furniture. My desk had to be replaced, because that too, was too large for my room. (all of this furniture was provided by evolve). If you are living in a outside 2 bedroom corner unit (520A-920A), good luck. However, this became the least of my problems in the end.\n\nMy real concerns regard the structural integrity of the building itself. My room had numerous cracks that went through the wall onto the other side. My door had to be shaved down multiple times throughout the year due to the shifting structure. Dry wall constantly flaked, and my bathroom floor started to separate from the tub and toilet. A close friend of mine from the construction company that built evolve told me that there was an ongoing lawsuit because the structural engineers for the complex were negligent in the structural design. (specifically with the pools weight on the fifth floor). Yet management will tell you its just settling concrete. Evolve has its perks, with location and amenities. However much of this was outweighed by the negatives", "pics": null, "resp": {"time": 1533322810155, "text": "Julia,\nWe are disappointed to learn that you have had a negative experience. The City of Auburn has had structural engineers sign off on the safety and integrity of the building, as well as three additional independent engineers that were hired by both previous and current owners. All reports show that there is some expected settling in that building, but it is typical. There has never been any issue with our pool, it is a rumor that it is falling into the parking garage. This came forward when our retail tenants were doing construction in the parking garage to run water and electricity to their business spaces from the other side of the building. In regard to the size of your room, we have given a $50 monthly concession to you. We appreciate your feedback!\nBest,\nEvolve Auburn Management"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "118073477887000862231", "name": "Savannah N", "time": 1541718974727, "rating": 1.0, "text": "I would not recommend this apartment to anyone. The cons definitely outweigh the pros here. It’s ridiculously expensive for tiny rooms and a tiny closet. There is constant traffic outside and constant contruction noise. Don’t even think about sleeping on the weekends because there’s people raging in the rooms next to you pregaming for downtown. I’m on the 7th floor and I can hear people having normal level conversations outside. The parking deck is awful. People speed, it’s hard to maneuver around, and people are constantly parking in the deck without decals and parking in spots that are not actual spots therefore blocking other people in. There’s also no guest parking so if you have friends they probably won’t be coming over. They also have the WORST staff and management I’ve ever dealt with. I got locked out of my room one night and tried calling the emergency after hour numbers multiple times and they never answered so I slept on our couch. Some of them are nice but most are incompetent and even rude. The manager Christina is rude and mean. She literally yelled at me before I moved in and was scolding me like a child. I honestly don’t see how she still has a job here because she’s terrible. Really, the only good thing about living here is the location, and sometimes they give us free food. It’s just not worth it.", "pics": null, "resp": {"time": 1542135611028, "text": "Savannah, we are very upset to read how much you've negatively experienced at West & Wright thus far. We'd encourage you to come by our office to speak on behalf of the troubles you've faced, so we can try and resolve them for you. We'd hate for these problems to persist. We look forward to connecting with you."}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "114069900171271932133", "name": "Prashanth Murali", "time": 1551476476431, "rating": 1.0, "text": "Total rip off. Rooms are so small, \"furniture\" is of very cheap quality, wifi is just too slow. The mattresses they provide almost feel like bricks. Closet is too small and theres just no storage space in the apartment to even put away boxes from appliances you bought.\n\nOverall, it just doesn't feel like its worth the package you get. You can find more space and facilities for half the price really considering I lived in a 5 bedroom apartment and paid 900$ for it. I'd feel better if the furniture was of better quality and the rooms were much much much larger.\n\nUpdate : Impossible to break your lease in case you're forced to relocate to a different city if you don't wan't to shed out a few grand. Also, impossible to find someone to sublet because of their ridiculous no pet policy and well, the ridiculous price.", "pics": null, "resp": {"time": 1537894809277, "text": "Prash,\n\nThank you for your incredibly honest account of your stay with us at Evolve Auburn. We tried reaching out to discuss more about your review, and what we could do to help facilitate your needs. If possible, give the leasing office a ring, or stop in sometime and tell us more about the changes you'd like to see to your unit. We'd love the opportunity.\n\nBest,\nEvolve Auburn"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "109035477007809226767", "name": "Hailey O", "time": 1542056891538, "rating": 5.0, "text": "Some of the reviews of this place are obsurd and need to be taken with a grain of salt. So many people complaining about late charges and convienence fees... like you’re the one that paid your rent late lol how is that their fault? You knew there were late fees and convenience fees when you signed up... get a checkbook like I did or set up a recurring payment jeez.\nI love the apartment and it feels super safe being a girl. The doors lock at night, there are gates, security cameras, and lights in the parking deck. It’s annoying people come on here to complain that the elevator may break once in a blue moon, WHEN THE REASON IT BREAKS IS BECAUSE ANNOYING PEOPLE JUMP ON IT. Like how is it their fault when they’re constantly fixing it?\nThe staff is pretty nice and the location to campus and downtown is amazing. We renewed our lease to stay another year", "pics": null, "resp": {"time": 1542132012832, "text": "Really appreciate your review, and considering the other reviews in the process. We'll always try to fix/repair anything that residents bring to our attention, and hope that your review helps shed some light on that. Thank you again!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "114980861704701490332", "name": "David P.", "time": 1534302340125, "rating": 1.0, "text": "In my opinion...\n\nEvolve Auburn poses a novel question: if you construct a mega-million dollar complex with state-of-the-art amenities and the best location in Auburn, how long does it take to run it into the dirt?\n\nI thought the train wreck that was move-in day was one of the worst experiences of my life, but it was only downhill from there. At Evolve, move-in resembled a WWE Royal Rumble. Entering the deck on move-in day took two hours. The lines for the elevator were longer than those for Space Mountain, so we had to climb the stairs with our arms full of heavy boxes. I had lived in the dorms at Auburn previously, and they staggered the move-in days. The management at Evolve, however, thought it was a great idea to have 1000 people show up all at once trying to cram their stuff up the building.\n\nThe management is not so much malevolent as they are incompetent. They are unknowledgeable and unprofessional. My work order took over a month to complete because the management ordered the wrong part. The wi-fi is spotty. Heaps of garbage bags accumulate in the hall. After the elevators were overworked during move-in day, the residents compounded the abuse by splattering them with vomit. The whole place just reeks. If you still want to live here, I’d recommend a HAZMAT suit and experience at a bio level 4 lab. But seriously, always carry hand sanitizer and shower twice a day.\n\nAs bad as the management was, some of the tenants tried their very hardest to out-do them. The delinquents stripped the buildings of all signage: room numbers, elevator signs, even the exit signs. It’s going to be a disaster the day someone gets alcohol poisoning because the 911 first responders will die of old age before they find where to go. If you want a good night’s sleep, your best bet is to go to your car, which will not be anywhere near the assigned parking spot that you paid for.\n\nIn the end, what should have been a great experience was marred by constant frustration and disappointment. For what it’s worth, however, Evolve did provide one of the best days of my life: the day I moved out.", "pics": null, "resp": null, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "110934790686577365039", "name": "Steve Jones", "time": 1541456486838, "rating": 1.0, "text": "This place nickle and dimes you to death.  A convenience fee of $18 to pay on line.  Getting my daughter checks so she we can save the $18 and make one of the children running this place go to the bank.  Convenience fee for who I ask?  I pay all my bills on line.  There are a few convenience fees like the water bill, it is $1.\nLast year they changed the late date from the 5th to the 4th.  Some Accountant figured they could make XXXX dollars by doing that.  Oh and if the 4th is on a Saturday or Sunday well you have to pay it on Friday or you get a late fee.  Late fees are $40 a day. So we blew $80 because I figured we could pay it Monday with the 4th being on a Sunday.  I have rented for three children for a total of 9 years, less the dorm and this is the most ridiculous  set up I have seen or heard of.\nCan't wait for all those new high rises to pop up.", "pics": null, "resp": null, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "106949973968241606814", "name": "Peyton Osborne", "time": 1540911631001, "rating": 1.0, "text": "The absolute worst place I have ever lived. Terrible online portal, dorm size rooms. I was extremely disappointed and encourage people to live anywhere else", "pics": null, "resp": {"time": 1541005215840, "text": "We're sorry to hear that your experience wasn't positive, Peyton. We encourage you and any other resident to bring forward any issues you have to the leasing office. :)"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "114601353566066423541", "name": "Joel Johnson", "time": 1551291401911, "rating": 4.0, "text": "The staff if very nice and knowledgeable.", "pics": null, "resp": {"time": 1551375726274, "text": "The residents are also pretty nice and knowledgable. -staff. ;)"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "114838077195657038343", "name": "Allen Boone", "time": 1517122083003, "rating": 1.0, "text": "This place is the worst possible choice for living at Auburn. I’m actually embarrassed to say I live here. “Rumors” going around town that the building is not sound and when called with my questions of concern, I was laughed at and told by worker Taylor, “I have a degree in building science and architecture and I have no idea what you are talking about”. Well, for starters, if you were successful, you wouldn’t be a “manager”of an apartment complex. You should be utilizing those two expensive degree you just got. If the building is so sound, how come 20+ spots are marked off with DANGER tape on the second floor? According to rumor, it’s because the ceiling is collapsing due to the pool being on the 5 floor... I have never been given an answer as to what the problem is so the only thing left to do is assume. Also, the WiFi has never worked (yes we had to do without WiFi for finals week)  and evolve stated over break the company synergy put in more access points but guess what.... WiFi still doesn’t work. Tenants have actually purchased their own routers but continue to pay for non existent WiFi in evolve. There are also over 30 lights out which is a major safety hazard.", "pics": null, "resp": null, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "109593939174641878835", "name": "Canon Kuipers", "time": 1556658907437, "rating": 5.0, "text": "Great staff, always available for help.", "pics": null, "resp": {"time": 1556723405754, "text": "Glad to be of service to you, Canon. Thanks for an excellent review!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "109506898378040245298", "name": "Sydney Rush", "time": 1510190066292, "rating": 1.0, "text": "DO NOT LIVE HERE\n1.) all of the room numbers have been stolen of the majority of floors. When I have guests they literally can’t find my room number.\n2.) the place is a mess. There’s is bean dip dripping down the yellow walls in the hallway right by my room. It’s been there for TWO MONTHS. This place is supposed to be nice and it’s a pig stine.\n3.) the tanning beds have been broken for months. We spoke with the owners of a near by tanning salon and they said the parts only taken about two weeks to come in so your excuse of “the part hasn’t come in yet” isn’t okay. This is an amenity that was included with the apartment. This will not do.\n4.) the WiFi is a joke. We called the WiFi provider and he said several rooms in evolve were “missed” upon set up and simply don’t get WiFi. Another amenity we’re being ripped off on.\n5.) You blare music so loud at the pool in the middle of the day that I can’t do my homework or even hear my TV because the walls were made so cheap and they’re paper thin.\n6.) many have reported not having the right couch they payed for\n7.) no private 9th floor access\n8.) the halls reek of trash and I’m embarrassed that this is where we live when we have guest or my parents come\n9.) TV channels consistently go out", "pics": null, "resp": null, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "102036595157266240957", "name": "Blair Varnell", "time": 1512777266030, "rating": 2.0, "text": "Walls are paper thin along with floor and ceiling. If you want to be woken up at 2 AM to the people around you JUST starting to party, this place is for you.\nWe have not had apartment numbers since the beginning bc the people that live here do not have any respect for this place or anyone else but themselves.\nWiFi is very spotty, doesn’t work\nIf you come on a weekend you get to see so many beer bottles and throw up\nPeople leave their trash outside the door to the trash chute— WHEN THE TRASH CHUTE WORKS\nthe tanning beds don’t work & we still pay for them monthly.", "pics": null, "resp": null, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "104173438066443726677", "name": "Trevor Hill", "time": 1509905210580, "rating": 1.0, "text": "MGMT does not care. The door signs were stolen over a month ago and have not been replaced. Apparently the cost of building this behemoth has left the owners without the capital to perform basic maintenance.", "pics": null, "resp": null, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "108382410662007107191", "name": "Morgan Young", "time": 1511108138670, "rating": 1.0, "text": "This apartment complex is the equivalent of Toby from The Office.\n\nSerious note though, from the times I’ve stayed here with friends there’s constant throw up or some kind of bodily fluid in the halls at all times. Very nasty", "pics": null, "resp": null, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "108732630712549261805", "name": "Mackenzie Carnes", "time": 1524684406682, "rating": 1.0, "text": "very poorly run business. i would much rather live at 221 or edge west. seriously the worst place to live.", "pics": null, "resp": null, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "105261486107617108541", "name": "Chris Jones", "time": 1517277310915, "rating": 2.0, "text": "Rooms are nice, but the halls and stairs are gross and the Internet sucks", "pics": null, "resp": null, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "110881075507147851725", "name": "Graham Woodington", "time": 1511105538676, "rating": 1.0, "text": "Living here is the most frustrating thing you will ever do in your entire life. Just don't do it. I'm actually begging you not to give these people your money, the staff and management do not care and will not help you with anything. I wish I could write multiple one star reviews but sadly, I can't.", "pics": null, "resp": null, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "111680905159359597461", "name": "Ryan Nichols", "time": 1551140831605, "rating": 5.0, "text": "Close to downtown, close to campus", "pics": null, "resp": {"time": 1551211004587, "text": "Close to a perfect review. ;) Thanks, Ryan!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "101223811861494256572", "name": "Mary Michelle Stokes", "time": 1551124601819, "rating": 3.0, "text": "Great Location!!", "pics": null, "resp": {"time": 1551223537367, "text": "Thank you, Mary!"}, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "117476558049839525095", "name": "Carson Speaks", "time": 1513715057160, "rating": 1.0, "text": "This place is a joke", "pics": null, "resp": null, "gmap_id": "0x888cf31ea5dbf9db:0x30b7a80f80ce8925"}
{"user_id": "109049885639497056790", "name": "Joel carpenter", "time": 1607976756869, "rating": 5.0, "text": "The honors dorm on campus. A great spot in the middle of everything.", "pics": null, "resp": null, "gmap_id": "0x88892bb34efae21f:0xe960295ecf0b3851"}
{"user_id": "105210576245069250035", "name": "Stephanie TheAnimeLover", "time": 1609305597842, "rating": 4.0, "text": "Excellent place, I like this place.", "pics": null, "resp": null, "gmap_id": "0x88892bb34efae21f:0xe960295ecf0b3851"}
{"user_id": "109740812514672062656", "name": "Carson Elmore", "time": 1479827875390, "rating": 5.0, "text": "The best dorm on Montevallo's campus. Worth all the work of the Honors Program just to get to live in Ramsay and have a fantastic college experience. Private bathroom with your roommate, rooms set up hotel style, and a great study lounge in the Basement.", "pics": null, "resp": null, "gmap_id": "0x88892bb34efae21f:0xe960295ecf0b3851"}
{"user_id": "106712251099474048205", "name": "Cassidy Acuff Williams", "time": 1532710035594, "rating": 3.0, "text": "This place is much older but it is clean and quiet..", "pics": null, "resp": null, "gmap_id": "0x88892bb34efae21f:0xe960295ecf0b3851"}
{"user_id": "104513820855507783273", "name": "Alexia Wilson", "time": 1562038528907, "rating": 3.0, "text": "Out of all the places on campus I could have stayed my first year, I’m glad I got Cambridge. It’s not too far from campus or downtown. You only share your room/bathroom with one other person so you get a decent amount of space. My only problem was that there isn’t a community kitchen and they closed the little convenience store down, so you have to go out to eat. Overall a good place to live. More space than quad & hill and less $ than village & south Donahue.", "pics": null, "resp": null, "gmap_id": "0x888cf31d2681d959:0xaf357bb18731dd12"}
{"user_id": "110023155127822715092", "name": "Jay Bouchard", "time": 1565035082484, "rating": 3.0, "text": "was a resident here in Fall 2017. it's an ok place. its just not easy to make friends. I had a bad RA where I was on the 4th floor I him for some help on how to make friends & get involved and he didn't help in the slightest. the RA's need more training", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNMTd8-TZ_O7y4uqNx2l0e420UhR4zbrHdakn4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNdcTsNtCI-_MjjGH6x-Db9pMeFVJpZ0RayHog=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888cf31d2681d959:0xaf357bb18731dd12"}
{"user_id": "112048720898356778135", "name": "Cecili", "time": 1368645589916, "rating": 2.0, "text": "Do not bother with this place. They need a renovation and new/better management. The meals are not free. They are included in your lease/rent. During the summer, their hours are extremely inconvenient. My job on campus let's out at 5pm and by that time dinner is over. There isn't even the OPTION to NOT have the meal plan. It is a complete ripoff. The choices are abysmal and the staff unbelievably rude!!! The room I was given has a leaking closet with tiles missing and a bucket as a bonus. Any maintenance requests were COMPLETELY ignored. I definitely would not have stayed here if it was for my short notice on a research position for just a few months. I have absolutely nothing positive to say about this place at all. Save yourself the headache don't bother.", "pics": null, "resp": null, "gmap_id": "0x888cf31d2681d959:0xaf357bb18731dd12"}
{"user_id": "117017495294030753217", "name": "Ferendez", "time": 1503977473543, "rating": 5.0, "text": "Owned by the university now and I loved staying there my first year at Auburn", "pics": null, "resp": null, "gmap_id": "0x888cf31d2681d959:0xaf357bb18731dd12"}
{"user_id": "100443250289771111064", "name": "Mrs. Carla Reid", "time": 1368650938039, "rating": 2.0, "text": "Terrible customer service (Mandi Harper) should seek customer service classes and proper conversational skills.  The food is horrible, please don't be born with any allergies or the need to eat healthy.  Meal options and schedule for meals are less than desirable if you don't get hungry at their convenience.  Response time for repairs and communication are pathetic.  Make time to contact them two/three times a day for any repairs.  make sure you have an iPad, or computer available for correspondence since they refuse to return or answer a call.  to talk to anyone with sense or manners you have to show up face-to-face since \" Owner is in and out\" your concerns or issues are of no importance to the person who makes the discussions.", "pics": null, "resp": null, "gmap_id": "0x888cf31d2681d959:0xaf357bb18731dd12"}
{"user_id": "104151789850160849730", "name": "Kimberly Faubion", "time": 1603208797505, "rating": 5.0, "text": "Beautiful old building", "pics": null, "resp": null, "gmap_id": "0x88892bea11706ac7:0x79da3e38d151abb6"}
{"user_id": "103320377592041171663", "name": "John Petersen", "time": 1612150825689, "rating": 4.0, "text": "One of the nicest dorms on campus. They have two bedroom apartment style, and four bedroom apartment style rooms. Everyone has their own room and they share a bathroom for two people, along with a common space. Very nice and not too expensive.", "pics": null, "resp": null, "gmap_id": "0x888decfb4391648d:0x88b04151c55b71d7"}
{"user_id": "113141121017686083633", "name": "robbie or brian malone", "time": 1597433020116, "rating": 5.0, "text": "My daughter lives here. That's probably why it's the best.", "pics": null, "resp": null, "gmap_id": "0x888decfb4391648d:0x88b04151c55b71d7"}
{"user_id": "118236338589653184100", "name": "Pratiksha Joshi", "time": 1562392751340, "rating": 4.0, "text": "Clean and well maintained. Comfortable", "pics": null, "resp": null, "gmap_id": "0x888decfb4391648d:0x88b04151c55b71d7"}
{"user_id": "107440129336525701506", "name": "Zheng Zhifei", "time": 1534022711227, "rating": 5.0, "text": "very nice place", "pics": null, "resp": null, "gmap_id": "0x888decfb4391648d:0x88b04151c55b71d7"}
{"user_id": "103306678955674420100", "name": "Joe Price", "time": 1599529007219, "rating": 4.0, "text": "Nice ,clean & secure", "pics": null, "resp": null, "gmap_id": "0x888cf34a1e18f851:0xc06a447b3b024fa4"}
{"user_id": "116150812212569428865", "name": "Jalen Cates", "time": 1542067622222, "rating": 5.0, "text": "Only reviewing to say that the other guy obviously hasn't lived here. Has no idea what he is talking about. -RA in Blount Hall", "pics": null, "resp": null, "gmap_id": "0x888602a36a827689:0x9cf70c10a65d8d4e"}
{"user_id": "114110759454118538476", "name": "Irene Falls", "time": 1580930980679, "rating": 5.0, "text": "I work here cleaning the dorm", "pics": null, "resp": null, "gmap_id": "0x888602a36a827689:0x9cf70c10a65d8d4e"}
{"user_id": "103013413841651670037", "name": "Sam Wight", "time": 1539640329335, "rating": 3.0, "text": "This is an alright dorm to live in, not the best that UA has to offer, but pretty good. There are a lot of requirements as far as classes go that you have to follow, as you have to be a Blount Scholar to be in this dorm. This is a traditional dorm, so you will be staying with a roommate and won't have your own private space like you would in suite dorms such as Ridgecrest, Lakeside, or Presidential. There are some pretty cool common areas to gather, but they aren't as good as New Freshman. Location is alright, but not any better than Ridgecrest, and you don't have the advantages of having a parking garage right under your dorm. If you have a car and live here, you're basically forced to park in the Ferg parking lot or one of the commuter lots. Not my favorite dorm on campus, but it's also not the worst.", "pics": null, "resp": null, "gmap_id": "0x888602a36a827689:0x9cf70c10a65d8d4e"}
{"user_id": "116871682773785613300", "name": "Lisa Getts-Folsom", "time": 1551869647727, "rating": 5.0, "text": "I was making a delivery, it is a nice facility.  University of AL always great", "pics": null, "resp": null, "gmap_id": "0x888603477249761f:0x8a019d29488289b7"}
{"user_id": "113498048059195711022", "name": "blake evans", "time": 1622909368758, "rating": 1.0, "text": "I pay good money to live here. The only people that care for anyone here is the people that work under management. I have more than once had issues with management and infact taken it without argument. I ask for one request ever in return. But instead of being about to talk to management personally, they decline my request to do so. It seems they do not have enough time to speak directly with their paying residents. Disgraceful.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "101932244876861798756", "name": "Jordan DeLoney", "time": 1617910716728, "rating": 1.0, "text": "The walls and ceilings are very thin and will not allow you like to study in your room if you need a quiet space. Their study rooms are also not an option because they are right below the gym. In addition, the Wifi is always out and there are problems with the hot water. I did not enjoy staying here.", "pics": null, "resp": {"time": 1617831019720, "text": "We’re sorry to hear about that! Please feel free to contact the Management Office or call our Customer Service Team at 512-732-1099 so we can discuss your review in detail. - Corporate Customer Service"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "113276612300887598711", "name": "Smoothiedude Dayton", "time": 1599497081905, "rating": 3.0, "text": "My daughter was a tenant for two years. All things considered, it was a good place to live. I do have three gripes that were never addressed.\n\n1.) The biggest. There is no formal protocol in place if a tenant tests positive for CV-19. They say they can't ask a resident if they are positive and do nothing to safeguard the other \"roommates\" or their staff, for that matter. Thank goodness her roommate left and quarantined back in Atlanta.\n\n2.) There is not a mechanism in place if a roommate decides to bring in pets and not tell the management team.  I complained on more than one occasion last spring, but, they did nothing to rid the unit of a dog and hamster.\n\n3. I'm still waiting on my deposit to be returned. I have not received any indication of any outstanding balances and wonder if I will ever get my deposit. They were very adamant about getting the deposit initially.", "pics": null, "resp": {"time": 1599655546483, "text": "Thank you for your review. We know you have other housing options, and we appreciate that your daughter chose 160 Ross for two years. We’re sorry your daughter had a bad experience. We have policies for each one of your concerns and welcome the opportunity to speak with you via phone. If you’d like, please give the Management Office a call or contact the Customer Service Department at 512-732-1099 to discuss your review. Thank you. -Jessica L. [Customer Service]"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "112396967808059000960", "name": "Meleah Montgomery", "time": 1614101744955, "rating": 2.0, "text": "It is a nice apartment with good amenities, but the WiFi is terrible. With some classes being remote this school year, it is sometimes impossible to get work done here because the WiFi barely works.", "pics": null, "resp": {"time": 1614874051752, "text": "Meleah, we’re sorry to hear about your issues with the Wifi! Please feel free to contact the Management Office or call our Customer Service Team at 512-732-1099 so we can discuss your review in detail. - Rachel K. [Customer Service]"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "106660808503539594520", "name": "Emily Dunlap", "time": 1599231807221, "rating": 5.0, "text": "I want to start off by saying the manager there Bre Davis is absolutely amazing! She is super friendly and has went out of her way to help in anyway she can! I would highly recommend 160 Ross to anyone looking for great apartments in Auburn!", "pics": null, "resp": {"time": 1599574586337, "text": "Thank you for your great review !"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "103155874501810648722", "name": "robert jenning", "time": 1591019000167, "rating": 1.0, "text": "This is probably one of the worst apartments in Auburn. Don’t rely on them to help your child or yourself in general. They will try to screw you over every way possible. Good thing they made a contract with Auburn University to be a “freshman dorm” because otherwise they wouldn’t have ANYONE living here. Do the best for yourself, and your child, and don’t live here. Find a more reliable and responsive management. It seems like a good deal, but there’s a reason for that...", "pics": null, "resp": {"time": 1591651937422, "text": "Robert, thank you for taking the time to leave us your feedback about 160 Ross. We value you as a customer and welcome the opportunity to discuss your concerns in more detail.  You may call the Management Office or contact the Customer Service Team at 512-732-1099 if you would like to discuss your review. - Rachel K. [Customer Service]"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "103969712783385222207", "name": "Anthony Hayes", "time": 1599236471629, "rating": 5.0, "text": "Fantastic amenities and management always go the extra mile! Misty and Breanda are always such a joy to be around", "pics": null, "resp": {"time": 1599574685908, "text": "Thank you so much for your wonderful review !"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "108844469546772245561", "name": "trent ashoo", "time": 1581465435085, "rating": 5.0, "text": "5 stars for KEN, he is the absolute man! He’s got a ton of knowledge about the building and if he doesn’t know how to fix something he is resourceful and timely. The building building kinda sucks. We had a leak in the apartment and in the hall. GOOD THING KEN IS THE BOY!", "pics": null, "resp": {"time": 1581517777361, "text": "Trent,\nThank you for taking the time to give us your feedback. We're so happy to hear that Ken is resourceful and doing a great job. I'll make sure to pass along the kind words to him. - Lauren K."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "116779256712710552513", "name": "KK L", "time": 1573751564689, "rating": 5.0, "text": "The management and front desk staff have bent over backwards to help us. They have been professional, prompt and kind. As a a parent, we appreciate all that they did to help us out of a terrible situation at another apartment complex in August and got us in to an apartment the week that classes started (a day earlier than promised). Recently, they have been very helpful and straightforward renewing our lease for next year. The facilities and apartments are beautiful and safe and the team supporting the residents is top notch.", "pics": null, "resp": {"time": 1573759368572, "text": "Hi,\nThat's what we like to hear, and we are glad we were able to help you all out this past August!  Thanks so much for the feedback - it's so appreciated. -Lauren K."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "100742714268639507173", "name": "Alissa Heath", "time": 1553004124992, "rating": 5.0, "text": "I have lived here for two years and it has been a very nice experience. I never had to wait more than an hour to get something fixed if something was broken in my apartment and also the management and workers at the front desk are always so sweet! It is also a plus to have everything so clean all the time compared to other complexes I have lived in before. I would recommend living here to anybody!", "pics": null, "resp": {"time": 1553016752076, "text": "Thanks so much for the kind words Alissa!  We wish you luck in your future career and will miss your smiling face when you graduate!"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "114892890022269151407", "name": "John Daily", "time": 1563127343238, "rating": 1.0, "text": "160 Ross are some snakes.\nthey told my roomates and I that if we did not resign when we did back in November the rates would be hundreds of dollars higher.  Here we are in August and they are offering free months of rent and rates $200 less a month for people that sign now. They tricked us and I would highly NOT recommend signing a lease with this apartment complex.", "pics": null, "resp": {"time": 1563200713492, "text": "Hi John, thanks for your feedback.  We know you have other housing options, and we appreciate that you chose 160 Ross. We’re sorry you’re unhappy with our current specials. 160 Ross strives to give our returning residents the best rates, but it sounds like we fell short.  If you’d like, please give the Management Office a call or contact the Customer Service Department at 512-732-1099 to discuss your review. Thank you - Caithn S. [Corporate Customer Service]"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "117677044216846986754", "name": "Bailey", "time": 1557018008892, "rating": 1.0, "text": "The fire alarm will go off at any time (almost daily) for at least 30 minutes. It is such an ear-piercing sound and the staff has never apologized for it going off so many times. It also goes off very late, sometimes at 4AM. It is the most annoying thing I've ever had to deal with and they are doing NOTHING to fix it. Unacceptable. Walls are paper-thin and you can hear every single thing from your neighbors room. Neighbors from upstairs are even worse. If they are just walking around, it sounds like they are jumping on the floors as hard as they can. Don't fall victim to the \"positive\" reviews. Don't live here. There are better options", "pics": null, "resp": {"time": 1569243181579, "text": "Hey Baily, I'm sorry that you were experiencing issues with the fire alarm. This issue has been resolved but if you would like to discuss your experience further, please give our Management Office or Corporate Customer Service Team a call at 512-732-1099. - Rachel K. [Customer Service]"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "113662695404416328934", "name": "Beth Thomas", "time": 1572834667379, "rating": 1.0, "text": "PLEASE READ BEFORE YOU DECIDE.  I feel compelled to write this review to warn present and future renters/parents of the issues with leasing at 160 Ross. My son has rented from 160 Ross and is now in his 4th lease. As noted, the rent rises every year with no new updates inside or out. THIS IS NOT WHY I AM WRITING.\nThis year because the complex did not fully rent out my son is in a 4 bedroom apartment by himself. Some would think this is a great thing but be warned, regardless as to the number of un-rented bedrooms in the unit, the utilities for that unit are the responsibility of whomever is living there. His utility bill for June and July was over$160+/mo total.  He does not use or have access to the other 3 bedrooms. After several discussions the complex agreed to subsidize the other 3 rooms @ $20 each (which is part of their lease agreement). That is helpful but does not cover the full utilities for the apartment unused spaces. Less the subsidy his portion was $80+.  Since he has lived there for 3+ years and in the same room for the last 2+ years he knows what his utility bills averaged.  He has never paid over $30+/mo. I thought these were supposed to be individual leases and a shared utility bill. He has no option other than to sublet (HA! HA! like anyone would be ignorant enough to do this) or pay the higher utility bills for the remainder of his lease. 160 Ross chose not to put anyone in this apartment and instead optioned to fill up other apartments. He did not even know he was not going to have roommates till July of 2019, well past his time to get out of a lease that was signed back in Nov. of 2018.  When you get down to it 160 Ross has decided he was going to be alone in the apartment and would be subject to cover all the utilities over the paltry subsidy. As I said before I would think very carefully about moving yourself or your son/daughter into 160 Ross or any American Campus Facility given the treatment of the residents.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "108188060915097222612", "name": "Elizabeth Taylor", "time": 1551743436696, "rating": 5.0, "text": "The staff at 160 Ross provides such a warm and welcoming environment every time I walk into the office. Misty and Lauren do such a great job at what they do and you can tell they really care about not only the property but every single one of the residents! I highly suggest checking out 160 Ross!", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "111400082563022369406", "name": "Tristan Hazebrook", "time": 1553275427972, "rating": 5.0, "text": "I’ve lived here for the past two years and loved it. The amenities are great and there’s always fun stuff going on for residents. The pool is perfect and stays in the sun super long.", "pics": null, "resp": {"time": 1553286298279, "text": "Hey Tristan, we are so glad you are our resident!! Resident's like you make 160 Ross an AMAZING place to live! - Lauren K"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "106499104152855688648", "name": "Tatom Moore", "time": 1553273812079, "rating": 5.0, "text": "I’ve lived here for 2 years & I’m living here next year because I absolutely love it! Lauren & Misty & the entire rest of the staff are always super helpful. I also love the amenities & the covered parking!", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "103763392657945003819", "name": "Andrew Lipscomb", "time": 1559140901473, "rating": 5.0, "text": "Awesome place to live! Work orders are fulfilled super quick. The wifi has been upgraded recently and is very fast. I can stream 4k video with no buffering, and I've never had any issues while playing online video games. they take care of all the things that you wouldn't otherwise think about. For example, I've never seen a single bug in my apartment, and that is absolutely not the case for my friends living in other apartments. Everyone who works here is very approachable, knowledgeable, and dedicated.", "pics": null, "resp": {"time": 1563975361376, "text": "Hey Andrew, we are so glad we are able to take care of any issues quickly for you! I'll pass along the praise as well to our maintenance staff for all of their hard work. - Lauren K"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "100621886449012649313", "name": "colin rossi", "time": 1573308759673, "rating": 1.0, "text": "Overall my experience living at 169 hasn’t been great, overages are made up and overcharged every month along with countless other issues the complex has.  However the one plus side has been the maintenance man Ken Howard.  Anytime we have had an issue Ken always comes through and does above and beyond what we requested.", "pics": null, "resp": {"time": 1573480436461, "text": "Hi Colin, Thank you for taking the time to leave a review. Thanks for the shout out to our Maintenance Tech, Ken! We're sorry to hear that you are getting overcharged and that the overages are not being clearly explained to you. If you would like to discuss the charges on your account, we're here to help. Give our Management Office our Customer Service Team a call at 512-732-1099 to discuss your review. Thank you - Caithn S. [Corporate Customer Service]"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "102814913555071620559", "name": "Noelle Johnson", "time": 1553273818210, "rating": 5.0, "text": "Nice and friendly staff!! Quick to complete work orders. Environment is kept clean and fun to live in! Lauren at the front is awesome!", "pics": null, "resp": {"time": 1553286367216, "text": "Thanks, Noelle for the shout out! I'll also pass along the praises to our maintenance team! - Lauren K"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "107597511305582777549", "name": "Davi", "time": 1579081483988, "rating": 3.0, "text": "Update, Missy resolved the issue, she handled it well. They still need to amend their contract with the towing company so that it does not grant so much  autbority to the towing company, their interpretation  of towable vehicles is bias.\nI am dumbfounded that this company would allow a towing company to enter a permit only garage and tow the cars. According to Auburn Express towing, they have a deal with the complex to tow any car that does not display both the hang tag and decal to their satisfaction. One of the primary reasons students have cars is for their safety. This compromises their safety, because it subjects them to unsafe alternatives when their vehicles are wrongfully towed. I would understand if the complex issued warnings regarding the accurate placement of decals. I wonder what incentives the towing company offers the complex to give them such liberal access to a permit only garage. I am angry that my child, a resident, was left vulnerable.", "pics": null, "resp": {"time": 1579041841129, "text": "Hi Davi. Thank you for sharing your sentiments about our towing policies. We have the contract to tow in place to avoid illegal parking or non-residents and visitors taking up spaces. If we don't have those rules in place, our residents are inconvenienced by outsiders taking their spots. If you have suggestions on how to avoid this, please feel free to contact the management office or customer service at 512-732-1099. Thank you. - Taniya R. [Corporate Customer Service]"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "109522612913668191299", "name": "Molly Cassidy", "time": 1553275131551, "rating": 4.0, "text": "I’ve lived here for a year now and it’s an awesome complex! great amenities and very helpful office staff! an awesome place if you want to be close to campus!!", "pics": null, "resp": {"time": 1553285850471, "text": "We're so glad you love calling 160 Ross your home. Stop by our office anytime you have any questions. -Lauren K"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "114676888929685708605", "name": "Alice Baker", "time": 1553275446297, "rating": 5.0, "text": "Lived here for 3 years and absolutely loved it! The workers are very helpful and maintence requests are complete in a short period of time. Pool and amenities are great.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "112696734414808115722", "name": "Gabby Burns", "time": 1553286498904, "rating": 5.0, "text": "I have lived here for 3 years and have loved it! It is a great place to live with great amenities!! The staff is always so helpful!", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "114297851070560136319", "name": "Piper", "time": 1553272567698, "rating": 5.0, "text": "160 ross has amazing and friendly staff. The amenities are great and are always a fun time. Shout out Amelia law for being so amazing at the front desk!", "pics": null, "resp": {"time": 1553285614116, "text": "Thank you, Piper! Positive feedback from our residents is always so appreciated - we'll certainly pass your shout out along to Amelia. -Lauren K"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "102385551483450970701", "name": "Tori Warren", "time": 1484700488184, "rating": 4.0, "text": "I have truly enjoyed living here in 160 Ross.  Why? Because of the wonderful amenities, helpful staff, and exciting neighbors.  I have had no real problems with 160.  However, I do wish the lighting was brighter.  Other than that I love 160!! Would recommend.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "111336816163966685222", "name": "Jackenstein", "time": 1523853047217, "rating": 1.0, "text": "Many of times have I hated living here. The walls are as thin as can be and people are always partying loud enough for you to hear then across both courtyards 3 nights a week. The parking deck is dangerous to drive in and is running out of space to park since few residents are willing to pay for the “reserved” parking at $25 a month. I just got towed since I didn’t have my hang tag on my car for about 48 hours while being parked in a spot that I’m normally allowed to park in. This happened without my knowledge since I was out of town for the weekend. It happened even though I had my sticker that said my car’s allowed to park in the deck in addition to them having my license plate and description of my car on file so they know the owner of the car lives here! You’d think that would be enough or that someone would have the decency to let me know my car has been towed! The hallways are always trashed and cleaned on Friday morning before they get messed up again Friday and Saturday night. Resident activities are a waste of money and the good ones require you to show up a good amount of time before it starts to even allow you to get so much as a chicken biscuit. Finally, the wifi is either not working or acting like it works while still not working. All of this can be yours for the hefty price tag of 12 payments of $749 a month not including the skyrocketing prices of utilities. The price keeps going up even though the value keeps going down. Bottom line, you’d be better off elsewhere in more ways than one!", "pics": null, "resp": {"time": 1524056434257, "text": "Hi Jackson. We appreciate your feedback and we’re sorry for any frustration you may have experienced with all of the issues you listed.  Please feel free to contact our Management Office or the Customer Service Department at 512-732-1099 to discuss your concerns in detail."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "102193142356263686175", "name": "Anna Sleeman", "time": 1553272630975, "rating": 5.0, "text": "I love living here! There is always cool activities like food trucks and the pool is sweet! Great location!", "pics": null, "resp": {"time": 1553285726125, "text": "Thanks, Anna! We try to make sure our resident events are always a ton of fun! - Lauren K"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "115014294091359670322", "name": "Stephanie Freeman", "time": 1485023916140, "rating": 4.0, "text": "I generally enjoy living here, they always have fun events going on and free food for different things as well. Our apartment unfortunately flooded but the staff was really helpful and nice and was able to get us back into our apartment very efficiently. I would recommend living here ! Also very easy to get to university by either walking or the transit.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "115993382383026837130", "name": "Lauren Hurston", "time": 1485140518811, "rating": 4.0, "text": "I have had a great experience living here. The staff is nice and friendly and very helpful if you ever have questions. They always have events going on and free food etc. for the residents. The pool and workout room are extremely nice and the game room is an awesome study break. I really love living here and would definitely recommend it to anyone!", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "100733634773212141012", "name": "Ally Douglas", "time": 1556508869596, "rating": 1.0, "text": "If I could give them -5 stars I would. 160 was awful. I could have lived through the paper thin walls, floors, and ceilings if it weren't for the management. They tried to fine us for a noise complaint when that night 1 person was home. The only reason complaints were answered for our unit was because the girls below us worked at 160 which shows the poor management style and unprofessional manner they operated in. Will not be returning next year.", "pics": null, "resp": {"time": 1559575063387, "text": "Hey Ally, thanks for taking the time to leave us a review. I'm sorry to hear that you had issues with Management and that you had a noise violation that you were unable to dispute. Please give our Corporate Customer Service Team a call if you would like to further discuss your experience. We would love to see how we can help. Customer Service can be reached at 512-732-1099 or CustomerService@AmericanCampus.com. - Rachel K. [Cusotmer Service]"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "106669643494030008718", "name": "Elias Hiskey", "time": 1553271066966, "rating": 5.0, "text": "great amenities, a nice workout room and good pool.\nsolid location, easy to walk to campus or downtown\nfun environment", "pics": null, "resp": {"time": 1553285176665, "text": "We love all of these things about our community too! Thanks for the review - Lauren K"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "116777263119749078975", "name": "Eddie Reyes", "time": 1566013400717, "rating": 1.0, "text": "DO NOT BE SCAMMED BY 160 ROSS!! Please avoid this place at all costs. Do not fall for the nice rooms that they advertise. Walls are paper thin and the people that live here no respect for others and play their music as loud as possible and as late as possible. If you live in front of one of the roads prepare for a lot of traffic noise that wakes you up in the morning before your alarm does. And don't expect to come into a nice clean room when you first move in, instead expect it to be dusty, dirty, and dark. I wish I had seen the bad reviews before I signed my $759 12 month lease that is now being advertised for $649. And apparently all the good reviews are from people who were told they would get free food if they put a 5 star review on here. Yikes!", "pics": null, "resp": {"time": 1566219159504, "text": "Hi Eddie, We’re sorry to hear about your bad experience at 160 Ross. We continually strive to exceed customer expectations with our units, however, based on your review it sounds as though we fell short.   Please feel free to contact our Management Office or the Customer Service Department at 512-732-1099 to discuss your concern in detail. Thank you - Caithn S. [Corporate Customer Service]"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "115278365644757849318", "name": "Carly Porep", "time": 1553275629145, "rating": 5.0, "text": "The staff is amazing!!! The are always so friendly when I walk inside and always willing to help with anything.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "104252158052943957734", "name": "Kelly Andreone", "time": 1553276183012, "rating": 5.0, "text": "I’ve lived here for the past year and it’s great! I love being so close to campus!", "pics": null, "resp": {"time": 1553284389438, "text": "That's what we like to hear. Thanks so much for the feedback, and we LOVE being close to campus too. — Lauren K"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "100488759318380402850", "name": "Shelby Gustin", "time": 1553274260622, "rating": 5.0, "text": "160 ross is a super fun place to live and they take care of everything in a timely manner! Lauren’s the best!", "pics": null, "resp": {"time": 1553284587974, "text": "Yay! We love our residents, and positive feedback is always so appreciated.-Lauren K"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "104449887939970482670", "name": "sam jones", "time": 1574180124936, "rating": 1.0, "text": "one time someone threw up in the stairwell and it wasn't cleaned for two weeks. also the pool in consistently green. the gates are often broken. they tell you the utility bill is usually $10 or less but it is much more expensive than that. DONT LIVE HERE", "pics": null, "resp": {"time": 1574256781561, "text": "Hi Sam, wow, that is unfortunate to hear that a mess was not cleaned up for a few weeks. It's always important to contact the office so that it may be addressed. We’re sorry that you had a bad experience.  Please give the Management Office or Customer Service Team a call, so we can discuss your concerns in detail.  The Customer Service Team can be reached at 512-732-1099. - Rachel K. [Customer Service]"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "106639610665423348028", "name": "Caroline Baehr", "time": 1556508136111, "rating": 1.0, "text": "160 Ross is not the place for you if you have sensitive ears. The walls are paper thin, you can hear everything from all directions(outside and inside). We got over 10 noise complaints because the people under us worked here, 8/10 of those were from us simply walking around.  The people above us are extremely loud, but we never called a noise complaint because we understood that the walls were so thin. The study rooms are loud because they are right underneath the gym so you can hear treadmills if you are trying to study. Simply don't live here if you can't handle a bunch of noise. 100% not renewing our lease.", "pics": null, "resp": {"time": 1559575291282, "text": "Hey Caroline! I'm really sorry to hear that you had issues with the neighbors below you and that you felt the walls and floors weren't sound proof. We appreciate your feedback. Please give our Corporate Customer Service Team a call if you would like to further discuss your review. We can be reached at 512-732-1099. - Rachel K. [Customer Service]"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "117485402951502837748", "name": "Lauren Brands", "time": 1523742716688, "rating": 5.0, "text": "160 has been awesome! Both management and maintenance are great. Anytime you have an issue they always work to do everything that they can! Although you do live in close proximity to your neighbors (just the nature of being in any apartment complex) the staff has measured in place to help out anytime there are any issues. Was originally worried about the negative reviews before signing my lease, but so glad I took them with a grain of salt. Glad to be a part of this community!", "pics": null, "resp": {"time": 1523896828697, "text": "Lauren,\n\nWe are glad you are a part of our community too! Thank you for your review. It’s always our goal at 160 Ross to provide the best customer service possible. Feel free to contact our office if you need anything and once again thank you!"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "103502285936935868494", "name": "D. East Cobb Mom", "time": 1563567788950, "rating": 1.0, "text": "We have been renters for one year in Ross and wish now we had never entered the front door.  Our experience is the same as a previous poster John Daily.\n\nWe were charged rent August 1st but only allowed in August 15th. The room was not freshly painted and we cannot understand the delay.\n\nOnly having lived there a few weeks, we were pressured to sign a new annual lease for the following year with an increase to the rate. Concerned and nervous, we signed a new lease in October with a new monthly rate for their cheapest room at 759.00.  This same room has been renting for 649.00 since April and they now allow for ten month terms.  We feel taken advantage of and very upset that  no one in the office will rent us our room at the current rate.  Beware of Ross, a lot of pressure, they are salesmen not community assistants.", "pics": null, "resp": {"time": 1563816442707, "text": "Hello there, Thank you for taking the time to leave us your feedback. We're sorry to hear that you are unhappy. 160 Ross values you as a customer, and we welcome the opportunity to discuss your concerns with the rental rates in more detail.  You may call the Management Office or contact the Customer Service Team at 512-732-1099 if you would like to discuss your review.  Thank you - Caithn S. [Corporate Customer Service]"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "107664849180977566428", "name": "Katie", "time": 1556042679077, "rating": 1.0, "text": "I would not recommend living at 160 Ross. Like everyone has previously stated, the walls are extremely thin. I can hear the conversations of the people who live beside me, above me, below me, and in the courtyard. The parking garage is also extremely tight, and people drive recklessly. If I come home past 7 PM, I can only find parking on the top floor. Further, if I ever have any problems such as noise complaints or maintenance issues, I no longer bother reporting them knowing how they’ve completely ignored or mishandled my complaints in the past. 160 Ross seemed like a nice place to live in originally because it’s proximity to campus and it’s amenities, but after living here for over a year now I’d highly suggest anyone looking to live here to consider looking elsewhere. Lastly, all the positive comments posted a month ago were only posted because those who did post positive comments could receive free food.", "pics": null, "resp": {"time": 1556581255350, "text": "Katie, We're sorry that you were disappointed with your experience. Please reach out to our office at 334-332-9736 - we'd love to discuss your situation in detail and make it right. - Lauren K."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "105285670903043648296", "name": "Tyler Dollar", "time": 1484687248892, "rating": 4.0, "text": "I've lived here since it open and I love it for what you get you really pay a good price considering how expensive other places are for the same style of living. My roommates are great and we all renewed to live here for our third year", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "104938972300154740910", "name": "Brenna Fowler", "time": 1506298508428, "rating": 3.0, "text": "I absolutely love living here! It is a close walk to campus, and parking is not an issue at all (it is now). Definitely recommend checking this place out if you're looking into living off-campus! Just kidding, they upped the rates $60.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "114258439112206346288", "name": "Cameron Humphrey", "time": 1524577748208, "rating": 5.0, "text": "I like this place. close to campus (close enough to walk). Prices are iffy but understandable. The staff is cool, the people that live here are cool. Overall a nice place to live.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "103460746053522402105", "name": "Catie Asarch", "time": 1553275628717, "rating": 4.0, "text": "160 is a great place to live! We love it!!! It’s close to campus and a perfect place!", "pics": null, "resp": {"time": 1553284681256, "text": "Thank you. We love our 160 Ross residents, and your feedback means a lot to us.-Lauren K"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "104641118850502472489", "name": "Amber Jackson", "time": 1553021615035, "rating": 4.0, "text": "I enjoyed the activities and amenities that 160 Ross provided; however, the roommate matching system needs improvement.", "pics": null, "resp": {"time": 1553197983192, "text": "Hi Amber,\nThanks so much for the feedback - it's so appreciated. -Lauren K"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "109219749517506572994", "name": "Curtis Mitchell", "time": 1524000911329, "rating": 4.0, "text": "I've lived here since 160 Ross opened and I must say.. Its LIT!! I absolutely love this place. the game room compared to the other apartments I have visited is simply awesome. The rooms are great and considering I only have to pay rent because my utilities are included is a big plus. The only knock I have on this place is parking. Yea we have a parking deck but its really tight. also Their isn't enough space for my guests to park so they run the risk of getting towed a lot . but other than that, the place is great!", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "102848483188136495523", "name": "Maddy Bergeron", "time": 1485028827490, "rating": 3.0, "text": "There have been multiple problems with my apartment. To get management to take the issues seriously usually a parent has to become involved, even then it was a slow going process to get the problem's fixed correctly and according to code. Overall it has nice amenities  and is close to campus so it evens out to be okay in the end.", "pics": null, "resp": {"time": 1485281573950, "text": "Hi Maddy, It is unfortunate to hear of your bad experience.  We strive to continually exceed customer expectations, however, based on your experience it sounds as though we fell short.   Please feel free to contact our Customer Service Department at 512-732-1099 to discuss your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "117777892202225646363", "name": "Jacob Locke", "time": 1485109730960, "rating": 5.0, "text": "For the past two years, my experience at 160 Ross has been bliss in comparison to other apartments I've lived at.  The rent is high compared to most places in Auburn, but the amenities, accommodations, and proximity to downtown make up for the difference.  Management has always been kind and quick to respond to problems.  It is very nice to have secure garage parking!  My only complaint would be the guest parking situation.  25 guest spots is nowhere near enough parking for the ~650 residents that live here.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "100791800570615361266", "name": "Jessica", "time": 1553107713818, "rating": 1.0, "text": "Management is absolutely awful to their employees. They make their workers want to quit almost daily. Never known management to act like such teenagers. They ignore continuous complains about loud neighbors even with evidence of loud bangs and screams. They never go to the next step to get them to stop the loudness. The walls are paper thin, if you want to listen to your roommates phone call crying to their boyfriend at 3 am you’re in luck. Or the person next to you tapping their desk chair against the wall for two straight hours. And nothing is done about it. Either the people here are jerks and refuse to answer their door, or no one is sent to handle it in the first place. They will say they’ll take care of it but record absolutely nothing of the issue so each call is basically call #1 and the neighbors are never punished. Garage is a crash zone, sorority girls and guys in big trucks fly around the corner with no regards as to who may be coming. No mirrors to see around the corners. If you live here, get top floor so you can’t hear the circus above you. Not nearly enough guest parking and half of it for future residents, you WILL get towed. They lock every single door at night so there’s no way to get in, and have even taken handles off the outside of the doors.", "pics": null, "resp": {"time": 1556621307405, "text": "Hey Jessica, thank you for your review. We take your concerns very seriously and will pass along your feedback. I'm sorry that you have not had a good experience with the onsite Management resolving your noise complaints. Please give our Corporate Customer Service Team a call at 512-732-1099 to discuss your review further. We are here to help! - Rachel K. [Customer Service]"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "113714190578280019994", "name": "Miranda LaTourette", "time": 1485029039602, "rating": 4.0, "text": "Living at 160 is a different kind of living experience, Its not like living on campus but it has its own way of making you feel as if you do. They always have games, events, and free food to entertain you. I love that so many of my friends live here, therefore we can go work out,goto the pool, or hangout on the green space all in the convenience of my home. Its just convenient way to socialize, live near campus, and meet new people. Although, Ive had a few issues with my living situation such as a pipe bust which caused flooding my apartment due to that and a few little things like lighting issues, management has worked well with me to address and find a solution to the problems.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "109156714024580657463", "name": "David Marinello", "time": 1484337315503, "rating": 1.0, "text": "The living room space and the Kitchen for the rooms were nice, but for the most part, that was the only nice things. The bedrooms are not large enough to warrant the price of the rent, the parking garage is a madhouse and should have been way bigger than it is, and the halls are uninviting and the layout is confusing. Also, the management is not very good and is poorly run. It is flashy, its an okay temporary place but I do not recommend living there very long.", "pics": null, "resp": {"time": 1484746873995, "text": "We appreciate your feedback and we are sorry for any frustration you may have experienced.  Please feel free to contact our Customer Service Department at 512-732-1099 to discuss your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "109949308911010929806", "name": "lyndsey", "time": 1556041177250, "rating": 1.0, "text": "If you are looking at the most relevant reviews and they are all 5 stars it is because 160 management pushes the good reviewes to the top so you will see them and sign but in reality no one wants to sign here anymore because it is the worst apartment complex in auburn. And the only good reviews on here are from a month ago and that is because they were giving out free food if you wrote a good review. If you are thinking of living here because it is close to campus and has great amenities, DO NOT LIVE HERE. 160 Ross was made fast and cheap. The walls are thin, you can hear the person above you, below you, and beside you, along with people walking in the halls. If you have a balcony, then good luck because you will hear people partying by the pool until early in the morning. and if you complain, they wont listen unless you tell them every day for a month. the doors to get in building are broken except for two. and the security guards will open the door for ANYONE. and when it is hot outside, the fire alarm will go off daily. It is now the fifth day in a row that the fire alarm has gone off in the morning. The rent amount goes up every month and i now pay 1000 a month. People throw up in the hallways and it is not cleaned up for weeks. Yes, 160 has a pool and gym but so does the Rec Center which is free for students and is way better than the pool and gym at 160. The wifi here will also randomly cut off and wont turn back on for a while. and the study rooms here are a joke! And they wont stop calling you to renew your lease after you have told the you wont renew 5 times. Also dont expect to park on the floor you live on if you get here past 7 pm and if you do park in the parking deck, be cautious because it is a CRASH ZONE! everyone drives fast and you cant see when you are turning the corner. also they forget to call pest control and roaches will appear in your freshly and weekly cleaned kitchen. walking to campus was enjoyable until construction started and now you have to walk on the street. If you call maintenance, dont except them to knock when they come. They have the key so they will walk right in, even if you are in the shower. another problem with privacy is that of you leave your blinds open, you are able to see directly into the whole room even if they are all the way across the courtyard. Also if you ever except to have guests, they will not find any parking. And the \"resident activities\" are always something random and scheduled in the middle of the day when everyone has class. I would have rather lived in a dorm than lived here!", "pics": null, "resp": {"time": 1559575562017, "text": "Hey Lyndsey, we greatly appreciate you as a resident and I'm sorry that you're unhappy with 160 Ross. There are a lot of things you brought up in your review that we would like to discuss further with you. It is our goal to provide the best experience possible, and we want to do better in the future. Customer Service can be reached at 512-732-1099 or CustomerService@AmericanCampus.com. - Rachel K. [Customer Service]"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "106065505163848325648", "name": "Ryan Hill", "time": 1506016365558, "rating": 1.0, "text": "If you are considering living at 160 Ross, do yourself a favor and don't. You can either trust me and start looking for other places or feel free to read about 160 Ross:\n\n160 Ross puts on a facade that they care about their residents and keeping everything running smoothly but a group of monkeys could run 160 better than the management does currently. You will never speak with a manager, they always send out the young kids to deliver their messages because it's usually is not what you want to hear and they don't have the spine to come out and say it for themselves so they always have others speak on their behalf. And when you call to speak with a manager, they are out of their office and won't be back for a few days. And then they are supposed to be back, they're \"out of the office\" again.\n\nI understand that the employees at 160 can come into the residents rooms if they have a reason but a little bit of notice would be nice. I have been getting out of the shower and had a 160 employee walk into my room without knocking. If they do knock on the front door, it's after they have already unlocked the door and began to open it.\n\nWhen it comes to maintenance, don't expect anything to ever get done. Our living room fan had water leaking through it from the ceiling and they came to take the fan down and fix the leak but they left our fan on the ground outside for about a month before we had to call again to get them to put it back up on the ceiling. And the very next storm, it leaked again and they came, took the fan down and again, it was about 3 weeks before we called to get the fan out back up. Our AC went out for 5 days this summer with extremely minimal help at all. We notified them the morning after our AC went out and we were told they'd come look at it and try to fix it. When they came, they looked at the AC, couldn't figure it out so they told us they were \"troubleshooting\" to fix the issue. This \"troubleshooting went on for 4 days until they finally had an outside vendor fix it. Meanwhile, we were given a portable AC unit to put in our living room. That made the air feel great if you were about two feet away from it. Our room was at 86 degrees at night, and I am really not concerned about us four human residents as I was for the dog we had in our room. And yes, I know it is not a pet friendly place but the dog was allowed to be their as it was an emotional support animal. And 160 was well aware we had the dog in the room. It wasn't until the afternoon before the AC got fixed that they gave each of us window AC units to have until it was fixed.\n\nI have also seen a 160 employee sweep broken glass, bottles (plastic and glass), plastic bags and all sorts of other random trash from the dumpsters into the water drain on multiple occasions. When I said something to him about it, he told me that the drain collected trash and kept it under 160. I told him that it was a water/storm drain but he argued with me that it was for trash and that what he was doing was fine. Eventually I was told I didn't know what I was talking about and to leave him alone, and so I did.\n\nIf you have any questions for them, always get your answers in writing. They will tell you one thing and do they exact opposite, hoping you don't notice or care so having their answers in writing will only help you if you decide to live there.\n\nI understand that this was just my (and partly my roommates) experience with 160 Ross and there very well may be people who have had great experiences with them. For example, the people in the room below us had lived their for 2 years and were resigning again. When I asked why, the main reason was convenience  of already being their, not necessarily the quality of 160. However, my experience with them was far less than ideal and I would recommend not living there.", "pics": null, "resp": {"time": 1506353899124, "text": "Ryan, Thank you for being open about your experience?your feedback helps us to further improve our services at American Campus Communities. It?s always our goal to provide the best experience possible, and we?d appreciate the opportunity to discuss your concerns in greater detail via phone. Please give our Customer Service Department a call at 512-732-1099."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "108086146947088129285", "name": "Spencer Mashburn", "time": 1470080346610, "rating": 2.0, "text": "I would recommend 160 Ross to anyone who seeks subpar quality at an obscene price. I will admit that the amenities are quite nice, but the actual apartments are second rate at best. There were large holes above my cabinets left over from installment as well as the constant bombardment of sound and shaking from neighbors due to the thin walls/ceilings. There have been a few instances of puke fermenting in my hall for up to 3 days as well as feces in the stairwell. It's just a generally nasty place, pretty fun to party at, but wouldn't recommend living there.", "pics": null, "resp": {"time": 1470166433003, "text": "Hi Spencer,\n\nWe value your feedback and we’re sorry you are unhappy.  We strive to provide excellent customer service at American Campus Communities.  Please contact our Customer Service Department at 512-732-1099 to discuss your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "118150123416390228324", "name": "Jane Robison", "time": 1506479743455, "rating": 5.0, "text": "I do not understand why 160 has so many bad reviews. I live here right now and I couldn't be happier. The apartments are beautiful and the amenities are fantastic. The only complaint I have is that parking can get crowded. As for all the bad reviews about management, I have not had any issues.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "104602884751542277836", "name": "Michael Holland", "time": 1459355963424, "rating": 1.0, "text": "Terrible management. Completely incompetent and lazy. My room mates found all 3 of us in serious danger due to the 4th room mate. He had multiple problems with flashing guns at people and had documented mental health issues. He eventually threatened to kill himself and us while holding a gun. Management couldn't care less! All they cared about was that he paid rent. The cops came multiple times to talk to the property manager and she only took action after she was spoken to by a legal representative of auburn (they didn't even seem to care he got arrested or had guns and ammo in the apartment which is explicitly forbade in the lease agreement). Absolutely awful leadership. There's a reason why all the workers keep quitting and they're under staffed now. Steer clear at all costs unless you want to see the borderline literal depths of student living hell.", "pics": null, "resp": {"time": 1459873454790, "text": "Michael,\n\nIt is unfortunate to hear of your bad experience.  We strive to continually exceed customer expectations, however, based on your experience it sounds as though we fell short.   Please feel free to contact our Customer Service Department at 512-732-1099 to discuss your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "110608397358611000725", "name": "Reagan Kaniut", "time": 1522172642960, "rating": 2.0, "text": "I've lived at 160 for two years now and am actively searching for a new place to live for next year. Walls are incredibly thin, so unless any of your roommates or neighbors are mute, I hope you enjoy listening to the details of their conversations and nightly escapades.\n$740 a month is a joke! In the great words of Tiffany \"New York\" Pollard, \"She just doesn't have the vernacular that she thinks she possesses. Somebody lied to her several times and told her that she was fly, hot, and sexy, and beautiful and she's nothing like that. She's nothing of the sort.\"\n\nEdit: Also there has been human feces in the hallways too many times for me to be comfortable with\n\nEdit 2: The community assistants are all wonderful, the events hosted are fun. But this does not make anything above less true.", "pics": null, "resp": {"time": 1506970272444, "text": "Reagan,\n\nThanks for your feedback.  We know you have other housing options, and we appreciate that you chose 160 Ross two years in a row. We?re sorry you?re unhappy. If you?d like, please give our Customer Service Department a call at 512-732-1099 to discuss your review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "105754643602640772978", "name": "Davonte Richmond", "time": 1578632452281, "rating": 1.0, "text": "160 Ross is a very nice and luxurious place and I am satisfied with my living arrangements. I would recommend this place. However, every place has its issues. I haven't really had a problem with management and I already knew my roommates before I moved in. The rent is way too high for what you get. Yes it is very nice, but I don't think it is worth almost $700/ month. The rooms could be bigger for one. Prices should be lowered. Parking is the biggest issue for me. It's just awful, partly in due to the location but mostly in due to the layout of the garage. It's nice we have one, but it is WAY too tight. People already can't drive here. Other complaints I have, 160 Ross can't control like how people behave and what they do. Overall, it's a nice place plus they have a lot giveaways.\n\nUpdate: I really wish i would have listened and moved away while i still had the chance. Forget anything i said that was positive about 160 Ross! Please, please, please, listen to the reviews that are real and not hyped up just to win a giveaway, DO NOT MOVE HERE!! To make a long story short, save yourself the heartaches and headaches PLEASE! It’s worse than what you’re reading. Everything from the noise, surprise charges, awful parking, and more! And Oh yea, the rent is always going up, it’s well over $700 now for the basic 4-bedroom setup. The connection, eagles west, copper beech, almost anything else besides here, please for your sake", "pics": null, "resp": {"time": 1484747321973, "text": "Davonte,\n\nWe appreciate your feedback. It is always our goal at American Campus Communities to provide the best Customer Service possible.  Please contact our Customer Service Department at 512-732-1099 if you would like to discuss your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "112284686250163204665", "name": "Josie Oldham", "time": 1484700465761, "rating": 4.0, "text": "160 is awesome woo!!! The only problem I've had was when the pool was closed for over a month. Please never do that again :(", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "118150123416390228324", "name": "Jane Robison", "time": 1506479743455, "rating": 5.0, "text": "I do not understand why 160 has so many bad reviews. I live here right now and I couldn't be happier. The apartments are beautiful and the amenities are fantastic. The only complaint I have is that parking can get crowded. As for all the bad reviews about management, I have not had any issues.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "104268387093400088204", "name": "Conrad Mershon", "time": 1459701421226, "rating": 1.0, "text": "Absolutely terrible management.  0 out of 10.  Would not recommend.  The one thing that place had going for it was this beautiful CA that used to work there.  Anyway she quit so that place is basically worthless now.", "pics": null, "resp": {"time": 1459873790901, "text": "Conrad,\n\nWe value your feedback and we’re sorry you are unhappy.  We strive to provide excellent customer service at American Campus Communities.  Please contact our Customer Service Department at 512-732-1099 to discuss your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "110608397358611000725", "name": "Reagan Kaniut", "time": 1522172642960, "rating": 2.0, "text": "I've lived at 160 for two years now and am actively searching for a new place to live for next year. Walls are incredibly thin, so unless any of your roommates or neighbors are mute, I hope you enjoy listening to the details of their conversations and nightly escapades.\n$740 a month is a joke! In the great words of Tiffany \"New York\" Pollard, \"She just doesn't have the vernacular that she thinks she possesses. Somebody lied to her several times and told her that she was fly, hot, and sexy, and beautiful and she's nothing like that. She's nothing of the sort.\"\n\nEdit: Also there has been human feces in the hallways too many times for me to be comfortable with\n\nEdit 2: The community assistants are all wonderful, the events hosted are fun. But this does not make anything above less true.", "pics": null, "resp": {"time": 1506970272444, "text": "Reagan,\n\nThanks for your feedback.  We know you have other housing options, and we appreciate that you chose 160 Ross two years in a row. We?re sorry you?re unhappy. If you?d like, please give our Customer Service Department a call at 512-732-1099 to discuss your review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "102249526530051852452", "name": "Tracey Rogers", "time": 1506828038663, "rating": 1.0, "text": "My daughter moved into a new unit this year it was filthy .There was mold in the bathroom sink, rusted curtain rod .Pot resin on the floor and coffee table .Previous tenants clothes in the dresser . Mold in the washing machine detergent dispenser .Counter top shifted and rough edges that need caulking .Kitchen floor peeling up .Cockroaches through out . filth and  mold on the balcony , bedroom ceiling fan inoperable .\nSome things were fixed shortly after move in with a promise of a return visit to fix the remaining problems. This did not happen .\nWe have been patient but it is coming up on a month and this is ridiculous and totally un acceptable . So very disappointing .Very different to the experience we had last year .\nPlease fix the kitchen floor and counter top and get the bug man in and the roaches out .", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "105168929532195057527", "name": "Yoko Brown", "time": 1492452862910, "rating": 1.0, "text": "PARENTS be AWARE.  NOT A SAFE PLACE... Please read all reviews and check with Auburn Police.  Property management was aware of narcotic usage and selling on property.  Management ignored police reports , and ignored emails requesting reassignment of apartment due to narcotic soliciting and sells in apartment. We accrued additional cost packing and unpacking after finding another apartment elsewhere.", "pics": null, "resp": {"time": 1492527200903, "text": "Yikes!  We’re sorry that you had a bad experience.  Give us a call so we can discuss your concerns in detail.  Our Customer Service Team can be reached at 512-732-1099."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "100814513688111081906", "name": "Quinn Morrison", "time": 1553273909079, "rating": 5.0, "text": "Great amenities and even better staff! Highly suggest 160 Ross if you need a place to stay!", "pics": null, "resp": {"time": 1553285255258, "text": "We are glad you are a part of the 160 Ross Community! Great resident's like you make 160 Ross AMAZING! - Lauren K"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "110233383973632890254", "name": "Sara Richardson", "time": 1455139361578, "rating": 1.0, "text": "Terrible management. Roommate matching is done poorly, management staff not educated, building structure not thought before (study room is located right below the treadmill and next to the playroom), although utility is included according to ads, you should always pay more (there is a cap), and overpriced for the value. Finally, it says on the website \"our staffs are there 24/7\". That is not true. When there is even serious false alarm (which is the case often) or no AC/Electric, etc, there is no one in office that can help you if the office is closed (after like 5)", "pics": null, "resp": {"time": 1455221436329, "text": "We value you as a customer and appreciate your feedback.  It is unfortunate you had a bad experience.  We welcome the opportunity to discuss your concerns in further detail.  Please feel free to contact our Customer Service Department at 512-732-1099 regarding your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "109152592048271299272", "name": "Robert Robbins", "time": 1544995321127, "rating": 5.0, "text": "I have nothing but good things to say about this company and this apartment complex. Not only is the furniture and quality always great in my apartment and my actual bedroom but so are the products they provide like the dishwasher, oven, and fridge. I have had issues with these products; but that is not 160 Ross's fault, it is the manufacturer who made the error and I reported it to the on-site maintenance; I understand they are busy but they came within 24 hours and fixed it.\n\nThe internet is actually way better than I expected. There are two wireless hookups and so if one is slower than you want (usually because of bandwidth issues) then I switch to the other wifi and it is perfectly fine because there's not 600 people on it. There's even a hard-wire hookup if you want even faster internet!\n\nAs far as cost to standard of living ratio I think it is great. Once you calculate all the utilities they pay for and the fact I didn't have to buy furniture to live here and haul it all the way down from home helps as well. Plus the amenities are great and always clean.\n\nThe apartment community rules are completely fair and not strict at all. I understand that they are there for my safety as well as others so I have no problems with the pool not being 24 hours, etc.\n\nNow for the residents. 160 Ross has an amazing staff, and they are always there to help. I have had to call the on-site community assistant (CA) for noise complaints before and they took care of it at 0230 in the morning. It is a place where college students live so there will be noise but if you ask a CA to tell them to quiet down then they will. Also, after some home football games there is some stuff in the hallways like beer cans, and I walk past them and go to my room but when I go back out they are gone. I really get the feeling that the staff cares about the community and their residents.\n\nI know I was rambling on and on but I saw the reviews online and just had to say something. Everything about living here is worth it, and if you have any shred of knowledge you will understand that not everything is perfect but 160 Ross really does try their best to make it so.", "pics": null, "resp": {"time": 1545347126399, "text": "Hi Robert,\nWe're so glad you're enjoying living at 160 Ross as well as love American Campus Communities! We love our residents, and it makes us so happy to hear that you love your home. -Lauren K"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "109002658099146838373", "name": "Kaitlin Seay", "time": 1534388805527, "rating": 3.0, "text": "I lived at 160 Ross for two years and have had both good and bad experiences. Pros: close to campus, nice amenities, friendly community assistants (shoutout to Lauren K, Lauren B, and Curtis), updated appliances and nice furniture. Now for the cons. Walls are paper thin... upstairs elephants and downstairs neighbors blasted their subwoofer until the wee hours of the morning on school nights. I don't know how many times I had to call a CA or even the police, but it was ridiculous. Our AC broke approximately 15 times during our stay (I think its safe to say it never got fixed even with multiple maintenance requests & visits), so even when only 1 person was living there, we consistently had an utility overage fee. The rent kept going up and the utility allowance kept going down. The hallways are consistently filthy (albeit not always 160's fault). The parking deck is a death trap and if you're not home by 5, expect to park on the 4th floor. Abysmal guest parking for the amount of residents.", "pics": null, "resp": {"time": 1534445355511, "text": "Hi Kaitlin, Thank you for being open about your experience. We're glad to hear you love our amenities and Community Assistants. Your feedback helps us to further improve our services at 160 Ross. It’s always our goal to provide the best experience possible, and we’d appreciate the opportunity to discuss your concerns in greater detail via phone. Please give our Management Office or the Customer Service Department a call at 512-732-1099. -Caithn [Corporate Customer Service]"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "104268387093400088204", "name": "Conrad Mershon", "time": 1459701421226, "rating": 1.0, "text": "Absolutely terrible management.  0 out of 10.  Would not recommend.  The one thing that place had going for it was this beautiful CA that used to work there.  Anyway she quit so that place is basically worthless now.", "pics": null, "resp": {"time": 1459873790901, "text": "Conrad,\n\nWe value your feedback and we’re sorry you are unhappy.  We strive to provide excellent customer service at American Campus Communities.  Please contact our Customer Service Department at 512-732-1099 to discuss your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "101334498324011253597", "name": "Tanner Chisari", "time": 1540605679909, "rating": 2.0, "text": "The internet here is terrible.  You could get better wifi in war-torn Syria. The rooms are nice I will say but the wifi is terrible and slow and for a college student apartment that needs to change. Management is okay, not too bad. The maintenance people Are great here however, they will do whatever they can to make living here a better experience. Unfortunately, I have to give this place two stars because the Internet makes it almost impossible to do anything. It takes forever so if you put off assignments until the last few hours like I often do, you won't want to live here.", "pics": null, "resp": {"time": 1541618291899, "text": "Hey Tanner, I'm sorry the internet hasn't been great for you at 160 Ross. I will be sure to pass along your feedback. You may also contact the Management Office or Customer Service. Customer Service can be reached at 512-732-1099. - Rachel K. [Customer Service]"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "114638928815366573993", "name": "Sydni Moss", "time": 1542857792981, "rating": 1.0, "text": "This doesn't necessarily regard the apartment itself, because I have renewed my lease for a third year living here, but I just have to give a review in hopes that it will fix this issue. As a student, wifi is of great importance and this place really just either doesn't care or just doesn't understand? I'm not sure which it is, but the wifi is laughably horrible. I lived here last year and we were constantly told it would get better- fast forward to this year and it's new wifi & ironically worse than the year before. Not only is it IMPOSSIBLE to do schoolwork from your own living space (that you pay an absurd amount for), but I am also from out-of-state and I cannot even FaceTime my parents, because it's \"poor connection\" every single call. I've held my tongue, because the staff has been great to me and there's nothing wrong with the apt aside from this, but I simply cannot take it anymore. This may not seem like a big issue, but once you can't do schoolwork from your home, FaceTime your own family that lives miles away just to see them, or do anything even relatively productive on any electronic device for longer than 5 minutes, you really start to question if $800+/month even makes sense- so if your life involves any sort of technology and you don't live under a rock, this place might not be for you. This has been a problem for almost 2 years now and something needs to happen. It's 2018 and I'd love to enter 2019 with wifi that works (and anyone who lives here can vouch for this)", "pics": null, "resp": {"time": 1543879104581, "text": "Hi Sydni. Thank you for taking the time to leave feedback. We value you as a customer and appreciate you taking the time to let us know about the wifi issues you're having. We use the feedback we receive here and in our annual surveys in November to better serve our residents. Internet and cable are tricky because our reach is only to the providers available in the area, but we will look in to our options. Once again, thank you for bringing this to light. - Taniya R. [Corporate Customer Service]"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "109436569797651434380", "name": "AL Beta Treasurer", "time": 1553272652277, "rating": 5.0, "text": "The amenities are great the rooms are spacious", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "113790419733854817348", "name": "John Smith", "time": 1480541960307, "rating": 1.0, "text": "It was a brand new apartment but things constantly broke and when fixed broke again. Cheaply made. Staff is subpar and parking is constantly a problem. Towed twice at my own apartment. Once for my second parking sticker falling off of the window and again for parking in a \"guest zone\" although there were no signs indicating this. Do not live here. Its a trap", "pics": null, "resp": {"time": 1480606510338, "text": "Hi John,\n\nWe value your feedback and we’re sorry you are unhappy.  We strive to provide excellent customer service at American Campus Communities.  Please contact our Customer Service Department at 512-732-1099 to discuss your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "110233383973632890254", "name": "Sara Richardson", "time": 1455139361578, "rating": 1.0, "text": "Terrible management. Roommate matching is done poorly, management staff not educated, building structure not thought before (study room is located right below the treadmill and next to the playroom), although utility is included according to ads, you should always pay more (there is a cap), and overpriced for the value. Finally, it says on the website \"our staffs are there 24/7\". That is not true. When there is even serious false alarm (which is the case often) or no AC/Electric, etc, there is no one in office that can help you if the office is closed (after like 5)", "pics": null, "resp": {"time": 1455221436329, "text": "We value you as a customer and appreciate your feedback.  It is unfortunate you had a bad experience.  We welcome the opportunity to discuss your concerns in further detail.  Please feel free to contact our Customer Service Department at 512-732-1099 regarding your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "112144879368107990686", "name": "Greg Rickman", "time": 1459485775639, "rating": 1.0, "text": "Absolutely terrible. I wish they would hire a new manager because the current one is absolutely awful at her job, she is one of the most ill-tempered people I have ever met. Pollen has been building up in the hallways for two weeks, they rarely clean the them. I've seen congealed pools of blood, vomit, urine, and other fluids built up and left to mold and foul up the complex for more than a week. They don't care about the residents, and I've seen the management get into shouting matches with residents despite them being in the wrong. They lied about where you can park, and constantly contradict themselves with what they advise residents to do. There are 17 guest parking spots for the 640 residents that live here, and no adjacent parking for over a quarter of a mile. There are holes punched into the stairwell walls, and the entire complex is full of cracks from where the building has started to settle. The walls are paper thin and you can hear everything your neighbors do. The maintenance workers all smoke right outside the hallways, so you can't go into your own complex without inhaling smoke.", "pics": null, "resp": {"time": 1459873621589, "text": "Greg,\n\nWe appreciate your feedback and we are sorry for any frustration you may have experienced.  It is always our goal at American Campus Communities to provide the best Customer Service possible.  Please feel free to contact our Customer Service Department at 512-732-1099 to discuss your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "104420392446586297332", "name": "Lauren Zito", "time": 1461331826581, "rating": 1.0, "text": "This place is discriminatory, harassing, and inconsistent with enforcing their rules set forth in their lease... AC does not work properly in some units causing overages... beware and rent at your own risk.", "pics": null, "resp": {"time": 1461588520135, "text": "Lauren,\n\nWe value you as a customer and appreciate your feedback.  It is unfortunate you had a bad experience.  We welcome the opportunity to discuss your concerns in further detail.  Please feel free to contact our Customer Service Department at 512-732-1099 regarding your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "108753091376853010567", "name": "Gerald Steinbaum", "time": 1521727588311, "rating": 1.0, "text": "The dates on the lease don’t follow the school schedule and my son has to move out with three days left during finals week.  Unwilling to help in any way.  They told me he should get a hotel!!!  I was told too bad so sad.  For an apartment that boasts they support a students study time they don’t.", "pics": null, "resp": {"time": 1521746683122, "text": "Gerald, We value your feedback and we’re sorry you’re unhappy.  We strive to provide excellent customer service at 160 Ross  Please contact our Management Office or the Customer Service Department at 512-732-1099 to discuss your review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "116095148198648033903", "name": "Ben Hedden", "time": 1501511952836, "rating": 1.0, "text": "Would not recommend living here, management is absolutely horrible. I had a loud ticking sound in my room for over a year couldn't sleep or study without ear buds in. A week before move out I request a form so I can mail my key and parking pass in and form isn't emailed to me, call back and still no email, so now they will charge me for a replacement even if I overnighted it because of their mistakes. Not worth the money whatsoever.", "pics": null, "resp": {"time": 1501692051853, "text": "Hey Ben!  We’re sorry to hear about your bad experience! We continually strive to exceed customer expectations, but it sounds like we fell short.  Please don’t hesitate to contact our Customer Service Department at 512-732-1099 so we can discuss your review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "102747446570362158704", "name": "Nate Lundquist", "time": 1486150073197, "rating": 3.0, "text": "Pretty good place to live in Auburn, but there is definitely better. The amenities are nice, but could always be nicer. The internet is awfully slow; makes it hard to get work done. The walls/floors are paper thin and I swear my upstairs neighbors installed a bowling alley. Not pet friendly which is a huge turn off to me. The parking situation is awful; people drive 30mph in the garage, and even though I life on the first floor, I often have to park on the fourth. People often complain about the staff but I've had nothing but a good experience dealing with them.", "pics": null, "resp": {"time": 1486561706134, "text": "Hi Nate, Thank you for taking the time to let us know about your recent experience at an American Campus community. We value your feedback, and use it to improve the services we provide to our valued customers. Please feel free to contact our Customer Service Department at 512-732-1099 if you would like to discuss your review in more detail."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "106652696567497587616", "name": "Robert Blandford", "time": 1518069257920, "rating": 2.0, "text": "This is my first year living here and no grills worked for the whole semester, our washer broke and we had to call the office twice to get it fixed (the first time nobody showed up). After they installed a new washer, the dryer wasnt working and i had to figure out how to fix it myself. The WiFi is HORRIBLE, you cant count on doing homework or studying here because the wifi cuts off. Also the rules in the lease are about as strict as living in a dorm room. Half of the managment is very nice but the other half can be rude. Wouldnt recommend it but good location.", "pics": null, "resp": {"time": 1518190496685, "text": "Hi Robert. 160 Ross consistently strives to provide excellent customer service.  We appreciate your feedback—you’ve uncovered an area of our customer service that could use improvement. Please feel free to contact our Customer Service Department at 512-732-1099 to discuss your review in further detail."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "114979072739590980869", "name": "Adam Blair", "time": 1485191119609, "rating": 5.0, "text": "Great amenities and even better staff ideal place to live", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "107854117603062753460", "name": "Alex Castre", "time": 1465487629786, "rating": 1.0, "text": "From the outside, 160 looks amazing and literally like a resort, but actually have lived there, I did not like it. Most of the appliances in my apartment were falling apart. My roommate and I lived right in front of the pool and the walls are paper thin so we could always hear the people outside. When people were out by the pool late at night and I would call someone to make them be quiet, they never did anything. Management was absolutely terrible and never actually did anything for us. I am glad that I am no longer going to be living there. I do not recommend it at all!", "pics": null, "resp": {"time": 1465559979332, "text": "Hi Alex,\n\nWe value you as a customer and appreciate your feedback.  It is unfortunate you had a bad experience.  We welcome the opportunity to discuss your concerns in further detail.  Please feel free to contact our Customer Service Department at 512-732-1099 regarding your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "105481098077780889994", "name": "Tia Chastain", "time": 1475175304433, "rating": 1.0, "text": "90% of the reviews I have read list poor management as a quality, and that is true. If you have a package delivered you have to pick it up during office hours, but the office closes at 5. If you do not pick your package up within a few days, they will send it back. This becomes a problem for those of us who do not get off work until late. You can't have a roommate or friend pick it up for you. The flooring in my kitchen has gaps from where maintenance had to take out our fridge, the fire alarm is going off weekly, there are very few quest spots (which becomes a problem when people visit from out of town), very unsanitary (vomit is left in the hallway for days), very little security (was told there would be cameras on every floor, that was a joke. You walk down concrete hallways without a camera in sight. Oh, did I mention we have gotten letters about needing to keep our doors locked at all times because people are stealing, wouldn't be a problem if there was cameras), and the parking deck is a major hazard (90 degree turns with no mirrors to see if anyone is coming from the other direction). I pay $25 for reserved parking so I can park in one of about 250 spots. My \"reserved parking\" is not a specific spot for me, it is in any of the \"reserved spot.\" This causes me to rarely (twice this year) be able to park on my floor even if there are open spots for non reserved parking. If someone pays for \"reserved parking,\" then they have to park in the \"reserved spots\" or they will be towed. So basically you are just paying to have just as bad of a spot as non-reserved parking. Last year we actually had a spot, but this year it is a complete scam. It would be a fun place to hang out and visit, but it's not so great when you realize what high rent you are paying for such little.", "pics": null, "resp": {"time": 1475240677502, "text": "Hi Tia,\n\nWe value you as a customer and appreciate your feedback.  It is unfortunate you had a bad experience.  We welcome the opportunity to discuss your concerns in further detail.  Please feel free to contact our Customer Service Department at 512-732-1099 regarding your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "102481017946925919078", "name": "Jackson Berns", "time": 1494595509901, "rating": 4.0, "text": "Great location, amazing amenity package, but definitely expensive", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "104721385732853752010", "name": "Terri Goode Parker", "time": 1509567618550, "rating": 5.0, "text": "A parent's review:  Aside from being crazy expensive in my opinion, we have no complaints at all about 160 Ross.   This place is nicer than anything I ever lived in during college.  But before I signed a lease last year, I'd worried about the bad reviews.  Take them with a grain of salt.  We're talking about 19 year olds here complaining about loud noises and thin walls...around their resort style pool surrounded by tvs and grills and hammocks.  What did they expect? :)\nWhile 5 stars may be an exaggeration, I felt I needed to counter all of the exaggerated 1 and 2 star reviews.  160 Ross is just fine for your child.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "101021156456437884412", "name": "Akila Green", "time": 1461805859545, "rating": 1.0, "text": "DONT RENT HERE!!!!!! OVERPRICED, MANAGEMENT IS AWFUL!!!!!!! They don't clean up , ppl animals urinate and poop in the hallways and its left for days , there is no GUEST PARKING or Enough parking for RESIDENTS , living here has been the worst don't be fooled by the pretty website !!", "pics": null, "resp": {"time": 1461851281834, "text": "Akila,\n\nWe value you as a customer and appreciate your feedback.  It is unfortunate you had a bad experience.  We welcome the opportunity to discuss your concerns in further detail.  Please feel free to contact our Customer Service Department at 512-732-1099 regarding your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "103736292482882804915", "name": "Breanna Perkins", "time": 1467992487928, "rating": 1.0, "text": "It's like living in a cheap spring break resort and never being able to leave. Management and employees are constantly rude. The \"maintenance\" guys fix a flood by putting a fan in your room and claiming that since it hardly ever rains in Alabama the building wasn't built for a lot of rain.\nIf someone throws up outside of your apartment on a Friday you have to wait until Monday for it to get cleaned up. Fire alarms are pulled bi-weekly.\nAppliances look nice on the outside but when you actually need to use them, they will more often then not break.\nOh and sometimes they'll give packages to the wrong people.", "pics": null, "resp": {"time": 1468851960402, "text": "Hi Breanna,\n\nWe value you as a customer and appreciate your feedback.  It is unfortunate you had a bad experience.  We welcome the opportunity to discuss your concerns in further detail.  Please feel free to contact our Customer Service Department at 512-732-1099 regarding your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "106827343348027447193", "name": "Caitlyn Baltas", "time": 1550723350819, "rating": 1.0, "text": "You would be hard pressed in finding a place with worse wifi. The walls are paper thin. The workers will harass you about renewing a lease, even after you've told them 5+ times you are graduating. Waste of money.", "pics": null, "resp": {"time": 1550760970762, "text": "Hi Caitlyn, thank you for taking the time to leave us your feedback. I'm sorry that you had issues with the wifi, noise and our renewal efforts at 160 Ross. Please feel free to give our Management Office or Customer Service Team a call to discuss your review. Customer Service can be reached at 512-732-1099. - Rachel K. [Customer Service]"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "112479089631822538738", "name": "qdawwg27", "time": 1466440662359, "rating": 1.0, "text": "By far the worst possible place to rent out in Auburn. I wouldn't recommend this to anyone. Management is horrible, guest parking has like 8 spots, my power constantly went out in my room, and it took almost 4 months to get our kitchen light replaced!", "pics": null, "resp": {"time": 1466535914413, "text": "It is unfortunate to hear of your bad experience.  We strive to continually exceed customer expectations, however, based on your experience it sounds as though we fell short.   Please feel free to contact our Customer Service Department at 512-732-1099 to discuss your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "103272467357807847153", "name": "Tucker Simmons", "time": 1475764794294, "rating": 1.0, "text": "DO NOT LIVE HERE. Dont even know where to start....managment couldnt be worse. They have no idea how to run a building. Parking is terrible. The air conditioning has broken in my room twice in the less than two months Ive been here. They have \"fixed\" the garbage disposal three times but still stinks up our ENTIRE room. The walls are paper thin and I cant sleep at night because all I can hear is the street. The management is why this place is going to suffer. DO NOT LIVE HERE", "pics": null, "resp": {"time": 1475846463761, "text": "Hi Tucker,\n\nWe value you as a customer and appreciate your feedback.  It is unfortunate you had a bad experience.  We welcome the opportunity to discuss your concerns in further detail.  Please feel free to contact our Customer Service Department at 512-732-1099 regarding your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "118446462178434825901", "name": "Shelby Murphy", "time": 1505165404345, "rating": 1.0, "text": "I am a senior at Auburn, and this is my third year living in 160 Ross. I would absolutely not recommend this place. The floors and walls are so thin, I can hear my neighbors alarm clock in the morning and footsteps above me. The customer service is terrible and management is mediocre at best. They do nothing to benefit residents. Money is wasted on \"resident activities\", and the rent goes up every year. I would rather pay less in rent rather than have resident activities that my schedule doesn't permit. They claim wireless internet is free and provided but the wifi doesn't work and you will end up having to purchase your own through Charter anyway. There are many cheaper, better options in Auburn that are worth the money.", "pics": null, "resp": {"time": 1506019709081, "text": "Hi Shelby,\n\nThank you for taking the time to leave us your feedback as it helps us provide the best customer service possible. We?d appreciate the opportunity to discuss your concerns in greater detail via phone. Please give our Customer Service Department a call at 512-732-1099."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "113836075080447284980", "name": "Joseph McDougal", "time": 1480548010412, "rating": 1.0, "text": "Frustrated - always pay rent on time but Son's car has been towed twice, once in the middle of finals.  Nitpicky stuff, like he had one sticker on his car but not two, and he parked in guest parking outside because of a lack of spaces.  Their defense - we sent an e-mail.  I want him studying not scrutinizing their constant e-mails.  His room is near the trash shute and reaks of garbage.  Lastly, the electricity constantly flickers, a little scary since they had an electrical fire during their opening!  Found a new place and getting him out A.S.A.P.", "pics": null, "resp": {"time": 1480606706255, "text": "Joseph,\n\nWe appreciate your feedback and we are sorry for any frustration you may have experienced.  Please feel free to contact our Customer Service Department at 512-732-1099 to discuss your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "112596006656459324228", "name": "Chat Sumlin", "time": 1474785179577, "rating": 3.0, "text": "Overall after living here for a month and some change there has really only been one complaint that comes to mind. The walls and ceilings are paper thin. I'm not sure if its just the people who live above us by it feels like one of them is about to come crashing through the ceiling at any moment. It is pretty easy to hear your neighbors if they are talking slightly above a normal tone. My roommate often describes the noise as something similar to a flag football team playing above us. The AC unit is pretty loud since its in the living room behind some doors which isn't crazy unreasonable since its not on 24/7. I haven't seen any flooding that has been reported in other ratings so hopefully that's less of a problem now. Living in a room facing the courtyard is nice  and from what i've heard its better than facing the roadway because of noise. From my experience and hearing from other renters the biggest complaint is the noise caused by paper thin walls.", "pics": null, "resp": {"time": 1474900609411, "text": "Hi Chat,\n\nWe appreciate your feedback. It is always our goal at American Campus Communities to provide the best Customer Service possible.  Please contact our Customer Service Department at 512-732-1099 if you would like to discuss your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "113604736407140851765", "name": "LaMiracle Bailey", "time": 1579635746864, "rating": 5.0, "text": "this is a very pretty place", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "108171833429641766229", "name": "Corey Williams", "time": 1467925704886, "rating": 5.0, "text": "Aubrey, the general manager, is very nice and helpful.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "100119087250707880783", "name": "Katy Stevison", "time": 1480435753401, "rating": 1.0, "text": "The worst place I have ever lived. I got into a car accident and had a different car for a week... they made me pay $50 just to park for a week. Management is not helpful and overall it just sucks. Don't spend the money living here.", "pics": null, "resp": {"time": 1480514754542, "text": "Hi Katy,\n\nWe appreciate your feedback and we are sorry for any frustration you may have experienced.  Please feel free to contact our Customer Service Department at 512-732-1099 to discuss your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "103785859868587340612", "name": "Herb Master", "time": 1529704865859, "rating": 2.0, "text": "kinda wish that guy succeeded burning the place down, the place is an eyesore. the parking garage throws huge shade on debardelabin, RIP flowers.", "pics": null, "resp": {"time": 1529932080822, "text": "Hey Herb, we are sorry to hear that you feel that way.  It is our goal to make sure the property is as beautiful as possible. If you’d like, please give the Management Office a call or contact the Customer Service Department at 512-732-1099 to discuss your review.  - Rachel K. [Corporate Customer Service]"}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "105629533628440087430", "name": "Jenny Lincoln", "time": 1506325425688, "rating": 1.0, "text": "I literally cannot open my own door with my key. This is the second time this has happened, and they have not found a permanent solution. Also, the halls???", "pics": null, "resp": {"time": 1506970881823, "text": "Hi Jenny,\n\nWe?re sorry to hear about that! Please feel free to contact our Customer Service Team at 512-732-1099 so we can discuss your review in detail."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "116799315297651512999", "name": "Austin", "time": 1474466108554, "rating": 1.0, "text": "Fire alarm is constantly going off I've been woken up many nights for no reason by the fire alarms and now I can't even sleep because they're going off every 5 minutes.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "111327936559904938399", "name": "Tripp Valentini", "time": 1460408502307, "rating": 1.0, "text": "Place is awful", "pics": null, "resp": {"time": 1460646266766, "text": "Tripp,\n\nWe value your feedback and we’re sorry you are unhappy.  We strive to provide excellent customer service at American Campus Communities.  Please contact our Customer Service Department at 512-732-1099 to discuss your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "103217837188682117809", "name": "Price Hammond", "time": 1459584333842, "rating": 1.0, "text": "This place blows", "pics": null, "resp": null, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
{"user_id": "115394808267326461627", "name": "Chad Vianey", "time": 1475765368932, "rating": 1.0, "text": "Parking is terrible, room smells, and being right next to the street is extremely loud. Don't live here.", "pics": null, "resp": {"time": 1475847961714, "text": "Hi Chad,\n\nWe value your feedback and we’re sorry you are unhappy.  We strive to provide excellent customer service at American Campus Communities.  Please contact our Customer Service Department at 512-732-1099 to discuss your Google review."}, "gmap_id": "0x888cf2e3e18dd913:0xde2917d43088c354"}
