{"user_id": "116949294774881240429", "name": "Kaylah Joseph", "time": 1619750556968, "rating": 5.0, "text": "Every time I purchase, I have such a great experience! I can’t beat the price and the quality is amazing! The customer service is also great!\n\nProducts are true to length and look exactly the same on the website as it does in-person so I always know what I’m getting.", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "111004095207703124091", "name": "Ebony Hickson", "time": 1612710635959, "rating": 1.0, "text": "I want to start off by saying, if you need quality hair, please don’t shop here. I want to save someone else from spending money they don’t have.\nDisclaimer: This isn’t to “bash” but to literally to bring awareness to customers about the fraud of this shop.\n\nOn 1/30/21 I went to the Weave Zone in Huntsville,AL to purchase hair for graduation pictures. Graduation is something that I looked forward to because I’ve worked so hard and endured a lot along this journey so I decided to celebrate by taking pictures with a certain look. The look I was going for requires deepwave hair.\nI purchased 4 bundles and spent a total of over $300.00. A day later I ran my fingers through one bundle and it was completely nappy and tangled. (Pictures will be attached)...\n\nThey gave me the run around and of course rude customer service but I’m from New York so that little attitude they gave didn’t phase me at all. I’m used to that.\nThey eventually exchanged it and I went about my way.\nNow it’s time to wash the hair ....\nI do hair and have been using bundle hair for years. The pattern completely dropped and ended up looking like straight hair.\nI called the Weave zone and not to my surprise, they refused to compensate me or exchange my hair just because they exchanged a bad bundle. Keep in mind, all these issues were THEIR FAULT! Lol anyway...\nAs I said, no need to be disrespectful towards them in this review because I’ll let the pictures speak for themselves.\nIn closing, ladies , I’m sure you’re reading this review because you are contemplating spending your hard earned money in order to do something nice for yourself. Please go elsewhere, I highly advise it.\nAm I disappointed? Highly. No one has 300 dollars sitting around but I strongly believe that when you’re dishonest, you won’t prosper. The weave zone isn’t exempt from that principle. Have a blessed day ladies!\n\nEDIT/(2/7/21)\n\nOk let me blast you really quick... first of all, there was no harsh chemical. It’s a rinse where you put the NON-TOXIC RINSE, NOT A DYE, on the hair and simply wash it out. (I’ll attach pictures). Everyone knows what a rinse is. Secondly, as I showed your associate, the left bundle with the red rubber band WAS NOT RINSED!! So how do you explain that??? The crunchy bundle I exchanged was also not touched hence why it was exchanged.\nMy point is, the hair you gave me was NOT DEEP WAVE!!! Does that look like deep wave to you? Cut the foolishness. Your hair is trash and I stand by what I said. All proof is provided. How do you over process a non chemical rinse? Go back and look at the picture with the bundle in the red rubber band that wasn’t touched. You’re still going to tell me that’s a deepwave pattern? You’re missing the point of my review. My point is, that is NOT deepwave hair!!!! Instead of replying to me, go invest in a better vendor.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMEmTB_3KhaUQ7683Xy0PWgMNo01TLg694-gwaX=w150-h150-k-no-p"]}], "resp": {"time": 1612709400886, "text": "Ebony, our hair is 1B. You applied a chemical and over-processed the hair. Our store policy is once a product has been chemically altered, we do not accept refunds nor exchanges. We stand behind our  commitment to providing high quality hair for prices our dolls can bare!"}, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "103972113846723551618", "name": "Dalphne Abernathy", "time": 1618680062578, "rating": 5.0, "text": "Ms. Kiala presented me with excellent customer service. She was very patient and knew her product well. I would highly recommend The Weave Zone for a complete professional outcome.", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "113512710988698177016", "name": "Kendra Rogers", "time": 1622384677736, "rating": 2.0, "text": "The only thing  is they are not consecutive. The young ladies charge more for there products. But if the gentleman is there you pay the same price. This reason alone has lost me as a customer. I don't mine paying for products that I like but don't overcharged people this is how you lose!", "pics": null, "resp": {"time": 1622387280169, "text": "Kendra,\n\nThank you for contacting us! Our prices are set by our corporate offices and our employees cannot make changes to them.\n\nFor discounts and exclusive sales, text WEAVEZONE to 474747.\n\nYou can always check out our weekly online deals on our website —- www.TheWeaveZone.com"}, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "109900075307553442593", "name": "Shawnda Jackson", "time": 1617851407863, "rating": 1.0, "text": "I purchased a wig from online I was lied to about when my wig was going to be here find out that my wig was never ordered after reaching a man in the Nashville office and it was past the event that I needed it for and then it was poor quality it came already broke off looking it did not look like what was advertised even though it said the wig on the page had been styled the pattern was way different then what it showed, it showed the wig natural black it came back Natural Brown it was just awful and not what I ordered. I have called\nand called and can't get a return call and apparently email isn't good either I never could get a response when I was trying to track the wig down the first time to see why I hadnt received it and never got a response back", "pics": null, "resp": {"time": 1617910096747, "text": "Shawnda,\n\nThank you for contacting us! We appreciate your feedback and thank you for taking the time to leave such a detailed review.\n\nYour order was shipped and delivered in accordance with our shipping policies stated on our website. Holidays, warehouse sales and shipping delays can affect your shipping speed which is why we have options for Express shipping available to our customers who are in a rush.\n\nIn an effort to provide the best and most efficient customer experience, we have a very detailed Customer Care section of our website. Additionally, you received a reply to your email within 30 minutes that also shared the answer to your question. Please check your Spam folder because you may have missed it :(\n\nWe appreciate your business and hate to learn that you are unsatisfied with your product! If it is still in the original packaging and hasn’t been altered, will you stop by our retail location so that we can make it right for you?\n\nPlease give us a call today if you’d like us to put another wig of equal value to the side for you to come and review ❤️"}, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "109985121112695010907", "name": "Porcha Hambrick", "time": 1617799701152, "rating": 1.0, "text": "I ordered a wig for pick up which stated it will be 3-5 days after the 5 days I never heard anything I reached out after the week I was told but the young girl that they waiting on shipment call back in 2-3 days I called back in 3 days a man answer the phone he stated we just waiting on the shipment I’ll put you on the list and give you a call sometime in the afternoon to give you update I received no call. I waited two more days and called back and the man answer and stated I have your name listed with several other names to call once it comes this is the 2nd week and 2nd time I had to reschedule a hair appointment. This week is the third week I called Monday and was told by the young girl I spoke with my manager and we don’t have your wig but we have a wig that’s longer and I’ll put that to the side with you with your order number and name and phone, the next day my sister went to pick up my hair the man was there he had no clue I was coming and after 25 min waiting my sister said he gave you the wig you ordered instead of what they told you on the phone. So I waited 3 weeks for my hair that I was told by a young girl and manager that they didn’t have so I was going to get a longer wig to get the same wig I was promised literally a day before no money back no percentage off no nothing. Then I opened the bag of hair it smelled like a full zoo!! Promise  I would never recommends this business they obviously don’t know what be going on don’t know anything and they lie to customers I guess just to avoid there mess up.\n\nPlease don’t let them fool you I have screenshots of all the calls all the the recordings of the lies I was told. Don’t shop I was literally told not to shop with them and I still did now I know why it will never happen again.", "pics": null, "resp": {"time": 1617821284202, "text": "Porcha,\n\nFirst, I’d like to thank you for choosing The Weave Zone! We value your support and value this review.\n\nThis feedback is important to us because it demonstrates areas for further new employee training as we provide new services to our customers.\n\nWe’d love the opportunity to make this right for you. One of our Management team members will reach out to you today. ❤️"}, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "115522752316997896156", "name": "Asia Hargrove", "time": 1616692923423, "rating": 5.0, "text": "Will definitely shop again ! Process was fast and I was able to pick my wig up as soon as I reviewed confirmation that it was finished received about 2-3 days after order placed", "pics": null, "resp": {"time": 1617404111790, "text": "Asia, thank you so much for leaving this review! We pride ourselves on delivering an exceptional and easy ordering process for our customers! As always, thank you for choosing us!"}, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "106282249650578831246", "name": "sharrona williams", "time": 1623800758749, "rating": 5.0, "text": "They are always nice when I come and very helpful.", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "108772191043528541122", "name": "Patrice Bates", "time": 1613248233256, "rating": 5.0, "text": "Very friendly professional and knowledge of product is awesome!", "pics": null, "resp": {"time": 1617404214032, "text": "Patrice, thank you for leaving this review! Our team prides ourselves on delivering great customer experiences which include being industry-certified as product experts! As always, thank you for choosing us!"}, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "117074973754057651171", "name": "Kanesha JS, M.S. IT MNGT", "time": 1571532990222, "rating": 1.0, "text": "I wouldn’t recommend purchasing hair from the Weave Spot.\n\nToday, I purchased hair and it appeared to be the same pattern as the the closure which was deep wave. Once the hair was wet it was completely different. Called the store and the sales person states once you take it out the pack it’s out of there hands! I went to the store and the salesman told me I used old hair. I’m not understanding why I would purchase hair then turn around and use old hair. That’s makes no sense! I proceeded to ask for a manager first he stated the manager wasn’t there then he stated there was no manager. I’m confused. So who is the owner?! He gave me a business card which was the store number. Before even asking what the issue was he over talked me to say once it’s out the bag it’s out of our hands.\n\nKNOW YOUR PRODUCT PRIOR TO SELLING IT FROM PEOPLE!\n\nSome people shouldn’t sell hair. Some people need customer service skills prior to working in a customer service position. Good customer service is vital in the hair industry.", "pics": null, "resp": {"time": 1571575591030, "text": "Hi Kanesha. Sorry and shocked to hear about your experience. Best way to reach customer service is by email. Our email is theweavezone@gmail.com. Please send us a email and we will get back with you ASAP."}, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "117027474958522077304", "name": "Jasmine Jones", "time": 1586734091033, "rating": 5.0, "text": "I recently purchased 7a Brazilian body wave & I must say I’m extremely impressed, not only by the price but the quality & customer service as well. The young gentleman who sold me the bundles was an absolute delight to do business with. & the bundles!? My God! I dyed, washed & deep conditioned them & they went right back to their original texture. Not only that but the hair was softer than before!!! I usually get my bundles from ATL but due to this shutdown I couldn’t. Needless to say, I won’t be making that trip to ATL anymore!", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "110407673882787464450", "name": "Qui Vibez", "time": 1586267118849, "rating": 3.0, "text": "I’m having mixed feelings about this body wave wig I purchased the unit is bomb I can’t deny but after a month the hair is breaking off. You can literally see the hair breaking in half.. I deep conditioned the hair to bring back its luster but after a day it was brittle again.. I hate to put this review out but maybe it can help the company.I purchased another wig before I noticed how much the hair was breaking off but I’m just gonna give it a chance n try n keep it as natural as possible ( little to no product.. (conditioner) ).. service was SUPER FAST.. I also used the pay layer option which I love love love.. I would say give this company a try!! Most companies have flaws but over all I would give the hair a 8 out of 10", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "103216632486256579523", "name": "Nade Onyeahialam", "time": 1590695536500, "rating": 5.0, "text": "The young lady Kiala was very professional and very helpful .i am certain i will be back again.. Thanks Kiala", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "110442497231160932667", "name": "Rekecha Hawkins", "time": 1607037013624, "rating": 5.0, "text": "Kiala was very patient and professional! 💗", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "107545535647275234525", "name": "Jennifer Summers", "time": 1615324039097, "rating": 5.0, "text": "Great quality hair", "pics": null, "resp": {"time": 1617404153536, "text": "Jennifer, we thank you for leaving this review! We pride ourselves on delivering high-quality products at an affordable price! As always, thank you for choosing us!"}, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "110341949445545811844", "name": "Tia Fuller", "time": 1565118468418, "rating": 1.0, "text": "Do NOT order online. Their shipping is not reliable and if you order expedited shipping, it is a huge waste of money because “USPS” will have a delay and your package will NOT come when expected. I contacted customer service and they were nice/nasty about the situation. I definitely would not recommend ordering online. You will waste the extra money and waste your time!", "pics": null, "resp": {"time": 1565128489858, "text": "Tia. We sent your order out yesterday on time. How are you going to get angry and rate us a 1 start when it is not our fault? Sorry your package didn’t come on time but we fulfilled our job. USPS every so often may lose or misplace a package which would cause a delay."}, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "101130876197059052021", "name": "Bthe1 B", "time": 1509506965983, "rating": 4.0, "text": "The customer service was great...She knew hair like know other..i kept my hair 2 months before I got it don...only because I wanted it for the winter...i wore it a month the first time...ive had it in a couple weeks this time...i love love my deep wave...i feel so pretty....however \"I cannot\" get this smell like chemical r burnt smell out i thought o it will come out after I washed it  but know ...How can I get the burnt smell out?? I never put any heat on it just a spray bottle with leave in conditioner oil and water as a mourning routine...", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "108216033022898718175", "name": "Tina Ellis", "time": 1491336635855, "rating": 5.0, "text": "I moved here three years ago and haven't let anyone but Demetra do my hair. After looking through reviews and other people in town that can do my extensions (Yep White girls do it to) I decided to give Demetra a chance. Three years later and she's still the only one in the city of Huntsville that I'll even give the time of day to. Not only is she professional but always polite and suggest different ways to do my extensions. Before meeting her I didn't know anything about beading. I always had my hair braided and then sewn in. She ensured me that beading was the way to go and would stand longer then braiding with my type of hair. Not only did she do an amazing job but she went above and beyond to even meet me at different hair sales places to make sure I had the highest quality of extensions but the exact color I needed. I would recommend Demetra to anyone even the girls at school have gotten to know her and use her. I love getting my hair done by her.\n\n❤️Tina❤️", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "118091142518681323785", "name": "Jean Groow", "time": 1617404115242, "rating": 4.0, "text": "Resolved issue", "pics": null, "resp": {"time": 1617403846679, "text": "Jean, Thank you for contacting us! Have you reviewed our shipping policy? We have responded to your messages & also have you checked out our Customer Care & FAQ sections found here -- https://www.theweavezone.com/pages/customer-care-faqs"}, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "118350341319266882245", "name": "Tee M", "time": 1539890888398, "rating": 5.0, "text": "Update! Thanks to Tony the owner of the weave spot for being so professional and helping me through the shipping issue that occurred. I wish I would have spoken to him originally. Im very pleased and can’t wait to get the rest of my hair. This will be my third wig I’m getting made with hair from the weave spot  :)", "pics": null, "resp": {"time": 1539873677527, "text": "Hi Tiara. Sorry for your experience. Not sure what happened and why you haven’t received your hair yet. Please give me a call so we can resolve your problem right away 256-665-6933."}, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "110934495327480624602", "name": "raven austin", "time": 1552330989692, "rating": 5.0, "text": "Doron was a great salesman. He really made my day. He gave me Great customer service.", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "114676394940509806435", "name": "Shurkera Walley", "time": 1520448422926, "rating": 5.0, "text": "From the moment I asked a random woman where she got her hair from I have been a faithful customer I love my hair n the quality is awesome. It would be cool if they had a stamp card so after so many bundles you can get a bundle for % off vs the one year membership", "pics": null, "resp": {"time": 1520460091431, "text": "Hi Shurkera. We have customer loyalty cards available. Go in store now and get you one and tell them that Tony said you can get 4 stamps on it. Thanks for being a Loyal Customer!"}, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "111588396565209426053", "name": "Gheymarne", "time": 1555224744470, "rating": 5.0, "text": "Extremely nice staff. Very upbeat store. Knowledgable cashier quick greeting and assistant.", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "101820567299045467140", "name": "Aishia Thurman", "time": 1597757513423, "rating": 5.0, "text": "The Best weave in town💯", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "105929734686891226914", "name": "LaKeesha Mitchell", "time": 1579613629434, "rating": 5.0, "text": "High quality hair at great prices- hands down !!", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "106399864356837692061", "name": "tomeka Burwell", "time": 1551746155007, "rating": 1.0, "text": "Poor customer service. The guy was helping me so I thought, only to stop helping me and start serving someone else as if I wasn't there.", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "104697804693639918118", "name": "Marie Marie", "time": 1555515804216, "rating": 1.0, "text": "I visited the weave shop 2mnths ago. My first time i wanted a sew in. The hair is ok but i can find better hair cheaper price. Way to much for  closure pieces and my sew in didn't last a month. Closure won't stay down my sew in is lose and coming apart and it has only been 2 mnths. I have had plenty of sew ins and they last way longer even with bad hair. I spent over 300 never again. 150 for hair, 64 for closure and 100 for sew in that didn't last a week.  I wanted a four way vixen and the stylist don't do that. You need a stylist that knows how to do everything and not what they want to give you.......", "pics": null, "resp": {"time": 1555618040674, "text": "Hi Natasha. Sorry about your issue. Could you tell me what stylist did your hair?"}, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "111803351718861530954", "name": "Amiya Ingram", "time": 1501194683482, "rating": 1.0, "text": "Although their hair is nice their customer service is terrible. They overcharged me 86 dollars for three bundles of hair. When I went back to retrieve my money the man replied with\" I don't know how you payed that much\". Ring up the cost in your head yourself because they will try their best to take all of your money.", "pics": null, "resp": {"time": 1501204419376, "text": "Hi Amiya. Sorry about your experience. Could you tell me which location and date this occurred?"}, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "115657570469743274250", "name": "M K Brooks", "time": 1598796165295, "rating": 5.0, "text": "Excellent Customer Service!", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "117750505537954175512", "name": "Trina H", "time": 1555529672420, "rating": 1.0, "text": "BBB COMPLAINT AND SMALL CLAIMS FORTHCOMING\n\nI purchased several of the longer 5A bundles, and a closure, on 3/13/19 at the Huntsville, AL University Drive store to be in a wedding. The hair was BEAUTIFUL, until shampooed on 3/17/19 with Tresemme products, and immediately lost all curl pattern. I was the only one in the wedding party with straight hair, and the bride was so disappointed because that was not the look agreed upon. Nevertheless, after speaking with the owner, Tony, who agreed that should not have happened to the hair, and texting him the requested pictures and receipt, I didn't hear back from him. Perplexed, I called the next day, and Tony placed me on hold for 23 minutes! Giving the business the ultimate benefit of the doubt, I waited and called again the next day. Tony was unavailable, but Keyshonna (sp?) told me she had seen the texts from me, and to bring in the hair, along with the receipt, for replacement hair. She told me to call before coming into the store. I could not make it HSV soon, so I called to inform them.  Tony and Keyshonna were unavailable when I called, but I spoke to Lawrence, who kept telling me to call back because they were moving. In anticipation of miscommunication, I texted after each call, just to make sure! Days later, I get to speak to Lawrence, and he finally speaks to Keyshonna about the issue, who remembered me from bringing up the wedding. They discussed it, and informed me that Tony doesn't remember me, and they won't replace or refund the purchase, since it was worn - which all parties knew based on 1) the pictures sent and 2) each text and 3) each conversation!\n\nAs a consumer, I legit waited weeks and several calls and texts to attempt to fix the issue. It hurts me to even have to write this review, and to announce the customer service practices of this business. However, they made it extremely hard to ignore. As a practicing attorney, I have filed accompanying complaints with BBB and BBB of North Alabama, and have all the time and evidentiary proof to file in small claims court over $245, plus legal costs and fees....which is just sad because all I wanted was some long curly hair, and not another court date.", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "113013425724720792857", "name": "Ashley Morris", "time": 1533241651659, "rating": 5.0, "text": "Some of the best hair I’ve ever bought hands down!!! Will definitely purchase over and over again!", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "105636907045987999159", "name": "Maya Cameron", "time": 1521776996471, "rating": 1.0, "text": "I purchased a 20 inch frontal in 613 and I believe I got three bundles of 26 inch at $90 a piece also 613. The hair didn't last a week. The hair sheds worst then synthetic hair. This is the first and last time that I will be purchasing hair from this vendor. The frontal was worse than the bundles. The only positive thing that I can say about the hair is it took semi permanant hair dye very well which it should because 613. I have bought hair online from AliExpress that sheds way less than this...", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "117336186460100836106", "name": "Tiffany Nicole", "time": 1503959035954, "rating": 5.0, "text": "Best Hair Ever!!!...In 3 Years I've Never Ever Had A Problem With The Hair....Not To Mention The Great Customer Service Every Employee Is Nice and Knowledgeable When It Comes To Every Product The Have!!...GREAT JOB WEAVE SPOT!!!", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "116025911394366635325", "name": "Zesaley Crawley", "time": 1560283907777, "rating": 5.0, "text": "The hair was really good and soft no shedding no smell", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "103647946950007186524", "name": "Cofee Rogers", "time": 1533519710857, "rating": 5.0, "text": "This is a wonderful place to purchase very good hair.", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "106339027688448704923", "name": "Chantel Washington", "time": 1491077813722, "rating": 5.0, "text": "Personally I have been to the weave spot to purchase hair on several occasions with no issues! I also get my 9 year olds natural hair done as well as getting sew ins for myself by Elijah with no issues! I love the weavespot!!!!", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "111997620845100246603", "name": "Felecity Benjamin", "time": 1561144210989, "rating": 5.0, "text": "love they hair price and wonderful deals", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "111261577012434617524", "name": "King R", "time": 1473093619265, "rating": 5.0, "text": "Best friendly experience with hair/ and hair stylist ever!! Beautiful hair I loveeeeeee The stylist are all badd with hair !", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "113062941428622946529", "name": "Kendra Bell", "time": 1463110669855, "rating": 4.0, "text": "great customer service! very satisfied.", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "112657562424064185404", "name": "Shericka Bone", "time": 1506182626421, "rating": 5.0, "text": "Has all you bundle needs, great hair", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "105389741408852477595", "name": "Nick Whitney", "time": 1470926929089, "rating": 1.0, "text": "The worse customer service I have ever received when it came to purchasing hair. The owner was very rude and unprofessional to say the least. I will never purchase hair from the \"business\" again. Customer service is the most integral part of a business, and when you lack that you are doomed to fail.", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "111752983415554346277", "name": "Deja Joseph", "time": 1524517312400, "rating": 5.0, "text": "Always a pleasure shopping there.", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "111552035113085343222", "name": "Donna Johnson", "time": 1523724818687, "rating": 5.0, "text": "Awesome selection and great staff.", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "109916169847535169351", "name": "zenobia ryan", "time": 1589929519835, "rating": 5.0, "text": "Very good customer service...", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "111049718223030727834", "name": "Megan Danielle", "time": 1572635412607, "rating": 5.0, "text": "has the best hair", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "112527290571986364844", "name": "Edward Lewis", "time": 1481842353689, "rating": 5.0, "text": "Best hair-store ever! :-)", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "103490845812585907994", "name": "Connie Lyle", "time": 1576589409222, "rating": 1.0, "text": "The food wasn't good", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "107029145091262333011", "name": "Janice Carroll", "time": 1521843796478, "rating": 5.0, "text": "I love dis place", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "103135539296994766453", "name": "Shi S", "time": 1496478770324, "rating": 5.0, "text": "Great prices and quality hair", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "101542578912184723174", "name": "DaiDai Carter", "time": 1543109500227, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "109052869529009380408", "name": "REESE SCALES", "time": 1512559446493, "rating": 1.0, "text": "I bought my hair in October the hair that I bought in October it didn’t last a week before it started to tangle and matted up so I said maybe I had a bad patch so I went back on November 21 and bought some more hair it has tangled so bad I spent 200 dollars for my hair October and in November I spent 250 this hair is trash don’t believe the reviews it’s not virgin hair.", "pics": null, "resp": {"time": 1512566873510, "text": "Hello Efilzaggin Scales. Sorry you have had a problem. We have no records of you calling our customer service line. When did you call our come in about this?"}, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "107421737258528075141", "name": "Yoshiko Legg", "time": 1506112592861, "rating": 5.0, "text": "Great hair!!!  Great prices!!", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "101480695719573405280", "name": "Quashana Stewart", "time": 1565897860059, "rating": 5.0, "text": "Great hair", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "108426210971548977208", "name": "Ange Cheri", "time": 1538152811933, "rating": 1.0, "text": "Worst customer service.", "pics": null, "resp": {"time": 1538156122389, "text": "Hi Ange. Not sure what happened but I'm sure it's not anything we can't resolve. Could you please send me an email theweavespot777@gmail.com"}, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "118348318456055957576", "name": "deshawna fonza", "time": 1489086825145, "rating": 3.0, "text": "Hair tangles quick...", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "118190354183669175748", "name": "Laparisson Thomas", "time": 1496191089973, "rating": 5.0, "text": "Great service !", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "113156179435448376559", "name": "Shell Harper", "time": 1504547387612, "rating": 5.0, "text": "Good experience", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "116967466195398471185", "name": "Nina Rich", "time": 1553570629813, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "115069226253158548608", "name": "Dean Bumpus", "time": 1483049014174, "rating": 5.0, "text": "They are very professional.", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "115224821441877841874", "name": "Erica Alexander", "time": 1518884973475, "rating": 5.0, "text": "Very Professional", "pics": null, "resp": null, "gmap_id": "0x88626bfae2fae3bf:0xd21327a29a38657f"}
{"user_id": "112488558235900441829", "name": "Marcus", "time": 1568234824926, "rating": 5.0, "text": "I would HIGHLY RECOMMEND Salon Elite of Madison. Great hair cuts and friendly atmosphere. The appointment text system is very professional.  I get a text reminder and my appointments have always been right on time.  Lisa does EXCELLENT detailed stylist work and listens to what I want.  I get compliments about how clean and neat my hair looks.  Best one I've found in Huntsville and Madison area.  Very dependable and professional.", "pics": null, "resp": {"time": 1568244262155, "text": "Thank you so much for the review Marcus! We always strive to please everyone. As my grandfather advised me many years ago, \"If you want to be successful in your business, you must always do good work and treat your public right.\" This is always our goal. Thanks again so much for your kind words and support!"}, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "115503933749981059085", "name": "Melanie Graf", "time": 1581655050989, "rating": 5.0, "text": "Michelle does a fantastic job. She has been cutting and coloring my hair for over 20 years. She always does a fantastic job. She also does my moms and daughters hair. We love her.", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "104144892645520796665", "name": "Diane Creek", "time": 1612652536942, "rating": 5.0, "text": "Great service...", "pics": null, "resp": {"time": 1612656028206, "text": "Thanks!!!!"}, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "109985597869463211158", "name": "Andrea Glasgow", "time": 1573932410321, "rating": 5.0, "text": "Desseria Hart is the best! Highly recommend her (and I am picky! 😂)", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "104455997414935657190", "name": "Earlene Kather", "time": 1590587578651, "rating": 5.0, "text": "Love having my hair cut by April", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "107167044393417513002", "name": "Kate L.", "time": 1444880710463, "rating": 5.0, "text": "I recommend Salon Elite of Madison! I've had my hair cut there by Lisa House a number of times, and she does a great job. I especially appreciate that she offers to let me come back in a couple of days if I somehow feel the cut needs a change, but I've never needed to take her up on the offer. I also like the look/feel of the salon, and when I have an appointment, I don't have to wait. Walk-in also are possible when I haven't gotten my act together to make an appointment. All around, this is the place for me.", "pics": null, "resp": {"time": 1444910379044, "text": "Thank you so much Kate!! We are so happy you are happy coming in here! I very much enjoy our conversations as well as doing your hair!! Thanks again!!!"}, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "107622189945973195137", "name": "Cheryl Anderson", "time": 1536940177211, "rating": 5.0, "text": "Great coloring of hair. Worked with me over time to get just right. Clean, professional and helpful", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "107689167191552588554", "name": "Adrienne Dibsie", "time": 1520369221083, "rating": 4.0, "text": "Love my hair stylist Michelle James. This is a nice salon with plenty of parking. Easy to get to.", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "117166890017340219250", "name": "Evan Yoss", "time": 1443825466824, "rating": 5.0, "text": "Great place for a haircut!! My wife loves going here and won't go anywhere else. Friendly staff and professional atmosphere.", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "110621542233705603058", "name": "Monica Moody", "time": 1447778316811, "rating": 5.0, "text": "I love coming to Salon Elite.  Everyone is welcoming and Jessica does amazing work.  I would recommend her to anyone!", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "101217890833949809972", "name": "Karen Moore", "time": 1447987516996, "rating": 5.0, "text": "Delighted to have found Salon Elite.  I've been looking for someone in Madison to do my hair; Lisa at Salon Elite is wonderful!", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "104862825058705029277", "name": "Will Stroud", "time": 1491144172029, "rating": 5.0, "text": "I love Lisa House!  She is always so consistent and fun to talk to.", "pics": null, "resp": {"time": 1491221155487, "text": "Thanks so much Will!!! Very much enjoy our conversations as well as doing yours and your family's  hair!"}, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "110940393760320844424", "name": "Amy Haines", "time": 1521911441020, "rating": 5.0, "text": "I won't go anywhere else! Desseria is the absolute best!", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "117023304607068841308", "name": "James Smart", "time": 1401909333889, "rating": 1.0, "text": "Awful!!! I called and scheduled an appointment for the following day at 2pm. They asked for my phone number in case of cancelation. I gave it to them. I show up the following day at 2pm after taking off from work. Only to find that my stylist left that morning. No phone call to me so I don't have to take off & drive down there. Nothing against the stylist, however front desk is to lazy to call you for cancelations!", "pics": null, "resp": {"time": 1514298768271, "text": "Don't know what happened to the reply that used to be on here about this. The stylist was unable to come back to work due to having a ill child. She only let the front desk know 5 min before the appointment time that she would not be there. He had never been to that stylist, had not requested her and there was another stylist that was going to do his haircut. He became upset when informed and was offered a free haircut but left angry anyway."}, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "103445427084278428648", "name": "Wendy Colley", "time": 1438715365642, "rating": 5.0, "text": "Lisa has been cutting my hair and my kids' hair for several years now.  She's great!!", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "106105426670877819237", "name": "Jamison Parker", "time": 1369558504243, "rating": 5.0, "text": "I am a 28 year old male looking for a place that wouldn't hack my hair to peices...and I finally found it! I have had so many bad experiences with different Mom & Pop shops as well as chain hair salons. Karen cut my hair and did a great job giving me exactly the look that I asked for! No pictures, just my description and viola! My hair looks great! She seemed very experienced and there was never any of those awkward moments of silence which I wondered, \"is she gonna destroy my hair?\" We have all had them. I felt very comfortable and was also happy to hear about their $5 off discount for \"liking\" their Facebook page! These days, every dollar adds up!  The staff was great and acknowledged me as soon as I walked in the door. It's the little things that I notice which confirm I'm in a well-run salon. They got me in at a moment's notice, and I was very pleased with the outcome. Salon Elite definitely lived up to it's name and I will definitely be returning! Now I can walk next door to Kroger and finish my grocery shopping...definitely a convenient location off Hughes Rd! Thx Karen!!! You ROCK!!!", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "111322245019212349941", "name": "Lori Poteate", "time": 1553822460604, "rating": 5.0, "text": "Loved it!  Michelle is awesome!", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "102691803896198544307", "name": "Diana Holland Faust", "time": 1423159931145, "rating": 4.0, "text": "Lisa gave me just the haircut I wanted (my previous stylist just couldn't understand).  I am looking forward to another great haircut.", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "100102003439782742803", "name": "Jeffrey Brooks", "time": 1520388072927, "rating": 5.0, "text": "Michelle is a super good hair dresser.", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "117549976695727219490", "name": "Ali Murphy", "time": 1444499938455, "rating": 5.0, "text": "Michelle James and the entire staff are fantastic!  Professional, stylish, on trend and take pride and making you look your best!", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "110065206022990759855", "name": "Julie Blair", "time": 1563808877267, "rating": 5.0, "text": "Kim V is the best!", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "109822057988809263599", "name": "Victoria Chrisman", "time": 1521255666747, "rating": 4.0, "text": "Friendly staff. Good haircuts.", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "101480536058842602685", "name": "Peri LaTorre-North", "time": 1583011781044, "rating": 5.0, "text": "Lisa is fabulous!", "pics": null, "resp": {"time": 1583098834511, "text": "Thanks Peri!!!"}, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "112608048469873571019", "name": "Andrea Brown", "time": 1438981445642, "rating": 5.0, "text": "Fantastic place with great service.", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "109700338254247657236", "name": "Karin Gilbert", "time": 1524531965140, "rating": 5.0, "text": "Great service and experienced beautician", "pics": null, "resp": {"time": 1524541073084, "text": "Thank you so much!!"}, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "116038773460967550695", "name": "Barbara DeFalco", "time": 1537649423795, "rating": 4.0, "text": "Love my highlights!", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "111754732468671978080", "name": "Wyatt Carpenter", "time": 1547344059279, "rating": 5.0, "text": "Desi is the best!", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "107183708004024455277", "name": "Luna Bella", "time": 1576884397287, "rating": 1.0, "text": "Rude people", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "111809579494792422358", "name": "Marsha Barnett", "time": 1544735700331, "rating": 5.0, "text": "Michelle is awesome !!!", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "106486158761783121812", "name": "Devin Hadden", "time": 1484968756391, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "106038130712586943529", "name": "Jesse Chaney", "time": 1478813560911, "rating": 1.0, "text": "Bad", "pics": null, "resp": {"time": 1478814659215, "text": "Jesse Chaney must be the telemarketer that I just called back to see why they called my business when I am on the National Do Not Call Registry for Businesses. These calls are a huge disruption to business! I must have bothered him by calling! SO sorry!!!!"}, "gmap_id": "0x8862658ae7f0529f:0x41a98190dfdc05e9"}
{"user_id": "112183650916637045862", "name": "Mary Lewis", "time": 1620794306427, "rating": 1.0, "text": "Didn't get to see stylist. Went to counter several times and was never acknowledged. A wave, a Hi, or I will be with you in a bit would have been nice and let me know I was not an Invisible person. Decided my time and resources could be better spent elsewhere.", "pics": null, "resp": null, "gmap_id": "0x88926e92c76febbb:0x5fb5af99f3ad019b"}
{"user_id": "115836674360448425938", "name": "Linda Kennedy", "time": 1599346435709, "rating": 5.0, "text": "After two family members got their hair cut by Andrea I decided to let her cut my hair.  I am new in tnis area and honestly very fusdy about anybody touching my hair. Andrea was amazing.  She understood what I wanted and did a beautiful job.  Andrea was very efficient and extremely prompt!  She was a very pleasant woman to talk with as well.  Everyone there was very polite. Social distancing was in effect and the salon was very clean.  Tbank you Andre!", "pics": null, "resp": null, "gmap_id": "0x88926e92c76febbb:0x5fb5af99f3ad019b"}
{"user_id": "106332387455427139907", "name": "Kylie Anderson", "time": 1614296851581, "rating": 1.0, "text": "Apparently, cut to my shoulders means cut to my chin. And straight cut means layers. Devastated with how my hair looks and it will take years to go back to normal. There was also a chunk of hair that was 2-3 in longer than the rest of it. Very disappointed with it.", "pics": null, "resp": null, "gmap_id": "0x88926e92c76febbb:0x5fb5af99f3ad019b"}
{"user_id": "106123515061936640928", "name": "Jill Lloyd", "time": 1580067285085, "rating": 5.0, "text": "I followed Jordan here and she is fantastic. I look a lot younger when I leave her chair. Covers my grey with hi lites and low lites and is meticulous. She's proud of her work and should be!", "pics": null, "resp": null, "gmap_id": "0x88926e92c76febbb:0x5fb5af99f3ad019b"}
{"user_id": "104032113770512155810", "name": "Brittney Stanford", "time": 1575663491913, "rating": 5.0, "text": "Love taking my kiddos here to explore and have fun.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOGIOkwd3jAlxVPIAZ3MzdPFXVCGOQjVvvuYmEj=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88926e92c76febbb:0x5fb5af99f3ad019b"}
{"user_id": "117269476289926605526", "name": "Darlene Raines", "time": 1528137700432, "rating": 5.0, "text": "I had a horrible experience Saturday, the stylist doing my hair was in no way experienced enough to under take the job. I left the salon in tears. The store manager Michael assisted me in getting that mess corrected I was put in the hands of Jordan Schmidt and omg she went above and beyond, the lady has skills, I once again left in tears VERY, VERY HAPPY ONES. Jordan is my stylist from this day forward. Thank you Jordan!!!", "pics": null, "resp": null, "gmap_id": "0x88926e92c76febbb:0x5fb5af99f3ad019b"}
{"user_id": "109348799078186072693", "name": "Scotty Brown", "time": 1528042752860, "rating": 1.0, "text": "My wife was at this salon for 4 1/2 hours to get her hair hi and love lights it never take longer that 2 hours with her regular stylist. She came home. Crying uncontrollably her hair was frizzy and looked nothing like it should as she requested with a picture of her own hair. I paid $115 for my wife to be inconsolable and will not even leave. The house to go to church, sh requested the manager call her as of yet that hasn't happened. When she began crying when the stylist turned her around to see what she thought. They were only concerned that she understood she still had to pay!", "pics": null, "resp": null, "gmap_id": "0x88926e92c76febbb:0x5fb5af99f3ad019b"}
{"user_id": "105460345359013889766", "name": "Jackie Newsome", "time": 1575895232779, "rating": 3.0, "text": "She was just out of school I think. Should have cut off a bit more but she didn't look comfortable so I just let her finish.", "pics": null, "resp": null, "gmap_id": "0x88926e92c76febbb:0x5fb5af99f3ad019b"}
{"user_id": "108071281535941817583", "name": "Kim Feurtado", "time": 1622602807706, "rating": 5.0, "text": "I booked a massage with my favorite massage therapist which is Jay. He is very sweet and always makes sure that you get your full time. His massages are very relaxing and I he caters to your every need, especially if you have a certain spot that may need more massaging like your back or neck. He is not going to talk during your massage, so you have to make sure that you speak up if you need something.I recommend that if you need a relaxing hot rock massage to go and see Jay, he is AWESOME.", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "113429343534020857497", "name": "Chiante July", "time": 1621391465429, "rating": 5.0, "text": "Jay is an exceptional massage therapist. I can always count on leaving my visits refreshed, relaxed and renewed. He listens to your needs and applies the right amount of pressure to remove any built up tension. He is also very professional, courteous and respectful of your time.", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "116207144113822338211", "name": "Krishalon Abrams-Davis", "time": 1622077358197, "rating": 5.0, "text": "My massage with Jay was awesome. H is always so professional and gives you your full time.  He caters to what you need for your relaxation. I definitely recommend his services. I'm already booked for next month.", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "109936529618697866587", "name": "Tamichael Tyus", "time": 1621391647315, "rating": 5.0, "text": "I love this location. I visited Jay East for my monthly massage and it was so inviting, clean and professional. This location holds variety of services that can cater to anyone needs.", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "105520938198699890613", "name": "Jodi Douglas", "time": 1611860747756, "rating": 5.0, "text": "I get my eyebrows microbladed there with Sarah, and she is the best! She's super friendly and makes me feel super comfortable! I couldn't ask for a better experience!! 1", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "103325674725409358845", "name": "Lisa Duck (Pisces Sun)", "time": 1621457523365, "rating": 5.0, "text": "I received a massage from Jay at Studio 36 Massage he is very professional and leaves me feeling relaxed. I will be returning in the future .", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "111276094812264779032", "name": "Mara Holmes", "time": 1599257617092, "rating": 5.0, "text": "I received a massage from the massage therapist at Studio 36.  T was amazing.  She has a great space very comfortable.  She is very professional .   I would recommend her to anyone and Everyone.  Her transitions are amazing.   I will be back!!!", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "111083483712555924607", "name": "Trey Palmer", "time": 1616701241004, "rating": 5.0, "text": "First post quarantine haircut. Looks good too.", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "117252942958610358251", "name": "Breanna Wagner", "time": 1603581879095, "rating": 5.0, "text": "Best hair and beauty salon!!! Outstanding service!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "118223111177894216318", "name": "Sadé Miller", "time": 1559945208908, "rating": 5.0, "text": "Great space, great customer service, and great ambiance. Really terrific space. All around great experience! I never leave dissatisfied.", "pics": null, "resp": {"time": 1561250273972, "text": "We are so pleased you enjoyed your service. Thank you for the review"}, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "112003793035071673437", "name": "Kim Sweet", "time": 1544552897606, "rating": 5.0, "text": "Had the full works and it's fabulous! Sarah was my esthetician and made me shine bright. Ashlee did my hair and pedicure and made me feel beautiful! I will be back and finally have found my place in Mobile.", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "105065989978060270388", "name": "Arlington show Bryant", "time": 1579413127395, "rating": 5.0, "text": "Netris is the best! Everyone there is so friendly!", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "104839990625285226306", "name": "Caisy CG", "time": 1543446533761, "rating": 5.0, "text": "This salon/day spa is a fantastic place to go for some pampering! Sarah Jenkins did an amazing job on my eyebrows(micro blading) and Sarah Morton made my hair gorgeous!", "pics": null, "resp": {"time": 1543499884850, "text": "Thanks for visiting Studio 36. We are so glad to hear that you loved your experience. We strive for excellence"}, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "116675702752681324219", "name": "Michael Driver", "time": 1591656478443, "rating": 5.0, "text": "Very professional , and well done.", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "112006970946299116806", "name": "Krystal WiddaKay", "time": 1571542537133, "rating": 5.0, "text": "I love the privacy of individual rooms", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "102936907829530282431", "name": "Bernadette Jenkins", "time": 1559943509412, "rating": 5.0, "text": "Very nice place. There esthetician Sarah Jenkins is beast!!!!", "pics": null, "resp": {"time": 1561250496469, "text": "Sarah Jenkins is definitely the best! We love her and we are so glad you loved her as well. Thank you for visiting us and we look forward to seeing you again soon"}, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "104793761528694083435", "name": "Jeremy Evans", "time": 1598917011898, "rating": 5.0, "text": "Awesome and chic", "pics": null, "resp": null, "gmap_id": "0x889a4da008b6e20d:0x8f86334fb6b608a"}
{"user_id": "112509494159313004156", "name": "Jacqueline Burgin", "time": 1583122015841, "rating": 5.0, "text": "I love my new hair color and cut done by master stylist, Linda Henry.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNftWlZDTPFDsYqql_4gMsnnpTdcVfbdibQC35-=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888a836647b4693:0x941152d513516600"}
{"user_id": "104651669910888602555", "name": "Dominique Hudson", "time": 1563495617945, "rating": 5.0, "text": "got my eyebrows waxed here, and Cynthia was an absolute delight! very fun to talk to and did a great job!", "pics": null, "resp": null, "gmap_id": "0x8888a836647b4693:0x941152d513516600"}
{"user_id": "117354027700956398216", "name": "Kellie Nelson", "time": 1519321905568, "rating": 1.0, "text": "JCP Salon DOES NOT deserve a star!! It would not allow me to post until a star was pressed..\nSm treet5 need to go back to school..If you can't do color the way the customer ask you,explains to you & also shows you by bringing in multiple pics then tell them,don't act like you do when you know you don't & can't...It breaks my heart when my daughter is crying because the stylist messed up her hair.. Just sad!!!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x8888a836647b4693:0x941152d513516600"}
{"user_id": "112953701130001328318", "name": "Steven Sykes", "time": 1558289079174, "rating": 5.0, "text": "Very happy with my cut", "pics": null, "resp": null, "gmap_id": "0x8888a836647b4693:0x941152d513516600"}
{"user_id": "103572091966107567735", "name": "Jessica S", "time": 1495594812269, "rating": 1.0, "text": "The woman who did my hair overcharged me, cut me too short, and gave me the wrong color.", "pics": null, "resp": null, "gmap_id": "0x8888a836647b4693:0x941152d513516600"}
{"user_id": "109264058510714405177", "name": "Kimmie Mack", "time": 1613925188285, "rating": 5.0, "text": "I came in the door feeling average and I left feeling like a superstar ready for my next challenge! Takaya slayed my hair and my face!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNZMt4tr5Qy_DoPMBQA8zQOFisYJ7IVAy7Z1z4L=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "115975595530644661510", "name": "Anita Brown", "time": 1613858384718, "rating": 5.0, "text": "Today was my first visit to Miracle’s Hair Design and it won’t be my last!! The atmosphere was peaceful and fun. Mrs. Maddox performance in styling my hair felt wonderful. Do yourself a favor and book yourself an appointment today if you’re looking for excellent service for your natural tresses.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "100417165487467645382", "name": "Jonnitha Clark", "time": 1620671267693, "rating": 1.0, "text": "If you are new to this salon, make sure you confirm the fees before service.  I expected to pay less than $100.  She charged me $310 for a sew-in bang.\n\nWhen I set appointment with Miracles, I was never told $310 for less than half a head sew-in and other services.", "pics": null, "resp": {"time": 1620669301506, "text": "This is FALSE! When you called the salon you were notified of the fees and you stated with our salon manager you did not care about the pricing because you needed your hair done . Also, your services included a sew in bang, a partial relaxer , a cut, your prior sew in removed,  a shampoo and blowout, and you also purchased a Premium Virgin Hair Bundle. You received several services which led up to your total . Thank you so much for your business . I do hate that you were unhappy with the prices but  no salon will give you all of those services for under a $100. I am glad you were very pleased with how your hair turned out .  God bless you !"}, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "108122796164408702064", "name": "Char J", "time": 1603941297482, "rating": 1.0, "text": "Poor quality hair that has a smell to it. Sew in are not worth the price. I got a sew in on the 13 of October, 15 days later I’m ready to take out.", "pics": null, "resp": {"time": 1603957859375, "text": "Hello , thank you for your review . However, Our hair is top quality and ALL of our clients LOVE our hair bundles . They last and they are quality! You are more than welcome to call and comeI in and give me the opportunity to right any wrong you feel you might have experienced. This review is inconsistent with our other reviews  and it is NOT true . Thank you!"}, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "116217634251695018764", "name": "Taccara Curry", "time": 1596574678623, "rating": 5.0, "text": "Love to e atmosphere and the stylist gave me what I ask for. Love my hair", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "113754100225041489631", "name": "tonitia thompson", "time": 1569624606928, "rating": 5.0, "text": "San was very nice, knowledgeable and professional. I love my color and cut. I appreciated how she wasn't scared to do my natural 4a hair.  Will be booking with her again", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "101824676465944600246", "name": "Kay Anderson", "time": 1589973561780, "rating": 5.0, "text": "Absolute best stylus in town. I am natural, and have been there for silk presse, hair coloring, trimmings, sew in’s with closures, etc,  and Takaya can truly slay some hair.  it’s common for me to walk in there with my hair flying in every direction, and boy let me tell you, once T is finished, I could give Beyoncé a run for her money. Highly recommend and she will and always be my stylist for life. Go give her a try. You will absolutely not be disappointed. If I could give Takaya more than five stars,  I would. Happy client always.\nKentreene", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "101639744834367360818", "name": "Dr. LaToya Ifill", "time": 1577049824303, "rating": 5.0, "text": "Takaya was amazing . I came  in with my hair in shambles. She made me look absolutely beautiful. The atmosphere in the shop is very personable.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "115862886022816996947", "name": "Gab L.", "time": 1561569652141, "rating": 5.0, "text": "Loved it! This is my new salon, not only did have get service but my stylist was very knowledgeable and informative about caring for my natural hair. It is definitely be worth the trip.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "107116476169188031877", "name": "Katrice Aldridge", "time": 1584013551499, "rating": 5.0, "text": "Love it!! TaKaya has a true gift!! Definitely deserves a 10 🌟! I found my new stylist!", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "110607041355485463708", "name": "LaSharn Faush", "time": 1511621585879, "rating": 5.0, "text": "I love the professional atmosphere and the quality hair care provided by owner and stylist Takaya Cunningham Maddox. I love the body and bounce my natural hair has after visiting the shop. Most people think I still have a relaxer.  I would recommend Miracles to anyone who desires to rock their natural texture. Its not only doable, it's manageable! Visit Miracles for healthy, high end hair!", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "101516864647723570364", "name": "Tara Garner", "time": 1510194247551, "rating": 5.0, "text": "Miracle's Hair Design is a very organized and professional place of business. The employees are very friendly, and they are great hairstylists! In addition, it is a one-stop shop for hair and makeup. This is my go to place when I want to be the best looking female at any event, and when I have to do a photo shoot.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "105898010682670962528", "name": "Tonya Clarke", "time": 1511313511434, "rating": 5.0, "text": "Miracle Hair Salon is truly a “miracle”. I have been a client of Miracle’s for over 10 years ; I have never been disappointed. Very friendly, professional and family oriented environment. I’ve always been happy and pleased with the ending results and service. If you want a professional and healthy look, checkout “Miracles ’s “.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "113936073297596921878", "name": "Mrs. Jen H", "time": 1571052685838, "rating": 5.0, "text": "The Master stylist does great work on natural hair.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "101902802062693821755", "name": "Lavinnie Collins", "time": 1514601499353, "rating": 2.0, "text": "I appreciate the quick appointment & services. My services were for relaxer, cut & curl. My hair was cut & styled the way I wanted, but my hair is thin & I asked for tracks to make my hair full, not black spray! I just left the shop & made it home back to Tuscaloosa washing my hair because this black spray all over my hand. I have to try to find someone to do my hair tomorrow!", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "105670691669573823245", "name": "Stacy Vann", "time": 1564008919243, "rating": 5.0, "text": "Extremely Lovely Women and Excellent Service. I definitely recommend this establishment.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "104651560977814296092", "name": "Leticia Orcutt", "time": 1566527997395, "rating": 4.0, "text": "Great place and my hair looks really great but I wish I would have said not so tight on the braiding on the edges. Its  soooo tight! But can't fix it moes im going out of town.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "117946726576500798922", "name": "Shakina Dixon", "time": 1584468227309, "rating": 5.0, "text": "I live this place and the people are wonderful especially San!!", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "104465843714297938806", "name": "Nikki B", "time": 1538605978815, "rating": 1.0, "text": "They are nice people but they don't specialize in natural hair. The Beautician Eco styling gel in my hair didn't oil it or put anything to protect my hair before putting Eco in it. I was totally disappointed in the results.", "pics": null, "resp": {"time": 1539231988271, "text": "Hello I truly apologize that you were not fully satisfied with your hair services.  Please allow us the opportunity to fix it.  Give us a call at your earliest convenience.  Thank you again for your business!"}, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "100393758149967183457", "name": "Annette Towner", "time": 1509829267770, "rating": 5.0, "text": "I am so grateful to know Takaya especially when I started taking care of my mom. She made her feel and look beautiful every time we were here. Mom use to say she spends a lot of time on your hair and it always looks good", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "105836257323951121079", "name": "Sharon McCray", "time": 1569530420173, "rating": 5.0, "text": "Nice, friendly, and professional atmosphere. Hair looked amazing!", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "107739520544849504184", "name": "Jasmine George", "time": 1511381478800, "rating": 5.0, "text": "Every visit for the last 16 years had been awesome. I never have to worry about not liking my hair; its always Flawless.\nI love my Miracle stylist!", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "102500914135542339286", "name": "LaKesha Douglas", "time": 1526061208356, "rating": 5.0, "text": "Professional and friendly atmosphere. I am very happy with my service and the stylist/owner who took very good care of my needs. I will be returning frequently.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "101959041425053853255", "name": "LIVING LIFE", "time": 1521948453863, "rating": 5.0, "text": "Today was my first time at this salon and I am a satisfied customer! Takaya is very talented at what she does and takes her time perfecting her craft. She is very knowledgeable about hair and  her foundation braiding for my sew in was impeccable. I would definitely recommend her for any service! She even slayed my brows! I drove 3 hours from Metro Nashville to experience the \"miracle\" that Takaya performed upon my head.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "111431311245977545387", "name": "Kernesha Weatherly", "time": 1527219098838, "rating": 5.0, "text": "Definitely my favorite place. I have been going for almost 15 years and I cant say enough good things about this place. Takaya is very talented and has always done a good job with my hair. When I decided to transition to Natural, Takaya helped me with the transitioning until I was ready for the big chop. After that, I literally just switched chairs and Carla has maintained my hair since then. They take their time and they protect your edges. Whether you are natural or relaxed, I would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "103748236140942090285", "name": "Kris Hayes", "time": 1509637685711, "rating": 5.0, "text": "I saw a girl at my job and her hair was life. I asked who did her hair and she told me Makaya at Miracles Hair Design. I proceeded to make an appointment at that moment and I must say I have absolutely no regrets. I have been coming here for about 6 months now and every single experience has been nothing but spectacular. My hair is always on point . The wait is not outrageous and the service is excellent. I've been looking for a great stylist for a while and I can honestly say I've found her. Do yourself a favor and make an appointment ASAP", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "117453474874483707767", "name": "Roldyne Dolce", "time": 1512231570055, "rating": 5.0, "text": "New to Birmingham and was in search of a salon for my natural hair. Found this salon and love it! I went for a silk press/trim: Kaya was very kind and took the time to gently detangle with my tangled hair and explained the process and maintenance tips. The salon is also very comfortable environment. Would recommend!", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "116668149879871390758", "name": "Angela Washington", "time": 1520137545037, "rating": 5.0, "text": "My daughter got her sew in today and she will love it. The owner and her family is very down to earth and it was a great experience.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "101424366313704124857", "name": "Natalie Glover", "time": 1509754924716, "rating": 5.0, "text": "Takaya has a gift of taking care of your hair as well as   styling your hair.  She is a master stylist who is dedicated, caring, and compassionate.  She believes in total beauty of your hair and makeup.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "106619963091489924009", "name": "Kimberly nalls", "time": 1510179438866, "rating": 5.0, "text": "Friendly atmosphere. Miracles truly believes in healthy hair, you will never leave disappointed. I’ve been going to Miracles for about 10 years now!!", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "112829250903574118100", "name": "Samantha Gomez", "time": 1522605483515, "rating": 5.0, "text": "Wow!!! Absolutely amazing work!! Cassandra Brown did my hair. I'm a natural and she gave me a great cut and press!! Fabulous job!!", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "108059915674541264519", "name": "Tracy BrownBeauty", "time": 1501504955598, "rating": 5.0, "text": "Want your hair slayed??? Come see the ladies at Miracles and get your miracle today! Beautiful eye for styles and unparalleled technique and professional atmosphere. My kind of shop.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "111129086737663544454", "name": "Shannon Walker uu", "time": 1537046456861, "rating": 5.0, "text": "Takaya is very professional. I refuse to let anyone else cut my hair. She has a very sweet spirit.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "112205445010742955873", "name": "Juliet Reed", "time": 1544375439051, "rating": 5.0, "text": "Wonderful master beautician who can give you excellent customer service.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "103421398221820666765", "name": "Sherrella Thomas", "time": 1469716497151, "rating": 5.0, "text": "Love everything about this place.  Great people,  amazing hair care products and I am always loving my hair styles", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "106364269755296944649", "name": "Nicole Henry", "time": 1509811547015, "rating": 5.0, "text": "Come to Miracles hair design ask for Takaya.  She is the stylist to see in Birmingham go no where else. She is the bomb. Com", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "111299019565516430495", "name": "Taneka Anderson", "time": 1547843722329, "rating": 5.0, "text": "I love the service and the Beauticians can Slay some hair.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "112435423356574697828", "name": "Kechia Davis", "time": 1511202942136, "rating": 5.0, "text": "Wonderful service, great atmosphere.  Will definitely be back again and again.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "111162130101003051638", "name": "Tamika Brown", "time": 1510709267173, "rating": 5.0, "text": "Miracle's Hair Design and Salon us the best salon in the world. The stylists are very professional and keeps your hair healthy.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "103421398221820666765", "name": "Sherrella Thomas", "time": 1469716497151, "rating": 5.0, "text": "Love everything about this place.  Great people,  amazing hair care products and I am always loving my hair styles", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "114897457911858428853", "name": "Robin Wms", "time": 1510193840921, "rating": 5.0, "text": "I wouldn't trade my Kaya gor nothing. She is my friend, sister,  teacher, biggest cheerleader etc....... She makes your experience at Miracles an encouraging one,  giving you laughter beyond measure,  and your life will be charged for the better.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "107112948027057419074", "name": "Helen Lee", "time": 1509651340744, "rating": 5.0, "text": "Miracles is the best! My stylist, Kaya, is awesome at suggesting great styles for me to try.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "108983653693445643545", "name": "Cristilyn Tolbert", "time": 1510280065554, "rating": 5.0, "text": "Nothing but excellent, professional service EVERY time I'm here! I LOVE MIRACLES!", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "113702738210801135483", "name": "Lacresia Caldwell", "time": 1509799733250, "rating": 5.0, "text": "Yasssssss hunty.....if you want the best hair care,go to Miracle's Hair Design to get all your custom hair care needs!!!! Let Takaya lay hands on your head and you will be hooked!!!!", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "105446426196065016902", "name": "Christine Grant", "time": 1512101534713, "rating": 5.0, "text": "It was a great experience I do plan to go again !", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "108186331608432410763", "name": "Valaria Lockett", "time": 1509819337877, "rating": 5.0, "text": "This place is the best for all phases of hair care.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "104502209081344096589", "name": "Tolanda Beal", "time": 1519565479073, "rating": 5.0, "text": "Great atmosphere and love my new cut.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "118178755586152566751", "name": "Idrissa S", "time": 1510158958567, "rating": 5.0, "text": "Great style and hair care. I’ve been a customer for years!", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "106736119118334330560", "name": "verona Oden", "time": 1510242248817, "rating": 5.0, "text": "Loyal and satisfied customer for over 10 years! 😍", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "105404345366048825924", "name": "valencia hall", "time": 1510257782737, "rating": 5.0, "text": "I love this salon it's the best in Birmingham", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "100773069393324090746", "name": "Michelle Mixon", "time": 1519782828285, "rating": 5.0, "text": "Excellent Courteous Customer Service.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "117038077843617763400", "name": "Onnex Games", "time": 1583430372988, "rating": 5.0, "text": "Amazing service", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "117580910141839985023", "name": "Tamika M. Arnold", "time": 1503281345279, "rating": 5.0, "text": "My stylist is the best!!!", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "101693035313540085102", "name": "Lillian Aleece", "time": 1511582193304, "rating": 5.0, "text": "I love this place💕", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "113314220715984250134", "name": "Sherry Laster", "time": 1511036138356, "rating": 5.0, "text": "Godly, talented atmosphre", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "106030229503122380811", "name": "Carolyn Robinson", "time": 1510270495066, "rating": 5.0, "text": "Leaving with a smile! Visit Miracle's Hair Design.", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "116999796912457141478", "name": "Cherice Davidson", "time": 1499286840129, "rating": 5.0, "text": "Takaya  is the best!", "pics": null, "resp": null, "gmap_id": "0x88891e6b15574a89:0x41a8716b9c08cdcb"}
{"user_id": "107266284129792988035", "name": "Rachael Rakocy", "time": 1622132656851, "rating": 5.0, "text": "Jennifer was wonderful!  made an appointment online the night before and she read my note and knew what I wanted before even walked in. I showed her pictures of long layers and she took the time to talk about how I wanted it to look before cutting anything off. She gave me long layers and my hair feels lighter and healthier, I love it! She even showed me how to add volume and texture for various styles. I will be back and I recommend her for anyone looking for a new stylist in town.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOyPBcLM81egN2kH6NO9ojeXxyDBveQ0uKNwBC-=w150-h150-k-no-p"]}], "resp": {"time": 1622136601270, "text": "Thank you for an awesome time and the review."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "102312004455994165693", "name": "Mia Brady", "time": 1618421090800, "rating": 5.0, "text": "Love this salon! I would recommend to many who want quality service. The employees cater to each customer with professionalism, and there’s good atmosphere at New Look. I was satisfied every time with my hair after my appointments.", "pics": null, "resp": {"time": 1618435721896, "text": "We appreciate you"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "109648534771073800033", "name": "Alicea Carimbocas", "time": 1614129808390, "rating": 5.0, "text": "New Lookz is a very nice, clean salon I was relieved when I walked in to observe their cleanliness during COVID. Jennifer did my hair and she knew as soon as I walked in that I was a bit nervous coming to a new salon. She did an amazing job from the start to end, and did a gorgeous color and style on my hair. I have not been to a salon in over a year so my hair definitely needed the TLC and that’s exactly what I got. I feel so blessed to have found her, she gave me exactly what I wanted and I just have not had a stylist do that in forever!!! Don’t be nervous, trust her and you’ll walk out happy!!", "pics": null, "resp": {"time": 1614171374271, "text": "It was a pleasure serving you."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "118418441184190138207", "name": "Lexi Covel", "time": 1624053406591, "rating": 1.0, "text": "It’s a shame that they don’t do box braids... no one in Enterprise does box braids and it’s so infuriating. I loathe this town.\nUpdate: I’ve found someone, through a family friend, to do my box braids… that’s sad but it’s all good…", "pics": null, "resp": {"time": 1622130882787, "text": "Oh so sorry to hear that. But Mama African Hair Braiding and their located at 1205 Rucker Blvd."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "111374376778746293582", "name": "Emily Burns", "time": 1622155020208, "rating": 5.0, "text": "Christina rocked my devacut! It’s hard for curlys like myself to find a good stylist but she is it for me! She can cut & color! I’m extremely happy and will be back!", "pics": null, "resp": {"time": 1622158266412, "text": "Thank you its our pleasure."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "118111029855258484877", "name": "kristen packard", "time": 1605457389856, "rating": 5.0, "text": "I am so grateful for these ladies! Christina did my little girls braids and they are beautiful! And while I was there they noticed my hair, I had just gotten it done a week before and was trying to let it grow on me. It wasn’t. It looked bad. They said my hair wasn’t wedding ready. It was purple and orange stripes with my grays still showing. Not what I asked for. Jen came in the next, her day off, to fix my hair! She spent so much time correcting and perfecting my hair. It is gorgeous and I’ve gotten so many complements already!! On top of this it cost me less then the other place. And while I was there I felt like I had been friends with them forever! If u have seen Steele Magnolias this place is like the salon in that movie. When u are there h are family! Thanks you guys!!", "pics": null, "resp": {"time": 1605468118027, "text": "It's our pleasure to make your plans without the worries of bad hair days."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "115051133221074014209", "name": "Aspyn", "time": 1622047531728, "rating": 5.0, "text": "I just got my hair cut and I love it. Jennifer is an amazing stylist!!!", "pics": null, "resp": {"time": 1622049940159, "text": "Thank you it was a pleasure serving you 😊"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "113703243475066022798", "name": "Cat Portwine", "time": 1612032550499, "rating": 5.0, "text": "Cristina is AMAZING! I went in with long hair and looking for a SHORT, liberating, carefree, easy pixie cut and she delivered!!! Talk about a clean look. I will definitely be going back. I'm hooked!", "pics": null, "resp": {"time": 1612037541465, "text": "Its our pleasure to service you today. You look fabulous."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "115156459458745181571", "name": "DJ Mamizonga", "time": 1618371300079, "rating": 5.0, "text": "I love this location it has 100 only from health dept. best hair salon in the Wiregrass. Mejor servicio y buena calidad", "pics": null, "resp": {"time": 1619017061622, "text": "Thank you for your review!"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "105585497419803559300", "name": "Toni Rodriguez", "time": 1613776278148, "rating": 5.0, "text": "Jennifer did an Amazing job on my hair, She was very knowledgeable of Color and did not let me leave Salon until I was 100% Satisfied! Will Definitely return!!", "pics": null, "resp": {"time": 1613778708548, "text": "It was our pleasure serving you on today.  We had a blast!"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "101316007932683563318", "name": "Savage Person", "time": 1621052711517, "rating": 1.0, "text": "Left me waiting for over an hour in the hot car for a consultation when they told me to come stop by after work least they could have done was came out and told me to reschedule", "pics": null, "resp": {"time": 1621349594304, "text": "Thank you for your feedback.  We strive to get our clients in and out as soon as possible.  We strongly encourage making an appointment.  As a walk in, its hard to nail how long you may have to wait.  We hate that your experience wasn't pleasant."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "113581223075632772100", "name": "Emily Dowling", "time": 1605832004292, "rating": 1.0, "text": "Booked an online appointment and received email confirmation for set appointment.  Showed up a few minutes early for scheduled appointment and door was locked and no lights on. Even tried calling, thinking due to COVID you would need to call and let them know you were there. Nope, no answer.  Hung around for 25 minutes thinking, maybe they're just running behind. It happens.  Waste of time! No one showed up.", "pics": null, "resp": {"time": 1606237357590, "text": "We apologize for the inconvenience this may have caused we had an unforseen medical emergency that had happened that day so the stylist will be out till December 1st. Again my apologies."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "107835854901583361196", "name": "Rebecca Rosser", "time": 1609433668211, "rating": 5.0, "text": "Christina actually had an opening for a Deva cut the day I called to enquire. If you have curly hair I HIGHLY RECOMMEND her! She has found a life long customer!!", "pics": null, "resp": {"time": 1609521571676, "text": "It was a pleasure to assist you."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "106548227461241338153", "name": "Emily Powers", "time": 1613185485252, "rating": 1.0, "text": "Dont come here! Its not a professional hair salon as well as the staffs. Boooo!", "pics": null, "resp": null, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "116308879837637654962", "name": "Alexis J", "time": 1613186647157, "rating": 1.0, "text": "Got my hair done a week ago, cost me almost 300$ for a dying job but colors already fading, hair feel dry and falling out. I wont be back and wouldn’t recommend this place to anyone. Cost a lot for something that poor value.", "pics": null, "resp": null, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "104270248374822588559", "name": "Joshua Broun", "time": 1613271638629, "rating": 5.0, "text": "Great service,  wonderful staff. The only place I let touch my head", "pics": null, "resp": {"time": 1613322092228, "text": "It's our pleasure to service you!"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "104363785779041621360", "name": "S", "time": 1618386209320, "rating": 5.0, "text": "Absolutely love Jennifer....she did s great job on my hair. Thank you Jennifer!", "pics": null, "resp": {"time": 1609771614051, "text": "It's our pleasure."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "102207074861795082499", "name": "11aaguilar", "time": 1596984503990, "rating": 4.0, "text": "Edit:  Cristina contacted me within an hour and apologized profusely for the error. She gave me a free haircut to compensate for the missed appointment and she clearly knows what she’s doing and gave a good haircut. After this experience I recommend this barbershop.\n\nExtremely disappointed. I scheduled an appointment for a haircut here the day prior. The day of I show up for my appointment and no one is there and the barbershop is closed. Mind you it’s 530pm and the hours on the door and online state it closes at 6pm. A man happened to be walking by outside and asked if they bailed on my haircut. I said “yes” and he said they did the exact same thing to him a week prior. Don’t take your business somewhere where they don’t respect your time.", "pics": null, "resp": {"time": 1596486198732, "text": "We apologize for the inconvenience. I hope your next experience with us correct the last visits."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "110167040817964856229", "name": "Danette Dixon", "time": 1591977993728, "rating": 5.0, "text": "Miss. Christina, is very professional an does a great job on my 💇 I'm well pleased when Christina completes a make over on me.\nI just recommended my daughter in law to go visit her. Take my word you will not be disappointed.very nice atmosphere.", "pics": null, "resp": {"time": 1592343848894, "text": "Thank You so much it was a pleasure serving you."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "100288341924117553486", "name": "Jess Le", "time": 1613185814801, "rating": 1.0, "text": "Waited over an hour for my service when I scheduled an appointment with them prior. Not a single staff come and check up on me. Left without getting the service done and they didnt even follow up. Very Unprofessional salon. WILL NOT RECOMMEND THIS PLACE TO ANYONE.", "pics": null, "resp": null, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "117426667017484408160", "name": "Christine Draheim", "time": 1614389689804, "rating": 5.0, "text": "I have been getting my hair done her by Jennifer for a year now and I won't go anywhere else. I live going and talking with all the ladies very friendly environment. The stylist always works to my schedule.", "pics": null, "resp": {"time": 1614390696600, "text": "It's always a pleasure to service you 😀"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "117783023303319741808", "name": "Itsyaboi 646", "time": 1597185333506, "rating": 5.0, "text": "Took my son here for color and cut last year and everyone was very nice. They did a great job on the color and made him feel right at home.", "pics": null, "resp": {"time": 1602887920578, "text": "Thank You it was a pleasure serving him."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "116943930026742661031", "name": "Niki McMahan", "time": 1590173940088, "rating": 5.0, "text": "Love Jennifer and the Salon. Super clean and friendly. She definitely worked miracles on my head of hair today. Thank you so much!!!", "pics": null, "resp": {"time": 1590177600554, "text": "It was a pleasure serving you."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "116767504869485617927", "name": "Barby Riffle", "time": 1593034312423, "rating": 5.0, "text": "Had a great experience! Estee did a great job on my and my husband's hair! We look gorgeous!", "pics": null, "resp": {"time": 1593038832751, "text": "So happy to serve you guys!"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "116640759517375571500", "name": "Ashley S", "time": 1613186169935, "rating": 1.0, "text": "Please DO NOT COME GET YOUR HAIR DONE HERE! They are very unprofessional staffs and will make you wait like a fool. They are not on time and poor skill set. PLEASE GET YOUR HAIR DONE ELSEWHERE, save yourself.", "pics": null, "resp": {"time": 1618348124545, "text": "Thank you for your feedback.  We strive to get customers in and out as quickly as possible, however sometimes the process does take time.  We regret if you were inconvenienced."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "111026534957462244783", "name": "janie “THE VOYCE” brown", "time": 1601217717196, "rating": 5.0, "text": "Love christina she is the best especially on hair washing,and styling", "pics": null, "resp": {"time": 1602089520890, "text": "Thank You"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "105002489782793296903", "name": "Summer Madrid", "time": 1554560501287, "rating": 5.0, "text": "These three women are AMAZING!!  My son wasn't not up for having his hair cut. But as I held him, they did an awesome job cutting his hair! I will never go anywhere else for my hair or my son's hair and I will ALWAYS  recommend them.", "pics": null, "resp": {"time": 1554596616187, "text": "Thank you very much that means a lot."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "112866502799113080139", "name": "Cassi Abston", "time": 1576775194808, "rating": 5.0, "text": "Great place they did a great job and had very good prices.", "pics": null, "resp": {"time": 1579200859601, "text": "Thank you so much appreciate you"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "100441489266711510393", "name": "Tofu McNooch", "time": 1571322274425, "rating": 5.0, "text": "The entire staff here is great. No one has a big ego, and they support and assist each other to make sure clients get what they want. Jen FIXXXEDDD my hair. I have very long hair that I tried to dye myself, light brown to ginger red. Big mistake. Hot roots, a total mess. I lived out of state and went to a local salon to fix it. They made it look more even and it improved, but it still wasn't the color I wanted. I moved here and found New Look. Jen really took the time to get my color exactly how I wanted it. It was a long salon day, with deep conditioning, all-over lightening, and a toner that made it perfect. I wanted a bright, orange-y/copper, natural ginger look. SHE.DID. IT. All of this was done WITHOUT damaging my hair--and it was a pretty drastic change. I've had my hair lightened before, and there was always a period of super-dry, frizzy straw hair that took weeks of deep conditioning to recuperate. This is not the case now. My hair doesn't even feel like it's been colored at all. It's just as healthy as it was from the start. Also, I now get complements on my hair E-V-E-R-Y day. That's never happened to me before! It's in the name, y'all: New Look.\n\nIf you're looking to srrsly upgrade your hair, go here.", "pics": null, "resp": {"time": 1571328592769, "text": "We really appreciate so much we aim to please.  It was such a pleasure getting to know you and giving us the honor of slaying your hair."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "112500750538820107906", "name": "Dee Widya", "time": 1580506084197, "rating": 5.0, "text": "Got a nice layered cut by estee 🥰 .. suprise with the dry cutting technique, but understand now that is the price for $25 in the US, will definitely go there again, but next time will come with my wet hair from home lol .. 😅😘", "pics": null, "resp": {"time": 1610508311585, "text": "It was a pleasure serving you!"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "102085646038987805142", "name": "Debra B.", "time": 1567621607558, "rating": 5.0, "text": "A very professional and nonjudgmental hair salon. The owner Christina is very personal and knowledgeable.", "pics": null, "resp": {"time": 1567624281269, "text": "So Happy that we made you feel at home with us."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "114595752526045506264", "name": "Chalbaka Thomas", "time": 1607636667407, "rating": 5.0, "text": "Thank you Christina for the nurturing care you give. You show me how to manage my Natural hair and I appreciate your Professionalism. Any hair type christina will Gracefully touch into Health.", "pics": null, "resp": {"time": 1553042204725, "text": "It's our pleasure thank you"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "117280336367330500305", "name": "Jeannine Trostle", "time": 1477683417382, "rating": 5.0, "text": "Wonderful place. I brought my daughter in for a haircut. Turned out beautiful. The customer service is excellent and very welcoming, friendly staff. I will definitely be returning.", "pics": null, "resp": {"time": 1477709324091, "text": "It was wonderful to meet you.  I'm glad you're experience with us was excellent."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "116215325289357331119", "name": "Eric Thomas", "time": 1544289049159, "rating": 5.0, "text": "Christina has mad skills. I will definitely return. Great business.", "pics": null, "resp": {"time": 1619367448217, "text": "Thank you!  We appreciate your business and your review."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "117325137103564350714", "name": "Trevor Cox", "time": 1536976666484, "rating": 5.0, "text": "Amazing haircuts everytime I go! Love this place! I will always go here for a haircut now.", "pics": null, "resp": null, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "107175993910079396770", "name": "Laura Nazario", "time": 1516742564258, "rating": 5.0, "text": "Great atmosphere... Stylist is knowledgeable and gives you tips on how to care for your hair properly... absolutely love Cristina 😄", "pics": null, "resp": {"time": 1520012177435, "text": "Thank you so much. Your very appreciated."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "103711910793599257920", "name": "Cristina Lynon", "time": 1610407528479, "rating": 5.0, "text": "Color, cut, and styling work is Exceptional. And I loved the atmosphere super clean and very professional customer service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOM9ondhZ03zSKy4q7JUjWB9s6Lh6YhssS_cUJq=w150-h150-k-no-p"]}], "resp": {"time": 1477972248424, "text": "Thank you"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "110416382159414192834", "name": "Melissa Soto", "time": 1469218448162, "rating": 5.0, "text": "First time in the salon. Feel welcomed. Cristna is an awesome hairdresser. I'm very pleased and happy. Definitely I will go back!!!", "pics": null, "resp": {"time": 1477709389212, "text": "Thank you! Very glad your happy.  We aim to please."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "114206560951168631587", "name": "Deaunqua Bryant", "time": 1505926350765, "rating": 5.0, "text": "Cristina is wonderful and her salon is excellent! I recommend if you need a style, cut, color or braid.", "pics": null, "resp": {"time": 1505927370638, "text": "Its our pleasure to help you keep your hair looking and feeling gorgeous."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "106483868620089149740", "name": "DJ Mamizonga Myra Aponte", "time": 1580338069125, "rating": 5.0, "text": "Great services with a wonderful smile", "pics": null, "resp": {"time": 1580349074346, "text": "Thank You, we appreciate you trusting us with your crown of glory."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "115209381493146497082", "name": "Jenna Fleming", "time": 1531752576022, "rating": 5.0, "text": "Hi Christina I really loved my hair thank you. I'll see you soon.❤", "pics": null, "resp": null, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "102492733986251235994", "name": "Diane Campbell", "time": 1506733821873, "rating": 4.0, "text": "Very friendly and great conversation. Of course the haircut was wonderful too.", "pics": null, "resp": {"time": 1508876126351, "text": "Thank you it was our pleasure to service you."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "115079393860133524957", "name": "m morlas", "time": 1506034429040, "rating": 1.0, "text": "I scheduled an appointment for 4pm. I walked in a few minutes early and she asked me to come back in an hour when she'd be done with a clients hair she was working on. I said sure, no problem and came back at 4:50 or so. A mother and two daughters walked in right in front of me and the owner said she was going to cut her hair first then get to me afterwards. I sat down for a minute then realized after she started washing the girls hair that I'd sit there for at least another 1.5 hrs. There was no apology, no offer to reschedule, nothing. Worst lack of consideration for customer service I've ever had.", "pics": null, "resp": {"time": 1506041725459, "text": "We personally apologize for making you feeling that way. It was not our intentions.\nSincerely,  New Look Hair Salon"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "112768473650984776103", "name": "Jennifer Horton", "time": 1570056391999, "rating": 5.0, "text": "This is an awesome place!", "pics": null, "resp": {"time": 1570566437201, "text": "Awww thank you"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "112099766745823790664", "name": "No Mask", "time": 1549422347711, "rating": 5.0, "text": "Newlook is the only place I go to have my hair done and Cristina is my go to girl. She is an innovator in her knowledge and business, a true artist and really knows her stuff!", "pics": null, "resp": {"time": 1550863907810, "text": "We thank you your so sweet"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "113354556983471301640", "name": "Samuel Lynon", "time": 1501024162599, "rating": 5.0, "text": "The shop was clean and people were very pleasant.", "pics": null, "resp": {"time": 1474675924240, "text": "What did you like the most about the salon and your services"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "106626619919048363949", "name": "Latasha Brady", "time": 1466814882839, "rating": 5.0, "text": "Awesome customer service! And an amazing stylist!!!", "pics": null, "resp": {"time": 1477709336281, "text": "Love ya"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "107273545988486623964", "name": "Kacie Lee", "time": 1550789727310, "rating": 5.0, "text": "Great walk-in appointment", "pics": null, "resp": {"time": 1550863883083, "text": "We thank you"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "105927120072250158205", "name": "Susan Knight", "time": 1457635050795, "rating": 5.0, "text": "Cristina is an awesome stylist and knows what she is doing! You are guaranteed to walk out her salon feeling like a million bucks!!", "pics": null, "resp": {"time": 1477709420495, "text": "Awww thank you"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "105939106153869485732", "name": "Ari Villa", "time": 1553361403310, "rating": 1.0, "text": "Last week I got my hair dyed, and now my hair looks like rainbow. I ask for two colors and I have about 5 colors in my hair. It took me 8 hours to get my hair dyed and its not what I wanted.", "pics": null, "resp": {"time": 1555594482498, "text": "I'm sorry but our books do not have you listed as a client or serviced with any of the stylists here."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "103206781129012940292", "name": "Jessica R. Lattimore", "time": 1521574031303, "rating": 5.0, "text": "Absolutely amazing!!!", "pics": null, "resp": {"time": 1521576450100, "text": "We work hard  So you can have the best"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "117242628029580980550", "name": "Ute Brown", "time": 1501192288359, "rating": 5.0, "text": "This girl can cut some hair!", "pics": null, "resp": {"time": 1501599901951, "text": "Thanks I loved your cut too"}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "113165177473136765526", "name": "Gabriella Chantal", "time": 1495139129316, "rating": 5.0, "text": "Great service and haircut!", "pics": null, "resp": {"time": 1495154979991, "text": "We aim to please! It was a pleasure deriving you."}, "gmap_id": "0x88926ef76e7fbf37:0x82037f60f4aac01c"}
{"user_id": "103834347878583509504", "name": "Lisa Trevino", "time": 1571694555000, "rating": 5.0, "text": "Jennifer is the best here in Andalusia come and book your appointment now", "pics": null, "resp": null, "gmap_id": "0x8891eead9a29e905:0x7a91621e67044396"}
{"user_id": "118281680621920069553", "name": "julie mcduffie", "time": 1525723012265, "rating": 5.0, "text": "Had a new stylist this time and really have enjoyed the cut looking forward to another ...hope she stays !!!", "pics": null, "resp": null, "gmap_id": "0x8891eead9a29e905:0x7a91621e67044396"}
{"user_id": "106773366283159129352", "name": "Shalona Kilpatrick", "time": 1528345801402, "rating": 5.0, "text": "Love Becky Smith. Shes an awesome beautician.", "pics": null, "resp": null, "gmap_id": "0x8891eead9a29e905:0x7a91621e67044396"}
{"user_id": "112795103745576899102", "name": "Bethany Schneider", "time": 1569449382523, "rating": 5.0, "text": "Brianna is an excellent stylist!", "pics": null, "resp": null, "gmap_id": "0x8891eead9a29e905:0x7a91621e67044396"}
{"user_id": "110782671739388976908", "name": "Nancy Canant", "time": 1538476655333, "rating": 5.0, "text": "Great cuts", "pics": null, "resp": null, "gmap_id": "0x8891eead9a29e905:0x7a91621e67044396"}
{"user_id": "108867503300486908985", "name": "Brenda Mccann", "time": 1535150336257, "rating": 4.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x8891eead9a29e905:0x7a91621e67044396"}
{"user_id": "102391865138627730848", "name": "Tasha Franklin", "time": 1533129586921, "rating": 1.0, "text": "Horrible", "pics": null, "resp": null, "gmap_id": "0x8891eead9a29e905:0x7a91621e67044396"}
