{"user_id": "107931970954707800238", "name": "Misty Jones", "time": 1629506473761, "rating": 5.0, "text": "Mark M. came out and helped us find the perfect windows and front door that would meet our needs. He was knowledgeable, super professional, very friendly and really left us feeling comfortable about our decision to go with Champion. The products seem to be extremely well made and energy efficient along with being durable and easily maintained. We will be using them again for future projects. Thanks for everything!!", "pics": null, "resp": {"time": 1629767403017, "text": "Hello Misty, We really appreciate the time you took to leave such a thoughtful review! Please share your positive experience with friends, family and neighbors! Thanks again!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "110896269865459864034", "name": "Christopher Davidson", "time": 1629951235008, "rating": 5.0, "text": "I decided to call champion windows because of the sale they are having. Donna Farmer came out to do our estimate and sold us on champion windows. She was very personable and informative. Looking forward to doing more business with her and champion in the future. Can't wait for installation day!", "pics": null, "resp": {"time": 1630437209562, "text": "Christopher, we are delighted to hear we provided a top-notch experience! Thank you for taking the time to write this review. It is wonderful to hear we were able to provide you with excellent service."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "118423212512887655469", "name": "Linda Creel", "time": 1629572969749, "rating": 5.0, "text": "I decided to to call champion windows because of a sale they were having. I’m so glad I did. Donna Farmer came out to do our estimate. She sold us the windows. She was very informative and answered all of our questions. She is a very nice person and I’m looking forward to doing more business with her in the future. Donna, you have a customer for life!!!!", "pics": null, "resp": {"time": 1629766655159, "text": "Linda, we are delighted to hear we provided a top-notch experience! Thank you for taking the time to write this review. It is wonderful to hear we were able to provide you with excellent service."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "109430286729431798714", "name": "kisha jordan", "time": 1628043007050, "rating": 5.0, "text": "Today we had the pleasure of meeting a lady by the name of Donna Farmer she represented for Champion Windows. She did a phenomenal job showing us the demonstration of how champion window works. For every question that I asked , she had an answer.  I was very pleased in the end with the decision that we made. I’m looking forward to our new windows . This home was built in 1965 and I’m so excited about the windows that me and Dee picked out and I can’t wait to see the end results. I’m also looking forward to the power bill being lowered and how much sound proof they will be and the curb appeal in my home. This was a big decision in the end and I’m glad that Donna was the one that came out to our home. If I had my own company this is the person that I would hire off the top, she knows her stuff, she honest, she’s consistent, determined, and she makes you feel welcomed and appreciative  that you chose Champion Windows", "pics": null, "resp": {"time": 1628563306820, "text": "Hello Kisha, We really appreciate the time you took to leave such a thoughtful review! Please share your positive experience with friends, family and neighbors! Thanks again!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "109170914282363764734", "name": "Ann Carroll Hill", "time": 1630350908956, "rating": 5.0, "text": "Gary Douglas, the salesman I worked with at Champion was very thorough, gave me several options, and helped me choose the right one for my house.  This is the third time I’ve used Champion and first time in Alabama.  I’m always impressed with the service and quality of the representatives of Champion.  Looking forward to another great install.", "pics": null, "resp": {"time": 1630464236101, "text": "Thank you for posting your positive review. At Champion Windows and Home Exteriors of Birmingham, we value your time and always strive to provide fast and efficient service. We are so pleased to hear our service was provided in a timely manner."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "103018188716265805411", "name": "Meg Boulter", "time": 1629315072033, "rating": 5.0, "text": "Donna was so knowledgeable, professional, and courteous! She took the time to explain everything and answer any questions we had. I would highly recommend her to anyone looking to have windows replaced!", "pics": null, "resp": {"time": 1630095547978, "text": "Thank you very much for your recommendation, Meg! We're glad to hear that our customer service met your expectations. We appreciate this review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "100378333743703376996", "name": "sTepUpTo Parenting", "time": 1629903734955, "rating": 5.0, "text": "Gary was very friendly and professional. He did not try to rush thru the presentation. He gave detailed information, and answered all my questions completely. I had received several other quotes and talked with other sales people who were nice but not as through as Gary. I am looking forward to the day my windows will be installed.", "pics": null, "resp": {"time": 1630436554182, "text": "We really appreciate the time you took to leave such a thoughtful review! Please share your positive experience with friends, family and neighbors! Thanks again!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "100905501917815755538", "name": "Justin “JC” Coleman", "time": 1630185237051, "rating": 5.0, "text": "Gary Douglas, did a great job coming out to the house and getting us squared away on a new sunroom, gutters, and doors. He was very professional and knowledgeable. The fact he used to help build these projects goes a long way. Thank you.", "pics": null, "resp": {"time": 1630463608876, "text": "Justin, we are delighted to hear we provided a top-notch experience! Thank you for taking the time to write this review. It is wonderful to hear we were able to provide you with excellent service."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "113838539771690705640", "name": "Brooke Grayson", "time": 1629225912234, "rating": 5.0, "text": "Dan James did an amazing job demonstrating the excellent quality of Champion windows.  He is extremely knowledgeable about the company and the window industry. He was seemed extremely trustworthy and not a pushy salesperson, which is refreshing. He made the process of replacing my windows simple. Champion windows provide an excellent product with a lifetime warranty unmatched by other window companies. Highly recommend.", "pics": null, "resp": {"time": 1630095178282, "text": "Hello Brooke, We really appreciate the time you took to leave such a thoughtful review! Please share your positive experience with friends, family and neighbors! Thanks again!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "110475703063511657064", "name": "Chris Berg", "time": 1629904555588, "rating": 5.0, "text": "Outstanding experience with Dan James on selecting Champion as the best option for our home remodel. The efficiency of the Comfort 365 glass and the lifetime warranty were definitely key components of our decision to choose Champion.", "pics": null, "resp": {"time": 1630436574338, "text": "Chris, We appreciate you taking the time to leave us a positive review.   We are dedicated to providing great service.  Please feel free to reach out if there's anything you need."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "114850785114596939313", "name": "Terry Coker", "time": 1629768293891, "rating": 5.0, "text": "Dan was amazing! He went over everything in detail. I love the that they have a lifetime warranty on all windows and you can call anytime.", "pics": null, "resp": {"time": 1630436045204, "text": "Thanks for the positive review, Terry. We work hard to exceed expectations. It was a pleasure working with you! Always know you can reach out to us directly if there's anything else we can do to help you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "103441638639710593036", "name": "Blaine Hurt", "time": 1629825492993, "rating": 5.0, "text": "Got everything going quickly when other companies wouldn't even come out. The demo looked great and the lifetime warranty certainly helped with the sell.", "pics": null, "resp": {"time": 1630436130827, "text": "Blaine, we are delighted to hear we provided a top-notch experience! Thank you for taking the time to write this review. It is wonderful to hear we were able to provide you with excellent service."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "109339871069162678712", "name": "Melia Calico", "time": 1630072337279, "rating": 5.0, "text": "The salesman, Dan, that came to my house to give me an estimate was very professional and personable. He went out of his way to help me with financing and I really appreciate his dedication.", "pics": null, "resp": {"time": 1630438835852, "text": "Thanks for the positive review, Melia. We work hard to exceed expectations. It was a pleasure working with you! Always know you can reach out to us directly if there's anything else we can do to help you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "104036173684818563675", "name": "Savannah Lee", "time": 1628277713973, "rating": 5.0, "text": "Mark mitchell did a great job of educating me on the products of not only their Windows but doors as well. Worked through many different options and gave us a great quote to which we bought Windows from him! We plan on buying more. We are new home owners and have never purchased Windows before. Made me feel like I had a family member in the window business", "pics": null, "resp": {"time": 1628617296804, "text": "Hello Savannah, We really appreciate the time you took to leave such a thoughtful review! Please share your positive experience with friends, family and neighbors! Thanks again!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "107751453229417964905", "name": "Kristen Williams", "time": 1626795095528, "rating": 5.0, "text": "My husband called Champion to get a window estimate. John came out precisely on time. He was kind, knowledgable, and friendly. We sat down and he told us about Champion, then he measured all of the windows in our house so he could build the quote. He built the quote quickly in our home and had us look over it to make sure the number of windows/style of windows were correct. John called Julian to get the best price for us. We were impressed by the number that they were able to get to, and we signed on the dotted line! They have quoted us 8-9 weeks for the windows to be installed.  After our wonderful experience yesterday, we are expecting great things with installation. John and Julian were both great to work with and really came through on pricing. I will update this review once installation is complete.", "pics": null, "resp": {"time": 1627058598831, "text": "Hello Kristen, We really appreciate the time you took to leave such a thoughtful review! Please share your positive experience with friends, family and neighbors! Thanks again!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "108848608520020635745", "name": "laron batie", "time": 1630288653173, "rating": 5.0, "text": "Gary was AWESOME. He provided an amazing design and was very knowledgeable. I would definitely recommend him and Champion.", "pics": null, "resp": {"time": 1630463703551, "text": "Thanks for the positive review, Laron. We work hard to exceed expectations. It was a pleasure working with you! Always know you can reach out to us directly if there's anything else we can do to help you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "100387491668530820143", "name": "TERRICKA LATRICE SMITH", "time": 1628816495773, "rating": 5.0, "text": "Customer service was amazing. My salesman Mark was very knowledgeable about the company. He worked really hard to get my husband and I financed. Would highly recommend Mark. He made this process so easy!", "pics": null, "resp": {"time": 1630091624999, "text": "Thanks for the positive review, Terricka. We work hard to exceed expectations. It was a pleasure working with you! Always know you can reach out to us directly if there's anything else we can do to help you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "117778439604322996779", "name": "Christopher Ritchey", "time": 1628090074641, "rating": 5.0, "text": "John Maenza did a fantastic job showing the value of Champion windows.  He provided so many options and gave us a really terrific price to take care of every window that needed to be replaced-13 windows in all.  He is not just a salesman.  He became a friend, and helped us like a friend would. I recommend him without reservation.", "pics": null, "resp": {"time": 1628563413920, "text": "Thanks for the positive review, Christopher. We work hard to exceed expectations. It was a pleasure working with you! Always know you can reach out to us directly if there's anything else we can do to help you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "115324747090395654179", "name": "Debbie Burrell", "time": 1627337836062, "rating": 5.0, "text": "Mark Mitchell came out to our house to give us an estimate on replacing all of our windows.  He was very nice and very informative.  He was right on time, which I was very impressed.  I was very satisfied with him and Champion Windows", "pics": null, "resp": {"time": 1628273355540, "text": "Thanks for the positive review, Debbie. We work hard to exceed expectations. It was a pleasure working with you! Always know you can reach out to us directly if there's anything else we can do to help you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "108239920956784430366", "name": "Maria Turner", "time": 1625203324163, "rating": 1.0, "text": "This was the worst experience that I had ever.  This company do not do good customer service at all. I order in February 2021 and my install date was April  8, 2021 a total of 9 windows with colonial grids. The installer came  with the windows  with no grids all plain windows  and we told the salesperson Robin 5 time we wanted  grids because we had windows install before like 2 years ago and we wanted these to match. For some unknown reason she fail to check the section with the grids on the paperwork.  And no, we did not let them install the plain windows because that's not what we order, but they got our down payment and said it will take  a couple of weeks to get grids and the windows install. It's July 2021 and we still have not got our windows installed  yet , I have called  and called and all I get is they been ordered and they should be here any day now. I call the install manger Dexter no responses, never. I will never ever use this company again. I thought this was a good reputable company.", "pics": null, "resp": {"time": 1625205245113, "text": "Maria, We want to sincerely apologize for your negative experience with us. We would like to speak to you to learn what exactly happened. We want to make things right. Please call us at (513) 327-7338. We look forward to hearing from you!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "105607170787097763666", "name": "Johnny Oblinger", "time": 1625611163351, "rating": 5.0, "text": "Worked with Mark on our replacement windows and doors. He was super patient with helping us identify and matching our needs. He was very knoweldgebale of the product, and the demo was cool. Mark even went out of his way to help us get our replacements when we had a little \"difficulty\" with financing. Overall, our experiance was great and I can't wait for the install. Thanks Mark, and Champion Windows.", "pics": null, "resp": {"time": 1626286245596, "text": "Thanks for the positive review, Johnny. We work hard to exceed expectations. It was a pleasure working with you! Always know you can reach out to us directly if there's anything else we can do to help you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "102011453158270683973", "name": "Jennifer Lester", "time": 1626815887344, "rating": 5.0, "text": "Had a fabulous experience with Joe C. at Champion Windows.  He was very knowledgeable about the various types of windows and answered all my questions.  Joe wasn’t pushy at all, which was a nice change from other companies I’ve dealt with.  Highly recommend Champion Windows and Joe C!  Excellent service.", "pics": null, "resp": {"time": 1627058830429, "text": "Jennifer, We appreciate you taking the time to leave us a positive review.   We are dedicated to providing great service.  Please feel free to reach out if there's anything you need."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "110493159660750759339", "name": "Anna Barnhill", "time": 1617895240257, "rating": 5.0, "text": "Gary Douglas was an outstanding salesman. He arrived on time and we very respectable to our home. He was very kind and considerate to my family. He was able to give a sales pitch without it coming off like he was selling us anything. It was like talking to a neighbor. Highly recommend. 5 Stars", "pics": null, "resp": {"time": 1618344113160, "text": "Thank you for posting your positive review. At Champion Windows and Home Exteriors of Birmingham, we value your time and always strive to provide fast and efficient service. We are so pleased to hear our service was provided in a timely manner."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "103423232284089650347", "name": "brooke schweitzer", "time": 1625252209343, "rating": 5.0, "text": "Requested an estimate, Joe Cash came out on time. He also gave an in depth presentation that answered all of my questions. He gave me several options to replace an oversized bow window. We decided on a design at a great price. I can't wait for the installation. I an super excited.", "pics": null, "resp": {"time": 1626285491665, "text": "Hello Brooke, We really appreciate the time you took to leave such a thoughtful review! Please share your positive experience with friends, family and neighbors! Thanks again!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "109339871069162678712", "name": "Melia Calico", "time": 1630072337279, "rating": 5.0, "text": "The salesman, Dan, that came to my house to give me an estimate was very professional and personable. He went out of his way to help me with financing and I really appreciate his dedication.", "pics": null, "resp": {"time": 1630438835852, "text": "Thanks for the positive review, Melia. We work hard to exceed expectations. It was a pleasure working with you! Always know you can reach out to us directly if there's anything else we can do to help you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "110400503565416738388", "name": "Amy Ellis", "time": 1628806086183, "rating": 5.0, "text": "Gary Douglas was very professional, punctual, detail oriented, and took the time to answer all my questions about a new door.  Will update with my experience with installation.", "pics": null, "resp": {"time": 1630091020472, "text": "Amy, We appreciate you taking the time to leave us a positive review.   We are dedicated to providing great service.  Please feel free to reach out if there's anything you need."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "114868398644468433503", "name": "Jennifer Campbell", "time": 1625152201613, "rating": 1.0, "text": "So, we ordered windows 6 weeks ago for our house.  Our instillation day was last week.   We had called right after the sale to change the window color and spoke with the sales rep, who sold us the windows, as well as called the office to ensure the change had been made. We reinterred the change when we signed the paper for the 2nd measurement to ensure the color was corrected. When the installers showed up, one of our 4 windows was measured incorrectly and in addition the windows were not the right color. The installers remeasured (this is the 3rd measurement since sale) and stated someone would call us.  This was on a Thursday.... no call.  So we attempted to call on Monday and spoke with someone who stated they would put a note in and someone would call us back....... No Call.  So we called again on Wednesday......Same spill..... NO CALL!.... I have yet called again and was given the same speech and that they are unable to get any of the project managers on the phone, so they will send them a message to call back.  I find this to be a little ridiculous at this point.  The company has taken half of my money for the instillation and I have no idea if the windows are being remade or anything at this point.  I have no answers and I am not even sure if I can get a refund at this point because you can not get anyone on the phone typically.   I personally would advise anyone looking for windows at this point to check out a different company.", "pics": null, "resp": {"time": 1626283933658, "text": "Thank you for bringing this to our attention. We apologize for the delay you're describing. Please reach out to us directly in national customer care, so we can work with you to get this taken care of as soon as possible – 513-327-7338. Thank you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "101923387209203009524", "name": "Monica Romine", "time": 1624586317415, "rating": 5.0, "text": "I got siding with champion. Gary was very professional and did everything he could to get me a quality product inside my budget. He worked with my schedule and did not rush me into making a decision. He was patient with my questions and listened to my concerns. I look forward to getting my siding installed.", "pics": null, "resp": {"time": 1625682225363, "text": "Hello Monica, We really appreciate the time you took to leave such a thoughtful review! Please share your positive experience with friends, family and neighbors! Thanks again!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "105730593442810679647", "name": "Linda Wallace", "time": 1627579674841, "rating": 5.0, "text": "Looking forward to getting my new windows. It will be a big improvement to my home.  I had a wonderful sales representative that demonstrated and explained everything in detail.  Her name is Donna Farmer", "pics": null, "resp": {"time": 1628558506811, "text": "Thank you for the kind words, Linda! We're happy to hear your overall experience with us was a good one. We are always here to provide any help you may need. Don't forget to tell your friends and family about us!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "106260348529763390999", "name": "Chris Elward", "time": 1622750281682, "rating": 5.0, "text": "Champion has been a pleasure to deal with. They were able to set up an appointment for an estimate quickly. Mark Mitchell arrived on time and was very professional. He explained all our options and helped us find doors that fit the look we wanted and were within our budget. We have used Champion in the past and they have done great work. We ordered three doors today. I will call Mark if we ever need windows or decide to add a sunroom.", "pics": null, "resp": {"time": 1624039926299, "text": "Thanks for the positive review, Chris. We work hard to exceed expectations. It was a pleasure working with you! Always know you can reach out to us directly if there's anything else we can do to help you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "114868398644468433503", "name": "Jennifer Campbell", "time": 1625152201613, "rating": 1.0, "text": "So, we ordered windows 6 weeks ago for our house.  Our instillation day was last week.   We had called right after the sale to change the window color and spoke with the sales rep, who sold us the windows, as well as called the office to ensure the change had been made. We reinterred the change when we signed the paper for the 2nd measurement to ensure the color was corrected. When the installers showed up, one of our 4 windows was measured incorrectly and in addition the windows were not the right color. The installers remeasured (this is the 3rd measurement since sale) and stated someone would call us.  This was on a Thursday.... no call.  So we attempted to call on Monday and spoke with someone who stated they would put a note in and someone would call us back....... No Call.  So we called again on Wednesday......Same spill..... NO CALL!.... I have yet called again and was given the same speech and that they are unable to get any of the project managers on the phone, so they will send them a message to call back.  I find this to be a little ridiculous at this point.  The company has taken half of my money for the instillation and I have no idea if the windows are being remade or anything at this point.  I have no answers and I am not even sure if I can get a refund at this point because you can not get anyone on the phone typically.   I personally would advise anyone looking for windows at this point to check out a different company.", "pics": null, "resp": {"time": 1626283933658, "text": "Thank you for bringing this to our attention. We apologize for the delay you're describing. Please reach out to us directly in national customer care, so we can work with you to get this taken care of as soon as possible – 513-327-7338. Thank you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "110493159660750759339", "name": "Anna Barnhill", "time": 1617895240257, "rating": 5.0, "text": "Gary Douglas was an outstanding salesman. He arrived on time and we very respectable to our home. He was very kind and considerate to my family. He was able to give a sales pitch without it coming off like he was selling us anything. It was like talking to a neighbor. Highly recommend. 5 Stars", "pics": null, "resp": {"time": 1618344113160, "text": "Thank you for posting your positive review. At Champion Windows and Home Exteriors of Birmingham, we value your time and always strive to provide fast and efficient service. We are so pleased to hear our service was provided in a timely manner."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "108090544853452850227", "name": "Elizabeth Wilkerson", "time": 1628623099299, "rating": 5.0, "text": "Thank you Gary DouglasYou are awesome and your presentation was Second To None me and my sister feel very comfortable with this large purchase you've answered every question thank you Gary you're awesome", "pics": null, "resp": {"time": 1628737989416, "text": "Thank you very much for your recommendation, Elizabeth! We're glad to hear that our customer service met your expectations. We appreciate this review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "103998699652336872640", "name": "Sarah Fortin", "time": 1627605698294, "rating": 5.0, "text": "Mark was great! Very professional and explained everything in detail. One of the best salesmen I’ve worked with!!", "pics": null, "resp": {"time": 1628558714383, "text": "Thank you for this positive rating, Sarah!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "105607170787097763666", "name": "Johnny Oblinger", "time": 1625611163351, "rating": 5.0, "text": "Worked with Mark on our replacement windows and doors. He was super patient with helping us identify and matching our needs. He was very knoweldgebale of the product, and the demo was cool. Mark even went out of his way to help us get our replacements when we had a little \"difficulty\" with financing. Overall, our experiance was great and I can't wait for the install. Thanks Mark, and Champion Windows.", "pics": null, "resp": {"time": 1626286245596, "text": "Thanks for the positive review, Johnny. We work hard to exceed expectations. It was a pleasure working with you! Always know you can reach out to us directly if there's anything else we can do to help you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "110400503565416738388", "name": "Amy Ellis", "time": 1628806086183, "rating": 5.0, "text": "Gary Douglas was very professional, punctual, detail oriented, and took the time to answer all my questions about a new door.  Will update with my experience with installation.", "pics": null, "resp": {"time": 1630091020472, "text": "Amy, We appreciate you taking the time to leave us a positive review.   We are dedicated to providing great service.  Please feel free to reach out if there's anything you need."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "117399443808803772834", "name": "Terri Del Conte", "time": 1623328714054, "rating": 1.0, "text": "We had to hunt them down on our window installation that went from “8 weeks to install” to over DOUBLE that time frame (around 5 months!). Anytime you call you’re on hold for at least 20-30 mins to only get someone to pass the buck. I would go with a local family owned company. Champion windows were by far the most expensive quote we got, but we thought we were paying for quality and customer service. Not the case. Oh, and when they came to finally install we had to pay an extra $2,000 for them to complete the work. There has been no ownership or accountability on their end. They won’t do anything to remedy our situation. My husband and I have a big network and they all will know to go elsewhere.", "pics": null, "resp": {"time": 1624302368786, "text": "Thank you for taking the time to give us a review. We sincerely apologize about the issues you experienced, and we hope to make this right. Please reach out to us directly in national customer care, so we can rectify this issue – 513-327-7338. Thank you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "101923387209203009524", "name": "Monica Romine", "time": 1624586317415, "rating": 5.0, "text": "I got siding with champion. Gary was very professional and did everything he could to get me a quality product inside my budget. He worked with my schedule and did not rush me into making a decision. He was patient with my questions and listened to my concerns. I look forward to getting my siding installed.", "pics": null, "resp": {"time": 1625682225363, "text": "Hello Monica, We really appreciate the time you took to leave such a thoughtful review! Please share your positive experience with friends, family and neighbors! Thanks again!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "104889802807169681194", "name": "Margaret Phillips", "time": 1616783191122, "rating": 5.0, "text": "I thought Gary Douglas who came to give me the quote was extremely professional and informative of the windows and installation process.  I appreciated that he took his shoes off when entering my house👍🤩\nThe quote I was happy with, I also got the 10% extra for signing while Gary was here and the 12 month interest free loan was a great option that I accepted.  I am now really looking forward to the installation.", "pics": null, "resp": {"time": 1617406140451, "text": "Margaret, we are delighted to hear we provided a top-notch experience! Thank you for taking the time to write this review. It is wonderful to hear we were able to provide you with excellent service."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "108835638839868901827", "name": "joyce carter", "time": 1622417002340, "rating": 2.0, "text": "We are using Champion to upgrade a large portion of our back porch into a Sun room. Salesman extrmely helpful and easy to work with.\nUpdate. Our job has not been completed but the installers have been great thus far. Problem with product I was shown and what was actually installed.  I have reached out for a solution and hopefully will have good results. I will update again when job is completed to our satisfaction. Will add back 5 stars when work is completed.", "pics": null, "resp": {"time": 1616099187978, "text": "Thank you for taking the time to give us a review. We sincerely apologize about the issues you experienced, and we hope to make this right. Please reach out to us directly in national customer care, so we can rectify this issue – 513-327-7338. Thank you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "116968180650388659908", "name": "Yolanda B Williams", "time": 1625071460292, "rating": 5.0, "text": "My sales rep , Joe Cash, was knowledgable, funny, professional, courteous, timely. He was able to answer all questions and sought to obtain the best price for my project.", "pics": null, "resp": {"time": 1625702754993, "text": "Thank you very much for your recommendation, Yolanda! We're glad to hear that our customer service met your expectations. We appreciate this review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "115299133518584633594", "name": "Ting Lee", "time": 1627425458652, "rating": 5.0, "text": "Donna is great and very professional. We look forward into getting our new windows!", "pics": null, "resp": {"time": 1628274400842, "text": "Thank you very much for your recommendation, Ting! We're glad to hear that our customer service met your expectations. We appreciate this review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "115503016966381840173", "name": "Thomas Brocato", "time": 1628560496346, "rating": 5.0, "text": "Mark Mitchell was a huge help. He walked us through the entire process and did a great job of setting expectations.", "pics": null, "resp": {"time": 1628737152156, "text": "Thank you very much for your recommendation, Thomas! We're glad to hear that our customer service met your expectations. We appreciate this review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "101353612259855424981", "name": "J Williams", "time": 1623164152673, "rating": 1.0, "text": "AVOID AT ALL COSTS!!! We ordered multiple exterior doors in January. The rep measured them and then someone else came out to measure again. Now a total of 5 people have come out to measure and we’ve received 2 doors that don’t fit. No return calls from the sales rep John( we were told he’s been fired), the manager Dexter (very unprofessional and unhelpful to say the least- I’d be better off talking to the incorrectly measured doors for better assistance) or the new rep Tyler (thinks a text message is appropriate over a phone call). This is the worst experience I’ve ever had with a “reputable” company that’s been in business for years. And before you reply with a “Covid excuse”, Covid doesn’t prevent you from knowing how to use a measuring tape or operate a phone and notify someone of what the heck is going on. I could’ve built the new doors myself in this time and saved myself all of this trouble.", "pics": null, "resp": {"time": 1624040926904, "text": "We want to sincerely apologize for your negative experience with us. We want to make things right. Please call us in our national customer care office directly at (513) 327-7338 at your earliest convenience. We look forward to hearing from you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "112653862529331003030", "name": "Ashley Hayes", "time": 1610589137553, "rating": 5.0, "text": "Robin Turner came out and did a awesome job on presenting and showing me all the information I needed to know about Champion windows.  She explained everything and answered all the questions I had for her.  She went step by step to show me just how well Champion windows are made and how energy efficient they are.  She did a great job making sure I understood what all I was initialing and signing as we went through the paperwork process.  I can’t wait to have my new windows and doors put in!!!", "pics": null, "resp": {"time": 1610993645657, "text": "Hello Ashley, We really appreciate the time you took to leave such a thoughtful review! Please share your positive experience with friends, family and neighbors! Thanks again!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "115377912661056595226", "name": "James Kuhlman", "time": 1628262301015, "rating": 5.0, "text": "Donna Farmer was great and would recommend  Champion highly. Looking forward  to getting my windows.", "pics": null, "resp": {"time": 1628616888849, "text": "Thank you very much for your recommendation, James! We're glad to hear that our customer service met your expectations. We appreciate this review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "106423102782982029861", "name": "Amber Piersol", "time": 1626364968283, "rating": 1.0, "text": "Ordered a sunroom April 19 2021, fitted May 15 2021. It is July 15th 2021 they have cashed my check in June, and not returned ANY calls I have been attempting to contact them since mid June. Emails, Voicemails, customer service, contact cell phone I was given, and facebook.\nIt is Very unprofessional not to follow up on your customers even if you are delayed you owe it to your customers especially if you have already taken there money. If someone is spending over 20K with your company I think a phone call update on there order is more than justified. I would absolutely cancel if I could get someone to take my calls. Don't ask me to call your (513)# because there is no direct line for customer issues. I just got redirected to someone else's voicemail. I will be contacting a lawyer to get my money back.", "pics": null, "resp": {"time": 1626902605085, "text": "Thank you for bringing this to our attention. We apologize for the delay you're describing. Please reach out to us directly in national customer care, so we can work with you to get this taken care of as soon as possible – 513-327-7338. Thank you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "105332343193052849909", "name": "chas Wilkins", "time": 1625960073699, "rating": 5.0, "text": "Mark did a very honest and great job really knows his job need more people like him!", "pics": null, "resp": {"time": 1626896363282, "text": "Chas, We appreciate you taking the time to leave us a positive review.   We are dedicated to providing great service.  Please feel free to reach out if there's anything you need."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "112054451206990332607", "name": "Kaitlin Caruso", "time": 1615827495041, "rating": 5.0, "text": "We had a great experience with Robin in choosing new windows for our home! She was very knowledgable, sweet, and walked us through every question we had. Great experience!", "pics": null, "resp": {"time": 1616098025433, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "100233387994489836982", "name": "Green Garage", "time": 1604063792941, "rating": 5.0, "text": "Gary Douglas came to my home and gave me all of the information I needed to know about windows and why Champion is superior to their competitors. He was well dressed, professional and knowledgeable. My entire family was home (wife, 3 kids, mother in law) because school was closed that day. He was respectful to the adults and kind to my children and wore a mask in the house. He quickly measured the windows and gave me a quote the same day. If you are looking for replacement windows, definitely call these guys!", "pics": null, "resp": {"time": 1605211645232, "text": "Hello Green, We really appreciate the time you took to leave such a thoughtful review! Please share your positive experience with friends, family and neighbors! Thanks again!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "114879072691305312043", "name": "Will Vann", "time": 1617119230624, "rating": 5.0, "text": "Gary, the sales rep, showed up on time and gave a great presentation. He sold the product, explained its superior performance  qualities, and illustrated the performance.\n\nI would recommend Gary.", "pics": null, "resp": {"time": 1617906748131, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "109729544776419968277", "name": "Patrick Grindle", "time": 1615900513145, "rating": 1.0, "text": "I contacted this company thinking it would be a fair price and good service.  The sales person was professional, however the qouted price for an 11 x 12 Sunroom was absulutely rediculeous.  I was quoted $80,000.00 for a all season room with a patio door installed. The price was far in excess of a resonable price. I would suggest that a person consider a local contractor and avoid the over inflated price on this company.", "pics": null, "resp": {"time": 1616099139080, "text": "Thank you for your review. We pride ourselves on offering the best products and pricing to our customers. Please check back as we offer different promotions throughout the year. We hope to earn your business and provide you with great service."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "108519894141997364947", "name": "Joe Hills", "time": 1617836993953, "rating": 5.0, "text": "Sales person Mark Mitchell was on time and professional . We requested Mark due to previous window purchase with him.\nWe have been very satisfied with the entire experience from the point of sale to installation.", "pics": null, "resp": {"time": 1618343951902, "text": "Thank you for posting your positive review. At Champion Windows and Home Exteriors of Birmingham, we value your time and always strive to provide fast and efficient service. We are so pleased to hear our service was provided in a timely manner."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "107133184831861472721", "name": "Corey Mccutchen", "time": 1614044313457, "rating": 5.0, "text": "This company is very professional and we are very happy with the services they have given us. Donna Farmer was our representative, and she was very knowledgeable and helped us through every step. We will use them again.", "pics": null, "resp": {"time": 1614119712678, "text": "Hello Corey, We really appreciate the time you took to leave such a thoughtful review! Please share your positive experience with friends, family and neighbors! Thanks again!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "104733857460506061098", "name": "James Gray", "time": 1618176543044, "rating": 5.0, "text": "We are remodeling a 1960 home that needed new windows. Gary Douglas with Champion Windows was a great help with picking out our windows.", "pics": null, "resp": {"time": 1619036226725, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "108365364258241059458", "name": "Edward Griffin", "time": 1625774950147, "rating": 5.0, "text": "EDIT:\n2021 Update\n\nTL;DR We were so pleased last time, we decided to hire Champion to replace 4 doors in our home. I'm incredibly disappointed. Our order was managed poorly - the left hand doesn't seem to know what the right hand is doing - and we're still waiting 6 months later for 3 doors to be installed. From this experience, it's hard to say whether I'd recommend Champion again. I like the product a lot, but I'm very disappointed with the progress of this project.\n\nWe were so pleased with Champion before, that we decided to hire them for 4 new doors around our house. January, they came and measured the doors and told us they would be installing the end of Feb or beginning of March (can't remember exactly). They show up and one of the doors is just right, one door is the *wrong* door, and the other two were not measured or manufactured properly. Ok, mistakes happen, I get it. So they tell me they'll order new doors and get back in a month. It's a busy time or something, right? They tell me the doors won't be ready until May. May rolls around, nothing. I start calling in June and nobody knows what I'm talking about, I have to tell the representative what my problem is and she tells me she'll have to contact the local office, gives me her number, and tells me to call her the following week. I call her the following week and she doesn't answer. I call the HQ and the rep has to take all my information again because my record isn't clear to her. I call the local office, nobody answers. I call HQ again, nobody answers. I finally get a call in JULY that *one* door is ready to be installed. \"One door,\" I ask, \"we are waiting for 3 doors.\" The rep is confused. All he has in his records is one door. I'm contacted by another rep the same day who says she got in contact with the local office, who weren't able to tell her whether the door had even been ordered and, again, I had to remind the rep that we had ordered 2 other doors.", "pics": null, "resp": {"time": 1580132983886, "text": "Champion appreciates the feedback in order to improve our customer service. We also appreciate all the kind words and glad to see you enjoying our windows. Champion Customer Care"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "108090544853452850227", "name": "Elizabeth Wilkerson", "time": 1628623099299, "rating": 5.0, "text": "Thank you Gary DouglasYou are awesome and your presentation was Second To None me and my sister feel very comfortable with this large purchase you've answered every question thank you Gary you're awesome", "pics": null, "resp": {"time": 1628737989416, "text": "Thank you very much for your recommendation, Elizabeth! We're glad to hear that our customer service met your expectations. We appreciate this review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "115377912661056595226", "name": "James Kuhlman", "time": 1628262301015, "rating": 5.0, "text": "Donna Farmer was great and would recommend  Champion highly. Looking forward  to getting my windows.", "pics": null, "resp": {"time": 1628616888849, "text": "Thank you very much for your recommendation, James! We're glad to hear that our customer service met your expectations. We appreciate this review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "112054451206990332607", "name": "Kaitlin Caruso", "time": 1615827495041, "rating": 5.0, "text": "We had a great experience with Robin in choosing new windows for our home! She was very knowledgable, sweet, and walked us through every question we had. Great experience!", "pics": null, "resp": {"time": 1616098025433, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "102193873345828015872", "name": "Jeremy Schrimsher", "time": 1615857291015, "rating": 5.0, "text": "Davis Mutert was extremely knowledgeable and responsive. We are very excited about our new windows and looking forward to lower energy bills. We recommend Champion Windows without hesitation.", "pics": null, "resp": {"time": 1616098254547, "text": "Hello Jeremy, We really appreciate the time you took to leave such a thoughtful review! Please share your positive experience with friends, family and neighbors! Thanks again!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "112530769989878408657", "name": "Herbert Mitchell", "time": 1616633790334, "rating": 5.0, "text": "Gary Douglas is the man I really enjoyed every thing about him he was very professional and damn good you can send him to my home anytime a really great guy love the service you will be hearing from me again and please send Gary Douglas", "pics": null, "resp": {"time": 1617393841063, "text": "Herbert, we are delighted to hear we provided a top-notch experience! Thank you for taking the time to write this review. It is wonderful to hear we were able to provide you with excellent service."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "109101920587269360815", "name": "Yvette Hill", "time": 1619041750295, "rating": 5.0, "text": "Everything went well it was no problem mr. Douglas was very nice he got the job done thank you", "pics": null, "resp": {"time": 1619544456524, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "117449706018240292278", "name": "Christina Vineyard", "time": 1602633204480, "rating": 1.0, "text": "Previously, I left a really positive review. And said “Best deal in town! Mark, their sales rep, was professional and informative. Great deal on siding. Better than the other companies we have had come out. Answered all questions!”\nWell, it turns out that after Mark got us to sign up for a certain price and we financed through their company, they told us actually is was $5000 more than the quote. After weeks of trying to understand, a third person came out to remeasure, who was very nice and said that Mark missed measured by 20 feet on each side of our house, but that he was going to have the rep “eat the difference”. A week later, we still could not get answers but the loan company wanted a payment because Champion already took $5000 from our loan. Mark then called back and said they would knock it down $600 bucks, but it still went up $4400. We now have had to file a dispute and complaint with the loan company against Champion. We have called every number we can to talk to someone and keep leaving messages with people at Champion with no response. They have our money, but have done no work. So here we are 6 weeks later, with a loan we don’t need, and Champion refusing to give us answers, only the sales rep who messed up the first time telling us there is nothing they can do.", "pics": null, "resp": {"time": 1600114641169, "text": "Thank you, Christina!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "111513026267193711804", "name": "Tami Maze", "time": 1626453279363, "rating": 5.0, "text": "Sunroom. Gary Douglas was like meeting a friend we didn’t know we had! Explained everything to us clearly & answered all our questions.", "pics": null, "resp": {"time": 1626903804456, "text": "Tami, we are delighted to hear we provided a top-notch experience! Thank you for taking the time to write this review. It is wonderful to hear we were able to provide you with excellent service."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "107133184831861472721", "name": "Corey Mccutchen", "time": 1614044313457, "rating": 5.0, "text": "This company is very professional and we are very happy with the services they have given us. Donna Farmer was our representative, and she was very knowledgeable and helped us through every step. We will use them again.", "pics": null, "resp": {"time": 1614119712678, "text": "Hello Corey, We really appreciate the time you took to leave such a thoughtful review! Please share your positive experience with friends, family and neighbors! Thanks again!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "117042384425130954731", "name": "Robin Turner", "time": 1614180079634, "rating": 5.0, "text": "This is an incredible company. They truly educate you on the product that you are going to purchase. I am incredibly satisfied!", "pics": null, "resp": {"time": 1614624959204, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "110032221930036800357", "name": "Amy & John Mark", "time": 1617132397319, "rating": 1.0, "text": "I have had good experiences in the past with Champion but not recently.  Unfortunately, they do not stand behind the lifetime replacement warranty on their window products.  I've been trying to get a damaged window replaced for over 10 months now with no progress.  Customer service is not helpful or responsive.  I''m very disappointed with the company and will not use them or recommend them.", "pics": null, "resp": {"time": 1617906960159, "text": "We want to sincerely apologize for your negative experience with us. We want to make things right. Please call us in our national customer care office directly at (513) 327-7338 at your earliest convenience. We look forward to hearing from you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "114693847863054252375", "name": "Beth Emerson", "time": 1607713760619, "rating": 5.0, "text": "Gary Douglas was very professional with his presentation. He was helpful and provided valuable information on window replacement. He was personable and easy to work with. I feel we are getting the best windows for our money.", "pics": null, "resp": {"time": 1607976163416, "text": "So glad to hear this, Beth. Thank you for your review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "115476357468601551846", "name": "Randy Beers", "time": 1617656932121, "rating": 5.0, "text": "Champion has great people I trust and they do great work. I loved my experience.", "pics": null, "resp": {"time": 1618343249905, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "103449459391241156554", "name": "Kim Ralston", "time": 1605223410555, "rating": 5.0, "text": "The first window company to show us actual windows!\nGary Douglas was amazing!  Made us feel comfortable and at ease.  Felt like we had known him forever, but made a friend on his first appointment.\n\nWould highly recommend Gary and Champion!!\n\nCan’t wait to have new windows in our forever home!!!\n\nBarry and Kim Ralston", "pics": null, "resp": {"time": 1605293029438, "text": "Kim, we are delighted to hear we provided a top-notch experience! Thank you for taking the time to write this review. It is wonderful to hear we were able to provide you with excellent service."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "110701001869854636922", "name": "Kenneth Beavers", "time": 1629145865025, "rating": 5.0, "text": "Salesman Gary Douglas was knowledgeable, professional, friendly and on time !", "pics": null, "resp": {"time": 1630094665605, "text": "Thank you for posting your positive review. At Champion Windows and Home Exteriors of Birmingham, we value your time and always strive to provide fast and efficient service. We are so pleased to hear our service was provided in a timely manner."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "101340928703385628687", "name": "Russ Forehand", "time": 1611709214644, "rating": 5.0, "text": "Gary Douglas was very helpful and knowledgeable about the products and industry.  A great experience so far. Really looking forward to seeing final product.", "pics": null, "resp": {"time": 1611783419871, "text": "So glad to hear this, Russ. Thank you for your review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "114199744391974570722", "name": "Jerome Mays", "time": 1613256126043, "rating": 5.0, "text": "Gary Douglass was awesome! He did an amazing job presenting products that Champion offers. I would highly recommend Champion windows.", "pics": null, "resp": {"time": 1613588550037, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "108444523293906862154", "name": "Dena", "time": 1615927043781, "rating": 1.0, "text": "Still waiting on our door to be delivered and installed. We placed order and put down payment on October 18th 2020! UPDATE ... Salesman has been very nice wonderful.   But all the managers and anyone else we have dealt with it has been a nightmare.  We found out today that they knew two weeks ago they can't even make the door at all. So after all this waiting we have to start from scratch with someone new.  Now we have to wait to get our deposit of 1800 dollars back. At the rate this company has been doing business I do not know if or when we will see that money. DO NOT DEAL WITH THIS COMPANY! We will be making sure we tell all we know to stay away and write as many reviews as we can.  Hopefully no one else has to go thru the headache we have gone thru.", "pics": null, "resp": {"time": 1615478798773, "text": "Thank you for taking the time to leave us a review, Dena. We sincerely apologize about the wait you're describing. In order for us to get you an update as quickly as possible, will you please send us a message at info@getchampion.com with your contact info and name the order was placed under? Thank you - Champion Customer Care"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "104733857460506061098", "name": "James Gray", "time": 1618176543044, "rating": 5.0, "text": "We are remodeling a 1960 home that needed new windows. Gary Douglas with Champion Windows was a great help with picking out our windows.", "pics": null, "resp": {"time": 1619036226725, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "110133900532426201188", "name": "Astra Patrick", "time": 1604662382103, "rating": 5.0, "text": "Did a very good job. Are not the cheapest windows in the market but you pay for quality. Windows were delivered early and installation was quick and efficient. We are very pleased with our experience and plan to use them when we finish replacing the remainder of our windows.", "pics": null, "resp": {"time": 1604698766046, "text": "So glad to hear this, Astra. Thank you for your review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "102395065776522190720", "name": "Michael Hanle", "time": 1614883472335, "rating": 5.0, "text": "Donna was the best!!   She answered every question and was able to give me great value at a great price.", "pics": null, "resp": {"time": 1615409104097, "text": "Michael, we are delighted to hear we provided a top-notch experience! Thank you for taking the time to write this review. It is wonderful to hear we were able to provide you with excellent service."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "116608536694214063020", "name": "Ford Brown", "time": 1601573637436, "rating": 5.0, "text": "Gary was the most professional, nicest window man in the business. Absolute pleasure to talk windows, home efficiency, and woodworking with. Champion windows are the Porsche of their industry and Gary fits in perfectly with selling them. You will not be anything but thankful you have him pulling up to your house. As a first time home owner he was so helpful in explaining windows and home efficiency. Thank you Gary.", "pics": null, "resp": null, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "113626063703066369253", "name": "Varrie Byrd", "time": 1605905142542, "rating": 5.0, "text": "Mr. Gary Douglas cane to our home and did an excellent demo! He came in masked up,  courteous and friendly.  He gave us thorough insight into the company and answered every question without hesitation. Outstanding!!!", "pics": null, "resp": null, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "106042088984577043695", "name": "Cheryl Calhoun", "time": 1605992505749, "rating": 5.0, "text": "Gary Douglas was great. He was very informative.  He discussed the whole project with us . I felt at ease after our consultation.  I would definitely recommend his services to others.", "pics": null, "resp": null, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "108829141672360392350", "name": "Kristy Redford", "time": 1606506300084, "rating": 1.0, "text": "After paying over $800 for a storm door and waiting almost a month, the salesman called to inform me that my purchase was not eligible for the coupon/discount he used at purchase, and that I would need to pay $271 more. I cancelled the order and purchased the same door from Lowe’s for $300. They were completely unwilling to make it right, accept the $815 I’d already paid (on a Lawson door - sold in stores) and waited almost a month to let me know. Very poor service and shows the amount of markup on their products/installation.", "pics": null, "resp": {"time": 1606771864896, "text": "Kristy, We want to sincerely apologize for your negative experience with us. Please call us in our national customer care office directly at (513) 327-7338 at your earliest convenience. We look forward to hearing from you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "109037769608141846979", "name": "Allen R", "time": 1601067615233, "rating": 5.0, "text": "Champion was recommended by a good friend of ours - we have our order placed and used them based on our friends recommendation.   We look forward to seeing the finished job as we just ordered the windows .   The sales rep was knowledgeable and friendly .", "pics": null, "resp": null, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "101340928703385628687", "name": "Russ Forehand", "time": 1611709214644, "rating": 5.0, "text": "Gary Douglas was very helpful and knowledgeable about the products and industry.  A great experience so far. Really looking forward to seeing final product.", "pics": null, "resp": {"time": 1611783419871, "text": "So glad to hear this, Russ. Thank you for your review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "114135386577580525629", "name": "Rob Bouchillon", "time": 1604689858727, "rating": 3.0, "text": "The number they gave me is a national call center. They had no answers! They are referring this back to the local office who won't call me and give me a straight answer! Here We go again!\nWe chose Champion because of their reputation and lifetime guarantee! We were pleased with the product and have reccomended them to our friends. Recently some of the Windows and door have clouded up and we called and someone came out took bar codes and said they would replace at no cost. That was almost 3 1/2 monthes ago. A few replacement windows were replaced but the rest of the Windows and door have not! I can't get management to call me and give me a straight answer. I am running out if patience! RCBouchillon", "pics": null, "resp": {"time": 1604683191563, "text": "Thank you for taking the time to give us a review. We sincerely apologize about the issues you experienced, and we hope to make this right. Please reach out to us directly in national customer care, so we can rectify this issue – 513-327-7338. Thank you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "115722861126912343248", "name": "Sara", "time": 1572780986233, "rating": 5.0, "text": "Top notch service and products! Recently had 20 new windows installed in our home by this company! The process was smooth and easy starting with Gary, the sales rep followed by Jerod, the install manager. Both were very professional. Tim and Shayne installed the windows in a timely manner.  They were very friendly, organized, and left zero mess. You can tell they took pride in their work. We can already tell a big difference in temperature inside our home these last few very cold days. Just being able to open the windows is such a treat as well! We highly recommend this company.", "pics": null, "resp": {"time": 1572874392300, "text": "Thanks so much for taking the time to leave this great review. Enjoy your windows! -Champion Customer Care"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "103304848974705676818", "name": "Stefano Mugnaini", "time": 1597422652423, "rating": 5.0, "text": "We've had a hard time getting competing firms to even show up for a measure and estimate. Champion was responsive, communicative, answered our questions and gave what seems like a reasonable quote. We look forward to seeing the finished product!", "pics": null, "resp": null, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "105066332370874812911", "name": "Phyllis Vaughan", "time": 1618859611498, "rating": 3.0, "text": "An initial visit has been made. I have paid half of the total cost of my enclosure. No one has come for further measorements or work.", "pics": null, "resp": {"time": 1619203008927, "text": "Thank you for bringing this to our attention. We apologize for the delay you're describing. Please reach out to us directly in national customer care, so we can work with you to get this taken care of as soon as possible – 513-327-7338. Thank you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "113439081813004235000", "name": "Kayla Absher", "time": 1556197334186, "rating": 5.0, "text": "We ordered our Champion Windows and they were installed 6 weeks later which was less time than we expected.  Bo was our salesman and he was exceptional at communicating and answering any and all of our questions.  The installers (Tim and Shane) who came to our house worked with our schedule so that we did not have to take any additional PTO.  At our home they were courteous, professional, and fun to have around.  Since our installation, we have not had to touch our AC or Heat as our home has remained comfortable.  We LOVE our windows and new back door!", "pics": null, "resp": {"time": 1556282998814, "text": "Thank you for taking your time to share your positive experience Champion.  We will be sure to pass your comments on to the local branch."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "103482137387010826304", "name": "Taylor Arnold", "time": 1615714010315, "rating": 5.0, "text": "I would definitely recommend Champion. Donna Farmer was professional and very knowledgeable and a pleasure to work with.", "pics": null, "resp": {"time": 1616096663505, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "105873016557561459021", "name": "John Quebodeaux", "time": 1625257688054, "rating": 5.0, "text": "Gary  Douglas  was awesome\nThank you champion window", "pics": null, "resp": {"time": 1626285510162, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "106732299902319771184", "name": "Rhonda Miller", "time": 1599176074642, "rating": 5.0, "text": "We had been getting cost comparisons from a few different outlets  for an All Seasons Room. Champions Glass representative Mark Mitchell came and gave us an estimate and presentation of their product. Being in the construction industry myself for over 20 years, I was very impressed with Mark. His pleasant demeanor and willingness to work with us a room was spot on and very appreciated. I will update this review once the project is complete. Thanks again Mark.", "pics": null, "resp": {"time": 1600109242906, "text": "Thank you very much for choosing Champion and taking the time to leave this review, Rhonda."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "109565356463658179391", "name": "Shelia Shonkwiler", "time": 1612837260687, "rating": 5.0, "text": "Gary Douglas  was was very professional and explained  everything  he put our concerns first he went over and beyond  his job thank you for sending such a caring salesman to us", "pics": null, "resp": {"time": 1612891877706, "text": "Shelia, we are delighted to hear we provided a top-notch experience! Thank you for taking the time to write this review. It is wonderful to hear we were able to provide you with excellent service."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "116011064389756896517", "name": "Tracy Matthews", "time": 1625337770823, "rating": 5.0, "text": "Gary Douglas was excellent and very thorough with his presentation!!", "pics": null, "resp": {"time": 1626285660953, "text": "So glad to hear this, Tracy. Thank you for your review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "106042088984577043695", "name": "Cheryl Calhoun", "time": 1605992505749, "rating": 5.0, "text": "Gary Douglas was great. He was very informative.  He discussed the whole project with us . I felt at ease after our consultation.  I would definitely recommend his services to others.", "pics": null, "resp": null, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "107924987077714993583", "name": "Bev H", "time": 1610065323549, "rating": 5.0, "text": "Gary Douglas did a great job explaining  next steps and really worked to save us money. Thank you for caring about your customers.", "pics": null, "resp": {"time": 1610138441322, "text": "Bev, we are delighted to hear we provided a top-notch experience! Thank you for taking the time to write this review. It is wonderful to hear we were able to provide you with excellent service."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "105562241004590689322", "name": "David Hayes", "time": 1617831997656, "rating": 5.0, "text": "Rep was outstanding, knowledgeable, & personable. He is a great representation of this company.", "pics": null, "resp": {"time": 1618343896987, "text": "Thank you for this positive rating, David!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "116295189984068090126", "name": "Jennifer Jones", "time": 1601514449150, "rating": 5.0, "text": "Gary Shults was our salesman. He was professional, knowledgeable about the product, and very helpful. We are in the preliminary stages of deciding on a total window replacement with new siding and shutters as well. Champion is a quality product and something we look forward to using in the future. If you are looking to replace your windows I highly encourage you to check out their product.", "pics": null, "resp": null, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "102098992856754793257", "name": "Alexa Raynaud", "time": 1615713616215, "rating": 5.0, "text": "Donna Farmer was a pleasure and very knowledgeable. Highly recommend!", "pics": null, "resp": {"time": 1616096573455, "text": "Thank you for this positive rating, Alexa!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "118203059932703516811", "name": "Barbara Elders", "time": 1605641191598, "rating": 5.0, "text": "Gary Douglas was very informative and well prepared with his presentation. The cost was very affordable and with several payment options. Very pleased.", "pics": null, "resp": {"time": 1605133441435, "text": "So glad to hear this, Barbara. Thank you for your review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "103304848974705676818", "name": "Stefano Mugnaini", "time": 1597422652423, "rating": 5.0, "text": "We've had a hard time getting competing firms to even show up for a measure and estimate. Champion was responsive, communicative, answered our questions and gave what seems like a reasonable quote. We look forward to seeing the finished product!", "pics": null, "resp": null, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "104065805100319753770", "name": "nathan chance", "time": 1606053416260, "rating": 1.0, "text": "They did not do the job right! Did not install flashing or protective wrap where they were supposed to. I have a rotted out hole the size of a person and can see the sheet rock from outside. They said they can’t come look at it because they are 60 to 90 days behind. Do not use them!!! And all this water damage had brought termites!!! Thank you champion", "pics": null, "resp": null, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "112596978503264606330", "name": "Bridget Jones", "time": 1609894349179, "rating": 4.0, "text": "Gary Douglas was very professional and great with everything he showed me and my husband. Looking forward to doing business.", "pics": null, "resp": {"time": 1610138009879, "text": "Bridget, We appreciate you taking the time to leave us a positive review.   We are dedicated to providing great service.  Please feel free to reach out if there’s anything you need."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "117578301040921562484", "name": "Terrie Garner", "time": 1608168336191, "rating": 5.0, "text": "Gary Douglas was very respectful and went out of his way to help me. He fixed an issue with my windows to help until the new windows come in.", "pics": null, "resp": {"time": 1608233635323, "text": "Thank you for this positive rating, Terrie!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "114978590912605233113", "name": "Melissa Beukelman", "time": 1613838584089, "rating": 5.0, "text": "I've used champion for door replacement, patio enclosure, and now window replacement.  Very happy with quality and service", "pics": null, "resp": {"time": 1614118914198, "text": "Thank you very much for your recommendation and continued patronage! We're so glad to hear that our customer service and products continue to meet your expectations. We appreciate this review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "105066332370874812911", "name": "Phyllis Vaughan", "time": 1618859611498, "rating": 3.0, "text": "An initial visit has been made. I have paid half of the total cost of my enclosure. No one has come for further measorements or work.", "pics": null, "resp": {"time": 1619203008927, "text": "Thank you for bringing this to our attention. We apologize for the delay you're describing. Please reach out to us directly in national customer care, so we can work with you to get this taken care of as soon as possible – 513-327-7338. Thank you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "113026771512976591806", "name": "Essex Parker", "time": 1605647174173, "rating": 5.0, "text": "Miss. Robin Turner gave an excellent presentation, she was on time, and explained everything in great detail. If I decide to do business with you all I would prefer to have her come back, she was absolutely amazing.", "pics": null, "resp": {"time": 1605733999976, "text": "Thank you for posting your positive review. At Champion Windows and Home Exteriors of Birmingham, we value your time and always strive to provide fast and efficient service. We are so pleased to hear our service was provided in a timely manner."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "109037769608141846979", "name": "Allen R", "time": 1601067615233, "rating": 5.0, "text": "Champion was recommended by a good friend of ours - we have our order placed and used them based on our friends recommendation.   We look forward to seeing the finished job as we just ordered the windows .   The sales rep was knowledgeable and friendly .", "pics": null, "resp": null, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "110010647596340785898", "name": "Tijuana Thomas", "time": 1611171919757, "rating": 5.0, "text": "Gary Shult,  came to my house on time, he was very professional, he explained every detail. Very nice I love working with him.", "pics": null, "resp": {"time": 1611254733145, "text": "Thank you for posting your positive review. At Champion Windows and Home Exteriors of Birmingham, we value your time and always strive to provide fast and efficient service. We are so pleased to hear our service was provided in a timely manner."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "106438399085226248612", "name": "Joel Shults", "time": 1606148085053, "rating": 5.0, "text": "We've had all Champion Windows on our house since we remodeled it several years ago. They have worked flawlessly and been very efficient in all weather", "pics": null, "resp": null, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "107232547710366096390", "name": "Edward Holloway", "time": 1609871589573, "rating": 5.0, "text": "Robin was great at the presentation process she really explained it the best we could understand Great work!!", "pics": null, "resp": {"time": 1609893415883, "text": "Thank you very much for your recommendation, Edward! We're glad to hear that our customer service met your expectations. We appreciate this review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "105120802382963784393", "name": "Jesse Harris", "time": 1610065331909, "rating": 4.0, "text": "Gary Douglas did an outstanding job. Great presentation, great product.", "pics": null, "resp": {"time": 1610138456700, "text": "Thank you for this positive rating, Jesse!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "118218726825889191636", "name": "Leander Wilkerson", "time": 1591304479566, "rating": 1.0, "text": "First of all I want to say that the siding done by Joe and his crew looks amazing  . I really appreciate all they did.  My issue is with the completion of the gutters. I have been waiting over 3 weeks for it to be done. I have called over 4 times. Only to get a run around answer and was told that someone would call .  I haven’t heard anything yet . It’s approaching a month now . It has rained here quite often  with a lot more to come. I have had to pump and dig trenches around my house to try to keep the water out from my (crawl space) basement. It’s a losing battle. I chose this company over others for peace of mind and quality craftsmanship.  I did not expect this.  I am very disappointed and dissatisfied with this .  I went from happy to angry . Still no response or resolution .  I feel that they should not start another project until they complete a project . Smh", "pics": null, "resp": {"time": 1591358528292, "text": "Champion apologize for the lack of follow up and will reach out to the location about your gutters. Champion Customer Care"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "102793937315130999315", "name": "Todd Rapin", "time": 1615685219042, "rating": 5.0, "text": "Very courteous and informative.  Took the time to really show what Champion is about.", "pics": null, "resp": {"time": 1616096546634, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "111512351486209663473", "name": "John Eskridge", "time": 1604160620777, "rating": 5.0, "text": "Mr. Gary Douglas gave us a very professional and indepth presentation. He was straight to the point, and provided much of the competitors material for comparison.", "pics": null, "resp": {"time": 1605210342056, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "108188289629658493282", "name": "Judy Shults", "time": 1600347184955, "rating": 5.0, "text": "Fantastic windows. Installation excellent. I am so happy with my Champion Windows.\nJudy S.", "pics": null, "resp": {"time": 1600354069583, "text": "Thanks for this review, Judy!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "114021384765649346370", "name": "Bruce Hancock", "time": 1625760808607, "rating": 5.0, "text": "Bruce is very professional and was very knowledgeable.", "pics": null, "resp": {"time": 1626804791119, "text": "Thank you very much for your recommendation, Bruce! We're glad to hear that our customer service met your expectations. We appreciate this review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "108214849809398110571", "name": "Pam Custred", "time": 1602604242157, "rating": 5.0, "text": "Gary Douglas, factory rep, was very professional and knowledgeable.  Great job of providing information and supporting my decision making process.", "pics": null, "resp": {"time": 1605133382595, "text": "Thank you for this positive rating, Pam!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "114135386577580525629", "name": "Rob Bouchillon", "time": 1604689858727, "rating": 3.0, "text": "The number they gave me is a national call center. They had no answers! They are referring this back to the local office who won't call me and give me a straight answer! Here We go again!\nWe chose Champion because of their reputation and lifetime guarantee! We were pleased with the product and have reccomended them to our friends. Recently some of the Windows and door have clouded up and we called and someone came out took bar codes and said they would replace at no cost. That was almost 3 1/2 monthes ago. A few replacement windows were replaced but the rest of the Windows and door have not! I can't get management to call me and give me a straight answer. I am running out if patience! RCBouchillon", "pics": null, "resp": {"time": 1604683191563, "text": "Thank you for taking the time to give us a review. We sincerely apologize about the issues you experienced, and we hope to make this right. Please reach out to us directly in national customer care, so we can rectify this issue – 513-327-7338. Thank you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "114448919639266669695", "name": "Mark Price", "time": 1601673233538, "rating": 5.0, "text": "The salesman. Gary was on time. He was Informative and very detailed. Even though I'm seeking estimates. He went the extra mile of letting no what to expect before and after.", "pics": null, "resp": null, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "103482137387010826304", "name": "Taylor Arnold", "time": 1615714010315, "rating": 5.0, "text": "I would definitely recommend Champion. Donna Farmer was professional and very knowledgeable and a pleasure to work with.", "pics": null, "resp": {"time": 1616096663505, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "111346222140967371861", "name": "Susan Styczynski", "time": 1603734427653, "rating": 5.0, "text": "Gary Douglas very informative  and professonal. He demonstrated the quality  of the windows and how effective they are for energy efficiency.", "pics": null, "resp": {"time": 1605215378428, "text": "So glad to hear this, Susan. Thank you for your review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "108143607722147538210", "name": "Steve Crocker", "time": 1591220377873, "rating": 2.0, "text": "Windows looks good had for couples year and trim starting to come lose . Have called several times get answer machine . They answer one time and was told the service department will get back with me. That's been a couple weeks no one called.  It bad to pay all that money and get no service respond .", "pics": null, "resp": {"time": 1591272464808, "text": "Champion does apologize for the lack of communication, due to COVID 19 our service department is backed up but is working hard to respond to all request. Please reach  out to 888-395-0041. Champion Customer Care"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "107924987077714993583", "name": "Bev H", "time": 1610065323549, "rating": 5.0, "text": "Gary Douglas did a great job explaining  next steps and really worked to save us money. Thank you for caring about your customers.", "pics": null, "resp": {"time": 1610138441322, "text": "Bev, we are delighted to hear we provided a top-notch experience! Thank you for taking the time to write this review. It is wonderful to hear we were able to provide you with excellent service."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "116011064389756896517", "name": "Tracy Matthews", "time": 1625337770823, "rating": 5.0, "text": "Gary Douglas was excellent and very thorough with his presentation!!", "pics": null, "resp": {"time": 1626285660953, "text": "So glad to hear this, Tracy. Thank you for your review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "102395065776522190720", "name": "Michael Hanle", "time": 1614883472335, "rating": 5.0, "text": "Donna was the best!!   She answered every question and was able to give me great value at a great price.", "pics": null, "resp": {"time": 1615409104097, "text": "Michael, we are delighted to hear we provided a top-notch experience! Thank you for taking the time to write this review. It is wonderful to hear we were able to provide you with excellent service."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "100613202421499042155", "name": "Benjamin Bylsma", "time": 1569088572644, "rating": 1.0, "text": "I don’t know what to say about this company but beware and ask for the best installers upfront!! We had 6 windows replaced. Original installers showed up over an hour late. No call but quickly made work of removing and installing new windows. Everything was going ok at this point. After install they spay foamed around exterior of window. I had to point out a couple of places where I could still see daylight coming through which meant it wasn’t completely sealed. I was told the foam continues to expand and they were going to lunch. Came back and I pointed out same spots. They did fix it. Back on track. Metal around windows was terrible. Text their boss and showed pictures, walked outside to talk to them, just caulked it and send it. Ok, leave and I’ll complain.\nNext installers come to fix metal. I would say metal looked better but not totally fixed like I was promised. Now I have a caulking mess on my hands!! I do mean mess. I wish you could post pictures. Will see how they respond. So far nothing from my contact.", "pics": null, "resp": {"time": 1569247583332, "text": "Thank you for leaving your feedback and apologize for issues with your project. I have passed the information onto the location and they should be reaching out shortly to get this addressed. Champion Customer Care"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "112596978503264606330", "name": "Bridget Jones", "time": 1609894349179, "rating": 4.0, "text": "Gary Douglas was very professional and great with everything he showed me and my husband. Looking forward to doing business.", "pics": null, "resp": {"time": 1610138009879, "text": "Bridget, We appreciate you taking the time to leave us a positive review.   We are dedicated to providing great service.  Please feel free to reach out if there’s anything you need."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "110879577718202113979", "name": "Melanie Reynolds", "time": 1616158422459, "rating": 5.0, "text": "Robin was incredible. Very knowledgeable and professional. Had a great experience.", "pics": null, "resp": {"time": 1616525772905, "text": "Thank you for this positive rating, Melanie!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "108113573243478144480", "name": "Gary Shults", "time": 1579920112577, "rating": 5.0, "text": "My Champion window installation was very professionally done. Keith took a lot of pride in his work and it showed in the final result.\nThe windows have had a great impact on our utility bills and the comfort of our home.\nMy wife loves the beauty and ease of use of the Champion windows.", "pics": null, "resp": {"time": 1580133691136, "text": "Thanks very much for this review!  We’re glad to see everything met your expectations. -Champion Customer Care"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "108143607722147538210", "name": "Steve Crocker", "time": 1591220377873, "rating": 2.0, "text": "Windows looks good had for couples year and trim starting to come lose . Have called several times get answer machine . They answer one time and was told the service department will get back with me. That's been a couple weeks no one called.  It bad to pay all that money and get no service respond .", "pics": null, "resp": {"time": 1591272464808, "text": "Champion does apologize for the lack of communication, due to COVID 19 our service department is backed up but is working hard to respond to all request. Please reach  out to 888-395-0041. Champion Customer Care"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "110022019108391531598", "name": "Julian Meloni", "time": 1598968336204, "rating": 5.0, "text": "Unbelievable company with the highest quality products around and at a great price. The price you pay for this quality is the greatest and it kills any of the other competitors products I’ve seen.  Best life time warranty there is, and the sales rep and installers are the best in the business. This company has been around for 66 years and I see why. I recommend this company to anyone doing home exterior projects", "pics": null, "resp": {"time": 1551127278728, "text": "Thank you Julian for sharing your positive experience with Champion.  We will share your review with the local office."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "106196461253215548815", "name": "Jack Catlett", "time": 1627040087152, "rating": 5.0, "text": "I have been working with Doug Shults and Doug Douglas and am very disappointed with their work. I have used Champion in the past and wanted to use them again with a new project. However, they do not meet deadlines and don't follow-up on problems. Will not use them in the future", "pics": null, "resp": {"time": 1608233575466, "text": "Thank you very much for your recommendation and continued patronage! We're so glad to hear that our customer service and products continue to meet your expectations. We appreciate this review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "115722861126912343248", "name": "Sara", "time": 1572780986233, "rating": 5.0, "text": "Top notch service and products! Recently had 20 new windows installed in our home by this company! The process was smooth and easy starting with Gary, the sales rep followed by Jerod, the install manager. Both were very professional. Tim and Shayne installed the windows in a timely manner.  They were very friendly, organized, and left zero mess. You can tell they took pride in their work. We can already tell a big difference in temperature inside our home these last few very cold days. Just being able to open the windows is such a treat as well! We highly recommend this company.", "pics": null, "resp": {"time": 1572874392300, "text": "Thanks so much for taking the time to leave this great review. Enjoy your windows! -Champion Customer Care"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "115985492465495773502", "name": "Ronnie Laymon", "time": 1584908584032, "rating": 5.0, "text": "My wife and I replaced all of our windows in our Montgomery Alabama home.\nInstall Supervisor Jarod McNeal and 2 other guys named Jacob Hubbard and Michael Little were punctual, very knowledgeable and above all honest.\nChampion Windows are extremely lucky to have these guys working for them.You will not be disappointed if any of these guys are on your install team.", "pics": null, "resp": null, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "113439081813004235000", "name": "Kayla Absher", "time": 1556197334186, "rating": 5.0, "text": "We ordered our Champion Windows and they were installed 6 weeks later which was less time than we expected.  Bo was our salesman and he was exceptional at communicating and answering any and all of our questions.  The installers (Tim and Shane) who came to our house worked with our schedule so that we did not have to take any additional PTO.  At our home they were courteous, professional, and fun to have around.  Since our installation, we have not had to touch our AC or Heat as our home has remained comfortable.  We LOVE our windows and new back door!", "pics": null, "resp": {"time": 1556282998814, "text": "Thank you for taking your time to share your positive experience Champion.  We will be sure to pass your comments on to the local branch."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "116078127732650116209", "name": "Robin Turner", "time": 1599745773400, "rating": 5.0, "text": "Not only was their sales experience incredible but with them making and installing their own windows they are so efficient!", "pics": null, "resp": null, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "104683246749273217261", "name": "Sandy Chatfield", "time": 1618537570902, "rating": 5.0, "text": "Very thorough presentation.", "pics": null, "resp": {"time": 1619046577411, "text": "Thank you for this positive rating, Sandy!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "108236530995421965328", "name": "Mike Frohlich", "time": 1543361495335, "rating": 5.0, "text": "Had Champion windows installed last week, also had a service call for an unfortunate hole in a screen. The installers Tim and Shane were exceptional, very professional, polite and courteous. Very pleased . The service call was handled quickly and professional as well. The service gentleman Jerry was also exceptional, professional and polite. Great job and nothing but praise to CHAMPION WINDOWS.\nKEEP UP THE OUTSTANDING WORK.", "pics": null, "resp": {"time": 1543497961616, "text": "Thank you Mike, for taking your time to share your experience with Champion.  We will pass your comments on to the local branch."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "110641395704000755502", "name": "Ben Evans", "time": 1601081920258, "rating": 1.0, "text": "Had an appointment, but after there was no communication. You do not want to use this company if you’re expecting conversation including a quote about any work at your property.", "pics": null, "resp": {"time": 1601324743969, "text": "Ben , we apologize for your negative experience with us. We will use your feedback in order to improve going forward. Thank you for alerting us to this issue."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "113348334731939085426", "name": "Rebecca Hassee", "time": 1475605867321, "rating": 5.0, "text": "Thrilled with the windows we just had installed from Champion of Birmingham. The installers were nice and respectful and did a great job cleaning up. The windows make our house look so much nicer, will be easy to clean, and decrease the noise of the outside street! I feel great that they have a lifetime warranty if anything were to happen to them!", "pics": null, "resp": null, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "106241834665240872500", "name": "Carla Gibson-Majors", "time": 1558355303398, "rating": 5.0, "text": "I placed an order with Champion Windows and they were installed 5 weeks later.  Bo Smith was my salesman and he was awesome in explaining all the window options, benefits, warranty and answered all other related questions.   The installers were on time, professional  and courteous.   The job took approximately 4 hours and they cleaned up and removed all exces supplies on their way out the door.  Since the installation, my electric bill has reduced by 50% and the temperature in my condo remains constant with adjusting the thermostat.   Also, my windows look great and has added to the condo's appeal.  Thank you Champion Windows for this outstanding service.", "pics": null, "resp": {"time": 1558440464100, "text": "Thank you for taking your time to share your positive experience with Champion.  We will be sure to pass your comments on to the local branch."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "107187462945340276406", "name": "Kelsey Parrish", "time": 1563932193421, "rating": 4.0, "text": "Update: guys came out to address last set of issues. Corey in service is so polite and professional; he truly cares about fixing any issues. Ultimately the project looks great. I wish we had handled things a little earlier in the process but you live and you learn. I can recommend Champion but as with any company, double check their work and have them address it right away.\n\nOriginal edit: Service managers came out and reviewed issues with us after making a recent complaint (gave 1 star a few weeks ago). Champion has nice products but make sure you point out mistakes before the crews leave!  We feel bad for having them come out so many times to fix a few major (crooked siding on two windows, etc) and many minor (bad caulking in spots, corners not lining up nicely, etc) problems but we want to be able to be happy that Champion did our siding and windows.\nAfter the last set of work is done I may change to higher rate.\n\nOriginal post has been deleted due to all the work that’s been put in recently to make sure the job was done right!", "pics": null, "resp": {"time": 1562174107683, "text": "We are sorry you are having issues and would like to speak to you about those issues.  Can you Please provide your contact information or yu can reach us at 888-395-0041 National Customer Care."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "100613202421499042155", "name": "Benjamin Bylsma", "time": 1569088572644, "rating": 1.0, "text": "I don’t know what to say about this company but beware and ask for the best installers upfront!! We had 6 windows replaced. Original installers showed up over an hour late. No call but quickly made work of removing and installing new windows. Everything was going ok at this point. After install they spay foamed around exterior of window. I had to point out a couple of places where I could still see daylight coming through which meant it wasn’t completely sealed. I was told the foam continues to expand and they were going to lunch. Came back and I pointed out same spots. They did fix it. Back on track. Metal around windows was terrible. Text their boss and showed pictures, walked outside to talk to them, just caulked it and send it. Ok, leave and I’ll complain.\nNext installers come to fix metal. I would say metal looked better but not totally fixed like I was promised. Now I have a caulking mess on my hands!! I do mean mess. I wish you could post pictures. Will see how they respond. So far nothing from my contact.", "pics": null, "resp": {"time": 1569247583332, "text": "Thank you for leaving your feedback and apologize for issues with your project. I have passed the information onto the location and they should be reaching out shortly to get this addressed. Champion Customer Care"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "103490226511400087530", "name": "C Roy", "time": 1595451461968, "rating": 1.0, "text": "I contacted Champion to get a quote for new siding to be installed on the home I am purchasing. They were unwilling to look at the home or provide any information until after the home purchase is complete. The cost of doing repairs is a consideration in the purchase of the home. Shay was very unhelpful and unable to answer my questions regarding their unwillingness to provide me with a quote. I will be hiring another company.", "pics": null, "resp": {"time": 1595524690558, "text": "C Roy, we want to extend an apology for the experience you had. There are certain protocols that we have in place. We apologize for the inconvenience and we will make sure that we take into consideration your feedback!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "113471215107228929941", "name": "Audrey Brown", "time": 1612999743913, "rating": 5.0, "text": "Very professional reasonably priced", "pics": null, "resp": {"time": 1613154517039, "text": "So glad to hear this, Audrey. Thank you for your review!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "109406431530249334726", "name": "Juice Jr", "time": 1624405279313, "rating": 1.0, "text": "Horrible service dept", "pics": null, "resp": {"time": 1625064073855, "text": "John, We want to sincerely apologize for your negative experience with us. We would like to speak to you to learn what exactly happened. We want to make things right. Please call us at (513) 327-7338. We look forward to hearing from you!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "105801829124965314437", "name": "Earl Pike", "time": 1625769885549, "rating": 5.0, "text": "Joe was very professional.", "pics": null, "resp": {"time": 1626894317516, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "104128360274769654866", "name": "W. Shipman", "time": 1566860610446, "rating": 1.0, "text": "We had one of the factory representatives to come by our house to give an estimate on a sunroom. Almost immediately, he began to bad mouth the competitors - very unprofessional.  His job was to convince us why we should do business with Champion ... period. That was the FIRST MISTAKE.\nWe were not 100% on board with the decision to work with Champion and was told we could give our final decision by Monday (the visit was Wednesday evening). Now... with that being said, nothing was 'official'. However, the Rep took it upon himself to pull my husband's credit report WITHOUT permission. He never indicated he was requesting this information otherwise it would have been a immediate NO!  Fortunately, I caught him before he was able to pull the other two credit bureaus. He informed us that these pulls were soft pulls when in fact, they were hard pulls against his credit report. I was livid!!  This was the SECOND MISTAKE.\nLastly, I sent a CC email to AHOLSOMBACK regarding my cancellation and requested a call back to talk about the visit. I never received a call. I cannot speak on the quality of the work. However, I can speak on the service. That alone is reason to not recommend this company.", "pics": null, "resp": {"time": 1566910804566, "text": "We are very sorry for your experience with Champion.  We have sent the information over to the District Manager to have teaching experience with the Sales Department.  Thank you for reaching out and feel free to call us at 888-395-001  National Customer Care."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "103696452643689709504", "name": "Emma Sartin", "time": 1537552680816, "rating": 1.0, "text": "Absolutely the worst experience and customer relations I have ever seen with a company. After paying and getting the measurements, it took 2 months for the windows to be installed. During this time there was 0 communication. We tried calling and left several messages with the receptionist, but no one ever returned our call. Finally, we called our sales rep and complained. Suddenly, the windows were ready to be installed.\nThe day of the installation, the company sent two workers who told me they would be finished by 1. The workers showed up an hour after we were told they would. After our old windows were removed, I overheard them talking about how our windows weren’t measured correctly. When I asked what was wrong, they assured me everything was fine. Later, the workers and their boss were screaming at each other over the phone about the correct way to install the windows, the result of which was another working coming to explain the correct way to install and why the windows maybe looked too small. At 4:45, I informed the workers that I had to be somewhere at 5 pm and was already going to be late. They left, and promised to return the next morning at 8 am to finish the installation. The next day my husband stayed home from his job to be there to let them in. At 9:15 they arrived and finished the installation.\n\nThe overall quality of the windows was fine, but I have never dealt with more unprofessional people in my life. We’re still waiting for our gutters to be installed (we originally measured everything the week of July 4th). Would not recommend this company to anyone.", "pics": null, "resp": {"time": 1537816732978, "text": "We’re sorry for this experience with communication and installation, Emma. We take your comments seriously and will work with our staff to improve going forward. Please let us know if we can be of any further assistance to you. Thank you. -Champion Customer Care, 888-395-0041"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "112453681103498072990", "name": "Bobbie Halvorson", "time": 1616612145716, "rating": 5.0, "text": "Donna was great!", "pics": null, "resp": {"time": 1617393661201, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "103555992256607174580", "name": "shirin kaynejad", "time": 1626910131909, "rating": 5.0, "text": "Friendly  and professional.", "pics": null, "resp": {"time": 1627059167330, "text": "Thank you for this positive rating, Shirin!"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "109211583115028567466", "name": "Trudy Buckelew", "time": 1551407830663, "rating": 5.0, "text": "My husband and I were very impressed with the windows that Bo presented to us and we are looking forward to having our Champion windows installed!", "pics": null, "resp": {"time": 1551706942560, "text": "Thank you for taking your time to share your positive experience with Champion.  We will pass your kind words onto Bo and the local office."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "100032426459898671243", "name": "Sam Monk", "time": 1553882607708, "rating": 1.0, "text": "Hell will freeze over before I do business with Champion again. The saleman showed up on time and was more than happy to secure a 50% deposit. The length of time it took for the window to ne manufactured was about what was told us up front. It's been down hill since the install, which was not completed initially. Parts that need to be reinstalled are lying around in my kitchen. My \"Thursday\" appointment was scheduled for a Friday. It is now 3/29. The original install was 3/14. I had a 10:30 AM appointment for today and stayed home to get it handled. It is now 11:00 and I was told when I called that \"the guy who was going to handle that didn't come it today.\" I now wait for another installer, who is apparently 50+ miles away, to \"call me.\" It is a shame how a company with a good product can ruin its reputation my \"don't give a damn\" service. CHAPTER TWO: 1:00PM: Well, a nice young man showed up not knowing what needed to be done to complete the installation. I an going from frustrated to livid. Installers (not finisher) will need to return. WIll call and make appointment. The way it has gone so far it will be another 2-3 weeks - - - if then. Chapter 3 will be added as apprpriate.", "pics": null, "resp": {"time": 1553885412411, "text": "We are sorry your are having issues and would like to speak to you about those issues.  Can you please provide your contact information or you can reach us at 888-395-0041.  Thank you National Customer Care."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "101614192048751406263", "name": "Paul Godfrey", "time": 1611256475550, "rating": 5.0, "text": "Pleasure to work with", "pics": null, "resp": {"time": 1611334989660, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "113439220089684992023", "name": "Dana HARDEN", "time": 1537361902216, "rating": 1.0, "text": "Worst local and national customer service EVER. Used them to replace all the windows and 2 sliding doors in my house last year.   Windows are not working as promised and the door locks are not properly working. I have called and spoken with latest 5 people and left messages for over a month and a half trying to get someone to come check them and no one will help!! They just keep giving me the run around. If I could have given them zero stars I would have. Shop around before you use this company.", "pics": null, "resp": {"time": 1537387063953, "text": "We sincerely apologize for the trouble in getting a service appointment, Dana. We have followed up with the local office to ensure your concerns are addressed and earn a better review. Please let us know if we can be of any further assistance. Thank you. -Champion Customer Care, 888-395-0041"}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "111016873758801316115", "name": "Tameka H", "time": 1618438656945, "rating": 4.0, "text": "Too expensive!!", "pics": null, "resp": {"time": 1619038502661, "text": "We appreciate your comments. We do our best to provide competitive pricing while maintaining a high level of service and products for our customers.  We're sorry that our pricing didn't meet your budget, please keep an eye out as we run promotions throughout the year. We hope to earn your business."}, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "109123005756155583519", "name": "Wanda Smith", "time": 1605057010046, "rating": 5.0, "text": "Gary Douglas was great!!!", "pics": null, "resp": null, "gmap_id": "0x888923a9049d4a97:0x8e1732085b1f3cd"}
{"user_id": "113328786324309345035", "name": "Peggy Castenholz", "time": 1602540442140, "rating": 5.0, "text": "Highly recommend John Paul and the whole team at Island Enclosures. They were professional, timely, communicative and use high-quality materials. Always available every step of the process in creating our beautiful, outdoor screen enclosure,  built-in barbecue kitchen and installing the indoor blinds.   Enclosure withstood Sally with no damage. Definitely will use again on our next project!", "pics": null, "resp": {"time": 1602541997288, "text": "Thanks Peggy.\nYou guys are very gracious.  Thank you for being outstanding customers to work with."}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "117683184607508508493", "name": "Chase Beason", "time": 1588345900731, "rating": 5.0, "text": "Great company! I have had several projects completed by them, and I have been 100% satisfied every time. There were a couple of minor adjustments that needed to be made after the initial installation, and on both occasions, the owner, John Jones, had them corrected the very next day with absolutely no hassle. Their work is beautiful, and they will also work you in their schedule as quickly as possible if needed. The installer, Greg, is also great. I highly recommend this company for any outdoor projects you have!", "pics": null, "resp": {"time": 1588602141647, "text": "Thank you for your kind review!  We appreciate it."}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "104413765980263553441", "name": "Michael Templer", "time": 1609890663978, "rating": 5.0, "text": "Very happy with the new windows they installed. Excellent follow-up support.", "pics": null, "resp": {"time": 1609892717067, "text": "Thank you Mike.  Pleasure doing business with you!"}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "110696385860215309524", "name": "John Kendall", "time": 1599930370225, "rating": 5.0, "text": "Anything you need done these are the people to use.  Great local business that does things the right way.", "pics": null, "resp": {"time": 1599936233348, "text": "Thanks John!  You be safe out there."}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "105172896549507867595", "name": "Melody Winborne", "time": 1607526453625, "rating": 5.0, "text": "Great work", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPsQdO6VB8LwL_h7rBj64wkLZEKkLwFLtC974BG=w150-h150-k-no-p"]}], "resp": {"time": 1608655822233, "text": "Thank you!"}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "103044573418217358876", "name": "Brandi W", "time": 1553972877009, "rating": 5.0, "text": "They constructed a very nice patio, firepit, and outdoor kitchen area for us with a screen enclosure close to a year ago.  OUTSTANDING customer service.  John Paul was always available to answer any questions or concerns and the construction quality is fantastic.  Would highly recommend!", "pics": null, "resp": {"time": 1553976011769, "text": "Hi Brandi,\nThank you for your review.  It was a great pleasure to work with you.  All of at Island Enclosures, wish you and your family all the best."}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "107994520461299534215", "name": "Jackie Clark", "time": 1548534729376, "rating": 5.0, "text": "Staff was very friendly and knowledgeable. Products are top notch!", "pics": null, "resp": {"time": 1548870150070, "text": "Thank you for the review, and your repeat business!"}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "109805676566394538299", "name": "Robert Reynolds", "time": 1531922591449, "rating": 5.0, "text": "Very professional and I highly recommend. All projects started and completed on time.", "pics": null, "resp": {"time": 1531942138852, "text": "Thank you for the nice review! We look forward to working with you on future projects."}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "101988223974105790574", "name": "Decie", "time": 1622085049945, "rating": 5.0, "text": "Isbell handled the spray foam insulation, vinyl, and gutters on my new construction. The cost was fair and the work was quick and accurate. Keith did a great job sharing information and getting the work done in a timely manner. Steve did a hell of a job on the vinyl, and left not a single shred of material on the ground at the end of each day. The spray foam is one of the best decisions that we made for this house. The black gutters against the white house look awesome. Good job guys!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "108126330685469041672", "name": "Chris Kozak", "time": 1622668629859, "rating": 5.0, "text": "Keith and his crew put a deck next to our above ground pool.  It surpassed our expectations, and the craftsmanship is outstanding.  We are beyond pleased with their work.  We had a few small adjustments but thanks to the quick communication and responsiveness to our changes by Keith, the project finished in a timely manner and surpassed our initial vision of what it was going to look like.  We will call Isbell and Keith when we decide to do our siding and patio covering.  Thanks Keith and Isbell for a professional job well done!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "100627247770266105638", "name": "Hayden Reed", "time": 1618968896937, "rating": 5.0, "text": "I recently had some siding and exterior trim work done on my house, and Isbell did a fantastic job. Working with Keith was easy and they delivered on time at a great value. They went above and beyond to ensure every cap was clean and square and even readjusted my screen door in the process. Would highly recommend and will be using Isbell again in the future.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "111070830124720769658", "name": "Lynda Fields", "time": 1627181807136, "rating": 5.0, "text": "Isbell siding made my home look better than new!! I'm so proud...thanks!!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "106566701466114873525", "name": "Wanda Littleton", "time": 1623239774975, "rating": 5.0, "text": "Twice we have used Isabel services for window replacement and both times we were very pleased with the job.  They use quality products and install them with care.  I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "118283339296880513272", "name": "Robert Sabbagh", "time": 1622925359285, "rating": 5.0, "text": "Isbell siding built us a  fabulous top for our existing deck. The top was good looking and strong, enough for a good size man to walk on the top of it with no regret, Mat done all the work himself and was very polite and friendly during all his work. Keith Kennemur  gave us a great quote and came by  a lot to check on the progress in building our new top. If you decide to build a top for your deck ask for the Sana Fe kit. you will love it as we do. Bonnie and Bob Sabbagh  Cottondale, AL", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "116222470159424450314", "name": "Captain Chris", "time": 1619116778528, "rating": 5.0, "text": "Did a great job on replacing some windows. Keith is a great guy to have come out! Fast service and windows look great!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "112923110968230482640", "name": "Patricia Atkins", "time": 1620916405087, "rating": 5.0, "text": "Outstanding and excellent quality work on my screened in porch and patio cover. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "114751050061870455830", "name": "RJ Thompson", "time": 1618318937951, "rating": 1.0, "text": "The absolute worst, rudest business experience I have ever seen. Isbell Services installed the roof on my home and I called to set up an inspection after I had two leaks that damaged my sheetrock. The owner contacted me and stated that I would have to find someone else, they don't stand behind their product and hung up. I would be extremely cautious using Isbell for ANY service.", "pics": null, "resp": {"time": 1619098657439, "text": "This review is very inaccurate. The house he is speaking of was roofed by Isbell for another home owner 8 years ago. He wanted us to come and do repairs for free and was told the warranty was nontransferable. Apparently he did not like the answer. Also I (Jeff Isbell) am the owner of Isbell Services and I would never hang up on a customer Write or Wrong."}, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "110952791891286604713", "name": "Rebecca Parris", "time": 1587144382009, "rating": 5.0, "text": "This is our 2nd house that we have used them for gutters the crew did a awesome and flawless job.  Can’t wait for the rain!!! 😊", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "108746358965586211707", "name": "Christi Wood", "time": 1573398260422, "rating": 1.0, "text": "Isbell Services was the roofing contractor for my townhome complex built 3 years ago.  We have had significant roof leaks this fall, and Isbell evidently offered only 12 months of warranty on their roofing work.  what good is a 30 year shingle if it's installed incorrectly, and the installer doesn't stand by their work?!!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "103183970892002056954", "name": "Sibyl Fondren", "time": 1564533343616, "rating": 5.0, "text": "It took a few days to come out for the job but I later understood why. They must be in high demand due to their impeccable work and customer service! They had the job done (replacing brick with vinyl siding over a garage with drooping lintel) efficiently and professionally. A few bricks from another area of the facade came off after repair and installation. They came and repaired it a couple of days later without a call having to be made. Our family will recommend and definitely use Isbell again for any home repairs!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "115937575270344792491", "name": "Jason Polancich", "time": 1578344002271, "rating": 1.0, "text": "Another example of an unreliable local Tuscaloosa home improvement company. Had them out week before Thanksgiving for a quote to replace/repair gutters on a historic home in downtown Tuscaloosa. Was told Id have a quote out by the next week and they'd be able to start within a couple weeks. Two weeks went by and no quote. I called them, was transferred to a rep named Mike \"who handles all the gutters.\" He told me he'd follow back up with me by the afternoon. Now, first week of January, called back and got mike who said \"We're not going to be able to help you on that job.\" Im guessing it was too low a cost threshold for them, but it would have been very nice to have known that back in November. Great people. Don't advertise gutter repair/replacement if you dont actually do the work!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "112249114710625384638", "name": "Joseph Mcguire", "time": 1548188748706, "rating": 5.0, "text": "I'm a grad student who just bought their first home. Being incredibly busy during working hours, Isbell was super easy to work with via email and text to arrange for gutter installation. They color matched to my paint without my even thinking about it, were quick, and overall did a great job.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "116226329867618313666", "name": "Daniyell Henderson", "time": 1588355732445, "rating": 5.0, "text": "Cause answer all your questions they do a great job very good customer services", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "115967766411968367183", "name": "Joe Fey", "time": 1480438575321, "rating": 5.0, "text": "We offer a wide range of Home Improvement amenities. From Siding, Roofing, Gutters to Windows.and Insulation. We have great salesman who promptly and properly explain what our services are. Also we have very dedicated work crews who are diligent and prepared to get the job done in an efficient and expedient manner. Call us today to make your home hey more efficient and good-looking place to live", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "102877399335547383643", "name": "Ray Miller", "time": 1570787879778, "rating": 5.0, "text": "They replaced some soffits, fascia and gutters after tree fell and damaged house. i was quite pleased with their work and their price. Their workers were courteous and knowledgeable of what they were doing. They got in and made  repairs quickly.  They are in demand so you may need to wait a week or two until they can get to you, but for the quality and price it is worth being a little patient. I will definitely call them again should the need arise. I do recommend them if you need their services.\n\nI had Isbell Insulation come out again this week and add a board and batten siding product to part of the front of my house. Frank and Jeff came in the morning and work was completed by lunch time. I could have not been more pleased with their quality of work and professionalism. These technicians really take a lot of pride in their work and it shows. This product has about half inch insulation rigid backing that makes it more solid. Looks like actual wood when driving up to the house. It matches other wooden board and batten we have on front of our house. I was tired of painting and replacing weather worn boards. We ordered color that matches the paint we have on the house. No more on ladder for me on this particular wall of the house. Once again i do recommend Isbell. Really nice technicians that do a great job. As other time price i believe was real reasonable.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "118167985337248201627", "name": "Raymond Milner", "time": 1594047231591, "rating": 1.0, "text": "Will not return calls after job is completed when customer is not satisfied", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "108404041661807532146", "name": "Slow and Curious !", "time": 1566329675341, "rating": 2.0, "text": "Did not get any work from this company but the guy I talked to on the phone was terrible with customer service, cost them my business forsure. Asked me when I would be free to have him come out and give me a quote, I responded 3pm - and after and he could not fit that into his schedule, anyday of the week.\n\nNo problem I will find someone else, and I did.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "118246049910762128807", "name": "Keith Kennemur", "time": 1562339475987, "rating": 5.0, "text": "Isbell put gutters on my pole barn house I built. It’s a metal roof on an 8/12 pitch. So the water flies off. The 6” gutters handles all the water on the first big rain I had.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "115100684069270389072", "name": "Kimberly Davis", "time": 1478307310155, "rating": 5.0, "text": "Thank you, Isbell Services, for doing such a great job installing my new roof and vinyl siding. The work was done in a very timely and professional manner with \"doing the job right\" at the top of your list. Your company provided me with the best price, the workmanship was of the highest quality, and most importantly you always stand behind your work. I will personally recommend your services to all my friends and colleagues.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "110509938166525089245", "name": "Julie Salter", "time": 1352825011284, "rating": 5.0, "text": "The guys at Isbell were great to work with for our roof repair. We got someone out to our house really quickly and they were able to repair the roof for us that week. This company was easy to work with and I would use them again!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "113280136718524382911", "name": "Joey Barnett", "time": 1555952085818, "rating": 1.0, "text": "I’ve heard good things about the work that they do, but I didn’t make it as far as to see their work for the lady that answered the phone. Very rude, short, and demeaning.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "112548653086400186821", "name": "Kelsey Williams", "time": 1556988502165, "rating": 5.0, "text": "Super easy to work with and did a fantastic job!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "115247561322815886592", "name": "Laney Hamner", "time": 1478612370544, "rating": 5.0, "text": "The men at isbell were a pleasure to work with. They were very considerate of what I wanted. I plan to use isbell again in the future. I will be recommending them to all my family and friends.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "104694932271875376638", "name": "Billy Morris", "time": 1609861531861, "rating": 4.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "105892217351996760270", "name": "James Fields", "time": 1596841437049, "rating": 5.0, "text": "Quality Service", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "114069710582244853219", "name": "Ailie Inc", "time": 1438723936550, "rating": 5.0, "text": "Work done with integrity...", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "114854596525958879428", "name": "wolf lonnah", "time": 1495456585529, "rating": 5.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "110006032525000737977", "name": "Kelli Taylor", "time": 1628048383439, "rating": 5.0, "text": "I built my dream home with a certain look in mind. I credit Isbell Services with working outside the box, envisioning each detail with me and bringing my dream to fruition! The Sales staff and each employee was very professional and always helpful. I can honestly say, when Frank completed the vinyl and fiber cement around the perimeter of my home, there wasn’t a punch list. Literally, everything is absolutely perfect! Selecting Isbell Services to do work on my new home was the best decision I made throughout the building process!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "102314361608215318357", "name": "Horace “Boogie” Copridge", "time": 1628035680660, "rating": 4.0, "text": "I didn't use their service; they recommended me to another agency, sense they were booked for several days.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "118263876092754335473", "name": "Betty Clemens", "time": 1621371416992, "rating": 5.0, "text": "This company rescreened 27 of my screens on my house, they did a fantastic job, in a timely manner and they were very professional, the price was very reasonable, and I will definitely use their service again.\nThank you so much for everything 😊", "pics": null, "resp": {"time": 1621374997514, "text": "Thank you for your review! We’re so happy that you’re happy! Thanks for choosing us to help you with your home!"}, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "111905505880968047180", "name": "Stefan Bowers", "time": 1623856652893, "rating": 5.0, "text": "Great work! Had our back patio screened in and it looks great!", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "116459841710032910471", "name": "Mari C.", "time": 1618779120634, "rating": 5.0, "text": "BLT, INC replaced my broken window screen in no time at a very reasonable price. I highly recommend them.", "pics": null, "resp": {"time": 1618849058235, "text": "Thank you for your review! We appreciate your business."}, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "108828007058460682094", "name": "Keisha B.", "time": 1595340368578, "rating": 5.0, "text": "Brian came out to give me an estimate on the cost of installing a screened in porch. He was honest and alerted me to issues I should resolve before having the porch built. It's rare that you encounter people that operate with integrity even when it will potentially cause them to lose business. I highly recommend BLT and look forward to doing business with them at some point in the future.", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "110425178175255256057", "name": "stephen story", "time": 1591666845131, "rating": 5.0, "text": "Very knowledgeable. They did a great job on a decommissioned hospital to nursing home renovation job I did in Greensboro Ga.30+ very large commercial storm windows with screens. Every one fit like a glove. I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "106773151138329701796", "name": "Kavita Kumar", "time": 1594996196465, "rating": 5.0, "text": "We had our screened porch converted to a sunroom. Brian and his crew did a great job! We are enjoying this space so much now that we can use it year round. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "106310424474730705458", "name": "Freeman I", "time": 1569285826624, "rating": 5.0, "text": "I highly recommend this company! I wanted a screen room and chose BLT Inc over three other companies. I ultimately decided on BLT Inc and I am so glad I did! They were responsive and highly professional. Additionally, they had my screen room installed within a week. The individual who installed my fence even looked at the screen room and indicated, \"they did a great job on your screen room.\" BLT installed an aluminum screen room enclosure with pickets. The pickets look great are very professional. I highly recommend everyone install the pickets. They look very fashionable and are a great addition. Based on my experience, I would have made a mistake if I would have selected another company. Again, I highly recommend.  Thank you BLT!", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "115944594081108836265", "name": "Dale Kelly Olguin", "time": 1565381420054, "rating": 5.0, "text": "I highly highly recommend Brian and his crew from BLT to do any form of screens on windows and screened in back porches. He did both on our house. It was worth every cent. His crew was professional, courteous, respectful, and polite. They took there time and did quality detailed work. You will not be disappointed. Brian is easy to get a hold of and will quickly return your calls. The whole process from measurements to ordering the supplies to the install was just shy of 4 weeks.", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "110086567894151896705", "name": "Erin Collins", "time": 1562158893149, "rating": 5.0, "text": "We bought a home that did not have screens for any of the windows, including those on the enclosed porch.  BLT came and measured each window, made the screens offsite and returned to install them.  Flawless fit, good turn around time and friendly service.  It was a bit pricey since I chose to have them come out and measure rather then do the measuring myself but it was worth it.", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "110717720209926167501", "name": "Christine Marsh", "time": 1568472704884, "rating": 5.0, "text": "Had a fantastic experience with Brian Allen and the rest of the BLT team!  Highly recommend and definitely will be back for additional projects!", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "103063337845103458139", "name": "BLT INC Home Improvements", "time": 1551720339193, "rating": 5.0, "text": "Great job on our sunroom. Very professional. All the guys were polite and they cleaned up everything really well.", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "114545217947767516679", "name": "Kevin Kimbrough", "time": 1574803870796, "rating": 5.0, "text": "Good friendly reasonable service. For glass, windows things give them a shot.", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "105357836224668797821", "name": "Carla Holder", "time": 1531439757399, "rating": 5.0, "text": "This is a great place to get replacement screens or get screens redone. Price is good and so is their work.", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "105849336326780805006", "name": "Antoinette Mitchell", "time": 1544345737140, "rating": 4.0, "text": "Professional Team and outstanding work! Highly Recommended!", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "106391552230202345366", "name": "lady lovelace", "time": 1488836329439, "rating": 1.0, "text": "Employees yelled at us from their work truck. Rude! Definitely would not want in or near my home !!", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "104939620394435081758", "name": "Harry Hall", "time": 1575214448403, "rating": 5.0, "text": "Excellent builders!", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "107922539234017508327", "name": "Brian Allen", "time": 1502824378796, "rating": 5.0, "text": "The single star review was not from a customer of ours.  Sorry for someone else submitting a review about BLT Inc.", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "100852349437855497285", "name": "Curtis Motes", "time": 1622154472623, "rating": 5.0, "text": "Good hard-working crew", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPxq2O3rYsiuR4L40hpGU-FKgEOrLaNGECYeOC8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPLfz9gU4rbFutzgW3xV9ii57Md3VVvwsyzbdLW=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "104601492673690281172", "name": "Keith Cooper", "time": 1611963973939, "rating": 4.0, "text": "They get the job done and an honest man can still get a contractor I think that's pretty good thing", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "116946694833052408025", "name": "Leslie W", "time": 1501260374323, "rating": 5.0, "text": "It was a pleasure to work with Pickett Construction. I have a small loft that needed a new kitchen. Josh and his team came up with several different ideas on how to best maximize the space, while still giving me the features that were most important to me. They were very flexible and responsive to me and to the changes I wanted made along the way. Josh stayed in touch throughout the job and all was completed on time. I appreciated the fact that I felt like a true partner in this project. My kitchen is beautiful and it's clear that they paid close attention to every detail. I would highly recommend working with Pickett Construction, not only for the creativity and quality of work, but for the high level of customer service provided every step of the way. I love my new kitchen and so does everyone else who sees it!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPTihM6SSLwxiKd5jRX2F-Idmi9Khr-ri420sCv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPyLTlv6rN8AEEl4ASx8-6Kvdm5-HBBsAnziFup=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMOIMgvkF_wIOJJxGza7PMRhfKYeloBu8vxUpVU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "112271668066397470018", "name": "Robert Allen Clark", "time": 1611027778024, "rating": 1.0, "text": "When did I the 85%owner Robert Allen Clark there ....", "pics": null, "resp": {"time": 1611065890843, "text": "We don't have anyone by your name in our records. We are Pickett Construction in Alabaster, Alabama. I think you might have meant this review and rating for a different company. If this was meant for us, please give us a call to explain further. (205)620-1798. Thank you"}, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "117512965993065586282", "name": "Mike Weathers", "time": 1608730673281, "rating": 5.0, "text": "You want find a more committed boss that will make the job rite no matter what it takes", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "103108801217104623140", "name": "Jessica Mccain", "time": 1570123904736, "rating": 5.0, "text": "We used Pickett Construction to remodel our bathroom and kitchen. Pricilla, our salesperson and designer, did a great job helping us get exactly what we wanted. The workers were pleasant, no problems having them in our home. They always left things clean, telling us what time they would return in the morning. We would absolutely recommend Pickett Construction for anything you need to have done in your home. And we will call them again for any future renovations.", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "106454038126055103281", "name": "Wendell Rotenberry", "time": 1558360030165, "rating": 5.0, "text": "We've used Pickett Construction for 3 different projects. They keep prompt appointments and maintain great communication throughout the project. Workers are great craftsmen and friendly. We will use them again for our future projects. The best contractor is Shelby County!", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "111589609259784975848", "name": "Chuck Tanner", "time": 1588729759280, "rating": 1.0, "text": "This is the poorest excuse for a general contractor I have ever seen.  They do not have the skills nor the staff to perform any construction project up to any acceptable level of standards.   I have been around these construction trades for 50 years and they are not managed nor staffed.  If you opt to do business with them make sure you have an attorney draft a contract and require them to post a surety bond for the value of the project for your protection.  I really am surprised based on his past reviews they have slid this far down in skills and service.  Pickett Construction also breached his contract by his poor workmanship.  They attempted to install two metal roofs and both failed building inspection.  This breach resulted in thousands in damages and job delays.", "pics": null, "resp": {"time": 1586462468775, "text": "Mr. Tanner did sign a contract with Pickett Construction. We were happy to do the work. However, he broke the terms of the agreement. He refused to let us complete the last part of the project and still owes the company thousands of dollars."}, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "109687798598020078588", "name": "Andrea Fordham", "time": 1431529782403, "rating": 5.0, "text": "Scott from Pickett Construction was awesome!!!  Him and his crew added a beautiful cover to our patio.  Scott always kept me informed on progress.  The project looks beautiful and now we have an awesome patio to enjoy this summer.  The price was great too!!!  Very reasonable.  Andrea Fordham", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "107960863016799096613", "name": "Meredith R.", "time": 1377887465008, "rating": 5.0, "text": "You do not give me enough stars.  How about 6 or 7 of them?  I have been through roof installation and repairs to that installation for several years and thousands of dollars.\nPickett Construction LLC was recommended to me by a home inspector (I am a real estate agent).   I ordered a brand new metal roof.  They have covered me up with service.    They do what they say they will do WHEN they say they will do it!  Such competent installers.  Each one is an expert.  The company stands behind its work and it is all guaranteed.  Take this from me:  Do it right the first time.  Use Pickett Construction and look no further.", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "118166027630238215859", "name": "Jammie Eldridge", "time": 1524495899766, "rating": 5.0, "text": "This business is a great one especially making ur home look beautiful & it has homes u can buy or rent. The owner is a really good person he also makes sure it's exactly the way u want it", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "117613102846957459277", "name": "Michael Daniel", "time": 1417060160495, "rating": 5.0, "text": "8 years ago we hired Pickett Construction to install a new roof, gutters and downspouts, and vinyl siding on our home. The quality of workmanship was outstanding, and the work was completed in  only 5 days. My wife and I could not have been happier.\n\nThen last month after a rain shower, we noticed water stains on the ceiling in two different rooms. Because Pickett installed the roof 8 years ago, we called them about the problem. Josh sent his roofer to our home to see if a cause for the water leak(s) could be found, because from the outside the roofing shingles were not damaged or missing and looked fine. However after a few minutes looking in the attic and walking the roof, it was determined that during construction of my home some 25 years ago, a handful of framing nails used to secure the plywood roof deck had missed the rafter below, and after all these years had begun to back out of the plywood deck, pushing up the roof shingle just enough to let water pass underneath. The roofer walked the entire roof looking for nails that were backing out (not just in the area of the water stains below, but the whole roof), removing all that he found, sealing the hole and making sure the roof shingle lay flat. Two days after the repairs we had a lot of rain, and no water leaks inside the house.\n\nOnce again, Pickett Construction has made my wife and I very happy, and I will not hesitate to call them in the future. It's nice to know that the quality of workmanship and professionalism we knew 8 years ago is still present today.", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "112449021323352250228", "name": "tb harvey", "time": 1548074781930, "rating": 1.0, "text": "Hired these people to do light repairs and painting.  Took 3 weeks to complete the painting.  They did poor preparation work on several parts of the house.  They did not paint the rear door to my detached garage,though they painted the trim.  They bent the gutter on my garage and was balking at replacing it until I showed some video.  They did not remount one of my porch lights, nor did they reattach a lens to one of the driveway flood lights. They left trash in the yard and on the front porch and in the plants behind the house. They missed painting trim on one of the back doors.  They replaced a French door that was alarmed. They had to detach the alarm panel from the wall because the new door trim was slightly larger.  After they finished the alarm would not work nor did they remount the alarm panel...just left it hanging by the wires.  When I questioned them the reply was “we don’t do that kind of work.”  Overall the work was substandard and the post work cleanup nearly nonexistent. Cannot recommend these folks . I have pictures if you need to see.", "pics": null, "resp": {"time": 1548077709132, "text": "We are sorry you had a bad experience.  We don't ask for final balance until you are completely satisfied. Thanks for your input."}, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "102776965644829246495", "name": "Linda Ackley", "time": 1399603948588, "rating": 4.0, "text": "Over the years Pickett Construction has re-roofed our home, installed new windows, and re-modeled our bathroom vanity, and kitchen.  We were pleased with all the results.  That is not to say that everything always went smoothly or on time, but that seems to be the norm for the construction business in general.  However, as promised by the Better Business Bureau of which Pickett is a member, they will resolve any problems to the customer's satisfaction and did.  Pickett also re-roofed our daughter's house to her satisfaction.", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "110318581220739592604", "name": "Amelia Cothran", "time": 1408386085439, "rating": 5.0, "text": "I hired Pickett Construction to replace all of the floors in my house. The workers did an excellent job. Everyone was prompt and professional, from Josh in the office to the guys who installed the tile.I appreciated the courtesy with which the workers treated me and my children. I would definitely use Pickett Construction again.", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "103917241948177916615", "name": "Peaches H", "time": 1450910649893, "rating": 5.0, "text": "Pickett Construction replaced my roof and gutters a few years ago. They did such a good job that I called them when I was ready to replace the siding on my house. It turned out beautifully!\nAlas, it had barely been done 4 months when another company dropped a ladder against it hard enough to seriously damage it. That company denied culpability. Nice,huh? I contacted Josh Pickett and he made a few calls and found that they had some siding in my style and color already in stock so I wouldn't have to shell out $300 for another box of siding. He then called his installers to see how much they would charge to swap out the few pieces of damaged siding. Mind you, this is four days before Christmas. Then I got an email saying it had all been fixed and when I asked how much my final bill was I was told \"no charge\"! Now that is the kind of company I will keep calling when I need repairs done. They bend over backwards to make sure they do the job right and that their customers are happy long term. I am looking forward to my next home improvement project with Pickett Construction.", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "112306083670983415667", "name": "Derek Smith", "time": 1436280155743, "rating": 5.0, "text": "Very Reputable, considerate and helpful.  Quality workmanship.  My roof was done in really cold weather and they finished it in record time but they took care of all the problems that was damaged by hail damage.  I would highly recommend this Construction firm for all your Restoration or building needs.  Top Notched.", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "109825978297142883165", "name": "Tami Pickett", "time": 1522288140383, "rating": 5.0, "text": "Professional services for home remodel or new custom built homes.  Customer service is always on point... Licensed, insured and bonded!  They will work with you to make your vision become a reality!", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "111526601925800055072", "name": "Bud Pommer", "time": 1398794153390, "rating": 5.0, "text": "I've had three experiences with Pickett Construction. All of them great. First; in the process of selling my home an inspection revealed hail damage on the roof and the determination that the tiles had to be replaced. Called Pickett. They gave an estimate (which ended up being lower than insurance company was going to pay). I signed contract and they showed up when they said they would, completed the work when they said they would, job looked great, did a good job cleaning up and all this done in a respectful and empathetic fashion to meet my need of completion of job prior to closing date on house.\nI've moved to the Gulf Coast but still have rental property in Jefferson County.  Insurance company review dictated the need of handrails for front steps. I had one month to get then installed or they would drop my coverage on the house. The Rental Management Company for that property got some quotes but I called Pickett Construction on my own. I gave them the contract knowing I would get quality work done on time. What I really gave them besides the contract was my trust. That's something that's hard to do these days. Again, they didn't let me down!\nMy third experience with them was to get a quote on electrical work at that rental property. They looked at the job, told me what needed to be done but couldn't do it do it because they were covered up at the time. So, they referred me to an electrician who was half the price of other quotes and also did a great job.\nI highly recommend Pickett Construction.", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "114968797412226292893", "name": "Roberts 2839", "time": 1509281698677, "rating": 5.0, "text": "I had a water leak upstairs that ruined the ceiling in my living room. They repaired it quickly and professionally. Great service and friendly workers.", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "116701627672939802143", "name": "Greg Clyburn", "time": 1399561702313, "rating": 5.0, "text": "I had the outside of my home repaired/updated by Pickett in 2013.  Ricky came out to give me a bid on the work and suggested some items that I had not considered.  Ricky took into account not only the house but the grounds, including sidewalk and driveway.  I agreed to these suggestions and could not be happier with the work.  I now come home (2014) to an updated home (outside) each day thanks to Ricky's suggestions.  The work was done in a timely, professional manner.  I will contact Pickett for my next home repair/update need.", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "114512808445224736557", "name": "Callie Dan", "time": 1336311950616, "rating": 4.0, "text": "This contractor is outstanding! Dependable, on time, quality caftsmamship, accessible, on budget... I would recommend them to anyone.. Hope they never move away from alabaster!", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "116468537569059634478", "name": "David Roberts", "time": 1398251019775, "rating": 5.0, "text": "I have used them for two jobs around my house.  They started work at the scheduled time and made sure that I was satisfied with the work done.", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "108877428998869950982", "name": "Brian Pavlick", "time": 1379354740181, "rating": 5.0, "text": "Our house had some water damage leak down the walls and cause damage to the interior/exterior walls and damaged the hardwood floors as well.  Ricky came first and within 10 minutes had not only an initial diagnosis but a wonderful recommendation as far as procedure to take care of the job.  Since our first call with Pickett, we were completely satisfied.  Nevermind that they did a wonderful job and that they completed their work in the timeframe they said, I was more impressed with the individuals who respected our home and my wife staying at home by herself with a 2 month old baby.  We never once felt uneasy with the staff and always felt like we were simply letting family go in and out as they needed.  I would recommend Pickett to anyone in need of home repair and we will definitely use them again for our next projects!", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "102161206328345801318", "name": "Vandy Lowery", "time": 1436816261151, "rating": 5.0, "text": "Put in wood flooring. Excellent job.  Looking at painting.", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "114564852319105562597", "name": "Lynn Sampson", "time": 1405780720854, "rating": 5.0, "text": "After two decades of wind and rain, our Alabaster home's roof needed a re-boot.  I've driven by Pickett Construction's office nearly every day for the past couple of years, so I figured, \"They aren't going anywhere!\"  We contacted them, got an estimate, and within a week we had a brand new roof.  It looks great; the price was fair; and our insurance company was pleased to work with Pickett.  They knew Mr. Pickett by reputation!  Oh, I can't forget how thorough the actual roofing crew was when it came to cleaning up. The only thing different after they left was our beautiful new roof. I can't wait till we have the funds to set Picket Construction loose on our siding and deck and bathrooms....well, you get the picture! I trust them to do the job right whatever it is.", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "112023673293571876317", "name": "Kurt DeAngelis", "time": 1397170898068, "rating": 5.0, "text": "We decided to do a major renovation on our 30 year old split foyer in Alabaster. I had a huge wish list that far exceeded the funds I had available and had to prioritize needs, essentilas and desirables. Josh assisted me in mximizing the budget with a detailed proposal that enabled me to do this. Josh did a great job with my wife letting her see and select the tile, flooring and paint, etc.\n\nDo you want to know if Pickett is versatile or can get the job done fast? Pickett did the following items in 17 days ... 350 feet of new privacy fence and gates, paint entire house exterior, re-roof covered deck, remove turbines and patch roof areas, repair rotted roof decking around chimney stack, re-flashed and re-roofed the area, installed new LED motion detecting security lights, installed new outdoor lighting over front door,replaced all windows with new double hung, double pane vinyl windows, installed new laminate/engineered word floors on the entire main level of the house, laid tile in both foyers, kitchen and den/study, replaced every interior door and all hardware, installed new ceiling fans in each bedroom and main foyer, removed wrought iron raining in foyer and replaced with wood and balusters, primed and painted all interior trim, scraped popcorn/acoustic ceiling from kitchen, repaired drywall issues in bedrooms and kitchen, textured and painted kitchen walls.\n\nAny \"extra\" I asked about was repsonded with a written proposal so that there could be no confusion or disaggrement.\n\nTo get these things done in the time frame of 17 days ... including holidays ... shows excellent planning and execution. I was kept informed as to what was scheduled for the day, who would be there and what to expect. They arranged for the construction dumpster delivery and pick up. Pickett did a nice job on the site clean up as well.\n\nPunch list items were few and far between and resolved promptly.\n\nThe only thing that would be close to a concern or a negative was the sub-contracting tile guy who was going through a diviorce while he did the job. He did not do a bad job but his distraction resulted in a couple of small punch list things that Josh had Tripp take care of. I was assured that they would not be using this tile guy in the future.\n\nWould I recommend Pickett Construction to you? Absolutely. Want to see pics of the renovation? I have them. Will I use them again in the future? Absolutely. As a matter of fact, my daughter used them on a foreclosure she purchased in Calera. She got prompt thorough quality work done as well.", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "108852040032783306603", "name": "Tim Calhoun", "time": 1396761930047, "rating": 4.0, "text": "Pricing:\nWe contracted with Pickett to complete some work on our house to prepare it for sale. We were looking for some typical wood rot to be replaced and exterior paint. We also requested an interior paint quote. I think the quote was a bit high for the exterior work, but not so bad that I didn't go with their services. The quote for the interior painting was outrageous, so we opted for another painter. The other painter's quote was nearly $3000 less than the quote from Pickett. We were also having some plywood put in the ceiling of the carport, because the builder used interior drywall in our neighborhood. Pickett gave us a \"complimentary upgrade\" to beadboard instead of plain plywood. This really added a nice touch to the carport ceiling, and was an appreciated upgrade. They only requested 1/2-down to start the work, which we felt was certainly reasonable. They also honored their coupon they regularly have (often in the Alabaster Newsletter, or ValPack). We printed ours from the ValPack website.\n\nWorkmanship:\nThe quality of the exterior work was pretty good. There were a few spots where the painting got a bit \"sloppy,\" but was overall good work. The beadboard in the carport made a great upgrade to our carport, and added a touch of \"class\" to an otherwise mundane area of the house. Unfortunately, due to our unusually cold winter, the holidays, and several bouts with rain, our work was regularly delayed. It took a bit longer than expected to complete, but didn't delay our schedule of listing the house. The little interaction I had with the crew was polite and courteous, though at times the project manager came across as mildly arrogant. Communicating with the PM via email was the best medium, although he sometimes took a bit longer than expected to return messages.\n\nPost Work Follow-up:\nAgain, the delays in returning messages made for a challenge in clearing our post-work \"punch list,\" but this was also around the holidays, so we conceded a bit.  Had there been more clear communication about workday expectations (e.g. workers will/will not be onsite today) this would have made for better overall feeling about the length of the job.\nDuring our home buyer's inspection, they found more wood rot that was inadvertently overlooked by the crew. While I don't expect the painters to look over every square inch of the house (heck, neither did I!), it ended up being a significant portion of the chimney that had rotted out the edge of our masonite siding. One would expect that at least part of that might have been discovered and either repaired or at least alerted me to the potential change in an estimate so it could be repaired. When we approached our PM about correcting it, he gave us a price quote. After paying over $6000 for the original work, this was certainly unexpected, especially with their \"1 year warranty.\" I spoke with Josh, the owner's son who is also in management with the company. He immediately started working with me to find a reasonable solution. I ended up having to pay a bit more, but we did come to an acceptable compromise on the final cost of the supplemental work. In the end, Josh personally stopped by the house to deliver the revised agreement and took pictures of the missed work. It turned out that the rot was more severe than even he expected. He opted to continue to honor that revised estimate and didn't charge anymore. Josh really worked hard to make a relatively displeasing situation wok out well in the end. Josh was absolutely committed to service and ensuring my end satisfaction. He even reached out after the supplemental work was completed to check in on my satisfaction, and knowing there was a bit of a sour taste, still wanted this Google Review. Josh knows what it takes to listen to customer concerns and immediately find a reasonable solution that works in the best interest of all parties. Had it not been for Josh's actions, my 4-star rating would have been a high 2-star, or low 3-star.", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "114703962043272744489", "name": "R Heffner", "time": 1570739164458, "rating": 5.0, "text": "Caddyshack", "pics": null, "resp": null, "gmap_id": "0x888928b42506b8af:0xcb8d4f70d1041df1"}
{"user_id": "111754218139503614418", "name": "Jason Horvath", "time": 1621293250154, "rating": 2.0, "text": "Salesman Kevin was very knowledgeable and convincing that Champion Windows is the best option and we would have no issues so  I cancelled my appointment with a competitor for the next day. Kevin mentioned it would take 6-8 weeks (possibly as little as 3 weeks) but there was absolutely NO communication from Champion the whole 8 weeks. On week #6 half the bill was charged with interest with NO work being completed and no communication on when it would be completed/started. When this was addressed with Charlie (owner) it was ignored and not resolved. There was no mention of us being charged BEFORE work was completed. We called the Champion local office twice with no response. On the 3rd time we called corporate and Damon (installation manager) quickly returned my call.\nThe installation guys were 40 minutes late from appointment time, again with NO communication. I had to call to find out they needed to stop and get caulk on the way to my house. I would think they would have been prepared with the proper equipment prior to the customer's appointment time.\nThe installers were polite and professional, however I brought up some quality issues during the installation process that did not get properly taken care of until they said they were leaving causing them to stay longer and redo some of their work. (Gap in the J-molding, they wanted to caulk the gap, not fix it) Corporate called me wanted me to sign a form stating the job was done even though the installers were still here finishing the job.  When I mentioned the issues regarding some other problems (window & screen defects) Damon called me to come out to resolve the issues.\nBottom Line: Customer service and apologies goes a long way. I feel that I had reach out and try to communicate to get the work done that costs thousands of dollars. As a customer, I should not have to work as hard as I did to get the job done properly which is still in progress.", "pics": null, "resp": {"time": 1621967031542, "text": "Thank you for your feedback, Jason. We use this feedback to make sure our services are nothing less than the best for all our customers. We are sorry to hear that you had a poor experience with us. If you would like to reach out to us in national customer care to speak further, please call us at 513-327-7338. Thank you."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "115079622044901938901", "name": "James Tynan", "time": 1621441946270, "rating": 1.0, "text": "5 Stars -They did a great job in 2017 when they installed my sunroom.\n0 Stars - In the last few months (April-May 2021) I have been trying to get in touch with someone, anyone, at Champion anywhere from Huntsville Alabama to their offices in Cincinnati. I have spoken to a few people that have given me nothing but a runaround. Several promised they would work out my issue and follow it through to a satisfactory conclusion. Nothing happening so far and based on recent past experience, I'm not holding my breath.\nAll I am trying to do is get a pet door that fits the wall in may 3 season room. I'm willing to consider buying it out right or having them install it. Can't even get anyone to talk to me about it.", "pics": null, "resp": {"time": 1622000889299, "text": "James, We want to sincerely apologize for your negative experience with us. We want to make things right. Please call us in our national customer care office directly at (513) 327-7338 at your earliest convenience. We look forward to hearing from you."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "100396018577655219774", "name": "Todd Long", "time": 1617796512798, "rating": 5.0, "text": "Called Champion after some siding was blown off the house in a storm.  Quick to respond (unlike other companies, who just didn't seem to have the time), came out, gave me a quote.\n\nTheir representative (Matt) was on time, very friendly, explained the entire process to me (including payment options) and by the time he was done, I felt comfortable about signing on the dotted line.\n\nThey'll be coming out to do the work soon, but so far, so good when it comes to dealing with Champion.", "pics": null, "resp": {"time": 1618343621677, "text": "Todd, we are delighted to hear we provided a top-notch experience! Thank you for taking the time to write this review. It is wonderful to hear we were able to provide you with excellent service."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "112113720908723120989", "name": "T Stiger", "time": 1623018181921, "rating": 5.0, "text": "The sales rep was very nice and knowledgeable. He listened to what I was looking for within my budget and was able to recommend exactly what I was looking for.  Will definitely recommend to others and will be back for more business.", "pics": null, "resp": {"time": 1624040623778, "text": "We appreciate you taking the time to leave us a positive review.   We are dedicated to providing great service.  Please feel free to reach out if there's anything you need."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "118019945669849859014", "name": "Dinah Branum", "time": 1620535404197, "rating": 5.0, "text": "Presentation of window installation. Matthew was Very professional and helpful and on time ! 🙌 Matthew was awesome and very knowledgeable and we are excited to get some windows replaced in our home. Just wanna say  Thanks Matt for taking the time to explain everything to us.  You’re the bomb!\nMy review will prob post twice because I hit post before I got finished  🤦‍♀️", "pics": null, "resp": {"time": 1621283357596, "text": "Dinah, we are delighted to hear we provided a top-notch experience! Thank you for taking the time to write this review. It is wonderful to hear we were able to provide you with excellent service."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "104046310342082883133", "name": "Joseph Cayse", "time": 1615841914912, "rating": 5.0, "text": "Matt from Champion stopped by to give a quote on windows and siding for our detached garage today. He was perfectly on time, kind and professional, and very thorough in the estimation. No high pressure sales tactics - just open and honest giving us all the information to make an informed decision on our project. I'm very happy with Champion and Matt, and look forward to using their services for installation soon!", "pics": null, "resp": {"time": 1616098167938, "text": "Joseph, we are delighted to hear we provided a top-notch experience! Thank you for taking the time to write this review. It is wonderful to hear we were able to provide you with excellent service."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "109217351761052935511", "name": "Amber Owens", "time": 1617125178785, "rating": 5.0, "text": "I scheduled my consultation appointment online and got text and email reminders, which I appreciated. Michael showed up on time today to walk me through a plan for my (future) sunroom. He explained the options, showed me pictures and samples, explained warranty information, answered all my questions and described next steps. He provided a cost estimate and showed me all the applicable discounts, and I am happily moving forward. I can’t speak to the final product yet, but I was very pleased with my consultation. Thank you Michael, especially for the times you said “if this were my house...” which really helped me make decisions while we were going through options.", "pics": null, "resp": {"time": 1617906794640, "text": "Thank you for posting your positive review. At Champion Windows and Home Exteriors of Huntsville, we value your time and always strive to provide fast and efficient service. We are so pleased to hear our service was provided in a timely manner."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "103284786204338073899", "name": "Judy Shockey", "time": 1610551370984, "rating": 5.0, "text": "I have lived in a home with Champion Windows before, and I really enjoyed their performance and ease of use. So when I bought another home that needed window replacements, I naturally decided to go with Champion Windows. They were installed just prior to a hard freeze, and suddenly I had no more drafts. The installation was very professional as well, and I was impressed with how many times the windows were measured to insure that the replacements would really fit properly. I'm very pleased with the appearance of the windows inside and out, and I look forward to lower heating and cooling bills, based on my previous experience with them. I'm confident the new windows add tremendous value to my home, and I highly recommend Champion Windows.", "pics": null, "resp": {"time": 1610993338405, "text": "Judy, we are delighted to hear we provided a top-notch experience! Thank you for taking the time to write this review. It is wonderful to hear we were able to provide you with excellent service."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "103729736214998236200", "name": "Luciana Samuelson", "time": 1618862874251, "rating": 5.0, "text": "Matt is a great salesman. Worked hard to get us what we wanted. Champion products are the best. The company does what it promises. Highly recommend to my friends.", "pics": null, "resp": {"time": 1619203224879, "text": "Thank you for posting your positive rating of Champion Windows and Home Exteriors of Huntsville. We value your business!"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "105574002147443800528", "name": "D Toney", "time": 1622311518234, "rating": 5.0, "text": "The champion representative Matt was very professional and did a very thorough job providing an estimate for replacement windows and explaining different options.If you are planning on replacing your windows you can't go wrong with the Comfort 365 windows. T", "pics": null, "resp": {"time": 1622690898259, "text": "Thanks for the positive review, D. We work hard to exceed expectations. It was a pleasure working with you! Always know you can reach out to us directly if there's anything else we can do to help you."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "110103099586473556119", "name": "Tobie S", "time": 1620492886732, "rating": 5.0, "text": "We set up an appointment for Champion to give us a quote on a sunroom. Matt showed up on time and answered all thirty thousand questions I had with enthusiasm. He spent over an hour and a half with us, making sure we understood all of our options.", "pics": null, "resp": null, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "114898440182541330288", "name": "Sara Scharber", "time": 1618240571273, "rating": 2.0, "text": "After 10 years, all 16 of the windows they have replaced look terrible. The window wrap is peeling off every single one and it looks horrible. There are flakes of white all over my yard from the wrap peeling off the frame. The functionality of the windows themselves is fine but they make my house look bad. I'm not the original owner so I am required to pay a $99 service fee just to have them come and look at it. I was told by them it was probably \"just a bad batch,\" so there is no way I'm paying a fee for them to come and tell me that in person. We have 10 more windows that will eventually need to be replaced and based off our current ones, we will absolutely go with someone else.", "pics": null, "resp": {"time": 1619036486849, "text": "Thank you for your feedback, Sara. We use this feedback to make sure our services are nothing less than the best for all our customers. We are sorry to hear that you had a poor experience with us. If you would like to reach out to us in national customer care to speak further, please call us at 513-327-7338. Thank you."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "102340428672921880285", "name": "Scott Sanders", "time": 1621018358636, "rating": 5.0, "text": "I had an in home demonstration with Matt and he was very professional. He didnt try and force the sale on us but allowed us to make our decision in our on time. He was very knowledgeable and prepared.", "pics": null, "resp": {"time": 1621893913098, "text": "Thanks for the positive review, Scott. We work hard to exceed expectations. It was a pleasure working with you! Always know you can reach out to us directly if there's anything else we can do to help you."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "100424655990599640316", "name": "ERIN KIRKPATRICK", "time": 1622853039384, "rating": 5.0, "text": "Sunroom estimate. Mathew Parker was great, explained ever thing we needed to know. He was a pleasure to work with!", "pics": null, "resp": {"time": 1624040204906, "text": "Erin, We appreciate you taking the time to leave us a positive review.   We are dedicated to providing great service.  Please feel free to reach out if there's anything you need."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "116891283115061044646", "name": "JoeSandy Garcia", "time": 1619876399740, "rating": 5.0, "text": "Our experience so far with Champion has been with meeting their customer rep. and mapping out our vision for our sunroom. The Champion rep., Mr. Matthew Parker, did an excellent job working with us and explaining every step in the process of taking down our existing structure and putting in place the Champion system. In addition, Mr. Parker had on-hand the various components of the sunroom structure explaining in detail the engineering and mechanics of how that component supported or operated within the structure.  He took the time to demonstrate how efficient  the insulated windows are (gas filled) along with answering our many questions about the sunroom and Champion's processes. At the end of the day my wife and I felt comfortable and confident enough to go on contract with Champion to make our vision a reality.", "pics": null, "resp": {"time": 1620681073450, "text": "Hello, We really appreciate the time you took to leave such a thoughtful review! Please share your positive experience with friends, family and neighbors! Thanks again!"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "103944500055272592847", "name": "Gail Locke", "time": 1620507125618, "rating": 5.0, "text": "Very responsive when we called to schedule our appointment! Super nice and professional! I would recommend this company to anyone!", "pics": null, "resp": {"time": 1621283093394, "text": "Thank you for the kind words, Gail! We're happy to hear your overall experience with us was a good one. We are always here to provide any help you may need. Don't forget to tell your friends and family about us!"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "112764631846255138023", "name": "Liz Clemons", "time": 1612696045433, "rating": 5.0, "text": "Our experience with Matt Parker, was excellent. First of all he was so very friendly, honest, left no stones unturned. The Really big thing is He knows his job! My husband and I had talked to several other companies, but Matt  sold us. He showed us product, tested the windows we are getting it was an awesome experience! Thank you for sending him! He didn’t talk to us to sell, he talked to us because he cared. Cudos to Champion for having Matt!", "pics": null, "resp": {"time": 1612656344090, "text": "Thank you for this positive rating, Liz!"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "110287968143184135098", "name": "Jeff Clark", "time": 1611011758670, "rating": 5.0, "text": "I was looking to add a sunroom onto my home. I called Champion home Exteriors and Matthew Parker came out to my home to meet with me. Mr. Parker explained everything to me very thoroughly and walked us through the whole process. , Mr. Parker was able to get financing for us at great rate and good pricing. He was also very polite and very informative.", "pics": null, "resp": {"time": 1611254252651, "text": "Jeff, we are delighted to hear we provided a top-notch experience! Thank you for taking the time to write this review. It is wonderful to hear we were able to provide you with excellent service."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "116567456541191954227", "name": "Kenneth Woodard", "time": 1622033109336, "rating": 5.0, "text": "They came and gave us a quote on converting our screened in porch into a sunroom. Can't wait to see it when it's done.", "pics": null, "resp": {"time": 1623296988448, "text": "Thanks for the positive review, Kenneth. We work hard to exceed expectations. It was a pleasure working with you! Always know you can reach out to us directly if there's anything else we can do to help you."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "113546981197057722985", "name": "Kristi Fuller", "time": 1614737809456, "rating": 5.0, "text": "Was interested in getting quote for widows & vinyl siding. Rep was super nice, good presentation & informative. I havent made decision solely because I need to analyze everything.", "pics": null, "resp": {"time": 1615408480794, "text": "So glad to hear this, Kristi. Thank you for your review!"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "114549946884079687078", "name": "Rudy Beckert", "time": 1622918119038, "rating": 5.0, "text": "Good representative that clearly explained the product and installation.     We are scheduled im 4 to 6 weeks to replace 11 windows", "pics": null, "resp": {"time": 1624040382755, "text": "Thank you very much for your recommendation, Rudy! We're glad to hear that our customer service met your expectations. We appreciate this review!"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "112933086411697559240", "name": "jimmy arnold", "time": 1615714824461, "rating": 5.0, "text": "I was very impressed with Donna Farmer and how she represented Champion. She knew her product and  gave me confidence to purchase windows from Champion without any pressure", "pics": null, "resp": {"time": 1616096680703, "text": "Thank you for this positive rating, Jimmy!"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "108884587375128387573", "name": "Kirk Shonk", "time": 1616525084080, "rating": 1.0, "text": "Think Twice before You Buy From champion Windows Not A True Lifetime Warranty. We Bought Campion windows for the lifetime warranty at $600.00 a Window.  We are now on the 3rd window that the seal has broke causing cloudiness in the window. Now they want to charge Us $100.00 to come out and measure & replace We have been waiting for 3 months still no new window . Here is the Lie they are saying on the website. Every Champion product is backed by our unparalleled customer service and best-in-class Limited Lifetime Warranty†. This comprehensive warranty covers every aspect of installation, parts, labor, and materials. If it breaks, we will replace it. Even if your child throws a baseball through your window, it’s covered. This means you can spend more time enjoying your home instead of worrying about it. Champion has you covered.", "pics": null, "resp": {"time": 1617391685821, "text": "Thank you for taking the time to give us a review. We sincerely apologize about the issues you experienced, and we hope to make this right. Please reach out to us directly in national customer care, so we can rectify this issue – 513-327-7338. Thank you."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "114079343275800050557", "name": "Donna White", "time": 1611989676260, "rating": 5.0, "text": "Stacey did an awesome job on educating us on windows. She was very knowledgeable and had a great personality. She did not pressure us at all and made the experience very pleasant.", "pics": null, "resp": {"time": 1612294663531, "text": "Donna, we are delighted to hear we provided a top-notch experience! Thank you for taking the time to write this review. It is wonderful to hear we were able to provide you with excellent service."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "111961308483476259297", "name": "Cynthia Clayton", "time": 1610069451415, "rating": 5.0, "text": "I shopped around and found Champion had the best quality and  warranty on windows. Michael was professional and highly creative. I cannot wait to do a patio room next year.", "pics": null, "resp": {"time": 1610478121471, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "114445659288674597305", "name": "Andrew Stinnett", "time": 1614303129705, "rating": 5.0, "text": "Matthew Parker came to give me an estimate.  He was very professional.  He was very friendly and presented his products extremely well.  I would recommend them in the future.", "pics": null, "resp": {"time": 1614627526207, "text": "Thank you very much for your recommendation, Andrew! We're glad to hear that our customer service met your expectations. We appreciate this review!"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "117897522586865688815", "name": "Dave Derbort", "time": 1621881981844, "rating": 5.0, "text": "Remains to be seen measurements were taken and subsequently confirmed. That’s is a far as we’ve gotten. The 4 season patio room is quite expensive, but having done business with this company in the past I’m certain I will be satisfied", "pics": null, "resp": {"time": 1623263114938, "text": "Dave, We appreciate you taking the time to leave us a positive review.   We are dedicated to providing great service.  Please feel free to reach out if there's anything you need."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "108760236225294338476", "name": "Kay Donaldson", "time": 1616444356155, "rating": 5.0, "text": "We met with Matt Parker and he was excellent and answered all of our questions.", "pics": null, "resp": {"time": 1616528811999, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "101311214689450037559", "name": "Carla Auchterlonie", "time": 1621881177247, "rating": 5.0, "text": "Knowledgeable sales person presenting a superior product.", "pics": null, "resp": {"time": 1623263050628, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "115277754511529901676", "name": "Steve Greene", "time": 1614882656459, "rating": 5.0, "text": "Great experience with Mathew Parker. Looking forward to our replacements", "pics": null, "resp": {"time": 1615409073191, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "102203895460119303114", "name": "Christy Osborne-Robinson", "time": 1605462976850, "rating": 2.0, "text": "Update:  I have called their cooperate office twice this week.  Once on Tuesday and once on Thursday.  Both times I got voice mail for two different people.  I left my name and phone number and STILL have not had a call back.  It has been 3 weeks since they were here to install the transom windows.  One is damaged (again) and I haven't heard back from anyone as to when the replacement will arrive or when it might be installed.  Since I still owe you over $8,000 maybe when you reconcile your books someone will take notice.  I have no idea how on earth you stay in business while conducting business in this manner.  No one ever answers at the Huntsville AL office and clearly people at the cooperate office do NOT return calls, nor do they seem at all concerned.  I'm regretting this whole deal.\n\nCan’t get person who did measurements and install setup to call us back about Transom windows that still need to be installed.  Apparently he took another job and we are left hanging.  Very frustrating!", "pics": null, "resp": {"time": 1604697443804, "text": "We’re sorry you weren’t satisfied with your recent experience, Christy. We appreciate you sharing your concerns so we can address them and prevent them from ever happening again. Please call us in national customer care so we can discuss this with you directly – 513-327-7338. Thank you."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "110091881284074366580", "name": "Darnell Stair", "time": 1600283457186, "rating": 4.0, "text": "On 9/15/2020 I had an in home presentation by Matt. He was extremely professional and very knowledgeable of the product. He answered all questions to my satisfaction and I did not feel pressured to purchase. However, I look forward to the install and hope it goes just as smoothly!", "pics": null, "resp": {"time": 1600362365919, "text": "Thanks very much for leaving us a review, Darnell."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "114654299672063232627", "name": "Cat Taps", "time": 1607980251194, "rating": 5.0, "text": "We contacted the toll-free number for Champion Windows (please know: this # is not your local Champion dealer but just a service...I hope!) for 6 months!  We just wanted a person to come by and talk to us about a new sunroom. This phone system service (meaning=the \"trained\" people manning the phones) is highly disorganized! Perhaps it is because of the virus? Leaving messages or even setting up appointments to meet with a representative and that representative never showed is very disheartening. (0 stars for that set-up-an-appt craziness.) Corporate office? You need to get that fixed! Perhaps employ another phone service to answer your toll calls? 🤔\n\nFINALLY...after months of calls...we got our Champion reps at our home.\n\nMatt and Charles came to us in East Limestone from the Huntsville office which is by the airport. Having already had sales presentations by two competitors, we knew what to expect in their presentation. They immediately realized we were most interested in quality and price for our new sunroom.\n\nMatt was thorough in showing us the construction of their unique products. He even had samples to demonstrate the sunroom's best attributes.\n\nWe were surprised at the price. Matt was precise and clear on it. One contract, too, one price. Never additional hidden fees. Perhaps we contacted them at the correct time since it is December after all. 😁 Good price for the quality...the sunroom we chose actually can be added to our home square footage.\n\nCharles invited us to come by their showroom. I suggest everyone do this! Seeing several sunrooms already set up truly helps in your decision process versus just seeing magazine quality sunrooms in their catalogs.\n\nCharles even brought us to the back of where products are custom made for every sunroom. These are not kits. We went for the 6in depth walls. Seeing the sun rooms in the office and showroom also convinced us to go ahead with additional products. Charles was not pushy at all. We made these decisions on our own.\n\nBoth Matt & Charles also gave us their personal cell phone numbers and we have called them several times. They have always been available -immediately-. We appreciate this courtesy! (Those 5 ⭐'s for them.)\n\nHaving read 1-🌟 reviews from a year ago...yikes! We decided to see for ourselves and really tested our sales team. We also detected this Huntsville office was working to improve themselves. So far? We are off to a good start. We are waiting for construction people to come and measurable are sunroom. Hope to bring you up-to-date after this happens.", "pics": null, "resp": {"time": 1607975507374, "text": "Hello Cat, We really appreciate the time you took to leave such a detailed and thoughtful review! We hope we can continue to provide great service throughout your project!"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "102045436644829050962", "name": "Karen Rosenhoover", "time": 1603377243471, "rating": 5.0, "text": "Donna was great to work with and extremely accommodating with our work schedules. Definitely will use for any further needs at our home.", "pics": null, "resp": {"time": 1603381465326, "text": "Fantastic to hear. Thank you, Karen!"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "102044714928047810465", "name": "Rob Felkner", "time": 1605838870549, "rating": 5.0, "text": "It was great working with Michael Aaron this evening. He was very positive and very kind.", "pics": null, "resp": null, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "110076017329513230095", "name": "Dale Parker", "time": 1623982531938, "rating": 5.0, "text": "Professional and knowledgable.", "pics": null, "resp": {"time": 1624590121872, "text": "So glad to hear this, Dale. Thank you for your review!"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "113726155572269852198", "name": "rubye boulden", "time": 1606156009648, "rating": 5.0, "text": "Sales rep, Michael Aaron was very professional and he explained all the options available to us.  We are very pleased we chose Champion.", "pics": null, "resp": null, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "103978949857003577356", "name": "Kathy Brock", "time": 1598671120160, "rating": 5.0, "text": "Matt was great at explaining the windows.  Windows were installed without any problems.  Everyone was on time.  Very professional.  We would use them again.", "pics": null, "resp": null, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "106304403053324060669", "name": "Rebecca Greene", "time": 1619218210957, "rating": 1.0, "text": "Had an appointment for an in home estimate and they never showed up.", "pics": null, "resp": {"time": 1619546271566, "text": "Rebecca, We want to sincerely apologize for your negative experience with us. We want to make things right. Please call us in our national customer care office directly at (513) 327-7338 at your earliest convenience. We look forward to hearing from you."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "108800967469084447028", "name": "Ryan Childress", "time": 1598636371452, "rating": 5.0, "text": "Well salesman Matt is very concise and explained everything my vison was. Happy to work him.", "pics": null, "resp": null, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "104190600803965457232", "name": "John Roberts", "time": 1574785950972, "rating": 5.0, "text": "We just had windows, siding an gutters done and everything about the experience was excellent.\nFrom Matt at estimation and selection to Cory in scheduling and installation interface to all of the install crews.\nQuality, service, on time performance and notification.\nExcellent value. Not the cheapest but best value.\nIf you need a house makeover Champion should be part consideration.\nThanks for a great job!\nJohn Roberts Madison Al", "pics": null, "resp": {"time": 1575293421039, "text": "Thank you very much for choosing Champion and for taking the time to leave us a review! -Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "110362593435979469036", "name": "Joy Nance", "time": 1622845368011, "rating": 5.0, "text": "Great customer service!!", "pics": null, "resp": {"time": 1624040143576, "text": "Thank you for this positive rating, Joy!"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "110626791556916878985", "name": "Martha Clark", "time": 1576187673966, "rating": 5.0, "text": "Matt, Daniel and Dakota did a fantastic job replacing my windows in our family room. They were polite and very professional and knew their job perfectly. Clean work space always. Windows themselves are great. I can already tell a temperature difference.", "pics": null, "resp": {"time": 1576241134696, "text": "Thanks so much for taking the time to leave this great review. Enjoy your windows! -Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "110022019108391531598", "name": "Julian Meloni", "time": 1580313192226, "rating": 5.0, "text": "Unbelievable company with the highest quality products around and at a great price. The price you pay for this quality is the greatest and it kills any of the other competitors products I’ve seen.  Best life time warranty there is, and the sales rep and installers are the best in the business. This company has been around for 66 years and I see why. I recommend this company to anyone doing home exterior projects.", "pics": null, "resp": {"time": 1569442990703, "text": "Thank you very much for choosing Champion and for taking the time to leave us a review! -Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "113399388035047231642", "name": "Joan Walls", "time": 1571923657272, "rating": 4.0, "text": "Daniel and Matt installed windows in my house yesterday. They were extremely nice and pleasant to have around all day. And very professional! They were good to address my many questions as the process unfolded. They cleaned up all the mess and debris involved with the job. I would highly recommend these two gentlemen to anyone for installation services.", "pics": null, "resp": {"time": 1572004427039, "text": "Thanks so much for taking the time to leave this great review. Enjoy your windows! -Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "108741273636400943279", "name": "Brian Zink", "time": 1600298711289, "rating": 5.0, "text": "Matt was great. He showed us why we need these windows.", "pics": null, "resp": {"time": 1600354663714, "text": "Thanks very much for the review, Brian!"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "115009172608936403818", "name": "Vickie Phillips", "time": 1622230993144, "rating": 5.0, "text": "Will update after job is completed", "pics": null, "resp": {"time": 1622691161624, "text": "Thank you for this positive rating, Vickie!"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "112225454996507112966", "name": "tracyslayton1", "time": 1570051367893, "rating": 5.0, "text": "My installers, Matt and Justin.. were simply the best at what they do! They were there when they said they would be there.. and did the job right from footings to the gate I asked for at the end! Michelle and Cory are great to work with in the office and Joe was a fine salesman... getting our plans right the first time. Very enjoyable group.. true professionals in every sense! I highly recommend...! And you should see our sunroom and deck, I wish I could upload pictures!", "pics": null, "resp": {"time": 1570104195902, "text": "Thanks so much for taking the time to leave this great review. Enjoy your new sunroom! -Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "104399171294304936317", "name": "Charles Plyter", "time": 1616076457750, "rating": 5.0, "text": "Excellent food & service", "pics": null, "resp": null, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "101825888447599414886", "name": "Thomas Harris", "time": 1571352170590, "rating": 5.0, "text": "Champion was great to work with! Our new siding looks great and makes our home look new again! They office staff and crews where very professional! Would recommend to friends and family.", "pics": null, "resp": {"time": 1571401007098, "text": "Thank you very much for choosing Champion and for taking the time to leave us a review! -Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "110204487347300063312", "name": "Zack Metler", "time": 1568854667430, "rating": 5.0, "text": "Champion was great to work with. The windows came in quicker then expected. The install went smooth and we are enjoying the new look to our home! 5 stars all the way", "pics": null, "resp": {"time": 1568894167616, "text": "Thanks so much for taking the time to leave this great review. Enjoy your windows! -Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "108610569284641901634", "name": "Jenny Roby", "time": 1570413091295, "rating": 5.0, "text": "My new windows look great!  Daniel and his partner were friendly, prompt, worked in a timely manner, cleaned up any mess, and made sure to explain how the windows worked before leaving. I can’t wait to replace the rest of my windows!", "pics": null, "resp": {"time": 1570465452449, "text": "Thanks so much for taking the time to leave this great review. Enjoy your windows! -Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "105778721368355349005", "name": "Marguerite Witten", "time": 1573600706693, "rating": 5.0, "text": "Champion is one classy outfit. Our installers, Garold and Derrick, were professional, competent and polite; always showed up when they promised and did a fantastic job of finishing our all-season sunroom. We especially appreciate the gutter installer Gary and the electricians from Bippen Electric.", "pics": null, "resp": {"time": 1573651000141, "text": "Thanks so much for taking the time to leave this great review. Enjoy your new sunroom! -Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "115842025770296761772", "name": "Jeffrey Cole", "time": 1568682413729, "rating": 1.0, "text": "The other Google reviews they have are accurate! We worked with Matt Jackson to get a quote, but he kept changing pricing every time we asked him to calculate it for us. He lied to tell us about what the windows would look like, and told us the installers were all Champion employees - which they are not. Champion will contract your job out to unprofessional, inexperienced, cheap laborers. Their sub-contractors repeatedly left our house completely open to the elements for hours and even days at a time which led to many issues for which Champion refused to accept responsibility. We spoke to Corey, the install manager, Rob McCauley, the regional manager, and even a national customer service manager - all who insisted the issues we experienced were not Champion's fault. Corey's temper when we involved Rob in communicating our concerns was completely unprofessional. Rob offered to give us a gift card for dinner as a compensation for the trouble we experienced (what a joke!). The national customer service manager threatened me and swore at me when I insisted Champion make the right the issues we experienced.\n\nThis company is full of dishonest, unprofessional, and unexperienced people charging high prices for a product of average quality.\n\nUPDATE IN RESPONSE TO CHAMPION'S RESPONSE: If nothing else, please take Champion's sarcastic response to my feedback as a token of their lack of professionalism. You can see from the reviews of others that our experience is not an outlier, but rather the norm for how Champion operates. Of course we noted our windows had just been replaced - WE SPENT OVER $12,000.00 ON THEM.\n\nCHAMPION WILL LIE TO YOU, SEND SUB-PAR CONTRACTORS TO INSTALL THEIR AVERAGE-QUALITY WINDOWS, AND THEN STEAL YOUR MONEY AND DO EVERYTHING THEY CAN TO MAINTAIN THEIR FACADE TO TRAP OTHERS - DO NOT FALL FOR IT!", "pics": null, "resp": null, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "116128177471269484922", "name": "Henry B", "time": 1568400576558, "rating": 1.0, "text": "What a disappointing company to work with. They do not stand behind their word. No one should have to go through the type of experience I had with this company. They make the product and the service sound like it will be great but once they have you sign the contract they are completely different people. They want your money but do not give you what your money deserves. They do not care about their customers.", "pics": null, "resp": null, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "114342003782269534749", "name": "Terry Hargrove", "time": 1616638172069, "rating": 5.0, "text": "Kevin was great,,,,with great presentation and professionalism Thanks", "pics": null, "resp": {"time": 1617405750788, "text": "Thanks for this great rating! It was a pleasure working with you."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "111453836884188606052", "name": "Sam Dodge", "time": 1568070405366, "rating": 1.0, "text": "Worst company I have ever used!!! The salesman Matt lied about everything he told about the windows and then tried to deny it to management. Then manager Rob from birmingham made it sound like he was going to make it right but lied about that and stopped returning calls. Then it was taken to the national customer care line and they said they would respond within 2 days and 5 days later I called because I had not heard anything and they did nothing to help me. TERRIBLE SERVICE FROM THIS COMPANY. I wish I could give it zero stars.", "pics": null, "resp": {"time": 1568119394282, "text": "We are very sorry for the issues.  If you still need assistance in getting your issues resolved please feel free to reach out to 888-395-0041."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "113201697627902660371", "name": "Anna Caudle", "time": 1574186595586, "rating": 5.0, "text": "We had all our windows replaced by Champion, and they did an excellent job, we are very happy with the results, the installers were very professional, they made sure we were happy with everything before they left, the guys were very nice and courteous, I would highly recommend them for your window installation.", "pics": null, "resp": {"time": 1574256887571, "text": "Thanks so much for taking the time to leave this great review. Enjoy your windows! -Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "106862065734814040647", "name": "deven dehnel", "time": 1542383954072, "rating": 5.0, "text": "Spoke with Michelle and she was incredibly helpful. She gave amazing customer service, and I went with them based on how helpful she was. Called several other companies and by far this had the best service.", "pics": null, "resp": {"time": 1542634269419, "text": "Thank you Devan for taking the time to share your positive experience with Champion.  We will be sure to pass your comments on to the local branch."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "113411924891439334611", "name": "accjdm", "time": 1603750457246, "rating": 5.0, "text": "It was great working with Michael!!", "pics": null, "resp": {"time": 1605215277034, "text": "Thanks for the 5-star rating! Please let your friends and family know about our products and services so we can help them too!"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "117401667551116119441", "name": "Janis Hart", "time": 1573615916591, "rating": 5.0, "text": "These guys were by far the friendliest salesmen that I dealt with while getting quotes on a window job.", "pics": null, "resp": {"time": 1573651153737, "text": "Thanks very much for this review!  We’re glad to see everything met your expectations. -Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "104176748971312408929", "name": "Honors gun and gaming channels", "time": 1588179836208, "rating": 1.0, "text": "Terrible company couldnt get help couldnt get estimate and the customer service was rude", "pics": null, "resp": null, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "117004147371423467182", "name": "Allie Walker", "time": 1567736341703, "rating": 1.0, "text": "DO NOT USE THIS COMPANY. They provide windows that are not worth the quality and give HORRIBLE service to their customers. They do not listen to concerns and threaten collections when you voice the problems to management. Extremely unprofessional company and they will steal your money and give you a terrible experience for all the money you spend. It appears through other reviews that everyone is having this same terrible experience with Champion of Huntsville. I want to warn others so they do not have to go through all of this by choosing this company.", "pics": null, "resp": {"time": 1567773373336, "text": "We are sorry for the experience you have had.  We would like to speak to you more about your experience.  If you could provide your contact information or you may reach out to us at 888-395-0041  National Customer Care."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "117787623321714275349", "name": "Whitt Roby", "time": 1570412126457, "rating": 5.0, "text": "Daniel and his crew did an excellent job with our windows!  The entire process was perfect!", "pics": null, "resp": {"time": 1570454714947, "text": "Thanks so much for taking the time to leave this great review. Enjoy your windows! -Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "117755037576287712190", "name": "Cathy Turner", "time": 1573239842950, "rating": 5.0, "text": "Great team from start to finish.  Love my windows.", "pics": null, "resp": {"time": 1573476906566, "text": "Thanks so much for taking the time to leave this great review. Enjoy your windows! -Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "104402257105410104571", "name": "Steve Palmer", "time": 1572640999832, "rating": 5.0, "text": "Excellent Product, Install and Service! This is a good long read. We have a home that has 32 windows. These windows were from the original build back in 1999. Over time these windows failed, broke internal components, were loose, didn't stay up and let so much air in between them; it really hurt our HVAC bills. We decided to look at new windows. We went through the hoops and ringers with various window companies in the area and the big box stores. The price ranges were all over the place and the functions, options, features and price points were the driving factors in this big home reno purchase. We called Champion (CW going forward) and had our salesman Whit come out and give his sales pitch. He did a great pitch and was at our house for 4 plus hours. Going over every detail and question we had. He was not afraid to say \"I don't know, but I will find out\" and called ahead to ask with us on his speakerphone right in front of him. He never stepped out to his truck to ask; he just did it right in front of us. We wanted an answer and he went and got one. Good bad or indifferent there was no empty promises or sugar coated answers. We were explained all the finance options and the promo they were having during our consultation. We beat him up pretty good with our wants and needs for the windows. After that was done, Cory then came out a few days later and walked me through the measurement process; again answering my rhetorical questions and others I missed with Whit. He took meticulous measurements of ALL my windows and explained what my casements would be and how they would sit in the frame. I walked through the house with and he asked questions to me about each room as he measured and took detailed notes. We discussed the order that was first taken to verify everything was right...the first time. He explained the install and what was done with that process from top to bottom. As well as what to expect with financing options again. Making this as streamlined as possible. He explained our order, what timeline for delivery was and the timeline of the install process once the windows arrived from the factory. Once our windows arrived in Huntsville, we were given a few choices on the install. We picked the date that worked on our schedule and a timeframe that made sense for the install. Once again, were explained the who what when were and how on the install team. The install team was on time the first day with everything ready and planned out so they could hit the ground running. Jimmy Mashburn and Brandon Clark were the install team and they were incredible. I have OCD about fit and finish and so does this install team. Jimmy talked with my wife so she would get the understanding of the install and what she could expect. He didn't make her feel silly for asking and was very professional with each question. We, of course stayed out of the way, but if either side had a question about a window, my wife and or Jimmy/Brandon made sure both parties were on the same page. They took their time and set everything right the first time. We didn't care how long it took and they were very meticulous and detail driven on each window. They were not in any hurry to just set 'em and forget 'em. It was done right the first time. I'm no installer but I'm a homeowner that bought 32 windows so I was wanting to find something wrong or find a shortcut that I saw...NOPE! I couldn't find anything that I felt was incorrect or not done in a make sense manner. Everything was top notch work. All my old windows were removed and stacked out of the way. Drop cloths were placed inside on each opening to make sure the removal was as clean and clutter free. All of the windows were set correctly, openings were cleaned from past dirt and debris. Professional 100%!! I felt that my money was going to the right company for our home. These are big decisions to make when getting new windows and the value of the CW product met our families need. We are truly very happy with our windows and would recommend CW to anyone!! We are very happy we went with Champion!", "pics": null, "resp": {"time": 1572873361192, "text": "Thanks so much for taking the time to leave this great review. Enjoy your windows! -Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "118194538783891699114", "name": "Heather Bolding", "time": 1571693577905, "rating": 5.0, "text": "Top notch windows. The installers where great to work with and the windows looks great.", "pics": null, "resp": {"time": 1571747373230, "text": "Thanks so much for taking the time to leave this great review. Enjoy your windows! -Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "107719286073841000332", "name": "Lanita Parker", "time": 1569011649816, "rating": 5.0, "text": "Matt was great to work with and made the purchase experience a pleasure. Was not a high pressure salesperson, which I appreciated.", "pics": null, "resp": {"time": 1569244077194, "text": "Thanks very much for this review!  We’re glad to see everything met your expectations. -Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "116973163227146040928", "name": "Mark Clark", "time": 1588359271376, "rating": 1.0, "text": "just called to talk about window service and they hung up on me.  the corporate office.", "pics": null, "resp": null, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "110646263947468777941", "name": "Paul Nowaskey", "time": 1564315454526, "rating": 1.0, "text": "Overpriced junk windows that do not fit properly and leak.  Company is almost impossible to deal with and not willing to help.  Go with anyone else, these guys stink!", "pics": null, "resp": {"time": 1564512497295, "text": "We are sorry you are having issues and would like to speak to you about those issues.  Can you please provide your contact information or you can reach us at 888-395-0041 National Customer Care."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "113412158886417435550", "name": "Matthew M.", "time": 1562905092725, "rating": 1.0, "text": "Better options in the area who will actually stand behind their work, unlike this company", "pics": null, "resp": {"time": 1562951660214, "text": "We are sorry you are having issues and would like to speak to you about those issues.  Can you please provide your contact information or you can reach us at 888-395-0041 National Customer Care."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "106689935284223857207", "name": "John Tyler", "time": 1572279954431, "rating": 1.0, "text": "What a miserable experience working with this company. They do not care about their customers or the quality of their product installation. Look for another company and do not use Champion windows huntsville.", "pics": null, "resp": {"time": 1572351544844, "text": "Champion apologizes for not meeting your expectations and would like to hear how we can improve our service. Please call 888-395-0041. Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "115125518442815500369", "name": "Ronald Bunnell", "time": 1539051896823, "rating": 5.0, "text": "Straight forward salesman.  Quick response.  Joe is the guy to talk to.", "pics": null, "resp": {"time": 1539175346356, "text": "Ronald, thank you for the positive review.  Joe will be happy to hear.  Champion Windows Customer Care."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "109722969341039835979", "name": "The Stever’s", "time": 1562942650588, "rating": 1.0, "text": "Prices are crazy high we found better deals else where", "pics": null, "resp": {"time": 1562963701722, "text": "We are sorry we were unable to accommodate your expectations."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "101577653906202022907", "name": "James James", "time": 1569284290917, "rating": 1.0, "text": "Had a VERY bad experience with this company. Will definitely never use again!", "pics": null, "resp": {"time": 1569331935931, "text": "Thank you for leaving your feedback about your experience, we apologize we fell short of your expectations and would love to discuss the issues that occurred. Please contact at 888-395-0471"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "106346180487055679791", "name": "George S", "time": 1568597444083, "rating": 1.0, "text": "There is not one positive thing about this company. I will never use Champion Windows again and I encourage you to look elsewhere also.", "pics": null, "resp": null, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "110098376063530746091", "name": "Joshua Adams", "time": 1570742346765, "rating": 1.0, "text": "Such a terrible experience with this company. I will never use them again for anymore home improvement.", "pics": null, "resp": {"time": 1570795236310, "text": "Thank you for your feedback, Champion we will like to discuss further with you about your experience. If you could please  contact us at 888-395-0041. Thank you, National Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "107053054455025737315", "name": "John G", "time": 1569724625798, "rating": 1.0, "text": "My elderly parents selected Champion to perform a number of exterior projects on their home. I had to get involved as the salesman took advantage of them and the installers did more of the same. The management turned a blind eye to the issues and hung my parents out to dry. My parents will never use this company again and I want to make sure no one else does either.", "pics": null, "resp": {"time": 1569845690462, "text": "Champion apologizes and would like to speak to you about the issues your parents experienced, Please contact 888-395-0041. Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "107587961019580524557", "name": "Patricia Fernandez", "time": 1522416166123, "rating": 5.0, "text": "Thank u michelle for ur quick response to my window breaking. Champion deserves 5 plus stars. They have alwsys taken good care of me for my house with all champion window.", "pics": null, "resp": {"time": 1522419506225, "text": "We're glad to hear that, Patricia. Thanks for the review! -Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "109863060916607137751", "name": "Marie Held", "time": 1370269077177, "rating": 2.0, "text": "Customer service at Champion is extremely poor.  After waiting 9 weeks for a replacement for a single panel of a patio door, that was busted during a home robbery,   the installer was upset because I was going up to Flint, MI for my daughter's graduation.\n\nChampion works on their own time with absolutely NO consideration for the customer.", "pics": null, "resp": null, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "104986636787680231329", "name": "Mark A", "time": 1570038347918, "rating": 1.0, "text": "This company does not deliver the quality or service that they promise. Highly disappointed by Champion Windows.", "pics": null, "resp": {"time": 1570047900113, "text": "Champion would love to make everything right, Please contact our Customer Care 888-395-0041 so we can address you concerns."}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "118085945564725037198", "name": "Matt D.H.", "time": 1571678848904, "rating": 1.0, "text": "Terrible quality and customer service. Waste of money using this company.", "pics": null, "resp": {"time": 1571747056955, "text": "Champion apologize that we feel short of your expectations, if you please call 1-888-395-0041 we would love to discuss the issues. Champion Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "112818881549461070855", "name": "Nancy Manning", "time": 1556110504709, "rating": 1.0, "text": "I tried to use the chat option on the website. Very rude person. Would never use them", "pics": null, "resp": {"time": 1556207084313, "text": "Thank you for contacting Champion and we are very sorry for your experience.  If you could please provide your contact information or contact us at 888-395-0041  Thank you National Customer Care"}, "gmap_id": "0x88626545c36f5ab7:0x6fb3859ed0eacb75"}
{"user_id": "101684836222605112158", "name": "Valorita Salaam", "time": 1612811440381, "rating": 5.0, "text": "Initially i was concerned re: when my work would start and remarkably, the installers showed up on a Monday and completed the work on a Friday!!! The guys could not have been more professional and courteous:-) They were kept us in the loop every step of the way and we could not be happier. I will recommend MA Jackson to any and everyone.\n\nThank you so much!", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "110864049055723485562", "name": "Joseph Marshall", "time": 1603642286902, "rating": 5.0, "text": "Last year,  M.A Jackson rebuilt my Deck. The crew was knowledgeable,  professional,  and courteous. This year, they sealed and stained that deck. There were initial problems getting the right people out to do the job because of prior job commitments, but eventually things worked out.  Everyone from office personnel, to the boss, to the stain crew, went out of their way to get the job do and make me happy. I strongly recommend.\nJoseph Marshall\nOwens Cross Roads,  Al", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "109273763668612700949", "name": "James Brasfield", "time": 1603201473284, "rating": 5.0, "text": "M. A. Jackson built me a screened pool enclosure and did an excellent job. The enclosure will provide insect protection (mosquitos/West Nile Virus, wasp, flies, etc.) and allow night swimming (keep bugs from flying into the lighted pool). The enclosure will also reduce pool maintenance/cleaning by eliminating falling and windblown debris, insects, frogs, etc. from entering the pool. Mr. Jackson and his entire team are friendly/courteous folks and are devoted to providing you with a quality product that you are completely satisfied with.", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "101762008964598927721", "name": "Pamela Fortier", "time": 1606785912319, "rating": 5.0, "text": "I love my new sunroom! From Start to Finish ALL M. A. Jackson employees have made every aspect of this building project a pleasant experience. Because of Covid-19 there have been a few unexpected setbacks. However, I was always informed about what was going on. The office personnel and construction workers were always very kind, friendly and professional. I can't stress enough how beautiful and well constructed my sunroom is. I wholeheartedly recommend M. A. Jackson for whatever your needs maybe. You won't be disappointed!", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "114799105984217025968", "name": "Doug Thompson", "time": 1586199038893, "rating": 5.0, "text": "M.A. Jackson took our concrete slab and turned it into a screened in room.....  After having to work around the weather ( All the rain ) they made us a fantastic area to sit in and not have to worry about the bugs.... It looks great... After it was done they had to come back to adjust a spot or two which only took 5 minutes and now it's perfect.... We found them very easy to work with and after the build they did a great job with the clean up..... They also called to make sure we were happy with our new room.... Yes... 100 %.... We will used them in the future and will Highly recommend to our family and friends....  Thank you M.A Jackson....", "pics": null, "resp": {"time": 1600301638479, "text": "Thank you for the 5-star review and kind words!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "102208728343896665081", "name": "Google User", "time": 1573583958453, "rating": 5.0, "text": "M. A. Jackson Co. recently installed a walk-in shower for us in our master bath. The installer did an excellent job with the installation. It exceeded our expectation. They were extremely courteous and proficient in their completion of the project. The work area was cleaned and all materials removed when the job was completed. Thanks for such a good job.", "pics": null, "resp": {"time": 1600301590416, "text": "Thank you for the 5-star review and kind words!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "115304278249640712525", "name": "Google User", "time": 1572365187415, "rating": 5.0, "text": "I did research on patio covers before deciding to go with MA Jackson, Co. The price was right and the design complimented our home better than the competition. We are so happy with the results. We sat under the patio cover the same day the job was finished. I would definitely recommend MA Jackson, Co. We are totally satisfied.", "pics": null, "resp": {"time": 1600301541365, "text": "Thank you for the 5-star review and kind words!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "107592303904915315005", "name": "teresa cobbs", "time": 1567426532477, "rating": 5.0, "text": "Absolutely the best guys around. They added a screen room to my carport. The crews that came out, were respectful neat and eager to please the customer.  I love my new space. Nathan Nicholaus is one of many that worked and the whole crew seemed to really put forth a team effort. Would recommend M.A Jackson Co.", "pics": null, "resp": {"time": 1600301609158, "text": "Thank you for the 5-star review and kind words!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "115955243844226744303", "name": "Diane Cooper", "time": 1574274685681, "rating": 4.0, "text": "I have had MA Jackson Co do a few projects for me over this past year and have been happy with the results.  Because of my disability due to cancer and amputation surgery, I had to have my master bathroom remodeled to install a walk-in handicap-accessible bathtub as well as open up a wall so that I can get into the toilet with my wheelchair.  Also had cement ramps built up at the front and back doors.  Aside from the medically necessary remodel, I also had a screened-in back porch put up and it's so perfect for us and the cats love it!!!  Just be patient as their crew is sometimes backed up with projects.  His guys are very respectful and friendly.", "pics": null, "resp": {"time": 1600301451080, "text": "Thank you for the 5-star review and your kind words about our company! If there is anything else we can do just give us a call. Thank you once more."}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "107216536958217320162", "name": "Cindy C", "time": 1582517883923, "rating": 5.0, "text": "They built a nice sun room for us, we love it. Quick, hard workers, great craftsmanship, couldn't be happier", "pics": null, "resp": {"time": 1600301494872, "text": "Thank you for the 5-star review and kind words!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "104968894491755492809", "name": "Linda Sell", "time": 1578358313534, "rating": 5.0, "text": "M.A Jackson Co installed us a screen in porch....we were very pleased with the work and professionalism of the men that installed our screen porch....I would highly recommend them and if I need anymore remodeling I will call M.A Jackson Co.", "pics": null, "resp": {"time": 1600301284053, "text": "Thank you for the 5-star review and kind words!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "107619999855236609786", "name": "Google User", "time": 1572967513196, "rating": 5.0, "text": "We went to a local home and garden show in Huntsville, AL where they had a display. We used them to build a cover on our outdoor patio with a fence and railing, etc. Outstanding!", "pics": null, "resp": {"time": 1600301088125, "text": "Thank You For The 5-Star Review!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "106249274123875795877", "name": "Lisa Sheffield", "time": 1508074721819, "rating": 5.0, "text": "Andy and his crew were great.  I love my sunroom and new deck!  Would definitely recommend to anyone looking to have a big project done.", "pics": null, "resp": {"time": 1564090788852, "text": "Thank you for the nice review and  \"5\" stars!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "109858007450538613604", "name": "Shana Romano", "time": 1530317921658, "rating": 5.0, "text": "Love my patio cover!! Andy was courteous and made sure that I was pleased with the work when finished.", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "114196298873055635658", "name": "John Drake", "time": 1500341916837, "rating": 5.0, "text": "M. A. Jackson company did a great job for me! They were very professional. There workmanship was top notch. I would definitely use them in the future!", "pics": null, "resp": {"time": 1500344325299, "text": "Thank you Mr. Drake!\nIt was our pleasure working closely with you and your wife, to get you the results you were wanting to achieve. We truly look forward in the near future to serving you both again, in all your home improvement needs."}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "106114360154908385574", "name": "Denise Cooper", "time": 1596555835994, "rating": 5.0, "text": "This is a great company!!!!  They stand behind their products and their work !!!  High quality products and great workmen ship!  Thanks Andy and Pam !!!!!", "pics": null, "resp": {"time": 1600294220721, "text": "Thank you for the 5 star review and wonderful comment!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "117642623293589202957", "name": "A Google User", "time": 1503412523215, "rating": 5.0, "text": "Great people to work with! Best contractor in North Alabama! A reputable company that diversifies in many different products.", "pics": null, "resp": {"time": 1503611368405, "text": "Thank you!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "102939315835045237027", "name": "Mr. Burnz", "time": 1547616585385, "rating": 3.0, "text": "I had a Four Seasons Sunroom window that had an inside water leak. The sunroom was out of warranty, so I had to purchase the glass directly from Four Seasons in New York. The problem is, I had no clue how to install it. I’m glad that Andy and Jim were able to do this,  but I think $1200 for four hours labor was a little steep. (Includes two hour drive back and forth from Cullman)", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "112559819295600015600", "name": "Google User", "time": 1577816816860, "rating": 5.0, "text": "Exceptional work!", "pics": null, "resp": {"time": 1600294139004, "text": "Thank you for the 5 star review!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "113550473204076566708", "name": "Susan Goodson", "time": 1491248012950, "rating": 1.0, "text": "We met this company at a home show in Huntsville.  At that time, we were in the process of selling our home and from the feedback we received, folks were wanting lighter cabinets which is why we spoke to them.   Fast forward a few months.  I rec'd a call from the company following up from our contact.  I scheduled an appt. but told the caller we have since moved but the home we own now was in need of a kitchen re-model.  The appt. came and went and no one showed.  Come to find out, rep went to our old address ( I gave new address during the phone call)  I called them to reschedule.  Rep showed up at our home and that was the end of the beginning.  He did not listen to us.  We did no want re-facing but he continued to measure existing cabinets which we did no intend to keep.  I asked to look at the books he brought in.  He asked rather snarkily, have you checked out our website???  Yes, but since you have books can I look?  At the  end of a very awkward meeting, he said they have a designer that could help with what we want.  We have not heard anything from this company 4 months later.  The end.  Would not recommend this company.", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "109364140630479289749", "name": "Google User", "time": 1501683472326, "rating": 5.0, "text": "Exceptional work!", "pics": null, "resp": {"time": 1501708260862, "text": "Thank you"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "103763369473849546741", "name": "A Google User", "time": 1501865133252, "rating": 5.0, "text": "Great Company", "pics": null, "resp": {"time": 1503611333234, "text": "Thank You"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
