{"user_id": "101882399135650773020", "name": "Kim Sanders", "time": 1533593673008, "rating": 5.0, "text": "We are 100% satisfied with the service we received from McCaig & Griffin employees.  We love our new home in Blue Eye Water Front Community.  The professionalism the employees portrayed was awesome. We felt at home and were very impressed with Tina, Chase and Jamie.  You have an awesome team of people who are great at their jobs and go out of their way to accommodate no matter what the situation is.  They all deserve a big raise.    We love living here and being a part of the  community. We love living on the water and are enjoying our beautiful lot.  This community has come  a long way since we first moved in.   We are impressed with the changes and are  excited to see more changes that will come.  If you want a beautiful lot for home or R.V.,  on land or water this is a great place to be.....Jerry and Kim Sanders", "pics": null, "resp": {"time": 1535417444241, "text": "Hey Kim, thanks so much for the wonderful review. You have truly been an amazing member of the McCaig and Griffin family. Hope you are loving lake living out on your new waterfront lot!"}, "gmap_id": "0x888bd13d8e586329:0xbac64191be294f36"}
{"user_id": "103779748080836993524", "name": "Tina Goss", "time": 1534975514504, "rating": 5.0, "text": "I just bought a new Mobile home and I have found the prefect spot in the Blue Eye Community. I love the lot we have picked out. There have been so many changes in this Park. We believe we are going to be very happy here and look forward to many years on our lot. If your looking for a nice place to put your home or RV, call McCaig & Griffin. They will get right on it for you.", "pics": null, "resp": {"time": 1535417554448, "text": "Hey Ms. Goss, First let me say welcome to the Blue Eye family. I think you are going to be excited about the changes coming to Blue Eye as we work to raise the standard of excellence throughout the community. We strive for a peaceful, safe and family oriented community and I hope you find it as such!"}, "gmap_id": "0x888bd13d8e586329:0xbac64191be294f36"}
{"user_id": "112555270096507690147", "name": "Ethan Martin", "time": 1570377522912, "rating": 4.0, "text": "Has some nice spots water just resieds certain times of year", "pics": null, "resp": null, "gmap_id": "0x888bd13d8e586329:0xbac64191be294f36"}
{"user_id": "117449532947111676391", "name": "Jennifer Thrower", "time": 1548779491918, "rating": 5.0, "text": "Blue Eye is a wonderful place, and everyday McGaig& Grffin have been working to upgrade the area. From the new roads to the landscape. They have several communities where you can have an RV on the lake,                   mobile home on or off the water. If interested call and set up an appointment with one of the sales staff.", "pics": null, "resp": null, "gmap_id": "0x888bd13d8e586329:0xbac64191be294f36"}
{"user_id": "105862436652168828402", "name": "Kevin McCullouch", "time": 1562449793835, "rating": 3.0, "text": "My sister lives their. Only complaint is to many potholes and a registered perv who lives infront of her.", "pics": null, "resp": null, "gmap_id": "0x888bd13d8e586329:0xbac64191be294f36"}
{"user_id": "102244426544665226412", "name": "Patsy Farmer", "time": 1530754401463, "rating": 5.0, "text": "It was very nice great place to visit owners were very nice and inviting great visit even dog had a lot of hospitality and entertained and played with kids and adults we will go back", "pics": null, "resp": null, "gmap_id": "0x888a8e74732782cb:0x9f72437402c065a9"}
