{"user_id": "106667157724249684034", "name": "Gretchen Perry", "time": 1602713953548, "rating": 5.0, "text": "I love Torrid. As a plus size woman I feel like I cant go into most places and find sexy trendy  etc clothes but Torrid always delivers. If anything I wish they carried a few more of the bigger sizes in the stores but I know I can usually find it online if not in store!", "pics": null, "resp": null, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "111025507861336035938", "name": "Megan Cook", "time": 1600733351438, "rating": 1.0, "text": "Went in at 6:20. Had a handful of items picked out by 6:30. Just needed to try on and pay. Employee told me their changing rooms were closed because they were preparing to close, despite having just let another lady into a room. Their store does not close until 7:00. I was in town for work and needed a couple things for the week. I do not buy clothes without trying them on. Left without purchasing them. Will not be back to this location.", "pics": null, "resp": null, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "109147436317041029133", "name": "Cornesia Lewis", "time": 1599407943591, "rating": 4.0, "text": "I want to start by saying the only reason I give it 4 stars is because the staff wasn’t welcoming at the time, love the clothes but it made me want to shop else where because of how the staff was. When I went to try on stuff, which I was iffy about (covid-19), but I have to try on certain stuff. At first i was the only one in the store for a little while before a second person came in, I asked about the dressing room, girl went in to clean it sanitize which I appreciate. But if I’m about to buy something & I’m trying it on why is the staff asking how long I got in the dressing room she knocked on door more than once , like was there a time limit or something? she kept asking me other people need to try on stuff I’m thinking like it’s about 4 other rooms & then they told me once I go in I can’t go in but once.  With that being said I made sure that I took in all what I could & wanted to purchase. Like don’t rush I’m trying multiple pieces, come out it’s like one person with two other people sitting including a man, which he is not trying on stuff waiting. Manager kept making small comments to staff hardly spoke when I came in....I wanted to give them a piece of my mind but wasn’t worth my time,  hence store was only open about 45 mins when I arrived so I don’t want to hear anything about a long day. Would have never went into store but shop online but I needed something I didn’t want to wait To ship only to arrive with limited selection. The world is already in a crisis to have people like this   Someone would love to have your job & customers are what keeping it open.", "pics": null, "resp": null, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "114450579005812258229", "name": "gwendolyn johnson", "time": 1621978433618, "rating": 5.0, "text": "Great staff, great sale today", "pics": null, "resp": null, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "109782477926605274135", "name": "100 Real", "time": 1618184419975, "rating": 1.0, "text": "First time shopping there . I wasn't greeted and noone offered assistance", "pics": null, "resp": null, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "111081557260904803010", "name": "Alexandria Gauntt", "time": 1554644371537, "rating": 5.0, "text": "Very nice and has some lovely clothes. The dressing rooms are designed nicely also.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP_nti7fEtryu7fogignYM6MZeR8MW8l5IBpg4f=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "115488493895869929213", "name": "shandia scott", "time": 1584041815510, "rating": 3.0, "text": "First let me say that I Love Torrid. Their clothes are awesome and the fit is even better. However, I do get frustrated with the local Torrid store, because they never have anything in stock. I'm not just talking about the online exclusive things. They always say how they don't have something.  Other than that,  Torrid is awesome", "pics": null, "resp": {"time": 1584205824038, "text": "Thanks for reaching out, shandia scott! We will be happy to pass along the feedback to our corporate team."}, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "116526403183543423222", "name": "Shannon Hopkins", "time": 1620777687551, "rating": 3.0, "text": "A lil confusing on the site", "pics": null, "resp": null, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "105492720409904234476", "name": "Debra H", "time": 1556635888211, "rating": 5.0, "text": "I was pleasantly surprised by all the pretty clothes. I have nerve problems in my shoulders and finally found a pretty bra that is comfortable and doesn't cause pain. I will be going back.", "pics": null, "resp": null, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "111154579157700100467", "name": "Constance Burke", "time": 1557775732349, "rating": 5.0, "text": "Torrid opens an actual store in Montgomery!! We now have several shopping destinations for women of all ages who are curvy and dare to be  fashionable!", "pics": null, "resp": null, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "106410553707269913574", "name": "Ari Rose", "time": 1568204350580, "rating": 5.0, "text": "I love this store so much!", "pics": null, "resp": {"time": 1568311511083, "text": "Ari, we love you too and are so happy to hear from you! Thank you for stopping by and the great review! Have an amazing day!"}, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "101205061377909102521", "name": "amy revis", "time": 1623113602167, "rating": 1.0, "text": "Came in today really needing a pick me up and there was a red head woman working who ruined this for me...I love this store but will shop in Hoover bc the red head woman was high and rude.", "pics": null, "resp": null, "gmap_id": "0x88891304dd51c1c1:0xfea47593e193f52a"}
{"user_id": "107358104168286123201", "name": "Racheal Bagley", "time": 1600457446457, "rating": 5.0, "text": "The woman there was great and helped me out alot. Happy to shop there again.", "pics": null, "resp": null, "gmap_id": "0x88891304dd51c1c1:0xfea47593e193f52a"}
{"user_id": "117711447631154434340", "name": "Seraphina Croi", "time": 1580945813695, "rating": 5.0, "text": "The sales employee was very knowledgeable, friendly, helpful and polite. I will go back there just because of her. The sale going on was awesome as well. Beautiful clothes in a variety of styles and sizes. Love this store!", "pics": null, "resp": {"time": 1581033773204, "text": "Seraphina, we are so happy to hear from you! Thank you for letting us know you had a pleasant experience with our Leeds Torrid team. Have an amazing day!"}, "gmap_id": "0x88891304dd51c1c1:0xfea47593e193f52a"}
{"user_id": "100873539856770134890", "name": "Caroline Baker", "time": 1562720700030, "rating": 5.0, "text": "I love this store. The staff are always friendly.", "pics": null, "resp": {"time": 1562798947182, "text": "Caroline, we love you and are so happy to hear from you! Thank you for the positive feedback about the service you received! Have an amazing day!"}, "gmap_id": "0x88891304dd51c1c1:0xfea47593e193f52a"}
{"user_id": "103432184903783154726", "name": "shea wilkerson", "time": 1573432398027, "rating": 5.0, "text": "Great quality products with A+ customer service!!!", "pics": null, "resp": {"time": 1573777480998, "text": "shea wilkerson, we are so happy to hear from you! Thank you for letting us know you had a pleasant experience shopping through our great style selections with our friendly Torrid team members. Thanks for stopping by. We hope you are loving your new purchase. Have an amazing day!"}, "gmap_id": "0x88891304dd51c1c1:0xfea47593e193f52a"}
{"user_id": "101888830812202008895", "name": "Sara Thurgood", "time": 1568159370011, "rating": 5.0, "text": "Super comfy clothes, very helpful sales staff.", "pics": null, "resp": {"time": 1568161511291, "text": "Sara we are so happy to hear from you! Thank you for letting us know our team in Leeds provided a great experience for you. Have an amazing day!"}, "gmap_id": "0x88891304dd51c1c1:0xfea47593e193f52a"}
{"user_id": "104114126834917129031", "name": "Cynthia Harkness", "time": 1557516602072, "rating": 3.0, "text": "Not a good selection of cropped or capri pants.", "pics": null, "resp": {"time": 1557752723773, "text": "Thanks for reaching out, Cynthia Harkness! We will be happy to pass along the feedback to our corporate team."}, "gmap_id": "0x88891304dd51c1c1:0xfea47593e193f52a"}
{"user_id": "115869086301088684980", "name": "zach TAYLOR", "time": 1614655771163, "rating": 5.0, "text": "I went to the store in Tuscaloosa Alabama and got Ashley Simpson to help me find the perfect gift for my wife. I was totally outside my comfort zone but If it wasn’t for her there to help me there is no way I would have ever been able to find my way. Since I have had such a great experience at that store with her help. I have been able to go back to that store with high confidence that she would be there to help me purchase many many gifts for my wife and my 3 daughters. She is the sole reason I shop there", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "113092338832879289017", "name": "denise congress", "time": 1607195988324, "rating": 5.0, "text": "I shopped for My Birthday yesterday at Victoria Secret. It was an awesome experience. I loved the Gifts I bought for Myself. I will be going back. But Word of Caution, due to the Social Distancing,\nbe prepared to stand in line at the Door. The Sales Clerks is standing at the Door; letting few in at a Time.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM5c_-iRlP306c0bWUZ8lqJJhPFyRoj1OyP9nYi=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "118209732440739048726", "name": "Haven Taylor", "time": 1614655912836, "rating": 5.0, "text": "Ashley Simpson and her staff at Victoria’s Secret Tuscaloosa are amazing. They are so helpful and the store is always so clean. They always greet you with smiles and help you find everything you need. The store always has plenty of merchandise in stock. The lotions are my favorite and always have great sales. I am thankful for having the store in Tuscaloosa and will always shop here instead of online.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "115678181343736975589", "name": "Chrissy Moore", "time": 1621368693951, "rating": 4.0, "text": "They people are usually really nice but lately when I go in there noone even comes to ask if I need help. When I'm usually in there for a specific item that I can not find.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "103392426301740251285", "name": "Patricia Boykin", "time": 1539207734419, "rating": 5.0, "text": "I love myself some Victoria secret perfume. I love shop in the store or online.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMmMkn80lW1A3U53_uwXwQToCEka5hka5WoMnAT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM8tMU8CNeHrkHVDrb3YxON8OdpW-dbPprnx7BT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNG-lLjVOmvug4fBsVPtIHhAQhYGTYrQsyETLhP=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "105293631898860718946", "name": "Kim Bullock (Momma)", "time": 1619102099079, "rating": 5.0, "text": "My FAV store. Love the sales going on. Great staff.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "115747766640828650812", "name": "Jamie lou Purser", "time": 1618697196044, "rating": 5.0, "text": "Hands down best one I have vist the sales lady debbie found my right size and and I got three bras for under 90 bucks that fit customer service is great", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "116721872808569597612", "name": "LaDonna King", "time": 1621630198806, "rating": 4.0, "text": "It's really nice to be able to go in a business without a mask", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "117910032529622564558", "name": "Lori Hogan", "time": 1589252712122, "rating": 5.0, "text": "Awesome store.  Friendly workers. They have great products the pricing is iffy. And I love the scents and tote bags. Never had an issue", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "104792842111260356749", "name": "Jenna Lynn", "time": 1462548951157, "rating": 5.0, "text": "The staff is EXTREMELY helpful. They're so nice and just fun to be around. This is the best shopping experience I've ever had and I hate shopping. This was also the first time I had ever went in VS and I will definitely be getting my bras there from now on. They fit so well and are really comfortable.\nThe woman I had helping me was the most helpful sales associate I've ever came in contact with.\nWill most definitely be shopping at this location again!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "111414778136583237245", "name": "Haleigh Bolton", "time": 1532285019072, "rating": 4.0, "text": "I love the quality and style of everything they have!  The only reason i didnt give them 5 stars was because of the prices.  But they have really good deals and when they do,  you better go.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "104243692820953755023", "name": "Jessica Cook", "time": 1528934818945, "rating": 1.0, "text": "The lady who measured me for a bra told me my size and then commented, \"no push up bra! You are past that, mommy.\" Really? I didn't ask her what style I should get or her opinion. I asked for my new size. It's been a while since I've encountered a nice helpful employee here.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "102360841293927416163", "name": "Tabatha festa", "time": 1545920027596, "rating": 4.0, "text": "Love Victoria secrets clothes, perfumes, bras socks, exc.  But the prices or way way to high. & some of the employees there are snotty acting. & not much help at all. Need to consider in lowering there prices way way down & make it more affordable for everyone. Especially there clothes & bras.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "106987836655976849781", "name": "Candy Harrison", "time": 1517171705196, "rating": 1.0, "text": "I was not happy with my experience here at all. I was followed around the store by one worker. Mind you I'm a disabled veteran on a cain. While I let my daughter shop, and not once did she ask if we needed help. It wasn't until I went to the pink side that a rep. Assisted us. However,  I spent over 200+ dollars. My daughter said she wouldn't like to return to that store again.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "108607456321979281783", "name": "Quikdraw 72", "time": 1579491721419, "rating": 4.0, "text": "Great quality and always something on sale.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPiSSySov082A-LAcGmF8my4owM3-6yCkz6-ji2=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "104582193078725368269", "name": "Francis Herring", "time": 1555846508497, "rating": 5.0, "text": "Very friendly and helpful staff. The store is clean and inviting.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "101416287120067212973", "name": "Mickie Ann Wagner", "time": 1555035244819, "rating": 2.0, "text": "Store was nice. Staff was snooty and not helpful. We were pretty much ignored until we paid for our selections.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "108230942032367414880", "name": "Brandice Ware", "time": 1562970794661, "rating": 5.0, "text": "I received phenomenal service and help from Ebony even though my return was lengthy she still with a positive disposition was able to apply my coupons to the best of her abilities. I will be returning to this location.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "105721256486792615956", "name": "Rebeckah Strickland", "time": 1515904017418, "rating": 1.0, "text": "I used to love shopping here..things have seriously gone down hill. They might have gotten a new look but as for customer service, there is ZERO. I walked in here with my husband and decided to get a couple things. Tried to ask for help to get a price on an unmarked product and I was ignored. Each time I tried to ask someone they basically ran to the back to hide. Lady at the register wasn't helpful either. If this is how you treat your customers then I'll be taking my business elsewhere.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "113937119186866136680", "name": "Marie Johnson", "time": 1545608615538, "rating": 5.0, "text": "Went the day before Christmas Eve it was busy the lines was very very long.but the move very fast,Cashier 3032894 was very nice and friendly", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "113840926010344466017", "name": "Logan Elise", "time": 1539290594578, "rating": 5.0, "text": "Always helpful staff waiting to greet you, and amazing deals if you buy in bulk. Sexy selections too!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "117893025765703165982", "name": "Maddie Mills", "time": 1481134290417, "rating": 1.0, "text": "Completely and utterly dissatisfied with my experience at his location this past weekend. Went to take advantage of their sale and happened to get a two piece pajama set as well after I was informed about a promotion they were running. Upon checking out, the cashier told me to just grab a pair of slippers on my way out for the pajama promotion. As I left, I didn't see where to pick these up so I asked a manager and she was suggesting that I was trying to steal because you can't just grab slippers and walk out. Well, if I had not been directed to do so, then I wouldn't have. Turns out, many customers had been told the same thing that day which explains why the alarm kept going off. Ended up walking out after the poor service from the individuals in the store.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "110735235150295408185", "name": "Carolyn Roland", "time": 1554815661651, "rating": 5.0, "text": "Great sale, everything always in order and staff was friendly and very helpful.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "107540115474300006685", "name": "Natalie", "time": 1552313897192, "rating": 4.0, "text": "It was crowded but other than that I always have a good experience shopping here.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "116477555025114321184", "name": "Kara Sallee", "time": 1497318551724, "rating": 1.0, "text": "Are there even people who ACTUALLY work here? or that help customers who need assistance?   Left the store empty handed, without so much as a glance from the laughing workers.  Rudest staff I've ever came across. Taking my business elsewhere from now on. ✌🏼", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "116111879080432855489", "name": "Nelly J", "time": 1561866930491, "rating": 5.0, "text": "Friendly Employees willing to help at any time..", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "111330288517077213147", "name": "India Lukas", "time": 1523328670082, "rating": 5.0, "text": "Love bogo free for body spray and lotion any day! Sign up for the coupons- sent right to your mailbox!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "100810983584844819171", "name": "Kim Drish", "time": 1531738842284, "rating": 5.0, "text": "I love this store. Great customer service...", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "103545531508976264559", "name": "Michelle Davis", "time": 1528025972605, "rating": 5.0, "text": "Great experience. Clean store, good selection, and courteous staff.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "105270846042193238342", "name": "Cameyer Anderson", "time": 1537925529657, "rating": 5.0, "text": "Bought a couple Pink items on a very low price 2 for 1", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "113890080606604954668", "name": "Rhonda Irick", "time": 1457830510875, "rating": 1.0, "text": "Worst shopping experience I've had in a long time. The staff were unfriendly and unhelpful. My daughter's and I will be shopping online or driving to Birmingham from now on.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "105328082722826691030", "name": "Vanessa Brown", "time": 1491264278520, "rating": 3.0, "text": "I love their perfume and body sprays but their bras are not the least bit impressive. The past 3 I bought there didn't fit properly after a few washes.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "114134785974983675374", "name": "lilshadow Vicki-72", "time": 1546317383128, "rating": 5.0, "text": "Something about this place just makes me feel beautiful", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "104651398572300312025", "name": "Lynda Dodson Gray", "time": 1542983634856, "rating": 4.0, "text": "Beautiful clothing and great customer servicea.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "104466812793751764417", "name": "Terri Lane Robertson", "time": 1542727000855, "rating": 5.0, "text": "Great service and selection!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "109750352301259566716", "name": "Sebastian Holcomb", "time": 1500775649506, "rating": 1.0, "text": "I've only been in here once to look at what they had. I was severely disappointed at the cheaply made items they had. All of it seemed way too thin and like it wouldn't last very long before needing to be replaced.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "104179116175998658863", "name": "Carley Meisenholder", "time": 1563741600276, "rating": 5.0, "text": "Clean and great customer service", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "100747476958703813585", "name": "Sheila Jones", "time": 1557377869509, "rating": 5.0, "text": "It was good.....!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "108772663495560871879", "name": "Eva Harris", "time": 1533691498776, "rating": 4.0, "text": "Great sale on lingerie!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "115998246434598346360", "name": "Danyale Jones", "time": 1544966125889, "rating": 5.0, "text": "One of my favorite stores.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "111128290378063842904", "name": "Nate Mehl", "time": 1489207128287, "rating": 5.0, "text": "Great service, good atmosphere", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "109858826750511579936", "name": "Andrea Howell", "time": 1528541646624, "rating": 5.0, "text": "Love shopping here", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "107758309611755351240", "name": "Carol Notperfectyet4given", "time": 1560578528270, "rating": 4.0, "text": "Love the products.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "109610073844791298892", "name": "Brady Hilyer", "time": 1537361631053, "rating": 5.0, "text": "Love shopping her with my wife!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "107377572741709202566", "name": "Jackie Green", "time": 1536007063505, "rating": 5.0, "text": "Got nice stuff", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "104466124580143520162", "name": "nyell Williams", "time": 1551758130631, "rating": 5.0, "text": "Nice place too shop", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "104643921623291193919", "name": "nick ray", "time": 1529253069121, "rating": 2.0, "text": "If you not skinny.you can for get it", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "107646346980132679231", "name": "Heather Smith", "time": 1533328947114, "rating": 5.0, "text": "Love VS!!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "114101122201921317567", "name": "No New Friends", "time": 1530214482592, "rating": 5.0, "text": "Friendly staff!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "105017034017448891426", "name": "myworld Moss", "time": 1528632088294, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "109070665696699159564", "name": "Rachelle Smith", "time": 1527302142559, "rating": 2.0, "text": "Too pricey", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "101127687922038458569", "name": "April Abrams", "time": 1527950620991, "rating": 4.0, "text": "Very pricey", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "107721443821316654730", "name": "Jalena Chambliss", "time": 1524867510304, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "105352440311808773098", "name": "Tara Bragg", "time": 1538498384115, "rating": 5.0, "text": "Very awesome staff", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "100752121150518016470", "name": "Wendy Canner", "time": 1535258545663, "rating": 4.0, "text": "Love this store", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "102811650118888468161", "name": "Jacketta Spates", "time": 1547617816855, "rating": 5.0, "text": "My favorite store", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "115500133441606576669", "name": "Shaiema Joseph", "time": 1527818370881, "rating": 5.0, "text": "Love this store!", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
{"user_id": "113478396759228074054", "name": "Alex Lee", "time": 1463714587101, "rating": 1.0, "text": "this VS is the worst one I have seen, also people that work there don't seem to care to help you.", "pics": null, "resp": null, "gmap_id": "0x8888a83398ccf29f:0x6de9afa5f6a755a9"}
