{"user_id": "102152517178800874015", "name": "Roxane Ray", "time": 1349833352155, "rating": 5.0, "text": "I Highly recommend David Holler's Taekwondo. I enrolled my son 6 months ago and he could not be happier! Mr. Holler is excellent with children and teaches with an individual pace depending on the  childs needs...My son looks forward to going to class 5 days a week and has already shown tremendous improvement in Attention,Discipline, Flexibility and Self Control.. David Holler's Taekwondo is also extreamley affordable compared to other places in Mobile . I have also enrolled both of my grandchildren in his classes as well... 5 Stars!", "pics": null, "resp": null, "gmap_id": "0x889bb3b84ee506dd:0x94d3b82d2bb5c824"}
{"user_id": "117494421199897266086", "name": "Nick Roussos", "time": 1502407927464, "rating": 5.0, "text": "Great taekwondo school. Great instructor. Great with kids and adults!", "pics": null, "resp": null, "gmap_id": "0x889bb3b84ee506dd:0x94d3b82d2bb5c824"}
{"user_id": "107244655574647047186", "name": "Wes Allday", "time": 1487996896815, "rating": 5.0, "text": "David Holler is a phenomenal instructor that connects with his students in a way few can. He fosters a positive environment for his students to learn and excel in Tae Kwon Do. No contracts, no constant upsells. I can't say enough good things about him. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x889bb3b84ee506dd:0x94d3b82d2bb5c824"}
{"user_id": "100842264521567348173", "name": "George Strickland", "time": 1464221023373, "rating": 5.0, "text": "Top notch instructor.  Dedicated to the pursuit of excellence!", "pics": null, "resp": null, "gmap_id": "0x889bb3b84ee506dd:0x94d3b82d2bb5c824"}
{"user_id": "104596104848584268768", "name": "Tony Wallace", "time": 1522380134023, "rating": 5.0, "text": "Been knowing David Holler for years. Great guy with a great school.", "pics": null, "resp": null, "gmap_id": "0x889bb3b84ee506dd:0x94d3b82d2bb5c824"}
{"user_id": "109570129816601656590", "name": "TiffanyAnn Borton", "time": 1626220906921, "rating": 5.0, "text": "We love Tiger Rock and the Crutchfields. My family has been going for about 4 years now. All three of my kids and myself. In tiger cubs they work on respect, focus, balance and coordination to name a few. Then as they go up the ranks they work hard and test. Sometimes they fail and learn to keep trying and work threw it. As an adult I don't have as much time as I would like but I am able to work threw things at my own pace and push myself to always improve. Tiger Rock is our extended family. Always working hard to achieve our goals.", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "117378737300638724389", "name": "Cala Grier", "time": 1627390013132, "rating": 1.0, "text": "My kids attended few years ago-i talked this place up until my daughter was being bullied by another older student.  She went to Mr Crutchfield and all he could say is not my problem.  He preaches that what he teaches doesnt mean you bully-but since the other child was known to be his fav he refused to get involved until my child ended it herself and fought back.  Than my child was no longer wanted there.", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "100015359816595129238", "name": "mackenzie Waters", "time": 1624407226597, "rating": 5.0, "text": "So far my son has really enjoyed going. He's heavier so I am happy he's getting into stuff like this. Plus he's always self-conscious of his size and gets bullied some times for it at school. It's been a real weight lifting experience to see him so happy and not worrying about his size for once. The teacher is really nice and from what I have seen so far very experienced in taekwondo. They have classes 6 days a week with some days having 2 different choices to participate in class.\nPlus my son told me after class today that the main instructor Kevin is always so helpful and nice. Then he goes on to say how strong kevin is and that he will be the final boss for him lol. Watch out Kevin you may have a rival in the works.", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "113788262781210485721", "name": "Shannon -Ellie- O'Brien", "time": 1599615852746, "rating": 5.0, "text": "The atmosphere is absolutely perfect for me and my daughters to learn martial arts! Respect, focus, determination and indomitable spirit flow out of each of the instructors. I've learned so much in a short time and I know my growth and my daughters growth will continue. A huge thank you to the Crutchfields for welcoming us with smiles!!", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "107580428333957528667", "name": "Karell Jackson", "time": 1603332224573, "rating": 5.0, "text": "The Crutchfield's are highly knowledgeable and professional highly recommended to anyone who is looking to learn an art.", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "108801386479175959325", "name": "Donna Jane", "time": 1563760999161, "rating": 5.0, "text": "My grandson really loves going and learning. The instructors are so nice and professional. Kids are not just handed belts for showing up they have to earn them and they get the satisfaction of knowing they've really accomplished something. The owners are very involved and do a wonderful job. Thank you so much!", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "108724763145873469132", "name": "Michelle Fefelov", "time": 1582416300124, "rating": 5.0, "text": "I have never experienced a place that is more dedicated to teaching our children not only Taekwondo but life skills and morals.  Mr Crutchfield, his family, and his staff work hard to teach not only how to succeed but how you have to work hard to make it happen. They also explain that failure is a part of life and how to grow through it.  You will never come across a business that makes you feel more like family!", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "109326187866869667909", "name": "Jennifer Lawrence", "time": 1582427331037, "rating": 5.0, "text": "Amazing group of people who really care. Love that they engage the whole family and great place to be. I love it!!", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "107551766955753952311", "name": "Sara Short", "time": 1584972057402, "rating": 5.0, "text": "We love Crutchfield’s Tiger Rock! Training is available for all age groups, so what started out as an experience for the kids has turned into a family adventure. Master Crutchfield is not only an amazing Taekwondo instructor, but is equally invested in helping his students develop character traits that will go far beyond martial arts...courage, perseverance, confidence...all invaluable life lessons. We love Master and Mrs. Crutchfield and couldn’t imagine training anywhere else!", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "104329563485528779183", "name": "David H.", "time": 1582408973633, "rating": 5.0, "text": "Kevin is one of the best instructors i have seen. The way his family lives the business, and not just run it, truly is a testament to how much passion they have for martial arts.", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "104208191473042635686", "name": "Michael Grimes", "time": 1582408990157, "rating": 5.0, "text": "Great place to take your child! My daughter really enjoys her training there and mr. crutchfield and the whole staff does a great job and keep a great attitude.", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "104022445856631492475", "name": "Bettye Chapman", "time": 1582413322206, "rating": 5.0, "text": "Love, love, love this place! Owners are wonderful people, great atmosphere, great place to learn and grow in the field of martial arts.", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "102067760971739631129", "name": "Crystal Taylor", "time": 1583370378251, "rating": 5.0, "text": "Mr. Krutchfield is patient and caring. We enjoy watching our son learn and grow!", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "108436691825413509041", "name": "Keith Jones", "time": 1582589459551, "rating": 5.0, "text": "We looked into Tiger Rock and some other Academy’s a few years ago for my son. He had previously done baseball, soccer and wrestling. Coaching changes took him out of wrestling do we wanted something physical. We stopped and talked with Mr. Crutchfield and immediately felt welcome. He explained all of steps, what was expected of parents and kids. We signed up and haven’t looked back. The Crutchfield’s TRULY CARE about the students! It might be hard, but it teaches KIDS AND PARENTS about work ethic and that NOTHING is given to you in LIFE.\n\nMrs. Crutchfield runs the “front” and is pleasant, knowledgeable and funny (oh yeah she has ALOT of patience).\n\nMr. Crutchfield is out front also, but mostly taking care of teaching. He also is pleasant, knowledgeable and funny.\n\nThey both make class enjoyable for the parents and kids.\n\nI am glad we signed up and have no intentions of changing!", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "106527865112669706692", "name": "John Manning", "time": 1582429351304, "rating": 5.0, "text": "Crutchfield's has been a great experience for my youngest. He has learned much about Martial Arts, and more importantly about pushing himself. The lessons learned here are more than punch and kick, they learn respect, patience, and above all how to improve themselves.\n\nThis is a family run business and you see that because it is more than Mr. Crutchfield teaching. It is watching their youngest in class, their oldest helping mentor new students, and even Mrs. Crutchfield helping a young student tying a belt before class in between helping a parent sort out a question.\n\nYour kids will fall here, they will get hit, and they will even fail to advance to the next level. How they move forward after each event is based on the lessons they learn from this family and specifically Mr. Crutchfield.", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "105067700562827602882", "name": "Nicole Ellis", "time": 1582405091817, "rating": 5.0, "text": "I can honestly say from the day I made the phone call to get information about Crutchfields Tiger Rock, I felt welcomed. When I called, I didnt get a machine, I got Mr. Crutchfield himself. Willing to answere all my questions. Wasnt long and we had my son signed up. When we walked in Everyone was so friendly and welcoming. Mr. Crutchfield has a way with the kids, that allowes them to have fun, but is professional and pushes them to achieve their goals and perform to the best of their ability. He wants them to succeed in their wins and their losses.  Since our son has been in, his confidence in himself has improved so much. His Osgood schlatters isnt much of an issue anymore bc his flexibility has improved so much. I cant say enough good things about Crutchfields Tiger Rock!", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "100083764970308916186", "name": "Denise Baker", "time": 1508203538451, "rating": 5.0, "text": "Tiger Rock had been great for my son. Mr. Crutchfield and the teachers are great mentors that our young people need these days. If you're looking for a great family environment that introduces physical fitness and helps kids with confidence this is the place!! Sign up today!", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "115220301608964431196", "name": "Michelle Lunsford", "time": 1508204707658, "rating": 5.0, "text": "A great academy filled with great people.  My kids and I have been training there for over 4 years.  The people there are more than just teammates and training partners, they are family!  Mr. Crutchfield and his certified instructors, along with the leadership team do a great job of working with all age groups!", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "113789636850834955329", "name": "Molly Thomas", "time": 1488212945519, "rating": 5.0, "text": "I highly recommend this taekwondo studio... Mr. C is the best, he is awesome with kids (no matter what age) and he absolutely loves them all equally. We have been coming here for almost 2 years and 3 out of 4 people in my family take classes... It is very family oriented!!", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "116157703143181936319", "name": "Traci Varon", "time": 1508204027052, "rating": 5.0, "text": "No one in our family had ever taken Karate, I really thought it was a waste of time. My 10 year old son has loved it and the instructor really takes time to learn about each kid and teach them.", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "109640480132434492089", "name": "Danielle Kinsey", "time": 1508198250327, "rating": 5.0, "text": "My son's confidence has skyrocketed in just the last few months.  The Crutchfields are some of the best people you'll ever meet and they really care about this program and the kids in it!", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "118275439771195095794", "name": "Keith Paulk", "time": 1503774416896, "rating": 5.0, "text": "Master Crutchfield and Tiger Rock completely changed my life! His academy is the best in town bar none. You will not regret choosing this academy!", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "114063521764816209680", "name": "Adria Winlock", "time": 1508205039226, "rating": 5.0, "text": "Our family loves Tiger Rock! Mr. Crutchfield and his team are great with the kids. They have a genuine passion for the school and the students.", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "103883629086684880497", "name": "Vanessa Arasin", "time": 1508198914266, "rating": 5.0, "text": "Kevin and Emily were so awesome when we were there! My daughter loved every aspect of learning Taekwondo with them while we lived in Alabama.", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "118007740479708168659", "name": "Madison Thomas", "time": 1508192414488, "rating": 5.0, "text": "This place is great for people from age 4 and up to learn taekwondo. The classes are split according to age, so students can learn with people their age and the instructors are great. They're very helpful. I highly recommend this academy if you or your child is looking to learn taekwondo", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "103290516270379663641", "name": "Jennifer Cartwright", "time": 1508198417512, "rating": 5.0, "text": "It has been amazing how happy my son has been and how he is growing while there. Great team to be a part of!", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "103886691321574878371", "name": "Loretta Sonsalla", "time": 1495497337250, "rating": 5.0, "text": "We have absolutely loved our time at Tiger Rock.  Our son gained and learned so much just in a year!  The Crutchfields and the other instructors have created a very family-friendly, focused, goal-oriented environment for the kids to grow in martial arts.    Our son will miss his Tiger Rock buddies - they are like family to him.  We highly recommend Tiger Rock!!!", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "116150856923538550443", "name": "Lori Vela", "time": 1508200333376, "rating": 5.0, "text": "My family loves this Taekwondo school. Master Crutchfield and his instructors are great. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "115678571137462986327", "name": "ASPTV ASPTV", "time": 1508199830553, "rating": 5.0, "text": "My son and step son have both been going here for 6 months now. They both have deferent learning styles and the instructors have figured out what works best for them and all the other children in the class to help them all succeed.", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "117239326008807921566", "name": "Benito Vela", "time": 1582471453884, "rating": 5.0, "text": "Excellent school and instructor's. Excellent schedule with up to 6 days available to train in a week.", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "103416962602094148925", "name": "Tina Reeves", "time": 1508196110301, "rating": 5.0, "text": "Our whole family has been members here for years! We love the school, the discipline and the competitions.", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "113483112079424323786", "name": "Kevin Williams", "time": 1508366835057, "rating": 5.0, "text": "My daughter has attended this academy for 3 yrs. I would recommend this place to anyone.", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "100771966385647165940", "name": "Joey Hyde", "time": 1508198167444, "rating": 5.0, "text": "Love the professionalism and kindness of this academy.. wouldn't train anywhere else...", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "113736211087816670643", "name": "Aric Lobenstein", "time": 1508198743067, "rating": 5.0, "text": "We love Crutchfield's Tiger Rock!", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "101272169083166986752", "name": "liz ryan", "time": 1508198343028, "rating": 5.0, "text": "Could not ask for a better place for my kids!!", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "113175766336428884380", "name": "Fortnitegod Iwillclapum8", "time": 1508198424756, "rating": 5.0, "text": "Great place.", "pics": null, "resp": null, "gmap_id": "0x888e856107df476b:0x44489a1ecddb1601"}
{"user_id": "112077620194315856139", "name": "robert hyche", "time": 1619023050664, "rating": 5.0, "text": "McCoy's Taekwondo is one of the nations premier taekwondo schools. As part of Taekwondo America McCoy's school often finishes in the top 10% of schools at national tournaments. My children have been attending for eight years and the staff and other families have became like a second family to us. I highly recommend for all children and any adults wanting to challenge them selves.", "pics": null, "resp": null, "gmap_id": "0x8889e6afcbd09f87:0x547ccbf51d5d31bc"}
{"user_id": "104237545715787694461", "name": "Jeffery Cowen", "time": 1596118122189, "rating": 5.0, "text": "McCoy's is a caring and wonderful atmosphere for anyone.  If you're looking for a martial arts studio for yourself or your kids you should consider McCoy's.", "pics": null, "resp": null, "gmap_id": "0x8889e6afcbd09f87:0x547ccbf51d5d31bc"}
{"user_id": "111259707683246980437", "name": "Laura Braswell", "time": 1596135383180, "rating": 5.0, "text": "Instructors are very professional and patient with my 9 yr old son. I appreciate their structure and accessibility for classes.", "pics": null, "resp": null, "gmap_id": "0x8889e6afcbd09f87:0x547ccbf51d5d31bc"}
{"user_id": "106640009154953127122", "name": "Stephanie Beaver", "time": 1564259259798, "rating": 5.0, "text": "Starting martial arts as an adult was intimidating. I was very unsure of what to expect or how to act. I have been with McCoy’s Taekwondo America for a little over 3 years now. I am so thankful I chose to walk through those doors. The instructors are highly trained and skilled in what they do. The environment is always welcoming and you feel like family. If you’re looking to start, this is definitely the place to go! They are amazing!", "pics": null, "resp": null, "gmap_id": "0x8889e6afcbd09f87:0x547ccbf51d5d31bc"}
{"user_id": "115233451434076350691", "name": "Jimmy Morgan", "time": 1564204622544, "rating": 5.0, "text": "I can't say enough about the positive impact this program has made on my 3 boys! Brian McCoy and his family have been a huge factor in the way our children are being raised. They are not only being taught self discipline, respect, loyalty, and integrity, but also they are being guided into being better all around as human beings.  I absolutely love this program and all my boys are learning to be better men because of it.", "pics": null, "resp": null, "gmap_id": "0x8889e6afcbd09f87:0x547ccbf51d5d31bc"}
{"user_id": "111404987716382773387", "name": "Alysa Eason", "time": 1562181187381, "rating": 5.0, "text": "Our family has been with this school for the last year. We have had such a great experience here! My youngest is autistic and pretty difficult sometimes, but they're always super helpful but still firm with her. My oldest is just coming out of her shell and they're so encouraging and have such love. I just recently joined with the kiddos and have really enjoyed the challenge but also the help they've offered without hesitation. We love our taekwondo family here :)", "pics": null, "resp": null, "gmap_id": "0x8889e6afcbd09f87:0x547ccbf51d5d31bc"}
{"user_id": "115215115149053848521", "name": "Michele Matthews", "time": 1564228156309, "rating": 5.0, "text": "AWESOME instructors, great program and school!! My son has taken karate here for 5 years. He really enjoys the classes, gets a good work out and has learned a lot. The McCoys are great people and we could not ask for a better school!!", "pics": null, "resp": null, "gmap_id": "0x8889e6afcbd09f87:0x547ccbf51d5d31bc"}
{"user_id": "106461622522735352343", "name": "Angelica Carnley", "time": 1564192294911, "rating": 5.0, "text": "My first class at Mr. McCoy’s school was seven years ago. The best decision I’ve ever made! The instructors and staff have become a second family to me. Beyond that, Mr. McCoy has helped me creat and reach goals that I would’ve never imagined possible.\nIt’s definitely the place to go if you’ve ever considered martial arts.", "pics": null, "resp": null, "gmap_id": "0x8889e6afcbd09f87:0x547ccbf51d5d31bc"}
{"user_id": "105096138567266718346", "name": "a bennefield", "time": 1562210962258, "rating": 5.0, "text": "We started at McCoy's on a promotion, my son enjoyed it so we continued on with our journey. The McCoys are such great people, my son has ADHD so Mr. McCoy and the instructors are patient but firm with him. Not only do I recommend McCoy's, but, our pediatrician also said he highly recommends it for ADHD children because it requires them to focus and have discipline.", "pics": null, "resp": null, "gmap_id": "0x8889e6afcbd09f87:0x547ccbf51d5d31bc"}
{"user_id": "110935210083308052365", "name": "Mary Parker", "time": 1530091239058, "rating": 5.0, "text": "Three of my grandchildren and I attend classes at Mccoy's Taekwondo. The kids live it and so do I. Since starting classes we are more active and have better focus than before. The instructors are very professional and well trained. Super family atmosphere!", "pics": null, "resp": null, "gmap_id": "0x8889e6afcbd09f87:0x547ccbf51d5d31bc"}
{"user_id": "101934424283443086985", "name": "James Buchanan", "time": 1564192676705, "rating": 5.0, "text": "The best takewondo school in the world taught by an amazing guy who is like chuck norris and Steven Segal with a little of van dam!", "pics": null, "resp": null, "gmap_id": "0x8889e6afcbd09f87:0x547ccbf51d5d31bc"}
{"user_id": "103987194217979016834", "name": "Amanda Stephens", "time": 1562178474583, "rating": 5.0, "text": "Amazing place! My kids and husband love going!", "pics": null, "resp": null, "gmap_id": "0x8889e6afcbd09f87:0x547ccbf51d5d31bc"}
{"user_id": "102447707108638271016", "name": "Erica Butler", "time": 1564190889772, "rating": 5.0, "text": "McCoy's is wonderful. Our children love it!", "pics": null, "resp": null, "gmap_id": "0x8889e6afcbd09f87:0x547ccbf51d5d31bc"}
{"user_id": "104962719048305525826", "name": "Shreyashi Ghosh", "time": 1624035165760, "rating": 5.0, "text": "My son has been associated with this since he was 4 years old and it has been one of the best journeys he have had so far (he is 7 now). They give each of the students personal attention and treat everyone as part of one big happy WorldClass family. My son enjoys it and so do we.", "pics": null, "resp": {"time": 1624106741486, "text": "We are proud to have the opportunity to be part of your son's journey! Thank you!"}, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "110860379773260947182", "name": "Brenda Guerrero", "time": 1601782148722, "rating": 5.0, "text": "Every person here is as committed, friendly and professional as you would wish they could be. There is no most accurate description of the experience than being here as part of the big tae kwon do family that Master Scarsella and team have accomplished. Every person that I can name, will be exceptional, from desk to the mat, to mat and office. So happy to be here.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNTM57HLv1ZTnnboPi5dUWp11eB0lnYkFMUDnkr=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "117690208567805968280", "name": "Jennifer Campbell", "time": 1624031346957, "rating": 5.0, "text": "We love Master Scarsella's World Class Tae Kwon Do!! My son has learned so much and absolutely loves going to class. The instructors are all wonderful and are very constructive in their teaching. I'm so glad we found Master Scarsella's!!", "pics": null, "resp": {"time": 1624041191499, "text": "Thank you! We are so glad to have your family part of our school!"}, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "103868470619748563661", "name": "Rachel Petry", "time": 1621902763340, "rating": 5.0, "text": "We love MSWCTKD!!! We continue to have an excellent experience at this dojang. We have 2 kids that are students and the staff does a great job keeping them engaged and motivated.  I would highly recommend if you or your child are interested, try a class! You will not be disappointed by the customer service and atmosphere.", "pics": null, "resp": {"time": 1621903960247, "text": "Thank you Mrs. Petry! We are so glad you're part of our TKD family!"}, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "107986587415469112098", "name": "Adrian Carraman", "time": 1590521038127, "rating": 5.0, "text": "I like the place ,very clean", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP9Gbkq1wmX1ABkSeX3W8jYZk_5A1xdvpu9RVy2=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "116043469987633343533", "name": "Bri Pena", "time": 1623707117823, "rating": 5.0, "text": "My son takes Taekwondo here and they are awesome! They really take the time with each child to help them reach their individual goals.", "pics": null, "resp": {"time": 1623709947570, "text": "Thank you so much for the kind words! We are so happy you're part of our World Class Family!"}, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "111167109163883178286", "name": "Gina Moncada", "time": 1624035762289, "rating": 5.0, "text": "Our experience with Master Scarsella Family is amazing ,we're love the instructors, they're always polite and committed with all the students.", "pics": null, "resp": {"time": 1624106780277, "text": "Thank you! Looking forward to seeing a Black Belt in your family in the future!"}, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "101513928275164681453", "name": "Bryan on gaming", "time": 1607631859209, "rating": 5.0, "text": "Don't expect to have frown in your face in this place, I am one student from taekwondo and this place is amazing, they used to have a small area near Inverness plaza and they had grown since then, this place is for all ages and has a great team. Master Scarsella and his team are very nice and will help you, they offer a free 3 day class and they'll let you try out if you dicide if you want to join taekwondo. They also have events every month like taekwondo championships and movie night. I been both of them and is really fun. Children can go to movie nights without their parents but the instructors will supervise them and is really fun. The championship is for all ages and for all belts. They take place in a school other than theirs because it is small. They are socially distant and if you don't feel safe doing in person, you can do taekwondo in home on zoom. Can't give the zoom code meeting for reasons but if you join, they will tell you the meeting code and instructions. A fun way and also a dedication to protect your self while having fun altogether!", "pics": null, "resp": {"time": 1607972450114, "text": "Thank you for the great World Class review! - MSWCTKD"}, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "117550390449760843597", "name": "Cheryl Ingram", "time": 1590090845077, "rating": 5.0, "text": "Our daughter has attended training at Master Scarsella's for over 6 years and has grown in leadership and confidence. We are so glad we found Master Scarsella's.", "pics": null, "resp": {"time": 1590094802826, "text": "Thank you! We love having the opportunity to see her grow!"}, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "113183594193991632405", "name": "Jacqui Sweet", "time": 1592851891091, "rating": 5.0, "text": "Awesome with children and teaches them respect and discipline.", "pics": null, "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "112333434551215376865", "name": "Em M", "time": 1499105697953, "rating": 5.0, "text": "Great experience! Master Scarsella and his staff are friendly, knowledgeable, helpful, and positive! Terrific location and building is really nice too!", "pics": null, "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "109937759192642320128", "name": "jerry clements", "time": 1361248122351, "rating": 5.0, "text": "The instructors are world class and work extremely hard to teach the best martial art to any age, and most importantly make it as fun as possible at any age.", "pics": null, "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "110390704527208621829", "name": "Weldon Birdwell", "time": 1533989672361, "rating": 5.0, "text": "Such an amazing program. Cannot say enough good things about the staff!", "pics": null, "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "115403831914981806034", "name": "Mark Carlisle", "time": 1405959664473, "rating": 5.0, "text": "My son has been taking Tae Kwon Do from Master Scarsella for 5 years.  From the very beginning, the staff has made the classes fun and exciting for the kids.  This is still my son's favorite activity after 5 years solid of participation.  It has been great for teaching my son the discipline required to achieve various goals along the way.  I think it has been great for teaching respect, hard work, and even public performance and confidence!  I would recommend Master Scarsella to anyone who has a child who is interested in martial arts or even just a fun activity.  Just be careful, because they will likely not want to stop once they have started!", "pics": null, "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "115019255617592464163", "name": "Luis Resto", "time": 1552433412323, "rating": 5.0, "text": "Great place; awesome instructors.", "pics": null, "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "104660580828547408078", "name": "LIn Jo", "time": 1562930837749, "rating": 5.0, "text": "me go liek I go go go win for vicory royalw", "pics": null, "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "116277707632641903647", "name": "Rachel Ashcraft", "time": 1430511416210, "rating": 5.0, "text": "Great experience for my son!", "pics": null, "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
