{"user_id": "107033886936537465600", "name": "Rachelle Griffin", "time": 1623425510754, "rating": 2.0, "text": "They are not friendly", "pics": null, "resp": null, "gmap_id": "0x88626898fa9c3d69:0x69f1528ee51fac3b"}
{"user_id": "113923320144720771283", "name": "Landsharkk K", "time": 1488386507708, "rating": 5.0, "text": "I have been to several tattoo removal places before but cirius is the best I have been to great results", "pics": null, "resp": null, "gmap_id": "0x88626898fa9c3d69:0x69f1528ee51fac3b"}
{"user_id": "109733101186201198215", "name": "Uyen Tran", "time": 1516764935995, "rating": 1.0, "text": "The most unprofessional business ever.", "pics": null, "resp": null, "gmap_id": "0x88626898fa9c3d69:0x69f1528ee51fac3b"}
{"user_id": "102926545958978965457", "name": "Kay Jones", "time": 1624739221178, "rating": 5.0, "text": "You’re going to love this place. My experiences are always great. Dr. Hartman is talented, funny and personable. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "107230378731141572847", "name": "Dani Spearman", "time": 1622297763535, "rating": 5.0, "text": "Five star experience from beginning to end. Great doctors and great staff.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "116632484189884982789", "name": "Jessie Langham", "time": 1609236125150, "rating": 5.0, "text": "I’ve seen all of the doctors at Skin Wellness and they all treat me and my family. I don’t know how they run such an efficient yet busy practice while still delivering compassionate, thorough care, but they somehow do every visit.  Their bedside manner is second to none and they offer only the latest and best treatments.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "114355281570085423035", "name": "Carol Misshra", "time": 1612633776411, "rating": 5.0, "text": "Dr. Hartman and staff create a caring, kind, competent environment that put me completely at ease. I know every time that he has my best interest at heart and will give me the best care for my skin.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "105350560179930347866", "name": "Yolanda Wilson", "time": 1615073181141, "rating": 5.0, "text": "Awesome with me from front desk to the nurses and Dr Yonuz is exceptional and strives to meet all od your skin needs", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "112134716174675945848", "name": "Ann Porter", "time": 1613313266073, "rating": 5.0, "text": "Love this office and the staff. I feel so confident in my skin now.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "106662681308897143966", "name": "kenny sams", "time": 1615689286387, "rating": 1.0, "text": "The staff was friendly but Dr. Hartman was rude.  Village dermatology is way better.", "pics": null, "resp": {"time": 1615692194584, "text": "And of course there is no Kenny Sams in our system."}, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "107911834360148606390", "name": "D M", "time": 1595461193839, "rating": 5.0, "text": "Dr. Hartman, his team and the products and services he offers, gets 5 stars from me. I was referred to this practice via a friend who was having issues with pigmentation and after seeing the results he experienced I scheduled an appointment. I am mainly concerned about wholistic skin health and anti-aging. I am quite astounded by the change I have seen. I am a patient for life.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "118017933483882812127", "name": "Meredith Massey", "time": 1576168352439, "rating": 5.0, "text": "Absolutely the best experience every single time! From the time you walk in the door, your are greeted by the most accommodating and welcoming staff, which continues until you leave. Great responsiveness, professional atmosphere, and hands down the best! My husband and I have been patients for several years and have also taken both of my children for appointments, and we have all had great customer service from the beginning. Definitely gets a high recommendation from our whole family!", "pics": null, "resp": {"time": 1576171322829, "text": "Thank you, Meredith!"}, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "105764511140854263369", "name": "Yasmine Dabgotra", "time": 1595534804003, "rating": 5.0, "text": "I've had nothing but a fabulous experience with Dr. Hartman and his staff. He is beyond responsive, professional and an absolute expert in his field. If you're looking for the best dermatology experience in the Chelsea area, look no further than Skin Wellness.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "101091012545186189970", "name": "Nadeira Rickford", "time": 1595609559807, "rating": 5.0, "text": "Extremely knowledgeable, caring staff. Very honest in their recommendations.  Dr. Hartman knows how to get results!", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "116359653379226329387", "name": "Ola L", "time": 1582753136731, "rating": 5.0, "text": "Very good patient/customer service.  It is difficult to get into a dermatologist, but they try as much as they can to help.\nI would send my whole family there, they are very trustworthy and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "106756691540367161737", "name": "Kim Gann", "time": 1576170421843, "rating": 5.0, "text": "Love Skin Wellness and the fact I have two locations near by. All of the staff is so friendly here and Dr. Hartman is the BEST in town. This office is ran with excellence and it shows!", "pics": null, "resp": {"time": 1576178483795, "text": "Thank you, Kim!"}, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "102616400079141048760", "name": "Pj Hester", "time": 1624044566612, "rating": 5.0, "text": "Excellent service", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "105304896111510430585", "name": "Courtney Johnson", "time": 1592247061958, "rating": 5.0, "text": "Brittany Rigsby CRNP & staff were super friendly, helpful, and very knowledgeable. Best dermatology visit I've had & highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "105770885156957581565", "name": "Anomor Yasdnil", "time": 1523299913120, "rating": 5.0, "text": "Black owned business with the best Doctors and nurse practitioners. Very organized with multiple locations, with extremely friendly and helpful staff. Their locations are extremely clean and have such pleasant environments. They always give back to the community, and often host special events for their clients or host fundraisers as well. Very thorough and knowledgeable, usually treating/curing quickly, without repeated visits (unlike most Dr offices these days). Our family is very satisfied and will continue to recommend their services.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "114340363068355389911", "name": "Adriane Andrews", "time": 1566508900402, "rating": 1.0, "text": "This staff literally wrote a false review using my name. I wonder how many others there are. Wow, I’m so appalled. I have received the best treatment ever from Dr. Youhn, but Dr. Hartman only cares about money not his patients. I tried very hard to keep a positive relationship with this practice, but they refused to uphold excellent customer service.\n\nBest", "pics": null, "resp": {"time": 1566813970623, "text": "We care about our patients. Not money. But when people receive treatments and leave without paying, yes we try to collect payment and call the police."}, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "113614989964239090451", "name": "Macamillion528hz Stinson", "time": 1518042090233, "rating": 5.0, "text": "I've been to a number of dermatologists over my lifetime, but Dr. Hartman is hands down the best of the best. He is extremely thorough and spends time addressing all my concerns. His staff is knowledgeable, accommodating and efficient. He is a professional in every sense of the word and I would recommend him to anyone looking for dermatological services.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "100607912928658405515", "name": "J Ebbert", "time": 1517999875076, "rating": 5.0, "text": "Amazing experience. I was in and out of the office in 20 minutes!  It's usually near impossible to get a dermatologist appointment that's within a month of when you're calling (especially to an office you've never been to) but I called Monday and they got me in on Tuesday! Dr. Youhn and Christa were amazing. She was so friendly and made the whole experience enjoyable and painless! She has resorted so much more confidence in myself from getting rid of a beauty mark I had ever since I was a kid. I highly recommend this place!!!", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "117268663517247359593", "name": "Larry Roberts (Pastor)", "time": 1570560498020, "rating": 5.0, "text": "Dr. Curl and others have always been very good to me. Love them all.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "108245188730368234414", "name": "Darla Watson", "time": 1518009336611, "rating": 5.0, "text": "The girls in the office and all of the doctors and nurse practitioners have always been super sweet and kind to us whenever we visit. I’m so happy to have these services in Chelsea. They even provide laser options and spa procedures. The best!", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "102623015743848423968", "name": "Lindsay Hamner", "time": 1491577991437, "rating": 5.0, "text": "I had a great experience here. The staff is incredibly friendly, the facility is stylish and still welcoming, and Dr. Youhn is a wonderful doctor. She's very knowledgeable​ and addressed my concerns quickly. She even found a few things I missed that needed to be addressed. I would highly recommend her and the Skin Wellness Center for anyone looking for a dermatologist in the area.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "113743085200624929930", "name": "Victoria Bailey", "time": 1557330981695, "rating": 5.0, "text": "Outstanding service and staff. I felt that my needs and concerns were heard. I will definitely be returning", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "117297840570967162540", "name": "Cindy Merriwether", "time": 1512254329460, "rating": 5.0, "text": "Dr Hartman explains exactly what is wrong and how we are going to treat it. I sincerely trust him, his medical knowledge and his judgment. The entire staff is friendly and makes you feel at ease even through some not-so-easy time.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "107022521011024574378", "name": "Nikasha Thomas", "time": 1495708589689, "rating": 5.0, "text": "Dr. Corey Hartman and his staff provides great professional service. Autism sensory friendly. Thank you for making my son comfortable and providing excellent care of his skincare needs 😊.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "103727632163372167257", "name": "Sheila Jackson", "time": 1470434173199, "rating": 5.0, "text": "Skin Wellness has exceeded my expectations.  No longer do I have to leave Chelsea for dermatology care only to be overcharged and belittled at other places.  Everyone here from the receptionist to the doctors are friendly, kind and really do care about me and my skin.  The new office is beautiful and impeccably clean.  I have been a patient at the Homewood office, but now I don't have to fight the traffic to get the best care in the Birmingham area.  I love this place and will continue to spread the word in Chelsea and beyond.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "109790212220421944069", "name": "Nazaren “N Mindi” Mindingall", "time": 1518002163018, "rating": 5.0, "text": "I’m always impressed with the efficiency and professionalism of the staff and the medical care I receive from Dr. Hartman. It’s second to none. I will continue to refer all of my friends and family.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "102489630705110783310", "name": "Elizabeth Golden", "time": 1576270895517, "rating": 5.0, "text": "Always excellent. I’m proud to be a patient.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "114050520771429951747", "name": "L M", "time": 1564214615329, "rating": 1.0, "text": "I took my daughter here for acne & the dr's wouldn't even consider topical treatments they only would do ACCUTANE which has alot of side effects & should be a last resort instead of the only way to treat mild acne. They also prescribed antibiotics & when I asked to get the prescription they said they send all prescriptions to Texas & have tgem shipped to the patient?! Its been 6 mo & still havent seen tge antibiotics from Texas. Never would I recommend skin wellness center to anyone", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "108912828467092178330", "name": "Haley Isbell", "time": 1518009142329, "rating": 5.0, "text": "The entire staff’s professional and the excellent care I received will be the reason I go back as well as refer anyone looking for a dermatologist in Birmingham area. Everyone in my family has seen a doctor at Skin Wellness and we are thankful for their care.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "105414570333196610803", "name": "Lori Yonfa", "time": 1565656814525, "rating": 5.0, "text": "Dr Hartman & Dr Yang are the best ! They're both are terrific Doctors.", "pics": null, "resp": {"time": 1567029405428, "text": "We love you back, Lori!!"}, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "108445323257674258673", "name": "Alicia Kenerley", "time": 1571812937827, "rating": 1.0, "text": "Whoever answered the phone had ZERO services that they offer, like she just doesn't care at all about her job nor me a potential cash cow of a customer. So, never mind.", "pics": null, "resp": {"time": 1571823594691, "text": "I’d like the record to show that this review was written at 2:42 in the morning by a person who has never visited our office. Also, in my 16 year experience, someone who was serious about skin care and procedures would not mind paying the $100 consultation fee to come into the office to discuss these things like an adult."}, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "104163824293693681924", "name": "Brannigan Keller", "time": 1538058039849, "rating": 5.0, "text": "Edited from a 1 star to a 5 star\n\nMy 2 year old child was a new patient and one of his siblings got sick the day of the appointment. I called to try to reschedule and was informed that I would be charged a no show fee. I do not think they could have made me pay the $50 no show fee as I had never been to this business before and more importantly was not aware of this ridiculous amount but called my spouse to make arrangements to go.  Needless to say they lost mine and my families business, I would not recommend them to anyone as my experience is not how to treat customers.\n\nI’ve changed my negative review to a positive one after receiving a phone call from the owner of this practice.  It’s nice that he took the time to call and listen to my concerns while making attempts to set things right. I understand why these “no show” policies have to be in place as I work in the healthcare field as well.  After talking to the owner I would recommend this business.", "pics": null, "resp": {"time": 1538053820804, "text": "Ms. Keller, Thank you for bringing this to our attention. We apologize that this was your experience. Charging for missed appointments due to illness is not and has never been our policy. Again, we apologize."}, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "118055034014976241838", "name": "Doug Merkel", "time": 1502880608621, "rating": 5.0, "text": "Always nice. Front desk back. We do not wait long to be seen. Good location for us.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "111462158990726185368", "name": "Trina Janay", "time": 1532542544223, "rating": 4.0, "text": "Saw Dr. Rayna Dyck(she was recommended by some people i know personally). & she was horrible. She first off camebin very dry which is a horrible first impression and my attitude immediately was based off of hers and by her attitude being so dry (seemed like she really didn’t want to be at work) it made me not believe anything she said or that she didn’t care to help ...although everything she said might have been true. Her staff though is very sweet. I didn’t get the medication she thought MIGHT help b/c it was pointless to purchase out of pocket if it MIGHT help. And the two reasons she said i might have skin discoloration was definitely not my case. I’m big on reviews & she had a few reviews on her dry attitude but i gave her the benefit of the doubt because i had people who recommended her..obviously b/c she helped their condition & not off her attitude. She was so awkward & dry. Def. appreciate Dr. Hartman for giving me a call about my visit and hopefully i dont have to pay another co-pay when i fu with him b/c today i def. paid a co-pay for no reason at all. and the stars are for the staff and him calling me back def. not for Dr. Dyck.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "106667846494885771651", "name": "Gillian McCown", "time": 1511332973543, "rating": 1.0, "text": "Dr. Youhn had the nerve and audacity to tell me that I should wean my son. Last I checked, breastfeeding is outside her scope of practice and she has no business giving professional advice about childcare or breastfeeding to a patient. It is unethical to give advice or direction on any topic professionally outside one’s scope. Breastfeeding and the health and wellness of my son most definitely are.\n\nUpdated because they decided to be unprofessional with their response here and on Facebook.\n\nThese comments started when I was asked if he was my only one and if I was thinking about having more yet and I said I'm still not sleeping so no. She kept saying should really talk to his ped because he doesn't need to be nursing all night long. At his size he doesn't need to eat at night and he's probably just doing it out of comfort. I didn't ask for sleep advice.\nI mean I could understand her saying the nursing could be irritating my issue and that weaning might be something to consider.\nBut talking about how my son doesn't need to nurse anymore and I should really just talk to his pediatrician about weaning him is way beyond her scope and none of her damn business!\nHis pediatrician has no problem with it and nursing till 2 is recommended by the WHO.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "103403565211783242766", "name": "Gina Delbianco", "time": 1517977185526, "rating": 1.0, "text": "The Chelsea office is aweful. I've been taking my daughter's here for skin care for a long time now...mostly because we live in Chelsea and it's convenient. I've decided I've had enough of their extremely snooty, unfriendly staff. We had been seeing Dr. Murphy in this office for years and then one day she just  magically dissapears and is replaced by a different dermatologist with no explanation. Nothing!  Can't stand this office!!  We wiill be moving on to a new dermatologist and hopefully a smiling, friendly and much more upbeat atmosphere!   Alert people! Five minutes after posting this review My phone rings and this man states is name is Dr. Hartman ..and demands to know my reasonings for posting this review! This is just too unreal for me! Skin wellness of Chelsea ...you are sketchy!!!!!!  Ok so now I'm getting harrassing messages from two different area codes regarding this review. I guess Skin wellness pays some crappy people to harrass people that give bad reviews in hopes they will erase it. Not going to happen. You're Chelsea office sucks!....Excuse me! Whoever you are..her name was Brittany and she treated my children's skin problems for years. And please . ..stop texting your profane messsges to my phone!", "pics": null, "resp": {"time": 1517974975958, "text": "We pride ourselves on being friendly and helpful. We have never employed a doctor named Murphy. Good luck achieving your skin care goals."}, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "113351778387214222595", "name": "Sarah Holder", "time": 1518013821868, "rating": 5.0, "text": "Fantastic staff and exceptional providers. The whole team goes above and beyond for their patients!", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "108548817705961667349", "name": "Lillian Byner", "time": 1467221115842, "rating": 1.0, "text": "In response to Dr. Hartman's reply to my review, I appreciate your telephone call. However, as I communicated to you in our conversation last night which you neglected to include in your response, I have waited for a return call to my non-urgent issue way longer than 24-48 hours. My first follow-up appointment where the biopsy was taken was on June 13th, where I was told by a clinician that I would know the results before I left for vacation. I called for results initially 1 or 2 days before I left town June 23rd. I then called back on the 28th, where I was told once again that I would be called back before close of business, yet I was not. I was never informed by any of your staff that I spoke with (both clinical and non-clinical - I have spoken with both) of the 10-14 day timeframe for biopsy results. In speaking with you last night is the first I have heard of the 10-14 day waiting period for results and the results not being discussed until the scheduled follow-up visit. Perhaps some form of training refresher would be useful in ensuring that all of the staff, both clinical and non-clinical are relaying uniform information and setting the proper expectations to the patients. Once again, I appreciate your reaching out to me and I am sorry that I had a less than desirable experience.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "103962130654556091337", "name": "Robert Cowart", "time": 1580488705029, "rating": 4.0, "text": "Very good exacerbation", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "104798592392179622716", "name": "Kris Findlay", "time": 1553977178260, "rating": 5.0, "text": "Great care and nice people!", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "117444171195740466901", "name": "April Cano", "time": 1581300483011, "rating": 5.0, "text": "Attentive Staff and Doctors", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "104619836542952061570", "name": "Judy Pannell", "time": 1552686393660, "rating": 5.0, "text": "Love the doctor and employees!", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "115411741844128239898", "name": "Desmond Allen", "time": 1564257952841, "rating": 5.0, "text": "Professional staff that has been spot-on with diagnosis", "pics": null, "resp": {"time": 1567029424956, "text": "Thanks, Desmond! Glad you’re reaching your skin care goals."}, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "102710709397009958555", "name": "Kimm Coady", "time": 1540754152274, "rating": 5.0, "text": "Very nice.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "114631475030767720263", "name": "Dee Shopper", "time": 1525328969119, "rating": 4.0, "text": "Not sure need another visit", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "105247957240396939219", "name": "Tasha Duncan", "time": 1529459879764, "rating": 5.0, "text": "Very friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "114991191137725540268", "name": "Duane Scarborough", "time": 1497454751434, "rating": 4.0, "text": "Great staff!", "pics": null, "resp": null, "gmap_id": "0x88893e50dc905cab:0x5579fabd64bbb096"}
{"user_id": "103489287745471256364", "name": "elise sappington", "time": 1613771626455, "rating": 2.0, "text": "I just left Cahaba Dermatology and I would say my experience could have been better. The doctor I saw was phenomenal. She was very well educated and informative. Although she seemed to be in a hurry and did not ask very many questions she was very considerate and kind. I feel as though I will have my problems solved by her recommendations. The nurse, on the other hand, was neither kind nor considerate. I hope that this was just a result of a bad day and that she does not treat patients like this regularly. She was short and made me feel like I was doing something wrong; when I was simply answering her questions to the best of my ability as a first time patient. I came to this clinic because of an acne outbreak that has left my self esteem low. Although I received products that will help me in that, the service from the nurse did not make me feel any better about my problem and instead made me feel as though I was being a problem. The individuals in this clinic have the power to help others feel more empowered in their own skin. I hope Cahaba Dermatology sees that and will do that.", "pics": null, "resp": {"time": 1614307722171, "text": "Helping our patients feel empowered to address and resolve their skin issues is our mission. I am sorry we did not deliver for you on this visit. Please call our office and ask to speak with our business manager or medical office manager to see if we can provide a solution to this issue.\n\nRegards,"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109546168843385043489", "name": "Bailee Perry", "time": 1614291375825, "rating": 5.0, "text": "I had a cyst removed by Dr. Wang and she was excellent. Her nurse did a great and gentle job numbing the area and I felt nothing during the procedure. They have a beautiful office and their staff is welcoming. I’ll definitely go back for yearly exams and recommend them to friends and family.", "pics": null, "resp": {"time": 1614307611111, "text": "Great to hear. Yearly exams are best way to keep major skin issues from developing. Look forward to seeing you next time."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "117296472139469421795", "name": "Erin Farella", "time": 1614702372552, "rating": 5.0, "text": "Dr. Wang and her team are wonderful! They are so kind, thorough, and always listen to my concerns. They always make me feel so comfortable and more than just a patient. I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113467275719356066671", "name": "Kathryn Sullivan", "time": 1620074083381, "rating": 1.0, "text": "I did not have a good experience here. I scheduled an appointment, and confirmed my appointment time/date. Once I showed up for the appointment though, I waited for about a half hour before being told that there was some kind of mistake and they wouldn’t be able to see me for my appointment I had scheduled over a month ago. I understand mistakes happen, but I was frustrated that I took off of work and showed up at an appointment just for them to cancel it on me. They then said they would talk to the manager to make things right and call me with times I could reschedule, etc...they never called or even apologized to me for the huge in convenience.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109754518793862684783", "name": "Shanae Hunt", "time": 1611983593376, "rating": 5.0, "text": "Dr. Wang was extremely kind, quick and knowledgeable. The staff were all super sweet. I had a wonderful visit and I do recommend. Clean environment. Very pleasant!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "118282819755964198561", "name": "Michele Ralph Hill", "time": 1612552311583, "rating": 5.0, "text": "Dr Anne Gerald gives a very thorough and complete examination.  She has a calm and soothing manner.  The facility is new and gorgeous.  They offer almost any service you could need.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "116998755185848079611", "name": "melissa goggins", "time": 1612813944091, "rating": 5.0, "text": "My son has been coming to Cahaba Dermatology for several months. The improvement is tremendous. Everyone we have had contact with has been helpful and caring. We love the staff!!", "pics": null, "resp": {"time": 1614308253353, "text": "Love to hear that your son's treatment is beneficial. Thanks,"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "101801743724250086538", "name": "Corie Betke", "time": 1611350360194, "rating": 5.0, "text": "Thank you to the ladies at Cahaba Dermatology!  Everyone showed us patience and kindness.  I took my daughter in today for a second opinion and I am very glad that I did.  First time doctor appointments can be a little unnerving for my daughter and today’s experience at your office eased her unlike the first dermatology office we went to and Dr. Wang provided us with so much more information.  The first doctor we went to was obviously wrong.  Thank you😊", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "105453419586128778167", "name": "Helen Penfield", "time": 1611103573077, "rating": 5.0, "text": "My experience was excellent.  Easy checkin and immediately made comfortable with a blanket and Netflix.  My PA , Elizabeth Smith, ensured I knew what to expect each step of the way.  She was concerned about my comfort all throughout  the process.  I’m so excited to see how my results last year k in about 3 days!   Very professional staff!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115981140347522520274", "name": "V Mo (vmosmoothe)", "time": 1608069253578, "rating": 1.0, "text": "Really nice presentation but not that great of an overall experience.  Not impressed at all 😕.  Little engagement with review of treatment unless I asked. The technician had awful bedside manners. Really rude and short. Not for patients that maybe going through something or for individuals with limited understanding of your options. I was treated almost as if my insurance wasn't good enough. At check out, the rep tried to charge me almost 100.00 for a co-pay I didn't have😳. Now...... Follow up about the set appointment and the patient portal is excellent. PLEASE NOTE......Thats how they even got a star. Portal is easy to use if.......you follow instructions correctly.  Brand new facilities but I think they really are in the business of isolating the population that they serve. Hint hint.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "116122039716617857609", "name": "pat ryan", "time": 1612889378187, "rating": 1.0, "text": "after much attention to filling out info on the portal we were never about to complete a video appointment - we finally talked to Dr Groysman on our home phone. It was not clear to us as to how to do a video connect. Someone mentioned SPRUCE, but we never had heard of that. In future please make it more clear as to how to do a video appointment. Thanks, Marie West", "pics": null, "resp": {"time": 1614308197295, "text": "Reading your review, it sounds like Dr. Groysman worked outside of the normal process to ensure you received the care you needed despite connection issues. We use technology as best as we can to provide telederm visits to our patients during the Covid-19 outbreak. We provide education on Spurce.com our telederm app, but things just do not always go as planned. Conducting a dermatology visit remotely is challenging, but we've taken on this challenge for our valued patients. We do not have control over third party applications, internet connection speeds, and other various factors, but we will work to provide excellent dermatology care in every way we can.\n\nRegards,"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102588753795927107273", "name": "Chris Williamson", "time": 1604103193565, "rating": 5.0, "text": "Very friendly and accommodating staff!! I arrived at what I thought was my appointment time and date but My appointment was actually a different day. The front desk was able to work me in. Even after all that, my wait was not that long. I would highly recommend to anyone looking for a dermatologist or skin care. Very knowledgeable also!!!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110468274468382052766", "name": "Megan Carroll", "time": 1612817244531, "rating": 5.0, "text": "Super nice facility. Friendly staff. My procedure was quick and painless. Highly recommend!", "pics": null, "resp": {"time": 1614308218845, "text": "Glad visit was painless. Thanks,"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115965557136112050304", "name": "Emma Perry", "time": 1611289320225, "rating": 5.0, "text": "Very organized office, I was in and out in no time. Respectful, helpful, and knowledgeable staff. It was my first time going to Dr. Wang and her staff. Definitely will be back in the future!!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110421771617649522643", "name": "Kelli Parham", "time": 1598538526762, "rating": 5.0, "text": "From the moment I walked in I was treated with genuine kindness.\n\n...From the lovely lady that greeted me when I walked in... I could feel her smile behind her mask.\n\n...To the amazing nurse that made me feel at ease, answered all of my questions and made me feel comforted immediately. I really trusted her guidance.\n\n...To the wonderful doctor that took her time with me and cared about my concerns. I feel great knowing I’m in here care.\n\n...To the absolutely fantastic woman that took my blood with ease and great conversation.\n\nEach person made my appointment a remarkable experience.  I was scared walking in and was smiling walking out!!\n\nThank you, ladies!!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103130445787374991708", "name": "Beth Meullen", "time": 1604406209972, "rating": 5.0, "text": "I met the doctor for a checkup and to remove a few spots. She was very knowledgeable and thorough with my questions. The nurse was also very professional. I was thankful that the doctor offered several options that could fit my budget. I did not feel she was over selling me to pay for their beautiful well designed office. I can say that everyone, including the front desk and checkout, were all extremely careful and professional!\nUpdate: I received my bill. $725 to freeze my nose and one spot on my arm. Then I called in for a quote for blue light treatment. Each treatment is $300 more than 2 years ago. Plus when I google the average cost for this treatment this doctor is quoting more than double! Not saying I won’t receive good care but Wow!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "105126579376298057767", "name": "Justin Drake", "time": 1614022764207, "rating": 2.0, "text": "Called to set an appointment.  Before even giving me appointment dates, the lady was asking for my insurance card.  Then she proceeded to tell me everything was sent to the lady for biopsy which is a complete money sink and moneymaker for the firm when it clearly isnt required.  I would understand if red or any issues but just a cosmetic procedure is just a way to make additional money.  If they are this greedy out of the gate, you can only imagine what they bill...", "pics": null, "resp": {"time": 1614307571883, "text": "When booking an appointment we do ask up front for insurance to best advise patient on coverage and/or any out of pocket costs associated with visit or biopsy. There is no way to advise if a biopsy would be necessary at the time of booking. Only the provider would make that determination. Regarding the \"sending\" or reading of the biopsy, our office has no financial involvement in this process. Samples are sent to an independent third party for processing and third party bills insurance or patient directly. Please call our office and ask to speak with our business manager if you have any further questions or concerns.\n\nRegards,"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112325334226758300307", "name": "Lynn Cummings", "time": 1612210589307, "rating": 5.0, "text": "Staff were courteous, professional, and had very good customer service skills. Dr Groysman was professional. thorough , and very helpful in addressing concerns.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112325334226758300307", "name": "Lynn Cummings", "time": 1612210589307, "rating": 5.0, "text": "Staff were courteous, professional, and had very good customer service skills. Dr Groysman was professional. thorough , and very helpful in addressing concerns.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115437265532798103718", "name": "Charlene Drake", "time": 1596487021459, "rating": 5.0, "text": "The staff was very friendly and informative and helpful. I was thankful that I was able to go back with my 73-year-old mother as she was already nervous about the visit. We have been encouraging her to go see a dermatologist for a while with a spouse they were on her face and her back. So they made the visit much more relaxing and encouraged her and assure her it would be OK. Follow up visits And building a relationship was encouraging since this is something she is going to be meeting in the future for her skin health care.", "pics": null, "resp": {"time": 1597695332662, "text": "We know so many patients have anxiety about seeing a doctor. We try to make patients feel comfortable with the process. We are glad we were able to get your mom needed care."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "116858402533920133126", "name": "Tamara Brewer", "time": 1604432406272, "rating": 5.0, "text": "The staff was very pleasant and attentive. Dr Wang has a great bedside manner, listened to me and was very knowledgeable in her field of study. One of the best experiences I’ve ever had at a doctors office.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109815844403707296286", "name": "Jennifer Smith", "time": 1606315082406, "rating": 4.0, "text": "I was only in for lab work but the medical staff had me relaxed and happy. Who knew having blood drawn could be pain free? Thank you!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "101000646500472672572", "name": "Valery Danielle (Danielle) Wormley", "time": 1603484936488, "rating": 5.0, "text": "Dr. G is amazing!! Very thorough and knowledgeable on all aspects. Always seen on a timely manner and leave with a solution every time! My mother and I love Dr. G and will be forever patients!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109943161369442338219", "name": "LaQuoya Robinson", "time": 1596310831113, "rating": 5.0, "text": "My second time receiving a facial at Spa Cahaba and it was ABSOLUTELY AMAZING! My aesthetician this time was Kayla Fisher. She assessed my skin thoroughly prior to the facial so she was knowledgeable of how to treat it during the Signature Facial. I can’t rave about this place enough! From the knowledgeable and friendly staff to beautifully designed and clean facility. You won’t be disappointed! I can’t wait until my next appointment.", "pics": null, "resp": {"time": 1596411674070, "text": "Thanks for the feedback and we are so glad you enjoyed your visit. We look forward to seeing you again and will pass along your kind words for Kayla."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110484726132310177218", "name": "MultiplesOfNico", "time": 1596083307163, "rating": 5.0, "text": "Great service!! I came from Tuscaloosa.\nGot there early. Waiting room was clean and log into the WiFi quickly.\n\nCustomer service was excellent.\nMy doctor took my concern and made me feel like I was heard.\n\nFront desk excellent and the place looked very clean.\n\nHappy to have an wonderful experience.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106165918091361442050", "name": "Dianna McQueen", "time": 1600277940842, "rating": 3.0, "text": "I had to wait too long before seeing the Doctor. My appointment was at 9:50 and it was 10:57 before seeing the Doctor. Once I was in the patient room it took less than 10 minutes for my visit with her. I almost left before being call back but I was too eager for the Doctor to check a place on my chest. I feel my time is valuable also!!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "114005406226350951058", "name": "Sarah Gentry", "time": 1609799639472, "rating": 5.0, "text": "Lovely experience, Dr Groysman is the best. I have seen several dermatologists before, none of them have been as professional, kind, knowledgeable and understanding as Dr Groysman. Everything was seem less from check in to check out.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "111236667811294210032", "name": "Pam Griffith", "time": 1605810639633, "rating": 5.0, "text": "Everyone was so nice. Treated you as if you were family. Doctor explained things to make it simple!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112656894552126872753", "name": "J Russell", "time": 1599759659717, "rating": 1.0, "text": "I arrived exactly 10 minutes prior to my appointment time,checked in and waited for exactly 1 hour. I got up to go to the ladies room, and when I came back another patient in the waiting room told me they had called my name. I walked to the back to tell them that I was just in the ladies room, they said we went ahead and called someone else back you'll need to wait until they're done. Granted I was in the ladies room for all of 3 minutes, there was no one to tell at the front desk that I had to go to the ladies room.  All of that after I already been waiting for 65 minutes!!!!!  They showed zero remorse... no apologies, just \"oh well..go and wait some more\". I will NEVER GO BACK and I will make sure I spread the news...", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "104656878688786320530", "name": "Amy Bolt", "time": 1608316550008, "rating": 5.0, "text": "I am so very appreciative of Dr. Wang and Dawn. They are very attentive and compassionate. I highly recommend Cahaba Dermatolgy.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "108848118576532001551", "name": "Connie DeVoe", "time": 1604015810896, "rating": 5.0, "text": "Even dealing with a power outage due to Tropical Storm Zeta, the staff were all friendly & as accommodating as they could be until power was restored. They fit me is as soon as possible and the doctor provided a clear care plan with detailed instructions.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "104740654415271739362", "name": "Andy Barclay", "time": 1607372973418, "rating": 5.0, "text": "Such attention to detail! Everyone in the office is friendly and courteous. Dr Groysman is outstanding!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102421168286775704907", "name": "Empty the Tanks", "time": 1607727944755, "rating": 5.0, "text": "Amazing! Shelby at the front desk was absolutely wonderful and I highly recommended Shelly for a massage! She was exactly what I needed to relax and unwind!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "107618204300214706723", "name": "Daphne Kirkpatrick", "time": 1595713929398, "rating": 5.0, "text": "Let me just say we had the BEST deep tissue massage today with Kari! She will be the reason we go back! Best massage we have ever had! And sweet Shelby is always smiling on Saturday mornings. Absolutely love these people!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112724622824546745577", "name": "Keith Wills", "time": 1601395690148, "rating": 5.0, "text": "I had an amazing experience this morning. Dr. Wang was amazing and Stephanie was awesome. It only took about 15 minutes for them to give me a prescription and send me about my way! This will be my new dermatologist from here on out!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "101514185085061035103", "name": "Tracy Fleischmann", "time": 1600360088291, "rating": 5.0, "text": "Very friendly for self pay patients. Upfront pricing with no nasty surprises. Knowledgeable doctor who didn't insist on unnecessary procedures. A good first dermatology experience. Definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "101552564004147881152", "name": "Su Kim", "time": 1602528240869, "rating": 5.0, "text": "Amazing service. All the staff were so kind. They helped us figure out the best treatment while looking out for us financially.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "105371150801209815149", "name": "Court Deaton", "time": 1611621382049, "rating": 1.0, "text": "Horrible. Dr Gerald is rude and condescending and makes you feel stupid every time you speak. Would not ever recommend!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "100914185563018150591", "name": "Carolyn Willingham", "time": 1607484312111, "rating": 5.0, "text": "I go to Dr. Groysman every 3 months for body checks.  Each time she is very thorough.  She has removed 4 skin cancers over the last 12 months without using Mohs surgery with very minimal scarring.  She and her staff are awesome!  I could not ask for a better dermatology group.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "117234706959624433685", "name": "Michelle McGrew", "time": 1607459463115, "rating": 5.0, "text": "I loved the assistant and Dr.Wang both were friendly and put me at ease. Will be back", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "108109000565415407904", "name": "Gloria Sanders", "time": 1600698864640, "rating": 5.0, "text": "My first visit was awesome. The staff was very friendly and helpful. I look forward to trying some of the other services. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "104858343689321785012", "name": "marquiz savage", "time": 1592858844443, "rating": 5.0, "text": "My visit was as comforting as possible.  Ever thing from the initial check-in to the check out was 1 heck of a gathering.  Everything was so smooth. Dr. Gerald and Dawn really laid all pertinent info for me on the table along with the appropriate way to tackle my skin issues.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "107780197956823968150", "name": "Matthew Ware", "time": 1597265445398, "rating": 2.0, "text": "I showed up at 1:50 in the afternoon for my 2:00 appointment and didn't get called back until 3:11. And that was only after I'd ask the receptionist what time my appointment was actually for. My time with the doctor only lasted 12 minutes. Multiple people in the waiting room had apparently been told that they showed up for their appointments at the wrong time. Unfortunately for the receptionist, most were able to show their appointment confirmation emails. One patient was saying that this has happened every time she's been there. Sounds like they've got a computer system to figure out, or at least need to do some remedial training on the check-in process. The doctor was fine, but patient support was seriously lacking.", "pics": null, "resp": {"time": 1597695778793, "text": "Mr. Ware, I am sorry to hear your visit took so much extra time. We  do strive to stay on time as possible. There are many reasons the clinic can run behind, but we obviously missed the mark for you. I will inquire about recurring issues with appointment times or other issues at the check in desk. Thanks for your feedback and we'll work to use it to address your concerns."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115044634673914401332", "name": "Judy Bresnan", "time": 1594326599571, "rating": 5.0, "text": "Have had the most amazing facials with Joy!! She is so knowledgeable not only about skincare products but what your face actually needs! Can't say enough good things about her.\nI also had an wonderful time floating with my daughter. Had never done that before and it was so peaceful and relaxing wanted! Wanted something special to share with her and I have to say this fit the bill nicely. We both thoroughly enjoyed. The staff were so helpful through each process and we got snacks!!", "pics": null, "resp": {"time": 1595607334223, "text": "Spending an hour with Joy is always enjoyable. Adding a float makes it even better. Thanks for your feedback and visiting our office."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109183529953307677786", "name": "Karen Thompson", "time": 1599580608275, "rating": 5.0, "text": "Cahaba Dermatology is awesome. The staff and the doctor was very kind and helpful. Each person explained each step of the visit, from check in to completion of my visit. I highly recommend Cahaba Dermatology.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115357187993137756875", "name": "Emily Westray", "time": 1594752483570, "rating": 5.0, "text": "This was my first spa experience ever, and I got my eye lashes tinted. They look great! And the staff was so friendly. Very pleased, and can’t wait to go back!", "pics": null, "resp": {"time": 1597695895601, "text": "We are honored to have been apart of your first spa visit. Don't let it be your last, you deserve it! See you soon."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110763218095878900735", "name": "Cindy Partlow", "time": 1598959935391, "rating": 5.0, "text": "Staff are pleasant and efficient.Dr. Groysman and her PA were  professional, friendly, and thorough. All of my concerns were addressed In a caring manner. Highly recommend to anyone!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103771872163105320299", "name": "Peyton Gans Booth", "time": 1593205254898, "rating": 5.0, "text": "Dr. Gerald was so sweet and understanding. Listened to every word I said and took it into account. So refreshing to finally see a doctor who cares!! Highly recommend.", "pics": null, "resp": {"time": 1595607954620, "text": "We appreciate your feedback. Caring for our patients is a cornerstone of our office. Everything good starts from that single place."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "114254367599879614757", "name": "Marsha Majors", "time": 1594076353525, "rating": 5.0, "text": "Had a much needed massage today with Kari — I feel so much better after a long weekend of moving! Very friendly/clean/relaxing atmosphere! Will definitely be back👍🏼", "pics": null, "resp": {"time": 1596411926987, "text": "Moving can be both stressful and tough on the body. A massage was surely in order. Glad you got some relief from your visit and look forward to seeing you soon."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "107943876902798343148", "name": "Stephanie Stephens", "time": 1592654298969, "rating": 5.0, "text": "Such a wonderful experience! I met Dr. Ann Gerald and she was amazing! Very thorough and listened. Eager to help me with my unique issues due to a rare autoimmune disease. Highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "101998750901600092359", "name": "Larry Thompson", "time": 1605907793744, "rating": 5.0, "text": "Make you feel you are getting the best treatment possible. Staff and doctors are great.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "114880840054176697697", "name": "kay chenoweth", "time": 1600292939457, "rating": 5.0, "text": "Dr Grossman at Cahaba Derm is not only five star but a Rockstar!  She's been treating me since 2016 and done an amazing job. I Would recommend to her for any skin or health issues!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "111996052027142445715", "name": "Cecelia Thompson", "time": 1594249335066, "rating": 5.0, "text": "Hour massage with Carrie and Facial/Extraction with Tracy. Both were wonderful. I felt very comfortable.  They were thorough and very knowledgeable. High quality service! I will be back!", "pics": null, "resp": {"time": 1595607215722, "text": "That sounds like a great visit and glad you enjoyed the services. We are happy to have both Kari and Tracy on our team."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106730299413102305501", "name": "Caroline and Evan Crisp", "time": 1581949334286, "rating": 5.0, "text": "My fiance and I decided to do a couples massage together to celebrate our engagement and I am so glad we did! The experience from start to finish made us feel so special. We felt as if we were the only clients in the building. The staff were friendly, courteous, and attentive. They took great pride in helping us feel comfortable and at ease. My fiance said that we will definitely be back for more services together.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103897875130646755314", "name": "James Hillegass", "time": 1604528789298, "rating": 5.0, "text": "I recommend Cahaba Dermatology. Parking is easy, wait is usually short, staff is very friendly and Dr Groysman is great.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103718994359453728518", "name": "Penny Weldon", "time": 1592258925169, "rating": 5.0, "text": "Nurse, Dawn was so warm & friendly to me. My Dr was equally fabulous, professional and so kind in examining and taking care of my skin issues. She froze them off and thoroughly explained what she was doing. Both of them eased my fears and made this such a calming process.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "100253668230881055086", "name": "Chuck Segrest", "time": 1603769204232, "rating": 5.0, "text": "Best dermatologist around! Been going to Dr Groysman since she was at UAB.. She, her PA, and her entire staff is GREAT!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102249608678756768317", "name": "Barbara Conner", "time": 1612574903812, "rating": 5.0, "text": "She was very helpful I go back in too weeks", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "111497038924063946656", "name": "Mary Kelly Cantrell", "time": 1594742181156, "rating": 5.0, "text": "Kayla was so nice! It was my first facial, and I didn’t really know what to expect, but she was great! I definitely recommend getting a facial done here. They will treat you right!", "pics": null, "resp": {"time": 1597695955566, "text": "Thanks for the recommendation."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113380319211850003885", "name": "Tara Murphy", "time": 1612299672481, "rating": 5.0, "text": "Amazing staff.. very helpful.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "105012456610485462688", "name": "Sonya Roshell", "time": 1606237999237, "rating": 5.0, "text": "Very pleasant and professional experience from the receptionist to the nurse to  Dr.  Gerard. AAA+++", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "111867446115635797372", "name": "April Butler", "time": 1597253749344, "rating": 5.0, "text": "The office was clean and the atmosphere relaxing. The staff was very friendly and respectful. The doctor was very informative and explained everything in a way I understood.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102674009824413004656", "name": "Louise Czapala", "time": 1593016324959, "rating": 4.0, "text": "Super compliant with safety measures regarding COVID-19! Staff is attentive & helpful. My wait time was longer than expected, but not excessive. Very pleased with Doctor & plan of action!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "108759264245857400930", "name": "Steven Stanfa", "time": 1603288433290, "rating": 5.0, "text": "Cahaba dermo is great! I have been with them about year for an allergic reaction I acquired with my job. They were very profesional and courteous with me. The doc I was seeing left and the transition to the new doctor was seamless and easy. They are very responsive with needs. I needed papwork/notes/diagnosis stuff the day of appointment and it was available about an hour after my appointment. Would recommend to anyone for dermotology needs.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "108619736026791885076", "name": "Noah Whitaker", "time": 1600277665185, "rating": 5.0, "text": "Dr. Groysman is fantastic!! She has helped me is so many ways!! If you ever need a fabulous dermatologist please visit Dr. Groysman at Cahaba Dermatology.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "116816240895084584239", "name": "Carol Schablow", "time": 1603412919710, "rating": 5.0, "text": "Love Cahaba Dermatology! They offer so many services and their staff is so knowledgeable", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "111863069453785200732", "name": "Jim Imhof", "time": 1601922032370, "rating": 5.0, "text": "Very professional encounter. Efficient check in, nominal wait time, courteous treatment and Dr Grosman did a systematic check of my skin. Very please with experience 👍", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "114800734733013092717", "name": "Bessie Tan", "time": 1593716217398, "rating": 5.0, "text": "Kari did an AMAZING job of getting my tight shoulders/neck/back to relax. She was professional and pleasant and I feel a gazillion times better after my massage! Im looking forward to my next one already!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106127435012223060609", "name": "Deborah Lambert", "time": 1594134658754, "rating": 5.0, "text": "Very accommodating and friendly!  Cari, the massage therapist, found all my problems areas and took care of them. The massage was tailored to what I needed!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "117986022748375190464", "name": "John D Williams", "time": 1597852858562, "rating": 5.0, "text": "Kind, considerate staff & a nice facility. Cahaba Dermatology is a class organization.\nKeira, Laura & Amanda were the ones I remember but everyone was very friendly & helpful.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113512114386631224663", "name": "Brandon Killingsworth", "time": 1612909006382, "rating": 5.0, "text": "The appointment service was prompt and speedy. The staff and doctors were very courteous and caring.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "104400107182839550848", "name": "david r. Daniels", "time": 1592877354648, "rating": 5.0, "text": "A very good appointment\nGabriel was very kind and helpful. The doctor came in and helped me and Gabriel finished up. She was very professional and did a great job helping me with my prescriptions", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "111294479487646826960", "name": "Brittany M. Whetstone", "time": 1573055139936, "rating": 5.0, "text": "I will absolutely be back! This place is everything you would want when going to pamper yourself! Everyone is super nice, all smiles. The environment is full of positive vibes and I love ❤️ that! They make you comfortable and have much to offer. I recommend Cahaba Dermatology to anyone looking for a place to get a facial or any pampering needs!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112011634981576330884", "name": "Nicole Compher", "time": 1594741228508, "rating": 4.0, "text": "Great first experience and pleasant staff! I thought that the deposit was the cost of the facial, so I was caught off-guard by how much I spent, but would go back again. Also, the lady at the front desk hooked me up with coffee and a breakfast bar!! Just what I needed from a spa", "pics": null, "resp": {"time": 1597696059431, "text": "We are glad you enjoyed your visit. Sorry there was some confusion on the deposit payment. We look forward to seeing you again soon."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103801123918589016483", "name": "Marlana Smedley", "time": 1592004158153, "rating": 1.0, "text": "Horrible went in for laser hair removal and ended up with multiple burns. I sent pictures in and was told to come into the office so they could take a look. When I got there Dr Groysman was extremely rude and arrogant. She proceeded to tell me that they put the laser on the “African American setting”, which there’s no such thing. I’ve had laser hair removal done  before and knew what to expect from the process...and burns were not it. If you are African American I would advise you not to go here. Spend your money where you will be treated with respect. I would give zero stars if it was an option", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "107020815145732736238", "name": "Ray Robbins", "time": 1606922123408, "rating": 5.0, "text": "The waiting room was very comfortable but the wait was so short that I did not have time to read before I was called back to an examination room.  There the assistant asked the normal standard questions.  She was nice and courteous.  She instructed me as to what to do to be prepared for the doctor to make her examination.  Almost as soon as I was undressed and in the gown given to me to wear, the doctor came in.  The doctor was very warm and polite and quickly began her examination to determine if I had any molds of concern.  She was very professional and did find one mold that was questionable so she took a biopsy of that mold.\nI am so pleased with the care given to me, that I highly recommend Cahaba Dermatology.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102260480013427160662", "name": "Adelle Sims", "time": 1604114651411, "rating": 1.0, "text": "Arrived early and had to wait an hour and a half to see the doctor.\nNurse and doctor both rude, especially nurse.\nTerrible staff.\nTerrible service.\n\nNurse kept calling me mom and talking down to me because I had to leave because I was late to a work appointment (didn’t plan on having to wait so long to see the doctor).\n\nWould Not recommend this office to anyone!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115527172201908838439", "name": "D Thompson", "time": 1602179206177, "rating": 5.0, "text": "Very professional, the doctor explained things thoroughly and there was not a long wait.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103535223547838993043", "name": "Amelia Johnson", "time": 1596584230115, "rating": 5.0, "text": "Always extremely clean and everyone is friendly. Saw the new Doctor, Dr. Wang, and she was very thorough; I felt very comfortable with her and her assessment of my skin.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115624659353112997588", "name": "Will Abreu (beautybyWill)", "time": 1591310336758, "rating": 5.0, "text": "Have been there before for skin issues and they have always been great! This time went for my first round of Botox and they were wonderful with that too. Definitely going back when it wears off and get my filler too next time", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106564602378304366338", "name": "Amy Everson", "time": 1568373053845, "rating": 5.0, "text": "Forget everything you know about a dermatologist office! I cannot say enough positive things about Spa Cahaba! It’s a beautiful spa that offers all the amenities you want when looking for a spa day of pampering. I went in to float in their float pool (if you’ve never heard of it, look it up- amazing experience!) and came out SO relaxed. I followed it up with a massage from Elizabeth- amazing! She was so careful to address my individual needs, checked in on the pressure to ensure I was comfortable and having a positive experience. It helped my chronic pain and relaxed me to the point that my nightly sleep improved immediately. Everyone was so kind and helpful. Beautiful quiet room, snacks, drinks, etc. Fluffy robe and slippers, you name it. They showed me around and made sure I had everything I needed. I can’t wait to go back!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "104347022579519324896", "name": "Ken Blake", "time": 1598643999486, "rating": 5.0, "text": "My wife and I both had appointments today with Dr. Wang. Everyone was great and we were out quickly!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106252528361732498994", "name": "Quenetta Barbee", "time": 1596726864261, "rating": 5.0, "text": "Always very pleasant and professional. Wait time is very minimal. The staff is very good with explaining all medications.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "107812809537651164023", "name": "Gretchen Covington", "time": 1577550206859, "rating": 5.0, "text": "Everyone at this office is so helpful! Valerie is very knowledgeable about the products and skin issues I’m having. Jane at the front desk is very sweet and attentive! The office is very clean and modern. I’ve had acne scars for quite some time... I’m finally beginning my journey and couldn’t feel better about it!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "116076991522528087749", "name": "Robin Oglesby", "time": 1601404563357, "rating": 5.0, "text": "I love Cahaba Dermatology. Great doctors and amazingly, awesome staff!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "107554973535610522078", "name": "richard weinstein", "time": 1601065147940, "rating": 4.0, "text": "Fantastic professional treatment for me as dr gearlds patient over 40 years", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "108316931970683356494", "name": "Abbey Thompson", "time": 1597261554502, "rating": 5.0, "text": "I’ve had massages all my adult life.....this one, by far was the best I’ve ever had. Kari was Amazing and I’ll be back soon!!!!", "pics": null, "resp": {"time": 1597695153547, "text": "What an compliment! Thanks for the kind words. Kari and our staff appreciate that we can impact our patients in a positive way."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "105836769223489868500", "name": "Khanijah Richardson", "time": 1591297648083, "rating": 5.0, "text": "They are super fast! They had me in and out of my appointment in no time! Additionally, they are extremely helpful! I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110049679056127262745", "name": "Jan Nunnally", "time": 1594064628055, "rating": 5.0, "text": "Masks worn by all.. got to me in a timely manner.\nVery pleased!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "104553057705099453476", "name": "Debra Lee Talbott", "time": 1602187887825, "rating": 5.0, "text": "very awesome experience, polite & super friendly staff & comfortably pleasant environment.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "107458430470593010867", "name": "Burthia Booker", "time": 1568600898146, "rating": 5.0, "text": "This is the dermatological/spa experience that I have been looking for in Birmingham. Professional, attentive, with staff and estheticians that actually listen and are more interested in healthy, beautiful skin than selling expensive peels and treatments without actually examining their client's skin. I have been working with Dominique,  and she is amazing. Friendly, interested, and caring with exceptional technique and insight. I look forward to continuing my journey with her towards healthy, beautiful skin.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "100344196109323220297", "name": "Deborah Brooks", "time": 1613780897452, "rating": 5.0, "text": "Everyone is very professional and courteous.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106380403138149235090", "name": "Monique Houle", "time": 1592240524056, "rating": 5.0, "text": "Efficient, quick, friendly service all around, didn't even have to wait more than 5 minutes past appointment time. I was impressed!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "116753372803011483004", "name": "Dona Luna", "time": 1593041462043, "rating": 5.0, "text": "The staff at Cahaba Dermatology is very professional and friendly.\nTracy Humphryes is one of their aestheticians and is extremely knowledgeable and an expert in her field.  I would highly recommend her to anyone.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112110226377438769739", "name": "Jennifer Howard", "time": 1610736955377, "rating": 5.0, "text": "Dr Groysman does an excellent job and she is wonderful with her patients!!! I have been coming here for over a year now and every experience has been wonderful! I recommend them to anyone that is needing help or wants cosmetic work done they are awesome!!! Staff is wonderful too", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112918036357312441734", "name": "Ac Drummer", "time": 1606954585045, "rating": 5.0, "text": "It was very good,l will give a 5\"\"", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "116402059823091465548", "name": "Latrice Mason", "time": 1603496008037, "rating": 5.0, "text": "I Love This Establishment...Everyone Is Very Polite and Professional!!!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "104780520178236160668", "name": "Ken Gross", "time": 1604095067941, "rating": 5.0, "text": "I really like all the staff, the facility and everything about Cahaba Dermatology and Health Spa.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "117318985712340240110", "name": "denise jeffries", "time": 1612979340831, "rating": 5.0, "text": "Dr Groysman is the best.", "pics": null, "resp": {"time": 1614307739844, "text": "Thanks for kind words"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "101030223740558475347", "name": "Aisha Hoyle", "time": 1568056727166, "rating": 5.0, "text": "The dermatologist that I saw was very professional, gave me some direct, factual answers to an issue that I have been worried sick about for almost 4 years. Also, while I was waiting, I was looking at their products for different skin types, and they had someone right there that specializes in that to help! I have rosacea and my face gets really angry at times, to the point of hurting down to my bones in my face, and I bought three products for my skin type that they suggested, and the total was only $104.00. That may sound like a lot, but I bought the largest size of two of the products, and she even told me...”open the spray first, it was the least expensive, and spray your face with it, and you will tell a difference within 3 minutes,”and I did! It was so soothing and calmed my face down as I sat in my car before leaving! She told me if I didn’t get a result from that, bring the other two products back and get my money back! When she said that, I knew she was genuinely trying to help me, and she did! My face has never felt as good as it feels, and looks from using these particular products! I have spent a lot of money trying to buy healthy products, trying to get some relief, to the point that my husband was not happy, at all, whenever I wanted to order another product! All I can say is that I felt like everyone there, was there to truly help people. Skin issues can be a very personal issue and it has been very difficult for me, but my skin is doing better than ever! I made an appointment for my 14 year old son that day, and another for myself! I won’t be going anywhere else. Cahaba Dermatology is top notch!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109963837154033416410", "name": "Temple Marston", "time": 1566739619837, "rating": 5.0, "text": "My 84 year old father came in to float in the salt water float pool. He thoroughly enjoyed every moment at the spa.  He was greeted with warmth and kindness and it didn’t stop there.  He was pampered and left walking better, relaxed and feeling better overall.  The staff have customer service down and go above and beyond to help and make patients feel special.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "105406771684260104509", "name": "Briana JTV", "time": 1578463827105, "rating": 5.0, "text": "I was only there for around 20 minutes and I fell in love. It smells wonderful everyone was so sweet and pleasing. They made me feel so comfortable and I will gladly be going back.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103590424786193827244", "name": "Elaine Jackson", "time": 1604966569740, "rating": 5.0, "text": "I love Cahaba Dermatologist and my Doctor there Dr. Groysman and the staff are all professionaly polite and friendly.. I'm improving and i feel good going there", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "107286705928103147284", "name": "Jessica Stodden", "time": 1592433551758, "rating": 5.0, "text": "Very clean and nice. They have been very helpful thus far", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "118330602737433284474", "name": "Cindy McRee", "time": 1607974433768, "rating": 5.0, "text": "Wonderful, friendly, professional and clean practice. Dr. Ann Gerald is an excellent dermatologist!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103455719761933434529", "name": "Sandra Evers", "time": 1578256642147, "rating": 5.0, "text": "Fabulous one to one information and follow up care!!! I was nervous and the clinician made me feel so comfortable and at peace.  Great environment and friendly service 👍.  I would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115707193188200004742", "name": "Katherine Morgida", "time": 1572443253720, "rating": 5.0, "text": "Very posh office and environment, the staff are always polite, professional, and take my concerns seriously. I have even been able to email them a picture after having an unexpected reaction to a medication. They provided help and a new treatment plan without me having to schedule and pay for an additional office visit so close after the last one. The nursing staff reassured me they would be there to help if anything else came up. Truly, they go above and beyond to provide high quality care. They will also help you get your medications affordably by sourcing from mail order pharmacies if your insurance is being difficult. ⭐⭐⭐⭐⭐, They're the best.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112396967808059000960", "name": "Meleah Montgomery", "time": 1597439149858, "rating": 5.0, "text": "I was a new patient because my old dermatologist could not see me in a timely manner. I sent out a request on yelp to be seen by a dermatologist and they responded immediately and said I could be seen the NEXT DAY! They staff was so friendly and inviting! The paperwork was all online so it was easy to get it all done. I was in and out in less than an hour. They have some skin care products available for purchase, but they also suggest cheaper options if people do not want to spend too much. I saw Dr. Gunn and she was amazing and understood my need to see her. When I left I was still confused on my skin care routine, so I called back and left a voicemail. She called me back later day and made sure all my questions were answered. From the Dr., to the receptionist, to the women who checked me out, they all were very helpful. I would recommend this business to my friends and family for their excellent service!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "104920922953007599838", "name": "Jenn C", "time": 1567167941428, "rating": 5.0, "text": "My experience here was just wonderful! The staff was knowledgeable and helpful. Dr.  Gunn has a wonderful demeanor. She is gentle,  kind,  and reassuring  during examination. She addresses your concerns with medical and practical solutions to fit your budget and lifestyle.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "100399983677896092488", "name": "Harvey Deane", "time": 1578187500014, "rating": 5.0, "text": "The experience was very enjoyable and I look forward to future services at Spa Cahaba. I had my first ever facial with Valerie and it was blissful. I highly recommend Valerie and Spa Cahaba", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113363816098126837431", "name": "Emmily Woods", "time": 1591233825675, "rating": 4.0, "text": "Ms. Elizabeth and Ms. Amanda in the Light clinic are wonderful. Thanks for the excellent service and care.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102381242666285347774", "name": "Ken Martin", "time": 1612367758606, "rating": 5.0, "text": "Excellent. Great doctor and staff.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103558931875767162246", "name": "Steve VanGilder", "time": 1591654749497, "rating": 3.0, "text": "Overall I am satisfied but I wish I could be seen at my appointment time and not 20 minutes late", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "114701366655029482344", "name": "Morgan Driskell", "time": 1568726877161, "rating": 5.0, "text": "Absolutely amazing! Went in with a few moles that worried me and they checked them, explained all the different types of moles I had, and put my mind at ease. Also helped recommend a great sunscreen! Great staff and great people!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115395318788047091699", "name": "martha ledlow", "time": 1594063946814, "rating": 5.0, "text": "Tracey was a great aesthetician.  Will definitely be going back.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115268293908777043694", "name": "Jess N.", "time": 1580149945380, "rating": 1.0, "text": "A little disappointed in my experience at CD. I felt rushed and I was told that I wouldn’t be able to address all of my skin concerns since I was scheduled for a full body check up. My medical assistant was rude and had terrible bedside manners. Luckily, my provider was extremely friendly, knowledgeable and a breath of fresh air.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113588660936539901820", "name": "S B", "time": 1578585636438, "rating": 1.0, "text": "Beautiful building.  Friendly front desk staff.  Rude doctors and administrators.  Good luck trying to hear back from them or billing.  I'd advise looking elsewhere.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103786404156326449788", "name": "Theresea Kilgore", "time": 1573630166829, "rating": 5.0, "text": "This spa is state of the art and has a wonderfully friendly and helpful staff.  Beautiful and relaxing from beginning to end. I highly recommend Cahaba Spa to anyone looking for a great spa experience", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "107811659693833487045", "name": "chuncie bowie", "time": 1605043332536, "rating": 5.0, "text": "Staff and doctor was very knowledgeable and helpful  and soo friendly", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "108693771664686521127", "name": "Whitney Thomas", "time": 1563971046244, "rating": 5.0, "text": "I have gotten two facials from Laura Cook and had the best experience!  She is not only a super sweet person but also keeps my sensitive skin in mind when choosing techniques and products. In the past with other estheticians, I’ve left red faced and burning. Not with Laura. My skin feels and looks the best it’s ever looked after seeing Laura. She also recommended great skin care products for me to use daily at home. She believes in just recommending the necessary products so you’ll actually use them. Highly recommend her!!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "117999091668186622193", "name": "Kami Williams", "time": 1568208725876, "rating": 4.0, "text": "The receptionists are very welcoming. The wait time was not too bad. Dr. Gunn has a very sweet manner about her and is also very informative. I will be using them for all my dermatological needs for the foreseeable future.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102304295003725527762", "name": "Gary Sowards", "time": 1608166924660, "rating": 5.0, "text": "Dr. Groysman & her entire staff are the best.  From check-in to check-out, its pleasant & relaxing.  Thanks to everyone for making my wife & I feel so safe & appreciated!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109880709122995772686", "name": "Sue Lee", "time": 1609895925459, "rating": 5.0, "text": "Great office & Doctor. Couldn’t ask for anything better!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "114768382227710968163", "name": "Wayne Kennedy", "time": 1596814432475, "rating": 5.0, "text": "Love Dr Groysman. Always concerned, always caring.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109043140247059816726", "name": "Brad Peak", "time": 1569334172906, "rating": 2.0, "text": "Doctor Groysman and her staff are always great people to deal with. I am only giving two stars because my appointment was at 10:50AM and I showed up 10 minutes early to of course be courteous and timely.   However, I was not called back for my 10:50 appointment until almost 11:50.  Kinda defeats the whole purpose of having an appointment.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112256447253967396205", "name": "Johnny Kelley", "time": 1604506416132, "rating": 5.0, "text": "I had an appointment on Wednesday with dr Ann Gerald and dawn I was treated excellent from the time I signed in at front desk until I was checked out this place is the best of the best to go for your dermatology  needs . Good clean facilities kind hearted people working with company whole staff gets five stars . March 18-2020 .", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115840635668725295944", "name": "John Harrod", "time": 1603053777483, "rating": 1.0, "text": "Try clicking on any of the providers below Dr. Groysman's photograph and see  if you can get any  information about them.. You can't,  because the website doesn't work. It hasn't worked  for months and apparently the owners don't care.  Now if a large dermatology practice doesn't care enough to have a working website, what else don't they care about?", "pics": null, "resp": {"time": 1603118232413, "text": "John, Our website is one of the few things we outsource to third party providers. Obviously, something is not working correctly and I've notified our webmaster. We also have a new website in construction that will provide better speed and function. Please call our office in the meantime if you need specific information on our providers. Thank you for bringing this matter to our attention, but your post is a review of our website and not our services. As we are a medical provider and pride ourselves on our quality service from check-in to check-out. Please consider evaluating us for our customer service and medical or spa services. Regards,"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109856190062981254010", "name": "Brittney Crump", "time": 1568849577021, "rating": 5.0, "text": "Courteous staff and clean office. The doctor we saw was very patient with my child. She answered all questions and made sure we felt comfortable with her diagnosis. Easy to find office with plenty of parking.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112832303814480430625", "name": "Veronica Johnson", "time": 1607968158184, "rating": 5.0, "text": "Love Dr G! She is genuine and down to earth!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "100720135604789568464", "name": "Thomas Yirak", "time": 1592326392699, "rating": 5.0, "text": "Great staff, very friendly and thorough.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "101512226479575261001", "name": "Shelly Smith", "time": 1593632110398, "rating": 5.0, "text": "Incredible facility with friendly and professional staff, service provided was excellent and timely.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "100300344247029305710", "name": "Angela Ward", "time": 1563277956971, "rating": 5.0, "text": "Easy new patient check in ever! Very professional staff. The building is beautiful and extremely clean with very pleasing decor and lighting.\nThe nurse and Dr Glick were very engaged in conversation about my reason for visiting. The doctor and other staff members that I encountered took time to talk to me as a person and not just as another medical case. It was a refreshing experience indeed.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "114517384588676294957", "name": "Ashley Shepherd", "time": 1593699339874, "rating": 5.0, "text": "The receptionists were all very sweet and the dermatologist was refreshingly helpful.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "114074615249144654065", "name": "lizbeth alvarado", "time": 1601303896067, "rating": 5.0, "text": "Dawn is 10/10 the best & Dr.Gerald is my fave !", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110802492918242673026", "name": "EmilyAnne Chenoweth", "time": 1573225364913, "rating": 5.0, "text": "I absolutely recommend Cahaba Dermatology & Skin Health Center! I have been to a couple Doctors there most recently Dr.Gunn, she prefers a more natural approach to Botox etc. (which is hard to find) and is very experienced and skilled to be able to create great results not to mention she’s an absolute doll! All the staff there are so helpful and kind! They make you want to come back!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109398393700793707446", "name": "Quazzicle Schap", "time": 1578063258808, "rating": 5.0, "text": "We did a couples float and a couples massage. Environment is nice. Wonderful staff. Great place to get away.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110632943549391788851", "name": "Amanda Blackwell", "time": 1594056708510, "rating": 5.0, "text": "Tracy was very professional and did an amazing job on my brows.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109034250974450395592", "name": "Laura Petro", "time": 1568116995108, "rating": 5.0, "text": "I recently went to Cahaba Dermatology and Skin Health Center for the first time.  I saw Dr. Glick.  I had seen her years ago and needed a new dermatologist so I made an appointment.  The office is easy to get to and is really nice.  Dr. Glick is a wonderful doctor.  She's easy to talk with and she explains what is going on and what concerns her.  I got the results of some path tests within a week and by phone.  I will definitely be a patient of hers for life.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106018728519008666703", "name": "Hilary Wood", "time": 1575502910268, "rating": 5.0, "text": "Dr. Gunn is absolutely amazing. She saved my skin after years of horrible cystic acne! She is so sweet and will go above and beyond to help you and take care of all your needs and concerns. Her staff is also just as amazing. I would definitely recommend them to anyone who is suffering with any sort of skin issue or acne issue! They will get tour skin exactly where it needs to be!!!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115421123923934435078", "name": "Hal Williams", "time": 1572963506411, "rating": 5.0, "text": "The facilities are excellent and staff always seem to have a smile on their faces. Minimum waiting time. Dr. Groysman is an experienced well respected dermatologist and provides superb care.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109644033929317994505", "name": "John Allen Dees", "time": 1575991203749, "rating": 5.0, "text": "Floated. Different than floating in pods but good. Much larger pool. Very nice staff.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "105577708190048753664", "name": "Michael Cooley", "time": 1557567003937, "rating": 5.0, "text": "Great place! The doctors and staff  are very professional and work hard to give you the best care. They spend the necessary time with you to explain and discuss your needs and course of treatment. You never feel rushed with them and they’re very pleasant as well.", "pics": null, "resp": {"time": 1557938467115, "text": "Michael, We understand a quality skin exam can't be rushed. Thanks for making a note of this. Reminds us we are sticking to our mission."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103227638461962091225", "name": "Marilyn Windham", "time": 1570112556143, "rating": 5.0, "text": "I am pleased to have been under the care of Doctor Glick from the beginning of her practice. Her compassion for excellence in patient care is outstanding.  I am so blessed and confident to be under her expert care.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102008416637240666713", "name": "Judy New", "time": 1571327359103, "rating": 5.0, "text": "Everyone there is so nice.  They always have a beautiful smile on their faces.  They always answer all my questions and explain what they are doing and why.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "114094365885833986475", "name": "Mike Cottingham", "time": 1560866201723, "rating": 4.0, "text": "Staff was great, waited a little long before going back, was told chart was put in wrong place, that's understandable. The person who saw me wasn't actually the doctor, but took pictures and showed them to the doctor. That was a little strange to me,  if the doctor could consult with her about the pictures of my condition why not take the time to see me and consult with me,being a new patient. Was my first dermatology visit, maybe they all do this, I dont know. Other than that all was good", "pics": null, "resp": {"time": 1560955805717, "text": "Mr. Cottingham, Thanks for the feedback. We offer appointments with physicians as well as our physician assistant. We understand this is a patient preference and are free to make changes to your provider at any time. Sounds like you were pleased with care and we are very confident in our PA, but of course this remains your choice. Thanks"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112803146546392372546", "name": "Debbie Collins", "time": 1560950215946, "rating": 3.0, "text": "I had my first appointment here yesterday. The nurse was absolutely amazing! So very informative and friendly!  The dr was very friendly and informative too. I did feel tat the doctor rushed through my appointment. She did a full body check on me and quickly did two biopsies and froze off one spot. Then she was out of the room.\nI wanted to talk to her about my complexion, as I had put that on my paper work when I filled it out.\nI didn’t get to do that.\nI had hoped to talk about some issues I had been having for years with my pores and had hoped that this was the place that I could finally get help.\nI was just rushed with my time with the doctor.\nEven though she was very nice.\nMaybe I need to learn to speak up.\nIt was close to lunchtime though 😩", "pics": null, "resp": {"time": 1560954226547, "text": "Ms. Collins, Each visit is unique and there are often many things happening being the scenes, especially with biopsy's and other procedures. Of course we don't want patients to feel rushed and providers typically make a point to address all concerns and determine if additional visits will be needed. We do offer full cosmetic consultations. Please contact our office if you would like to set this up so we can partner with you in resolving or improving your areas of concern. Best"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "118138161081206649550", "name": "Donna Vickery", "time": 1570716778762, "rating": 5.0, "text": "Love Dr. Groysman and staff at Cahaba Dermatology!  They make each patient feel special and cared for.  I am very happy with the results of their care.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112135643853420321479", "name": "Gary Perkins", "time": 1557929069392, "rating": 1.0, "text": "I have been a patient for a few years.\nI had to call to reschedule an appointment.\nBecause I couldn’t give a 24 hour notice, I was charged $50.00.\nAfter speaking with the Manager, I was very disappointed.\nI got the feeling that according to her they were now to big to care about the patient.\nIts as if they don’t need my business any more, they have plenty.\nIt isn’t  about the unfair charge, it’s about me just being a dollar amount to them.\nI will not be returning to them, i will find a Dermatologist that cares about me not just my money.\nVery disappointed with the Manager and the attitude toward me.\nThere are plenty of other Dermatologist out there, it would be best to find one.", "pics": null, "resp": {"time": 1557938082462, "text": "Mr. Perkins. We value every patient that we care for. Our office policies are clearly stated at the time of appointment booking, on confirmation messages, and on our in-office paperwork. Charging a fee is a last resort in most cases and something we never want to do. I regret this has left you feeling less valued."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "118302414810746823432", "name": "Polly Mitella Goins", "time": 1598293764705, "rating": 5.0, "text": "Good job.  Everyone friendly", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109644033929317994505", "name": "John Allen Dees", "time": 1575991203749, "rating": 5.0, "text": "Floated. Different than floating in pods but good. Much larger pool. Very nice staff.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113816765993684000056", "name": "alan barr", "time": 1559424906617, "rating": 5.0, "text": "Great experience overall as a new patient and new to Alabama.  The doctor was excellent and listened to my concerns and immediately set about helping me.  Staff is very kind.  Free coffee!  I highly recommend this group.", "pics": null, "resp": {"time": 1560178915070, "text": "Welcome to Alabama and Cahaba Dermatology. We are happy to have you!"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115449471965202045908", "name": "Joy Toffel", "time": 1563296876275, "rating": 5.0, "text": "Dr. Ann Gerald is one of the most brilliant, loving, ,sincere doctors my daughter and I have ever been privileged to be under. I trust her totally. The office is lovely and personnel are most gracious and helpful!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "107853777585546378718", "name": "Meg McQuiddy", "time": 1605895860869, "rating": 5.0, "text": "Everyone was very kind and helpful.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "118261356807956540386", "name": "Jonathan Smith", "time": 1559829667798, "rating": 5.0, "text": "Always a pleasant experience with this Dermatologist! Dr. Glick has always been really nice and listened to my concerns and provided helpful feedback. I highly recommend this be your Dermatologist of choice! You won’t be disappointed!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "100360934963907158087", "name": "Crystal Roberts", "time": 1564060902650, "rating": 5.0, "text": "Dr Holly Gunn was great. She answered all questions and was very thorough. We are looking forward to our follow-up appointment with improvements. I will definitely be referring my friends/co-workers.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110616119343385406299", "name": "Amy Howard", "time": 1569763291243, "rating": 5.0, "text": "Amazing spa!  Beautiful and relaxing atmosphere. The staff is AMAZING!  I can’t wait for my next appointment!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "107539999343955170317", "name": "Margo Lawson", "time": 1574273929284, "rating": 5.0, "text": "I have been going to Cahaba Dermatology for over two years for treatment of  various skin issues, one being melanoma.  Dr. Glick was very thorough in her examination and this lead to discovery of early melanoma which was removed. I now go back for routine examinations regularly. I have full confidence in Dr. Glick and the doctors at Cahaba Dermatology.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "100939427536529598892", "name": "Julie Heckman", "time": 1604940544958, "rating": 5.0, "text": "Susanne, NP, is a breath of fresh air!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102319297265645895857", "name": "David Battles", "time": 1578711445285, "rating": 5.0, "text": "Excellent professional care. I have visited 3 Drs including my Rheumatologist, Dr Gerald was the first to suggest a biopsy was critical for a correct diagnosis to be made.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "118270868074768457523", "name": "Scout Parker", "time": 1558704352633, "rating": 5.0, "text": "It was very easy to make an appointment at Cahaba Dermatology. The patient portal and text appointment reminders were helpful too. The ladies at the front desk were warm and welcoming when I came in, answering any questions I had and making the process very efficient. This allowed for me to be in/out quickly, which is a huge bonus!\nDr. Holly Gunn is amazing- I have been previously told by other dermatologists that there isn’t much I can do to treat my skin, but Dr.Gunn made me feel very comfortable discussing my acne AND confident that we can tackle my issues together. It was great walking out with solutions!\nThank you, Cahaba Dermatology! :)", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "111235133437265635830", "name": "Angela Lopacki", "time": 1557582593246, "rating": 5.0, "text": "Very attentive personal service. All around friendly helpful staff. I felt at ease throughout the entire procedure. Highly recommend for any of the services offered", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "116761694079575283224", "name": "Debbie Cook", "time": 1571582495269, "rating": 5.0, "text": "I went to Float Therapy here. It was an amazing experience. The staff is amazing and the energy is positive all around!!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109254078240670312991", "name": "J P", "time": 1557898857227, "rating": 5.0, "text": "Both locations are stylish and clean. I usually go to the office in Tuscaloosa, AL, although it is a smaller office I still feel welcome and pampered. Both receptionists always great me by name.\nJoy B. is a fantastic esthetician. She is very knowledgeable, has a great touch and always uses the products to your advantage based on the condition of your skin. I have followed Joy twice to new offices/practices, she is that good! Highly recommend Cahaba Dermatology & Skin Health Center.", "pics": null, "resp": {"time": 1557938233694, "text": "JP, Thanks for visiting both our locations. It was important that both our offices offered an equally high level of patient service."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "100626025978484614802", "name": "Kim Gayle", "time": 1563196716111, "rating": 5.0, "text": "Wonderful facial!  So relaxing and cleansing. I felt like I had new skin. Can’t wait to go back!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "101955621968962393273", "name": "Karen Carroll", "time": 1558105906856, "rating": 5.0, "text": "Front desk, checkout, nurse, PA, Doctor - all friendly and professional.  Beautiful and clean office.  Hardly any wait time.  From having several skin cancers and melanoma, I want only the best to protect me and help with prevention.  5 stars for Cahaba Derm!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110425880328856466658", "name": "Tracy Blackwell", "time": 1566308199244, "rating": 5.0, "text": "I’ve been using Cahaba Derm for two years now. I started with tattoo removal, now taking measures to protect my skin, thanks to Valerie! She has me looking 10 years younger, she’s the best!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "114041995735895051356", "name": "Leslie Mays", "time": 1569938198402, "rating": 4.0, "text": "I was very comfortable having Dr. Groysman do a full body skin check.  It was very thorough and she answered all my questions.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "117123763975142092920", "name": "Qraging", "time": 1611356203076, "rating": 5.0, "text": "Very nice people", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "101210274085315011392", "name": "Ingrid Moore", "time": 1562770485806, "rating": 5.0, "text": "My masseuse was amazing!  The spa was immaculate.  The staff was kind and courteous.  I will definitely be back!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "118270868074768457523", "name": "Scout Parker", "time": 1558704352633, "rating": 5.0, "text": "It was very easy to make an appointment at Cahaba Dermatology. The patient portal and text appointment reminders were helpful too. The ladies at the front desk were warm and welcoming when I came in, answering any questions I had and making the process very efficient. This allowed for me to be in/out quickly, which is a huge bonus!\nDr. Holly Gunn is amazing- I have been previously told by other dermatologists that there isn’t much I can do to treat my skin, but Dr.Gunn made me feel very comfortable discussing my acne AND confident that we can tackle my issues together. It was great walking out with solutions!\nThank you, Cahaba Dermatology! :)", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "105108410105356712413", "name": "Debra Hajj", "time": 1598037071997, "rating": 5.0, "text": "Very good service and great Doctor’s!!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "107423628702111233746", "name": "Phillip Oliver", "time": 1603730234427, "rating": 5.0, "text": "Great staff!  Very patient minded!", "pics": null, "resp": {"time": 1596411851509, "text": "Phillip, We strive to provide a patient focused experience for both our Dermatology and Spa facilities. We appreciate the feedback and will work to continue to deserve this compliment."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "114886517277136226922", "name": "Angela Johnson", "time": 1591735365697, "rating": 5.0, "text": "Everyone is very nice. Great job.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106132858906007182906", "name": "Kim Sanders", "time": 1564105500199, "rating": 5.0, "text": "I’ve been Dr Groysman’s patient for years and have always received the best care... always felt like I was the only patient that mattered... she has a way of making everyone feel that way!", "pics": null, "resp": {"time": 1566250498194, "text": "Ms. Sanders. One patient at a time is how we like to do things. I am glad this comes through in the visit. Thanks for your comments."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110679700111159100994", "name": "Mary Breckenridge", "time": 1574816354201, "rating": 5.0, "text": "Dr. Groysman has a great bedside manor....very thorough and takes her time in answering all your questions.  Thank you!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "114041995735895051356", "name": "Leslie Mays", "time": 1569938198402, "rating": 4.0, "text": "I was very comfortable having Dr. Groysman do a full body skin check.  It was very thorough and she answered all my questions.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "111346505050896404909", "name": "Brenda Fuller", "time": 1596039675553, "rating": 5.0, "text": "Very professional and very nice atmosphere.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110708181704163471358", "name": "Kersti O'Farrell", "time": 1574648035129, "rating": 5.0, "text": "The Spa is just wonderful.   The sea salt soak was just amazing!!!!   Dominque was so professional (Facial) and Elizabeth’s massage was just perfect!", "pics": null, "resp": {"time": 1566232310658, "text": "Kersti, Glad you enjoyed the soak. It is a really unique experience that only gets better with each visit and can provide very deep meditative relaxation."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112092164894859529780", "name": "Melinda Gargiulo", "time": 1597248724595, "rating": 5.0, "text": "The staff is friendly, facility is beautiful, and I rarely have to wait long.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "107423748964735314745", "name": "John De Block", "time": 1591719298761, "rating": 5.0, "text": "The staff in the light clinic are always prompt and courteous.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112998085369000304159", "name": "John H. Davis", "time": 1601496991406, "rating": 5.0, "text": "Great care and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "116218290122106170667", "name": "Mary Anna Raburn", "time": 1561733540321, "rating": 5.0, "text": "Dr. Glick is wonderful. The staff and services are as well.  I have always been treated with kindness, consideration and dignity.  They have a spectrum of products and services. A thank you to Laura for taking care of me yesterday!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110416508875276706092", "name": "Alyssa Carman", "time": 1594667786330, "rating": 4.0, "text": "Amazing staff. There was a little wait at the beginning. But the nurse who welcomed me in apologized for that and said it’s not normal. Then I had a little incident with my baby who was with me and everyone was so kind and understanding and helpful! And then the main reason I was there was for my acne and the doctor prescribed me things that were safe while breastfeeding. She explained what was going on, too. I’m about 2 weeks in with her suggestions and my skin has significantly improved. I will definitely continue to come here for my skin health needs.\n\nUpdate: I have been to this location 3 times now and each time I have had an hour + wait. So the first time was not an isolated experience. Today is July 13th, 2020. Jefferson county has put a message out saying masks are required to help stop the spread until there is a vaccine. Unfortunately, this location is subject to this “requirement” and after asking if I had to even with the recent announcement that the WHO has come out and said in a press conference that “it is rare for an asymptomatic person to spread COVID. “ So now we are in an era where counties and the businesses in them will pander to fear that is unfounded as of today with the death rate of Covid well below 1%. We will see what the future holds for Covid. If it mutates into a more dangerous strand, I will re-assess my frustration with businesses like this. But in the mean time, I will speak my mind and spread truth about what Covid is. I’m sick and tired of being forced to wear a mask that will spike my carbon dioxide intake that has been proven to lower my immune system along with many other side effects. And all in the name of waiting for a vaccine that will still not have a long term trial study under its belt to make sure that there are not any severe long term side effects. And in case you are not aware, there are plenty of vaccines that have side effects that do not show up right away. One example of this is thimerosal (Mercury) was removed or reduced from vaccine use. Heck, Johnson and Johnson just settled with plaintiffs who experienced many different cancers decades after the use of JJ baby powder. BABY POWDER!! So I have serious concern with an inoculation that will most likely be required, like the masks are, to “stop the spread” (of a disease that is recording low death rates) that will not have long term testing to make sure that we aren’t doing more harm than good. But that’s my two cents.  I will most likely end up moving my derm needs to an office that not only can figure out how to not have hour waits for their patients but is brave enough to look the stats and facts in the face and take a stand against the current overstep we are seeing all over the country.\n\nAll in all, the people here are very kind, and the doctor I’ve been seeing seriously helped with my adult acne. So  I will give them 4 stars. I recongize it’s hard to stand against the grain. But the hour plus waits have been very hard since I bring my infant with me to these appointments.\n\nLastly, they also require hand sanitizer and temp check. These are things that do not bother me personally, and I still complied with all that was asked of me.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "114030567618091215616", "name": "JEffrey Cashmore", "time": 1594234427656, "rating": 5.0, "text": "Absolutely phenomenal I did a 1 hour float and it felt almost like I was in a sensory deprivation tank with the lights turned off and the volume just low enough to where you could barely hear the sound I would definitely recommend this to anyone!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109427081417129031091", "name": "Tina Montgomery", "time": 1557494428620, "rating": 5.0, "text": "I LOVE Dr. Groysman!  She is very attentive and I never feel rushed like you do in some offices.  She has provided me with answers and direction for my medical condition that I have been suffering with for years.  If someone needs a dermatologist, I highly recommend her.  She is the best!", "pics": null, "resp": {"time": 1557938579912, "text": "Best compliment we can EVER get is to hear we helped someone with an issue that has plagued them years. So glad we found each other."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103966833685811543399", "name": "Paul Hughes A Voice for Civil Righteousness", "time": 1576687113355, "rating": 5.0, "text": "The Blu u light treatment for Atinic Keratoses is no a fun experience, but the technicians do a great job of making it as unpleasant as possible.  I am very pleased with the results of the procedure and would not hesitate to return to Cahaba Dermatology in the future if needs be.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110689686489068267021", "name": "Lynneice Allums", "time": 1567937916878, "rating": 5.0, "text": "My son is on a acne regimen that requires a monthly visit and I can truly say that every appointment  is done in a courteous and professional manner.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115967601788435097569", "name": "Anissa Bradley", "time": 1573137660242, "rating": 5.0, "text": "The service was great, I was able to get in and out and also make another appointment within an hour.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112626572209747116411", "name": "Lynn Ervin", "time": 1592860961743, "rating": 5.0, "text": "Everyone nice..polite and so helpful...", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103586655949752247853", "name": "Hannah Green", "time": 1567697058949, "rating": 5.0, "text": "Cahaba Dermatology has truly changed my life! The staff is so nice and helpful and I'm very impressed with how quickly I've seen results.", "pics": null, "resp": {"time": 1567734962397, "text": "Food for our soul Hannah. We shoot to make an impact in every patient. To hear that we've delivered that for you makes us happy. Thanks for sharing."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115370360053968402832", "name": "Hannah Montgomery", "time": 1571321549151, "rating": 5.0, "text": "I love Cahaba! Getting a monthly Hydrafacial is the best thing I’ve ever done for myself!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110246001846112003637", "name": "Craig Owings", "time": 1560783189716, "rating": 4.0, "text": "Very professional and certainly knowledgeable.  Nice office although I did have to wait a bit longer than I anticipated.  Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106319967041811572016", "name": "Ann Marie KROKOS-SWETZ", "time": 1568988231010, "rating": 4.0, "text": "I was happy with the exam and that the issues I asked for treatment Were addressed. The only problem I have is I didn’t receive a copy of the notes with follow up treatment I would do at home which I will call for today .", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112787509359924584931", "name": "Ronald Duncan", "time": 1594068214356, "rating": 4.0, "text": "Very friendly staff and thorough exam.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115184565118349887452", "name": "J Moses", "time": 1580503186961, "rating": 1.0, "text": "Apparently, my time isn't as valuable as the doctor's. I waited a month to get an appointment, only to drive 45 minutes to have them say that Dr. Gunn was running over an hour behind. I got there 20 minutes early, per their request and no one had the decency to call and let me know of the delay so I could reschedule. If I had been the one late or missed an appointment, I would have been charged a fee but it's okay for the doctor. This was my first time coming to this location as sadly, I will not be back.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102027342974629894713", "name": "Chantrice Lyons", "time": 1566219323139, "rating": 3.0, "text": "The environment was not very welcoming for me. Maybe it was just me, but I didn't feel any friendliness.  Just a very awkward visit.  They said they were calling in a prescription for me, but it's now Monday, and my pharmacy doesn't have it.  I called Friday and received the run around.  I'll be calling again today for my prescription.", "pics": null, "resp": {"time": 1566232182850, "text": "Sorry to hear there was an issue with your Rx. I'll send a message to our nursing team and try to get this resolved before you call in today."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "107352566114303520283", "name": "Bill Christenberry", "time": 1565885743976, "rating": 5.0, "text": "Quick and friendly, in and out within 45 minutes including full body check, several cryotherapies and a biopsy. Atypical for most doctor’s offices these days. Keep it up!", "pics": null, "resp": {"time": 1557118456435, "text": "Thank you for your feedback! We are glad you are happy with our care!"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "111907161478083403294", "name": "Nora Gilchrist", "time": 1568468824117, "rating": 5.0, "text": "I am extremely satisfied with the excellent care I get from\nDr. Glick.  She is thorough and listens to the patient's\nconcerns.  Her expertise and deep caring shows through\neach time, and she surrounds herself with efficient help\nto carry out her practice in such a commendable way.\n\nI not only appreciate the care I receive from Dr. Glick, I have\nsent my daughter, both grandsons, and friends to her for\nexcellent care, and they all come back and thank me!\n\nBlessings on your excellent practice!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106880012166298120307", "name": "Shannon Hataway", "time": 1561589693975, "rating": 5.0, "text": "Love Dr Glick! She is always so helpful and caring. Beautiful new facility too!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "101766739623688627220", "name": "Amynralphsmith songs", "time": 1573051309362, "rating": 5.0, "text": "Very friendly staff very welcoming..I could stay all day..", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "105252297031402523194", "name": "Jill Griffin", "time": 1568403659726, "rating": 5.0, "text": "Very friendly staff and Dr. Groysman is very compassionate and knowledgeable doctor who listens to her patients and delivers excellent care.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "105139436964053952336", "name": "David Lamar", "time": 1561635474525, "rating": 5.0, "text": "Got in and out quickly. Welcoming and helpful staff. Knowledgeable Dr. Very smart and friendly.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "114624640096719525985", "name": "Brittany “Britt” Peveler", "time": 1569074108744, "rating": 5.0, "text": "The staff was amazing. Dr. Gunn was awesome and they have great personalities!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "116904996721863168113", "name": "abby libb", "time": 1562771899925, "rating": 5.0, "text": "Love this staff and facility would recommend to anyone and everyone! Highly professional and personal to you.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113418867470204733842", "name": "Devyn Jones", "time": 1576955300619, "rating": 1.0, "text": "I was scheduled for a chemical peel for 12/21/19 at 2:00 pm. I was told to come at 1:00 pm. I did and there was absolutely no one was there. My time has been completely wasted and I find it highly unprofessional.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "117508652178651784275", "name": "Jill Leath", "time": 1556975738125, "rating": 5.0, "text": "Everyone was super nice.  Event was planned perfect with gifts, games, food and beverages.  Received a tour of Spa, and overall enjoyed.", "pics": null, "resp": {"time": 1557118396720, "text": "Thank you so much. We enjoyed having you!"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "117414238293967348024", "name": "tamitam09", "time": 1608325327416, "rating": 5.0, "text": "Everyone is amazingly sweet", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "101457622320865786256", "name": "Rebecca Jones", "time": 1566913059675, "rating": 5.0, "text": "Dr. Groysman really cares about me as a patient & wants to see me succeed in my skin health. She knows Hidradenitis Suppurativa & stays consistent with each visit. Her staff is kind, efficient & professional. I can not recommend her enough.", "pics": null, "resp": {"time": 1567735076852, "text": "Thanks for your feedback."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "107479279691668534138", "name": "Pamela Reed", "time": 1566694880109, "rating": 5.0, "text": "This is actually Donald Reed. This is an amazing practice. From receptionists to physicians, friendly, professional, caring.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "101602673221180754947", "name": "Cgirl Tab", "time": 1563593257976, "rating": 5.0, "text": "Hopeful that the treatment prescribed and diagnosis made by Dr.  Groysman is accurate. After years of suffering with a medical mystery, it is encouraging to hear that she may know what I have.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "114624640096719525985", "name": "Brittany “Britt” Peveler", "time": 1569074108744, "rating": 5.0, "text": "The staff was amazing. Dr. Gunn was awesome and they have great personalities!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110785741462361706994", "name": "Philip Malone", "time": 1577377756552, "rating": 5.0, "text": "Got a quick appointment.\nWait in Office was not long.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "101766739623688627220", "name": "Amynralphsmith songs", "time": 1573051309362, "rating": 5.0, "text": "Very friendly staff very welcoming..I could stay all day..", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112493055548575880149", "name": "Kelly Seaman", "time": 1564060675659, "rating": 5.0, "text": "I was in and out in 30 minutes, even having a spot removed to he biopsied (completely painless, btw☺). I would highly recommend!", "pics": null, "resp": {"time": 1566250570597, "text": "Getting a biopsy can be nerve racking. Glad it went smoothly and without pain. Thanks for your feedback."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "118264744608632180489", "name": "Jane Smith", "time": 1603735476364, "rating": 5.0, "text": "I just love the physicians and entire staff;  the facility is beyond anything I expected in the Birmingham area.  For my aging skin and cosmetic concerns, Dr Groysman is a miracle worker.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "114813068549596601571", "name": "Sandy Watwood", "time": 1569475035291, "rating": 3.0, "text": "Anyone in the Hanceville, Cullman,  Area  in NEED  of A GREAT  Dermatologist  I Can  Definitely Recommend  , the Nicest AND MOST HELPFUL AND FRIENDLY    STAFF,  I've Seen and I visit Doctors on a weekly Basis  Usually !!!!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113418867470204733842", "name": "Devyn Jones", "time": 1576955300619, "rating": 1.0, "text": "I was scheduled for a chemical peel for 12/21/19 at 2:00 pm. I was told to come at 1:00 pm. I did and there was absolutely no one was there. My time has been completely wasted and I find it highly unprofessional.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113544688769509968849", "name": "Susan Foley", "time": 1562676698633, "rating": 5.0, "text": "I was very nervous when I went in as it was my first visit.  The staff made it a great visit! What a huge relief!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "101602673221180754947", "name": "Cgirl Tab", "time": 1563593257976, "rating": 5.0, "text": "Hopeful that the treatment prescribed and diagnosis made by Dr.  Groysman is accurate. After years of suffering with a medical mystery, it is encouraging to hear that she may know what I have.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110785741462361706994", "name": "Philip Malone", "time": 1577377756552, "rating": 5.0, "text": "Got a quick appointment.\nWait in Office was not long.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112218808452484369620", "name": "Anita Nelson", "time": 1557177072469, "rating": 5.0, "text": "Great facilities! Easy to find location! Fantastic doctors! Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112527248324599004011", "name": "Patsy Rogers", "time": 1607978480119, "rating": 5.0, "text": "Prompt, friendly, kind, efficient, facilities are of excellent taste and relaxing. Very accessible, convenient, nearby parking. Love them.", "pics": null, "resp": {"time": 1557938524043, "text": "We really do enjoy our central location in Hoover and Tuscaloosa. Both offices are so close to all parts of the city. No parking garages or long walks to the door is nice too!"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113544688769509968849", "name": "Susan Foley", "time": 1562676698633, "rating": 5.0, "text": "I was very nervous when I went in as it was my first visit.  The staff made it a great visit! What a huge relief!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109284781161460951063", "name": "Judy Romero", "time": 1562964635364, "rating": 5.0, "text": "The staff was super friendly an courteous. I like that the spa is separate from the skin and wellness center. This will be my go to Spa center.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103616213861494677161", "name": "Ted Turner", "time": 1592237711286, "rating": 5.0, "text": "Dr. Glick is a very caring and thorough health care provider.  I would highly recommend this doctor and the entire team to anyone that is searching for great healthcare.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "111535496325520867874", "name": "Tammy Randle", "time": 1576171750336, "rating": 5.0, "text": "Outstanding bedside manner. Very attentive.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102581507358206156713", "name": "Tammy Glover", "time": 1565193581611, "rating": 5.0, "text": "I found this place during a Google Search for rosacea treatments. I emailed for information, then booked an appointment with Dr. Holly Gunn. Staff were very helpful when I arrived. Dr. Gunn was friendly and professional. She answered all my questions and got all the background on previous treatments that I have tried. She scheduled me for 3 IPL treatments. The results were amazing! Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "105215403665117044367", "name": "Terra Smith", "time": 1557926353770, "rating": 5.0, "text": "I absolutely recommend Cahaba Dermatology! They are great, their whole staff is wonderful! Now that they come to Tuscaloosa, it's an added bonus!!!", "pics": null, "resp": {"time": 1557938117562, "text": "Thanks for the nice words. We love our Tuscaloosa patients."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110037418959294087350", "name": "Laura Baker", "time": 1600176139201, "rating": 5.0, "text": "Dr. Groysman and her staff always go above and beyond in my treatment, whether by televisit or in person.", "pics": null, "resp": {"time": 1595608024598, "text": "We always try to make \"above and beyond\" the norm. We are glad you had a good visit and appreciate your feedback."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103300918399651326113", "name": "Gina Hester", "time": 1565900811348, "rating": 5.0, "text": "I personally cant say anough about Valerie she is the best . My face is so much better. Fine lines ,wrinkles dark spots . The Hydrating facials are one of my favorites sence I'm in the sun alot .\nChristy is one of the best for massages. My body akes from cleaning Residential homes all day . Finally I can  move with ease.  If you havent tried it you should . Its top on my list . I've been to many different Spa 's around Birmingham  the customer service at Spa Cahaba is the best so welcoming to your every need !!  Cant recommend it anough  go you wont be dissatisfied . Gina Hester\nTurn Key Cleaning Service  llc", "pics": null, "resp": {"time": 1566250421392, "text": "Ms. Hester, Thanks for kind words. Best case scenario for us is to hear that clients enjoyed their service, received valued benefit and felt taken care of. Thanks"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "117782187848165237766", "name": "Grace Bearden", "time": 1561047014071, "rating": 5.0, "text": "Beautiful facilities, wonderful staff and extraordinary doctor.  Dr. Groysman is the most thorough and caring doctor,  so much respect for her.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "100551792480750308490", "name": "Miranda Stephens", "time": 1572178628411, "rating": 5.0, "text": "It was absolutely amazing from the price, state of the art facility, care, and of course the massage! I cannot wait to go again!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113073807104413337723", "name": "lynn Barnett", "time": 1560432323022, "rating": 5.0, "text": "I have searched for over 20 years for a Dr that could help me with my mouth pain due to Lichen Planus but no one knows much about it. Finally I found Dr Zoey Glick and she changed my life. She is so smart and serving her profession extremely well.  I am so blessed that God sent me to Cahaba Dermatology. They are all wonderful. I thank them all from the bottom of my heart for changing my life. If you are suffering from something you could not be in better hands than Cahaba Dermatology.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "105674095235597084830", "name": "Shawnderrick Brown", "time": 1558530924805, "rating": 5.0, "text": "Everyone is  nice and they know their jobs well  I'm in love with my results of being treated !", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115685692918544076550", "name": "Noelle Fant", "time": 1572356528156, "rating": 5.0, "text": "The staff is very professional, friendly, and prompt. It is always a great experience when I visit Cahaba Dermatology!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103589009484674885679", "name": "Keona Bonds", "time": 1556901021494, "rating": 5.0, "text": "Always pleasant and extremely welcoming. The professionalism of the staff and Dr’s is beyond exceptional.", "pics": null, "resp": {"time": 1557118422050, "text": "Thank you for the feedback! We love our patients!"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102872055241432248357", "name": "Luke Netjes", "time": 1571754838550, "rating": 5.0, "text": "Dr. Groysman is great. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106059264196871430600", "name": "Jonathan Weinberg", "time": 1563385287196, "rating": 5.0, "text": "Wait was a little long in the waiting room, but once I was in, they were quick, friendly, and professional.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102254502854080045029", "name": "Patricia Havard Havard", "time": 1555504031880, "rating": 5.0, "text": "Friendly, professional staff. Love the results of all the procedures. A clean, relaxing, and stress free environment.", "pics": null, "resp": {"time": 1557118528709, "text": "Thank you for your feedback! We look forward to seeing you again soon!"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106302658008553296903", "name": "Paul Hamner", "time": 1572496090184, "rating": 5.0, "text": "All people were very nice to me and were professional.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106059264196871430600", "name": "Jonathan Weinberg", "time": 1563385287196, "rating": 5.0, "text": "Wait was a little long in the waiting room, but once I was in, they were quick, friendly, and professional.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110814380469144735510", "name": "Kenneth Fagan", "time": 1557104998216, "rating": 1.0, "text": "Dr. Gorysman is the WORST dermatologist I have ever met in my life. My wife has seen her off and on for 3-4 years and her skin condition is the same possibly even worse than before going to her practice. When we tried to discuss it with Dr. Gorysman she gave us an attitude and blamed my wife for her skin condition. Really Doctor? Blame the patient. Finally, when my wife's condition started getting better they run out of the medication that was making it better. Then, they don't get any of the medication for her to use again. So, 3-4 years later her skin condition is the same or worse. Do yourself a favor, DO NOT go to see Dr. Gorysman for any dermatology treatment.", "pics": null, "resp": {"time": 1557115639924, "text": "It pains us to discover that a patient is struggling with a persistent medical condition. Many medical conditions require routine management. Due to HIPAA and privacy regulations we cannot provide more than this limited response. We request you encourage your wife to contact us if we can be of any further assistance."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103871690960148927629", "name": "Sheila Murphy", "time": 1576083832417, "rating": 5.0, "text": "Overall good experience. Wait time was a bit lengthy.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106670616160396470021", "name": "Lucretia Sumerel", "time": 1555518169268, "rating": 5.0, "text": "Dr. Vlada Groysman is the best dermatologist in the area. She is very knowledgeable and her  techniques are outstanding.", "pics": null, "resp": {"time": 1557118498230, "text": "Thank you so much! We truly enjoy taking care of our patients and their families!"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102644131362636387022", "name": "Silke Steg", "time": 1497900187819, "rating": 5.0, "text": "After we moved to Tuscaloosa I searched long for a good skin doctor. I love to have such a great clinic also in Tuscaloosa. Friendly staff, and most important the doctors I met were friendly, patient and never in a hurry.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106353811470004991077", "name": "Robin Hill", "time": 1557240199691, "rating": 5.0, "text": "Really like cahaba derm. Staff nice and Dr. Vicars and Dr.Glick very nice and knowledgeable. I have made this the only place for skin issues.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113913147080765029120", "name": "Heath Haley", "time": 1603134651851, "rating": 5.0, "text": "Dr. G is outstanding. She is one of the most knowledgeable, thorough and hardworking physicians I have ever been around.  A consummate professional with a  bedside manner second to none. I highly recommend her. I drive down from Nashville once per year.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113947840662373566396", "name": "Angela Crenshaw", "time": 1602696059350, "rating": 5.0, "text": "Everyone was friendly, professional, and efficient", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102782406979491302992", "name": "Tiffany Chapman", "time": 1573397383209, "rating": 5.0, "text": "Nice facility. Nice staff.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "101160711838680173891", "name": "PJ Vining", "time": 1569594942605, "rating": 5.0, "text": "Dr. Groysman, Rita her nurse and the rest of her team are great!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103865165749811816484", "name": "denise jeffries", "time": 1569418639834, "rating": 5.0, "text": "Love Dr Groysman and her staff. Really helped me!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106353811470004991077", "name": "Robin Hill", "time": 1557240199691, "rating": 5.0, "text": "Really like cahaba derm. Staff nice and Dr. Vicars and Dr.Glick very nice and knowledgeable. I have made this the only place for skin issues.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113044564705916916333", "name": "Borden Burns", "time": 1437586670277, "rating": 4.0, "text": "Although I was very impressed with the cleanliness of the facility, the positive dispositions of the staff, and speed with which I was taken back to my appointment, I was shocked to be presented with an $85 charge for a consultation that lasted a total of four minutes with a clinical technician (not an MD). Feeling taken advantage of, I will not be using this practice for any actual procedures.\nUpdate: Joel called from the business office later in the week and informed me that there was a mistake during my check-out process. I was incorrectly charged. He refunded my balance. He did this very kindly and expeditiously, and I am likely to use this practice in the future.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102334063637032467732", "name": "Faith Rakestraw Grill", "time": 1571583544422, "rating": 5.0, "text": "The BEST! I can’t wait to come back.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "107215079447511190979", "name": "Christy Eggleston", "time": 1557842072039, "rating": 5.0, "text": "Dr. Vickers is great. Have seen her and Dr. Groysman and they both have been great. Was referred to Dr. Groysman originally to remove a cyst. I then moved to Huntsville and saw my local doctor to freeze a wart. When that didn't work they wanted to cut it out. I went back to cahaba derm for a second opinion. Dr. Vickers said not to cut it and debilitated me. She was finally able to get rid of it.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102075620178632878805", "name": "Deanna Leader", "time": 1594330903628, "rating": 5.0, "text": "They excell at blending warmth with professional care at the Spa. Jane and Joy are outstanding.", "pics": null, "resp": {"time": 1560178876910, "text": "What a great way to feel. We look forward to a long friendship."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "101720621191521659969", "name": "Michele Crawford", "time": 1561981831011, "rating": 5.0, "text": "Dr. Groysman and her staff are fantastic! Dr. Groysman is the best dermatologist that I have ever seen!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "118099327618347062212", "name": "Tomekia Lawhorn", "time": 1596760290424, "rating": 5.0, "text": "My experience was Awesome!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102644131362636387022", "name": "Silke Steg", "time": 1497900187819, "rating": 5.0, "text": "After we moved to Tuscaloosa I searched long for a good skin doctor. I love to have such a great clinic also in Tuscaloosa. Friendly staff, and most important the doctors I met were friendly, patient and never in a hurry.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "105354961810640221286", "name": "Keith Carlin", "time": 1568989439411, "rating": 5.0, "text": "Great experience. Very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "116139726452800708547", "name": "Fran Prunty", "time": 1570164966596, "rating": 5.0, "text": "Friendly, on time, comfortable professional setting, overall very good experience.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106018271105244060699", "name": "Kayla Moore", "time": 1561525115323, "rating": 5.0, "text": "Very clean office. They listen to your concerns but get you in and out in an efficient manner.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113538805431982707973", "name": "robert abston", "time": 1560613609230, "rating": 5.0, "text": "Very nice staff that are very professional. The doctor really impressed me.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "101026058747973108884", "name": "Darthy Moore", "time": 1569935830982, "rating": 5.0, "text": "Great service  pleasant time thank you all", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "111752569941784450920", "name": "Rob Wynne", "time": 1569590345596, "rating": 5.0, "text": "I really like the thorough care that I receive from Cahaba Dermatology.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113916862381216233737", "name": "Tom Edmonds", "time": 1560518683131, "rating": 5.0, "text": "Friendly service, competent care, professional treatment, what more can I say?", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110443421994233999436", "name": "Louise Bailey", "time": 1570236086320, "rating": 5.0, "text": "Outstanding care and great patient services.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "104799947506934555789", "name": "lelah body", "time": 1558377538175, "rating": 5.0, "text": "Great place to go very nice and you get results!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "108678399903001383715", "name": "Lua Kennedy", "time": 1557753313726, "rating": 1.0, "text": "The nurse was rude. The doctor did not look my skin. They are good selling you many expensive products, seems like this is their goal. I literally wasted my time.", "pics": null, "resp": {"time": 1557938409741, "text": "Sorry we got off on the wrong foot. Our skin care products should only accompany the skin advise we offer. Please contact our office if you would like to speak with our office manager about your concerns."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112295311126461220789", "name": "Steve Korson", "time": 1417813874447, "rating": 5.0, "text": "I have been going to Cahaba Dermatology for 18 months now.  I have vitiligo which is very tough to reverse but we have made great strides.  They have been professional and a pleasure to see every week.  I highly recommend them as a dermatologist.  Tasha is the best!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "108637328542434933467", "name": "Kim Vance", "time": 1516240390755, "rating": 5.0, "text": "Dr. Glick has such an awesome bedside manner! I drive 50 minutes one-way for her meticulous care. My experience leads me to believe that she has a genuine and caring soul, a rare find these days in this fast paced medical appointment world. 2 thumbs up for Dr. Glick!", "pics": null, "resp": {"time": 1557118862112, "text": "Thank you for your kind words! We strive to provide meticulous care for all of our patients!"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109413819416697374874", "name": "Jack Gaido", "time": 1567603076979, "rating": 5.0, "text": "Dr Glick is incredible, outstanding experience every time", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "114264279162917671361", "name": "Angela Johnson", "time": 1520016509112, "rating": 1.0, "text": "I have called several times for a prescription refill, left numerous messages( because no one will answer the phone), and CVS has faxed a request 3 times.  No one will contact us.  The prescription has been empty for 2 weeks now.  No one will even call us back for an appointment.  We are done.", "pics": null, "resp": {"time": 1520028822721, "text": "Ms. Johnson, sorry to hear of your issue. We have been open all day and having no issues with phone calls. I don't have enough information to contact you directly from your post. Please make sure you are calling our office number at 205-214-7546. If you call back after hours, please leave a message our nurses to return call Monday morning. Thanks,"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "114459926578759570477", "name": "Beth Dykes", "time": 1592495865542, "rating": 5.0, "text": "Professional, friendly, informative.   I’m going back!", "pics": null, "resp": {"time": 1567734981007, "text": "We look forward to seeing you again soon."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113737823305345119819", "name": "Richard Harley", "time": 1596463075552, "rating": 5.0, "text": "Excellent staff and facilities", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110212585166460161515", "name": "Rose Potts", "time": 1487624329907, "rating": 5.0, "text": "In and out within one hour, which is great, considering most dermatologist I've sat there two hours before seeing a doctor. I had a skin cancer screening today, probably the most thorough I have ever had. She checked every inch of my body. Had one questionable spot which was biopsied; totally painless. I was told I would hear back from the biopsy (either negative or positive) by the end of the week. Dr. Groysman answered all of my questions. Her nurse explained the wound care and gave me written information on another spot I had questions about. Everyone had a sense of humor, which always makes you feel more comfortable. I inquired about a cosmetic consultation, Dr. Groysman said she does cosmetic consultations herself. She didn't \"encourage\" any cosmetic procedures, she simply answered my questions regarding the consultation. Although these services available, it was a good feeling to have a dermatologist seem concerned about the \"health\" of my skin not just cosmetically how it appeared.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "108870903556923576588", "name": "Kathleen Spencer", "time": 1445973412331, "rating": 5.0, "text": "Going to a dermatologist can be somewhat daunting, especially if you have never been to one before.  If you are looking to be treated with respect and understanding, this is the skin health center to go to.  Dr. Groysman is wonderful, and will put you at ease immediately.  Her staff is delightful and the care you receive is beyond reproach.  The clinic treats everything from acne to skin cancer screening to spider veins to botox, and even has spa services, along with a great line of cosmetic products.\n\nI rarely take the time to write a review, but this place certainly deserves raves.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106718344653270528415", "name": "Randal Ford", "time": 1502981996330, "rating": 5.0, "text": "Fast, efficient and knowledgeable. Welcoming staff and great physicians.  Would recommend to everyone.  A+", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "100072016104282439624", "name": "Kristie P. LaRochelle", "time": 1393258426950, "rating": 5.0, "text": "Love, Love, Love Vlada. She is great dermatologist and knows her stuff. She takes the time to understand your conditions and get you the proper treatment needed. I would recommend her to all of my friends and family.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106088589395259647738", "name": "Denise O'Rourke", "time": 1567694441450, "rating": 5.0, "text": "Dr. Groysman is very gentle, patient, and thorough.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "100292683276011792641", "name": "S A", "time": 1534872399688, "rating": 1.0, "text": "Dr Groysman performed IPL and Pico Genesis on my face for dark spots.  She has left permanent damage on my face.  The texture of my face now is like an alligator with no other way to describe and other problems. It has been over a year since my last procedure.  Had terrible flair up at the time. She referred me in the end to a dermatologist at UAB which was unable to reverse the permanent damage she caused.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "117059433989524352504", "name": "Tomiko Porter", "time": 1507934039265, "rating": 5.0, "text": "3rd Visit, 4th month for following treatment plan. Excellent results. Dr. Glick has a shining personality, is friendly and personable. She suggested a couples visit and I brought my husband this time for his first visit.", "pics": null, "resp": {"time": 1557157932675, "text": "We always can count on Dr. Glick to provide excellent care with a healthy dose of friendly personality. So glad you enjoyed the visit. Good to hear you are spreading the healthy skin bug."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112114046073764592588", "name": "Caroline Crisp", "time": 1434757204236, "rating": 5.0, "text": "Great experience at Cahaba Dermatology! Dr. Groysman showed great skill, professionalism, and compassion. Also, the staff members were super friendly and helpful. I am looking forward to my next visit!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "107387869312353135992", "name": "Mike Christopher (1-WHO-1)", "time": 1473791579181, "rating": 2.0, "text": "Very poor billing practices. Had 1 brief visit, and was charged two separate consultation fees of $85 at time of service an another $140 billed by mail. Asked after the leaving the office \"do I owe anything else\" and the answer was \"no\". They were able to refund the $85 after initially declining the refund.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110261691090320813535", "name": "Jacob Story", "time": 1498848117204, "rating": 5.0, "text": "Just moved to the Bham area and glad I did not waste much time finding a dependable dermatologist. From the friendly administrative assistant to the dermatologist, the entire staff genuinely cares about your experience from booking the appointment to billing.", "pics": null, "resp": {"time": 1557157776088, "text": "We are proud to have made a good impression and glad you found a great place for Dermatology in Alabama."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "107291027088859748319", "name": "Marie Sharpe", "time": 1476132632259, "rating": 5.0, "text": "I highly recommend Cahaba Dermatology.  The office is nice and the staff are very friendly.  I cannot say enough good things about Aesthetician Valerie Esposito.  I have had several sessions with her and she is as professional as they come.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "116519072563497631083", "name": "Brandi Dover", "time": 1487721946553, "rating": 5.0, "text": "I've been seeing Dr. Groysman about an issue that I've had for over 10 years and no one has been able to help me until now. I've had lab work done before by other doctors, but none as thorough as Dr. Groysman. She is very kind and really cares about her patients. My issue has been very difficult to deal with all of these years and this is the first time a doctor has given me hope for a treatment. I highly  recommend everyone go to her if you need a GOOD dermatologist - one that will actually get to the bottom of your problems and cares to see you get better. I am so very thankful I have found her.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115180060927204507554", "name": "Hannah Oden", "time": 1518442444936, "rating": 5.0, "text": "I love this facility! Very sweet staff, made me feel very comfortable. I will defiantly be back soon!!!!", "pics": null, "resp": {"time": 1557118804795, "text": "Thank you for kind words! We look forward to seeing you soon!"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "106078783485652326259", "name": "Debra Gilbreath", "time": 1528402705947, "rating": 2.0, "text": "I had an appointment  with  Dr Groysman in 2016. It was my first appointment with Cahaba Dermatology the day I went it must have been a busy day for them, I waited that day about 45 min and people\nwere getting called into see her while I was still sitting out in the waiting room it ended up being me & one other lady that day which she was there before I was , I finally got called in and left her sitting there.\nI met Dr. Groysman and we proceeded with my appointment she biopsied a place on my ear I was having problems with.  My results came back and everything was okay. I still have problems\nwith my ear from time to time was the reason I made the 2nd appointment – fast forward to May 2018 and I called and made an appointment with her Nurse Practitioner& was told when I called in that I had a balance from 2016 that would have to be paid – Im not sure about their billing department but I didn’t know about the balance & I told her that I would pay it. If I had known about a past due  and call to make an appointment is that someone that is trying not to pay? So we made the appointment went in today 6/7 my appointment was at 11:00 I get to my appointment she collects my co-pay I go sit down and she calls me back to the front desk and proceeds to tell me that she collected the co-pay not realizing there was the balance due and I would need to pay or I\ncouldnt go thru with my  appointment. I told her I couldn’t pay it all today – that I could pay it tomorrow and she said she would have to speak with someone in billing – so this other young lady  comes out and says basically the same thing the other one  did with the exception -she said that someone had called me and left a voice mail for me & did I not get the voice mail? & on that VW stated I had to pay this. Which I said no  & I told her the same thing  - I get paid tomorrow and I would pay it then -  she says I couldn’t keep the appointment if I didn’t pay today. So I had to leave.   This review is not about whether I got to keep my appointment or not, its not about the balance I owe, its about how people are treated, all this was handled out at the front desk instead of asking me to step to the side, step into the 2nd  young ladies office , or go stand out front and wait for the police to arrive to hand cuff me is the way I felt  Just as the 1st appointment  was not good , my 2nd time there was even worse. I was so humiliated that other people could hear what was going on. I owe the money - but I would rather other people not know that I owe that money. I wish I would have paid more attention to the girls names, but I do remember faces. I had not intentions of not paying the balance due.\n\nMy cousin goes to Dr. Groysman - he has all great things to say about her as a Doctor & as a person. He thinks very highly of her & her practice. He is the reason I made the 2nd appointment -he said I should try again.\nMy cousin's name is Don Amick. He was also surprised that I couldn't keep my appointment today. BTW they took my co-pay and took it off my past due amount. My balance was 125.00 and not I only owe 95.00. That's right 95.00 not 200.00, not 300.00, not 500.00. It was 125.00. I've never written a review, while I know this is a long review - I just couldn't let this go. I felt this was just wrong the way I was humiliated in front of everyone Oh and I had to walk all the way back to my seat get my purse and then back in front of them again as they were watching me leave.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102794144317239398978", "name": "Jay Cox", "time": 1559678021788, "rating": 5.0, "text": "Nice friendly staff, quick and easy visit.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "102836565423646889030", "name": "Joel", "time": 1572716081632, "rating": 1.0, "text": "I would not advise anyone to be a client with this establishment.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "114502492429720989717", "name": "Michael Johnson", "time": 1417472450985, "rating": 5.0, "text": "An organized and friendly practice with top level staff and expertise. You will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "105043300585110038021", "name": "Tripp Rogers (TR)", "time": 1415241850795, "rating": 1.0, "text": "Do not go to this office. Dr. is a quack.  Misdiagnosed my daughter.  I spent 200 on cream that she didn't even need.  Got a 2nd opinion and this Dr. stated she must be crazy to have given us that diagnosis.  Stay away!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "111117227936914415723", "name": "JERROD BALLARD", "time": 1557231801939, "rating": 5.0, "text": "Clean office, very nice staff, great place to go", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113965823263956662771", "name": "Civille Brown", "time": 1558796938740, "rating": 5.0, "text": "Excellent dermatologist who knows her stuff.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103314168041745934589", "name": "David Farr", "time": 1567755322377, "rating": 5.0, "text": "Very good cancer screening.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115020905612683366326", "name": "Lara B", "time": 1502933287672, "rating": 1.0, "text": "I took my teenage daughter to that place for bad acne. We didn't actually see Dr Vlada, her NP was prescribing all the medications she knew I guess. After about a year Dr finally came to the room to examine her because after months of antibiotics, creams and numerous other meds her face stayed the same. She personally promised my daughter it would get better with another prescriptions.... you can imagine what it means for a teenager! Several months later still no change. I felt like my daughter was a Guinie pig! So the last resort was Accutane and after a week my daughter could not move or get out of bed that's how poisonous it was. We stopped it immediately and I took her to another Dr who diagnosed her w policystic ovaries... all she needed was a simple blood test. her face is a lot better now. I don't know how much harm all the meds she took for months did to her body. I'm just furious that nobody even suggested a blood test, they just treated the face, not the whole body. Hope our bad experience will help someone.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113534799137330972381", "name": "Lena Dillon", "time": 1526614490027, "rating": 5.0, "text": "My checkup and the service  I received was more                                         than satisfactory!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "116190674046048908418", "name": "Leah Eagle", "time": 1435001227362, "rating": 5.0, "text": "I, along with my parents, have been patients of Dr. Groysman for several years.\nShe is so knowledgable and answered all my questions. She took her time during my visits and didn't make me feel rushed.\nHer office on Valleydale Road is beautiful and the staff is very friendly.\nI have recommended Dr. Groysman to many friends, and they have all reports back their experience was wonderful.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109421527859863555713", "name": "Missy Wright", "time": 1480537649473, "rating": 5.0, "text": "Dr. Groysman is a wonderful doctor. I highly recommend her :)", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "117945261321829630387", "name": "Adam Summerford", "time": 1568409671429, "rating": 5.0, "text": "2 hours was life changing!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103990921401842050874", "name": "Jamie Broday", "time": 1418061836093, "rating": 5.0, "text": "Dr. Groysman and her staff are over and above. You can tell Dr. Groysman really cares about her patients and her office is very clean and welcoming. The wait time is minimal, the staff is friendly, and Dr. Groysman truly is a good and caring doctor.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103293512470006379707", "name": "Tim Giddens", "time": 1519702943186, "rating": 5.0, "text": "Awesome staff!!!! Dr. Glick is the bomb. Very knowledgeable.", "pics": null, "resp": {"time": 1557118781270, "text": "Thank you for your feedback!"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110733720420580849358", "name": "Shanevia Smith", "time": 1572614426549, "rating": 5.0, "text": "This is an awesome place to visit", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "113188005921115884803", "name": "K M", "time": 1592839058596, "rating": 4.0, "text": "Wait time was longer than usual", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "108347845047115266916", "name": "Marie Sharpe", "time": 1567517021597, "rating": 5.0, "text": "Dr. Glick is wonderful!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "112564343229137927809", "name": "Janice Newlin", "time": 1435770632048, "rating": 5.0, "text": "I was recommended to see Dr. Groysman for my palmoplantar psoriasis. Two other dermatologists attempted to help me treat this with systemic medications. Although the medications cleared the palmoplantar psoriasis, the side effects from them were horrible. Dr. Groysman offered two topical compound treatments that began working immediately! My palmoplantar psoriasis is under control and I couldn't be more thrilled! Dr. Groysman spends a lot of time with her patients answering all their questions and concerns. She is very kind and caring. I highly recommend her practice to anyone!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103672991284595623860", "name": "John Evans", "time": 1560605377039, "rating": 5.0, "text": "Excellent surgery and friendly staff!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "105881614613976428334", "name": "katina carter", "time": 1500481926370, "rating": 1.0, "text": "The staff is friendly for the most part but I went in for tattoo laser removal and it did not turn out like I was told it would or the before and after pictures shown. They did try one more treatment but told me the second would cost $200 after I had already paid $2,000 for the actual treatment. Then had me come back for a \"follow up\" just to charge my insurance and push me out the door (2 visits within 2 weeks of each other) just to be told I would have to pay for any extra treatments.  Something they could have told me over the phone and keep me from driving a 2 hour round trip each time. I have two children and a job.  Very inconsiderate!!!\nI will never be back for any future dermatology needs.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "115905872563954981380", "name": "Larry Wojciechowski", "time": 1576157127752, "rating": 5.0, "text": "Great experience and terrific facility", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "104905059354543480177", "name": "Wayne Pullen", "time": 1417806200027, "rating": 5.0, "text": "Great Doctor & great staff. Truly caring.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "110161234709836025102", "name": "Rusty Miller", "time": 1576765486425, "rating": 5.0, "text": "Very helpful and professional.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "117765102111659642261", "name": "Annette Evesque Heerten", "time": 1594394190950, "rating": 5.0, "text": "Always friendly and supportive.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "104950854546884679631", "name": "Trish Haywood", "time": 1596478358807, "rating": 5.0, "text": "In and out within an hour.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109091915146749154682", "name": "Rita Reynolds", "time": 1592947350246, "rating": 5.0, "text": "Love the doctors and staff here!!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109651188078297894284", "name": "Alan", "time": 1511215262585, "rating": 1.0, "text": "The staff are kind, but the wait times are absurd. I’ve had to wait in the waiting room for over an hour past my scheduled appointment time at every appointment I’ve had here.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109480531060049722987", "name": "Aser Khan", "time": 1560435209979, "rating": 4.0, "text": "Very professional and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "109230989940964035342", "name": "Kendall Thompson", "time": 1559741533599, "rating": 5.0, "text": "Joy, the aesthetician is amazing!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "116208172592607204091", "name": "Sonia Bernard", "time": 1559920181735, "rating": 1.0, "text": "Not happy with how we were treated.", "pics": null, "resp": {"time": 1560178822246, "text": "Ms. Bernard, Sorry that you were made to feel this way. Please contact us and ask for Lynne Marston or Joel Druxman. We'll do what we can to address your concern."}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "117535813492863304688", "name": "Robin H (Robin)", "time": 1527227663262, "rating": 5.0, "text": "Excellent service and staff.", "pics": null, "resp": {"time": 1557158009804, "text": "Every step of the process must be great. Glad you enjoyed!"}, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "101606402822091205853", "name": "Thomas Weltzin", "time": 1571825082828, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "108200780787462821583", "name": "Bill Taylor", "time": 1593211090690, "rating": 5.0, "text": "Outstanding", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "108019484325033320933", "name": "Gina Chancellor", "time": 1594153275934, "rating": 5.0, "text": "Great service !!", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "104916512994048730049", "name": "Zach Smyly", "time": 1563975306873, "rating": 5.0, "text": "Friendly", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
{"user_id": "103415176883193701673", "name": "Dhanalakshmi H", "time": 1475291838975, "rating": 4.0, "text": "Dr. Groysman is good and caring", "pics": null, "resp": null, "gmap_id": "0x888602aacce729c9:0x135bb203d88babc6"}
