{"user_id": "114037759036480937125", "name": "Wayne Beasley", "time": 1629489508975, "rating": 5.0, "text": "Great service and very friendly! Highly recommend!! Made the process very easy and simple.", "pics": null, "resp": {"time": 1629490521958, "text": "Thank you!!!"}, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "102486773922186781802", "name": "Joe H", "time": 1621278566396, "rating": 5.0, "text": "Mr. Ryan is not only an excellent bankruptcy attorney, but, unlike many, he is prompt and available to respond to you directly. Whether through text, email, messaging through his sites portal, or even through calls, he's always available for correspondence.\n\nWhen we filed for joint bankruptcy, he made it easy to do so, and it was all done rather quickly. Very simple process with him. 10/10 will recommend him every time!", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "101259691554028512810", "name": "Mormon Redd", "time": 1628185315568, "rating": 5.0, "text": "Mr. Ryan was very professional and provided some great legal advice for a unique situation that definitely required in depth knowledge and expertise about real estate and foreclosure law.", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "104291926320340842651", "name": "Roy Browning", "time": 1627841703412, "rating": 5.0, "text": "Upon contact with Ryan Legal Services I was tended to promptly. I had questions about Real Estate in Alabama and was given resources and answers. Thanks for the help Mr. Ryan.", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "110968897662796695866", "name": "Labrisha flott", "time": 1613076450044, "rating": 5.0, "text": "RLS has been a great team to work with during the most challenging time of my life. Professional, honest, and always responsive.", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "114435765355372763852", "name": "Luana Madden", "time": 1579831880950, "rating": 5.0, "text": "Mr. Ryan is extremely quick about responding to emails and phone calls. I have not once had an issue. He’s so helpful and educates me about everything that I question. He got my monthly payments to the lowest possible. Even after 2 years into my bankruptcy, he ALWAYS responds promptly and thoroughly. I would recommend him to anyone.", "pics": null, "resp": {"time": 1581485648177, "text": "Thanks L.M. !"}, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "118065138894007977284", "name": "Xiomara Lemans", "time": 1581009889093, "rating": 5.0, "text": "Mr. Ryan is A ok. He returns calls and emails in a timely manner. With all your credentials and documents in place, the process is, from my experience, smooth. Plus he is affordable. May I add, he is quite patient and this helped me because of the stresses I was under.", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "100659679774234839275", "name": "Tammie Lawrence", "time": 1542793864157, "rating": 5.0, "text": "Mr. Ryan is wonderful to work with.  He stays in contact and has worked late nights and weekends with us. We are still using him and no complaints.  Thanks for helping us through a rough time.", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "105018095097897626514", "name": "Wendy Paulsen", "time": 1490748070268, "rating": 5.0, "text": "Wonderful experience with Mr. Ryan. He was very helpful, thorough, kept constant communication. Only regret was not going to Ryan Legal Services almost 2 months ago when we made the decision to go this route. Best bankruptcy law firm in Mobile, hands down. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "103903963387048588794", "name": "David Engen", "time": 1575907276597, "rating": 1.0, "text": "Not responsive on Chapter 7 questions about IRS issues. Was also billed $310 in addition to $1,000 fee for filing. Still no resolution!", "pics": null, "resp": {"time": 1629326827862, "text": "To prospective clients:  negative comments are always a chance to improve services.\n\nA flat legal fee is most common for a ch 7 bankruptcy case and has a limited set of itemized services.  There is in every case a written Attorney Services Fee Agreement.  Our Attorney Fee Agreement does  not cover legal questions months, or as in the above comment, years, after the case is concluded.   Secondly,  most federal and state taxes cannot be discharged.\n\nWe maintain a high level of 5 star reviews because we do not take every case, and because we strictly follow our employment agreements.  Time is a finite resource, and is a lawyer’s only tradeable  asset.\n\nFormer clients cannot take precedent over existing clients who have paid, and contracted for representation in a pending, filed case.  We will endeavor to answer questions from former clients,  but we cannot provide free legal services if a new legal issue arises, or if further consultation is desired. This again is spelled out in the Attorney Services Fee Agreement in every case we take on.\n\nWe sometimes cannot respond to people we no longer represent because of time obligations to existing clients, and we cannot solve all legal issues."}, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "116998678761722078753", "name": "Michael Doyle", "time": 1589913527481, "rating": 5.0, "text": "Great lawyer. Trustworthy and dependable.", "pics": null, "resp": {"time": 1628186131104, "text": "Michael Doyle is one of my favorite human beings and lawyers.  If you are in Cleveland, call him first!!"}, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "106976154448675379066", "name": "Joshua Forbes", "time": 1443408018616, "rating": 5.0, "text": "I recently called Mr Ryan because I was being sued and wasn't sure how to handle it. He came to my house and sat down with me and explained everything in detail of how we could get this resolved. I was extremely pleased with how smooth the process went and how he keep me informed on what was going on. I would highly recommend him for any legal matter you may have.", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "115139568357553685613", "name": "Lori Jones", "time": 1468429986945, "rating": 5.0, "text": "Mr Ryan was very helpful, resourceful and accommodating. I have just begun this process but I am very happy with his performance.\nI work in Robertsdale and he made arrangements to be in his incomplete (still being renovated)  office for my convenience. Thus far he has gone above and beyond my expectations, especially how he made me feel comfortable in a situation I certainly felt ashamed to be in. I never once felt judged by him, only supported and assisted by him.", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "116132386186366349599", "name": "Tammie Spencer", "time": 1520858656750, "rating": 5.0, "text": "Mr Ryan was very helpful, resourceful and accommodating.  I have just begun this process but I am very happy with his performance.", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "110309101523471312276", "name": "chris bradley", "time": 1580937204880, "rating": 5.0, "text": "Went out the way to get everything I asked for done. Thanks again for your help!", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "106734887637764611979", "name": "John Williams", "time": 1498838816299, "rating": 1.0, "text": "Mr. Ryan was our attorney in Ohio but unbeknownst to us he had plans to move to Alabama. Our case was not argued as we had discussed and are now in limbo in our case and are paying additional funds as overpayment and may never see that money again. We didn't know that he had moved to Alabama until 2-3 years into the case. We only found out when we called the trustees office. The judge then made him turn his cases over to another lawyer that has no invested interest in our case. We are over $1,000 over paid and very frustrated.\n\nWe know that he left just weeks after our filing so it was a planned move and we should have been told as we would have found another attorney that was going to fight for us.\n\nThanks for nothing!", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "110771931565532388039", "name": "Tabatha Willis", "time": 1602860665195, "rating": 5.0, "text": "Wonderful", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "113553960004043215192", "name": "George Sides", "time": 1615221621288, "rating": 5.0, "text": "I had an excellent experience with C Taylor Crockett PC.  Due to some poor choices on my part a few years ago, I had to file for bankruptcy and enlisted the services of C Taylor Crockett PC to assist me in this.\n\nTaylor, Kim and the whole staff were very professional and handled my case better than I’d ever imagined.  In fact, they went the extra mile and researched a lien that had erroneously been placed against me by the State of Alabama and had that removed.\n\nMy bankruptcy has been discharged a few years now and I’ve turned my life around.  I’m retired and enjoying a relatively stress free life thanks in large part to my experience with C Taylor Crockett PC.  I highly recommend them.\n\nSincerely,\n\nGeorge Sides", "pics": null, "resp": {"time": 1615232376975, "text": "Hi George, Thank you so much for taking the time to share your experience at C. Taylor Crockett. P.C.  We take pride in knowing our customers are happy with their experience."}, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "107148160305697812971", "name": "Jonathan Whitworth", "time": 1615247760256, "rating": 5.0, "text": "I dont know what I would have done without Taylor and his staff,they were so calming to me through such a trying time in my life.\nThey made the process so easy to understand and answered any questions I had.\nKim was so nice and was easy to talk to, and  she never made me feel like I was getting on her nerves even though I called her so often.\nIn short I would say they genuinely care for you and what your going through.", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "103977140842091863058", "name": "Harley Martin", "time": 1615245446764, "rating": 5.0, "text": "Taylor Crockett and his staff are super polite , they follow up and follow through , they are very professional and are worthy of your business.\nKim is very helpful and quick to answer calls, emails etc.  I don’t often leave reviews for services unless my socks are blown off.   Since I am now bare foot consider them for your legal matters.", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "114814341701955262461", "name": "Mark McConnell", "time": 1615226932750, "rating": 5.0, "text": "The office of C. Taylor Crockett P.C. and staff were very diligent in the handling of my case and courteous in their interactions with me. I recommend the legal services of C. Taylor Crockett P.C. completely.", "pics": null, "resp": {"time": 1615232234696, "text": "Hi Mark, thank you so much for taking the time to provide feedback. We are so delighted that you rate our service as 5 star as we strive to provide just that for all our customers."}, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "109048871792660755841", "name": "Jerrica Thomas", "time": 1614871809769, "rating": 1.0, "text": "VERY UNPROFESSIONAL, paid him for a service and two months later i was still being garnished. When i called him he spoke to me with no respect! I highly DO NOT RECOMMEND TAYLOR CROCKETT.", "pics": null, "resp": {"time": 1615231990168, "text": "We appreciate your feedback. I have been practicing for 27 years and this is the first time a client has stated they were treated with disrespect from anyone at my office. I can assure you we took immediate steps to resolve your issue upon the filing of your case and continue to monitor your file.  Please do not hesitate to call me personally at any time to address this or any other issues."}, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "107930000183574321741", "name": "Linda Brasher", "time": 1615222236138, "rating": 5.0, "text": "From the day I made the first phone call all the way through the completion of my business the service was superb. Everyone was not only professional but were also kind.", "pics": null, "resp": {"time": 1615232265279, "text": "We're happy to see that you had a 5-Star experience at C. Taylor Crockett. P.C. Thanks for sharing Linda."}, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "101612722668586993917", "name": "Deirdre Daniels", "time": 1577810828509, "rating": 5.0, "text": "Professional, patient and compassionate service. I would definitely recommend Attorney Crockett to anyone. Rest assured that you'll feel relieved before you leave his centrally located office.", "pics": null, "resp": {"time": 1615232429249, "text": "Thank you so much for taking the time to leave an excellent rating. We really appreciate your business. Please let us know what we can do for you in the future."}, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "103574179415098269771", "name": "Valerie Chavez", "time": 1588017276579, "rating": 5.0, "text": "Diligent, dependable, and direct. Mr. Crockett got me to a place where I had peace of mind and a chance to rebuild my future.", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "100523205980761907387", "name": "Mimi Latoine", "time": 1572537688773, "rating": 5.0, "text": "Attorney Crockett and his staff, particularly Kim are top notch professionals.They are very passionate about the work they do and in helping people find the right fit to meet their individual needs. A highly ethical group and I would strongly recommend you give them a call!", "pics": null, "resp": {"time": 1615232468711, "text": "The team here at C. Taylor Crockett. P.C. is thrilled to receive such great rating, thank you."}, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "109907278468966289984", "name": "Mr. Griffin", "time": 1561557976734, "rating": 5.0, "text": "My experience with Mr. Crockett was 2nd to none. The personal touch he provided me was what I was looking for in a professional environment. He kept me informed on my case even after I had filed with details of actions the court was trying to make on my behalf and fought with my best interest at heart. So he is highly recommended in my book!", "pics": null, "resp": {"time": 1561578213543, "text": "Thanks Mr. Griffin.  We appreciate you entrusting us to assist you, and now your daughter as well."}, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "112089707884091351127", "name": "Romar Smith", "time": 1587163524974, "rating": 5.0, "text": "Mr. Crockett and his staff have always been nothing but professional, knowledgeable, thoughtful, courteous, and extremely helpful!\n\nI’ve known Taylor for close to two decades and there is not another person I would trust to handle my interest!", "pics": null, "resp": {"time": 1615232528535, "text": "We are incredibly grateful that you took the time out to leave us a 5-Star review."}, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "103882929916838986244", "name": "carletta collier", "time": 1586544434544, "rating": 5.0, "text": "I HIGHLY RECOMMEND THEIR SERVICES, THE COMPASSIONATE ONES.", "pics": null, "resp": {"time": 1615232399780, "text": "Thanks so much for sharing your experience with us."}, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "113397870894714079501", "name": "Ann Roth", "time": 1565007835609, "rating": 5.0, "text": "I highly recommend Taylor and his staff, they are very professional and walked me through everything. I didn't know what I was going to do with my mom's finances but once Taylor got involved I knew I was right where I needed to be. When I was overwhelmed he was so reassuring, \"you got this\". I even talked my brother and his wife into going and they couldn't be happier about it.", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "112740559787137600242", "name": "Brett Beiter", "time": 1556801761212, "rating": 1.0, "text": "Met with Taylor in March 2018 to discuss my case.  He tasked me with collecting all of my financial information of which I submitted within a week.  They never followed up.  After five weeks I inquired again and was notified they had been dealing with an illness.  No communication the duration of 2018.   I received a letter in January 2019 following up so I called again.  No return call!!! In April 2019 I retained a different attorney.  If zero stars was an optional rating this firm would have received that notorious ranking.", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "117228725734298021830", "name": "TC Oliver", "time": 1566622995509, "rating": 5.0, "text": "Friendly, professional and extremely knowledgable. I highly recommend C Taylor Crockett PC.", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "110198317219258716810", "name": "Gwen Sanders", "time": 1561581448113, "rating": 5.0, "text": "I highly recommend Mr. Crockett. He so Professional  and very courteous.", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "103077961104598857484", "name": "Traci Melton", "time": 1564766618809, "rating": 5.0, "text": "I highly recommend him and his staff are really awesome.....", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "109202398711055858698", "name": "Kandy Garner", "time": 1564683404867, "rating": 5.0, "text": "I definitely highly  recommend Mr. Taylor Crockett best attorney I know", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "101156437609462412768", "name": "Matthew Heath", "time": 1490897197770, "rating": 5.0, "text": "Not all Bankruptcy Attorneys are created equal.  I wouldn't use anyone other than Taylor Crockett.  That is for sure!", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "111890203144724879118", "name": "Imogene Batemon", "time": 1481046718470, "rating": 5.0, "text": "One the best Law Firms I have ever had pleasure of assisting me and my family.", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "113593517434527797849", "name": "Claude Fountain", "time": 1494557435082, "rating": 5.0, "text": "Taylor Crockett will take the time to listen to you as an individual, and give you the best legal representation for your specific needs.  I highly recommend him and his staff", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "104858873591796280717", "name": "Brian W. Kittrell", "time": 1493392359002, "rating": 5.0, "text": "Great lawyer and great office staff!", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "104802436380625202572", "name": "jason grantham", "time": 1599275368932, "rating": 5.0, "text": "Highly recommend!! Very professional, and easy to talk to. They actually take time to explain things and listen as well. Two thumbs up!!", "pics": null, "resp": {"time": 1599576674704, "text": "Thank you Jason, for the opportunity to represent you."}, "gmap_id": "0x889293aa63485577:0x3924fe72b070382d"}
{"user_id": "116329889988890747155", "name": "Tec Tony", "time": 1543511405095, "rating": 5.0, "text": "Cam & Kaz are great to work with & really know there stuff when it comes to tax laws bankruptcy, living wills. The best part is they don't treat you like a number or a paycheck. They treat you like a person. They will both site down and with and explain all the options you have, so you can make a well informed decision.", "pics": null, "resp": {"time": 1553721746987, "text": "Thank you!"}, "gmap_id": "0x889293aa63485577:0x3924fe72b070382d"}
{"user_id": "106394610950008531716", "name": "Aaron Gartlan", "time": 1575762311966, "rating": 5.0, "text": "Cam Metcalf is a true friend in our community and trusted legal advisor in business and estate planning law and financial matters. I gladly refer clients to Cam on a regular basis.⚖️", "pics": null, "resp": null, "gmap_id": "0x889293aa63485577:0x3924fe72b070382d"}
{"user_id": "101869380722082337567", "name": "Courtney Quinn", "time": 1560883844353, "rating": 5.0, "text": "Highly recommended attorneys who care about the clients they help.", "pics": null, "resp": {"time": 1567187551855, "text": "thank yo so much"}, "gmap_id": "0x889293aa63485577:0x3924fe72b070382d"}
{"user_id": "102932560093225843725", "name": "Christopher Calvin Reid", "time": 1560884028440, "rating": 5.0, "text": "They come highly recommended.", "pics": null, "resp": {"time": 1567187543756, "text": "Thank you"}, "gmap_id": "0x889293aa63485577:0x3924fe72b070382d"}
{"user_id": "107705895886001194379", "name": "Katlin Anderson", "time": 1502988463998, "rating": 5.0, "text": "The attorneys and staff always go out of their way to make sure an already difficult time is made as easy as possibly. They always have their clients best interest at heart and strive to help in anyway possible.", "pics": null, "resp": {"time": 1553715240800, "text": "Thank you!"}, "gmap_id": "0x889293aa63485577:0x3924fe72b070382d"}
{"user_id": "117962847686830747592", "name": "Hayden Lee", "time": 1502748897081, "rating": 5.0, "text": "So nice and helpful, and they always have YOUR best interest in mind, not their pocketbook's", "pics": null, "resp": {"time": 1553715269731, "text": "Thank you!"}, "gmap_id": "0x889293aa63485577:0x3924fe72b070382d"}
{"user_id": "112610788643880651915", "name": "Cassie Meadows", "time": 1502824830988, "rating": 5.0, "text": "Understanding attorneys and staff who are always willing to help in anyway they can.", "pics": null, "resp": {"time": 1553721765168, "text": "Thank you!"}, "gmap_id": "0x889293aa63485577:0x3924fe72b070382d"}
{"user_id": "100797197793850253161", "name": "Trey Horton", "time": 1433982163218, "rating": 2.0, "text": "Went in, Very old guy.... I told him about some tax things I would like to take care of. Paid him $500 - he said he was going to the IRS to pull my transcripts (that can be pulled online) the next day so when I met him next I asked to see them. Since he said he spent all day down there getting them and used the $500 I paid him.. . He could not produce them. Never saw them. I asked him what I needed to do, he offered no sort of plan, no sort of advice. Said let's offer them xyz and see what they say.... Give me a break. I can do that myself...   Never went back. hate being lied to. Lost $500 beware...", "pics": null, "resp": null, "gmap_id": "0x888917df8c1c89dd:0x6669c005e7cb1a1e"}
