{"user_id": "116537229658831650336", "name": "Peggy Jackson", "time": 1617997319467, "rating": 5.0, "text": "Yesterday was a beautiful day to enjoy the park! So pretty and it's always nice and clean...\nIt's certainly deserving of a 5 star review, being the perfect little place for my sweetie and I to meet for lunch through the week while working! 💕🥰", "pics": null, "resp": null, "gmap_id": "0x888bfd7c612102a9:0xe76eaf7749ff63db"}
{"user_id": "106765044542958894963", "name": "Eduardo Oseguera", "time": 1563598839914, "rating": 5.0, "text": "Really nice courts to play some pickelball.", "pics": null, "resp": null, "gmap_id": "0x888bfd7c612102a9:0xe76eaf7749ff63db"}
{"user_id": "106046629375134758382", "name": "Clarissa Harris", "time": 1540343133290, "rating": 4.0, "text": "Nice place to play Tennis for outdoors. Court is good", "pics": null, "resp": null, "gmap_id": "0x8886031c06d4b5dd:0xcc51ac416267093"}
{"user_id": "117022401735539133364", "name": "Rickey Giddeon", "time": 1480822936860, "rating": 4.0, "text": "Love playing tennis here", "pics": null, "resp": null, "gmap_id": "0x8886031c06d4b5dd:0xcc51ac416267093"}
{"user_id": "117021586969259752148", "name": "Him", "time": 1620840568795, "rating": 1.0, "text": "Not sure they are ever open. Have been by several times within listed hours and either completely closed or a sign that reads “back at 2” - even at noon……….", "pics": null, "resp": null, "gmap_id": "0x88621257bcfaa5c7:0x278644febecaa25d"}
{"user_id": "100327035419382427617", "name": "Rey Rivera", "time": 1623101588538, "rating": 1.0, "text": "Same as everyone else, the store is always close during regular business hours. What’s the point of having a store that is never open, I’ll spend my dollars somewhere else.", "pics": null, "resp": null, "gmap_id": "0x88621257bcfaa5c7:0x278644febecaa25d"}
{"user_id": "101445824033448312299", "name": "Joseph Soares", "time": 1619892392494, "rating": 1.0, "text": "There is no point in having the hours on the door. May as well not even waste your time going up because they won’t be open.", "pics": null, "resp": null, "gmap_id": "0x88621257bcfaa5c7:0x278644febecaa25d"}
{"user_id": "107931706247723638464", "name": "Donna Land", "time": 1607720265254, "rating": 1.0, "text": "I am sitting in the parking lot because the hours on the door means they are still open.\nI have been here on many occasions and they are closed .\nThis is this most sorry run place I have ever been too.\nIf you don’t want to stay in business sell it to someone who would!", "pics": null, "resp": null, "gmap_id": "0x88621257bcfaa5c7:0x278644febecaa25d"}
{"user_id": "104248126637153268070", "name": "Jeremy Patton", "time": 1617640844692, "rating": 1.0, "text": "Same problem as everyone. Wish I had seen the reviews first. Nobody is here and it's 1130 am on a Monday.", "pics": null, "resp": null, "gmap_id": "0x88621257bcfaa5c7:0x278644febecaa25d"}
{"user_id": "110651977013620184668", "name": "Joe Smith", "time": 1596567210051, "rating": 1.0, "text": "I dropped by on a Tuesday and was extremely disappointed by my treatment.  The young woman was so unfriendly it bordered on rude.  When I asked a question I would get a one word answer and nothing more.  Almost like she was aggravated at me.  She had a little dog in the store with her so I tried to warm up to her that way.  When I asked if the dog was hers I got a terse, \"Yes\", and that was it.  I am new to the area and wanted to talk so someone about options for playing tennis and maybe find a stringer.  I cut that place off my list after this visit.  I think maybe she wanted to go to lunch because as soon as I left she came out and locked up and left.  I understand she may have been hungry but I have never met a dog owner who was not friendly when you asked about their dog.", "pics": null, "resp": null, "gmap_id": "0x88621257bcfaa5c7:0x278644febecaa25d"}
{"user_id": "105637047098714700621", "name": "Trisha Hollings", "time": 1601576653371, "rating": 1.0, "text": "Add me to the list of people who have come multiple times during business hours just to find the door locked tight. I also have a friend who tried to go last week after I suggested she go there she also found it locked.... Right there are 2 pair of shoes worth of business... I guess the rude owner does not need business?  As we are close friends with another business owner in the plaza we have also experienced her rudeness not only doing business transactions with her but also watching her yell at playing kids that are eating at the tables outdoors at the shopping center.....  I'm surprised the story still in business with the lack of ours and the lack of customer service and I personally I'm hoping taking for another store to move into the area!!", "pics": null, "resp": null, "gmap_id": "0x88621257bcfaa5c7:0x278644febecaa25d"}
{"user_id": "111536226597833948406", "name": "Sandra Barrett", "time": 1603131076417, "rating": 1.0, "text": "I’m laughing as I read these other reviews with a one because I am literally in the parking lot trying to pick up a racquet (300$) that I am so mad I bought from the lady with the dog. I was such a bother to her. I’ve honestly never seen anything like it.... it’s really almost comical.  We thought we might be on a hidden tv show.", "pics": null, "resp": null, "gmap_id": "0x88621257bcfaa5c7:0x278644febecaa25d"}
{"user_id": "105221121703630725363", "name": "Ananda Upshaw", "time": 1552774489289, "rating": 5.0, "text": "Kathrine is great. She helped me with picking out my first tennis racket and gave us discounted items while also being kind. I would highly recommend especially if you’re a beginner like me. The store is well organized so it shouldn’t be hard to find what you’re looking for.", "pics": null, "resp": null, "gmap_id": "0x88621257bcfaa5c7:0x278644febecaa25d"}
{"user_id": "117488036582781753598", "name": "Caleb George", "time": 1600103141272, "rating": 1.0, "text": "Have called a few times during their listed business hours but haven't got an answer. I'm leary of driving half an hour to the store given that so many have said they often aren't open during business hours and I wanted to verify they were open.", "pics": null, "resp": null, "gmap_id": "0x88621257bcfaa5c7:0x278644febecaa25d"}
{"user_id": "104448284924577526068", "name": "Bamamommy 123", "time": 1538669957720, "rating": 1.0, "text": "Came here from Madison to get some new tennis shoes.  It's 11:15 am on a Thursday morning and the shop is closed.  No one is answering the phone.  If I could give zero stars, I would.  No excuse for this.  Good luck paying your rent!", "pics": null, "resp": null, "gmap_id": "0x88621257bcfaa5c7:0x278644febecaa25d"}
{"user_id": "117781313382841529064", "name": "Andréa P Nicolau", "time": 1582391581929, "rating": 1.0, "text": "Came twice and the store is closed during business hours. Very frustating.", "pics": null, "resp": null, "gmap_id": "0x88621257bcfaa5c7:0x278644febecaa25d"}
{"user_id": "105500596258754132189", "name": "Mathieu Baker", "time": 1468691628885, "rating": 2.0, "text": "While the store's selection is great and the people that work there are very helpful, I have major issues with this store. During their supposed operating hours, I have seen the closed sign a lot more than the open sign. It's difficult to shop local and support a small business when they aren't even there at 12:30 on a Saturday! It's disappointing that the best source of tennis gear in Huntsville is so inconvenient and inconsistent.  If the store were open during posted hours this would be a five star rating.", "pics": null, "resp": null, "gmap_id": "0x88621257bcfaa5c7:0x278644febecaa25d"}
{"user_id": "112598264623575940512", "name": "Jack Bruce", "time": 1565454406923, "rating": 1.0, "text": "I have been to this store 3x and 2 of those 3 the store was not open when they were suppose to be. I drove 30 miles to shop specifically at this store  but that will no longer be happening. I will take my business elsewhere!", "pics": null, "resp": null, "gmap_id": "0x88621257bcfaa5c7:0x278644febecaa25d"}
{"user_id": "116938167513674569541", "name": "Catherine DeLeon", "time": 1502464131643, "rating": 1.0, "text": "So tired of store hours not actually being store hours! For the second time I am sitting here at 10:10 in the morning when the store should be open and no one is here. It's very frustrating. I've also been here in the middle of the day and the store is closed for lunch. It's hardly worth making the trip over the hill when there are other places I can buy my tennis equipment.", "pics": null, "resp": null, "gmap_id": "0x88621257bcfaa5c7:0x278644febecaa25d"}
{"user_id": "113223759010523950784", "name": "William Brinkley (Ben)", "time": 1518895612529, "rating": 4.0, "text": "This is a pretty neat store that reminds me of serve and volley from back in the 90s.", "pics": null, "resp": null, "gmap_id": "0x88621257bcfaa5c7:0x278644febecaa25d"}
{"user_id": "107014162077609071347", "name": "Chris Stewart", "time": 1482350831420, "rating": 5.0, "text": "This is a great shop, very helpful sales staff. Overall great experience.", "pics": null, "resp": null, "gmap_id": "0x88621257bcfaa5c7:0x278644febecaa25d"}
{"user_id": "109297950517637762977", "name": "Jeff Stewart", "time": 1470670720996, "rating": 2.0, "text": "I really wanted to like this place. They have a good selection of gear and the staff is helpful. I also like giving my money to local businesses when possible. But when a racquet order takes 25 days to arrive and no explanation other than \"the manufacturer screwed up the order\" and \"thank you for your patience\" is offered, I can't justify doing business here. Maybe the manufacturer did foul up the order but why did it take nearly 3 weeks to sort it out? When I asked for a loaner racquet for use during an upcoming match since mine was already 2 weeks overdue, I was told that I could pay a $5 demo fee to use a racquet. Really? I just spent $200 in your store and you can't loan me a racquet for 1 day without a fee? I got the distinct impression that \"we're the only tennis shop in town, you're stuck with us\". Maybe so, which is why I'll be making my future purchases on the internet, where I can get better customer service and MUCH faster product delivery.", "pics": null, "resp": null, "gmap_id": "0x88621257bcfaa5c7:0x278644febecaa25d"}
{"user_id": "112290586496802662263", "name": "CptRon1", "time": 1524155985265, "rating": 1.0, "text": "Stor is closed during regular business hours. They did put up a note saying it opens at 11am but it is now 11:40am and still closed. Meanwhile I’m sitting in the parking lot looking for an another store to take my business.", "pics": null, "resp": null, "gmap_id": "0x88621257bcfaa5c7:0x278644febecaa25d"}
