{"user_id": "108015018424015314004", "name": "Amy Tadlock", "time": 1490901490423, "rating": 4.0, "text": "Great for a child birthday party. Limited choice on the different jumps but great for children.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOAi82FJI4jWCSRnv-1ZehprYaTzd8FjHnOsk8v=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipONCksk5gYlze0A0tzzMFcBQJLRE9KJZNcIfD8g=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO3MK_9WjWVkLbGg1-YNNxSNGLDjElyC0Ia89yh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNxStnbK8_oiFzndFtSY5brqhBz47xo9ArUMnQI=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb274c1e33acd:0xce3c59be4fe9890"}
{"user_id": "106096636210156420232", "name": "Jay Friday", "time": 1427678582508, "rating": 5.0, "text": "Jumps A Lot is awesome!  I had my daughters 6th birthday party there. We have been to all the bounce houses in the area and Jumps A Lot is by far the best. The inflatables are better than any other around and all the kids loved it!  Some of the other parents commented on how clean the inflatables were. The staff did a great job and most important all the kids had a blast.  I would highly recommend this place to anyone.", "pics": null, "resp": null, "gmap_id": "0x889bb274c1e33acd:0xce3c59be4fe9890"}
{"user_id": "110407811057675797052", "name": "Brianna Payne", "time": 1487384538561, "rating": 5.0, "text": "I ordered an inflatable for my son's 5th birthday party! There was a slight mix up, but the manager resolved it in what has to be record time! The gentleman who delivered the jump was so nice and accomaditing to make sure I pleased and everything was good to go! Not only that, but the inflatable was CLEAN! Having ordered 2 before from a different company, I expected the normal sweeping and need for a wipe down, but this one needed nothing! I FULLY recommend Jumps-A-Lot, their equipment, and their staff to anyone searching to rent an inflatable for a party! For anyone wondering, we used the 5-in-1 Combo and it is AWESOME!", "pics": null, "resp": null, "gmap_id": "0x889bb274c1e33acd:0xce3c59be4fe9890"}
{"user_id": "112281983583898476746", "name": "Kathryn Lee", "time": 1487855551928, "rating": 4.0, "text": "Fun for the kids most games did not work and the 2 helpers did not seem to happy to help and didn't get mich help from them", "pics": null, "resp": null, "gmap_id": "0x889bb274c1e33acd:0xce3c59be4fe9890"}
{"user_id": "103882434172552356451", "name": "Jennifer Williams", "time": 1504817405039, "rating": 3.0, "text": "Fun but a lot of the games were out of order", "pics": null, "resp": null, "gmap_id": "0x889bb274c1e33acd:0xce3c59be4fe9890"}
{"user_id": "114534086400548489992", "name": "Kenneth Concilio", "time": 1479340954102, "rating": 5.0, "text": "My daughter loves the place!", "pics": null, "resp": null, "gmap_id": "0x889bb274c1e33acd:0xce3c59be4fe9890"}
{"user_id": "109946900393209342846", "name": "AleishaDavisDesigns TheSableBelle", "time": 1518801952212, "rating": 5.0, "text": "Great location for parties!", "pics": null, "resp": null, "gmap_id": "0x889bb274c1e33acd:0xce3c59be4fe9890"}
{"user_id": "100333162899773795585", "name": "Crystal Mcdaneld", "time": 1488153681765, "rating": 1.0, "text": "More then half the games didn't work and the ones that did took your money", "pics": null, "resp": null, "gmap_id": "0x889bb274c1e33acd:0xce3c59be4fe9890"}
{"user_id": "109588606457863339768", "name": "Lagina Fillingim", "time": 1623702820414, "rating": 5.0, "text": "Just want to thank the staff and crew at Top Notch for all their hard work setting up for RMC Foundation's Frontline Farm Fest. The weather was not cooperative during set up but they persevered to make our event special. They really went above and beyond and the results couldn't have been better. We will always call on Top Notch for every event because they always make it \"Top Notch\".", "pics": null, "resp": {"time": 1623704202038, "text": "Thank You , Lagina! We ❤️❤️ working with you and all the staff of RMC. We will do what needs to be done each and every time to make every event “ Top Notch”!"}, "gmap_id": "0x888bb3e875cc5ad5:0xf71cc8f07b5939ca"}
{"user_id": "115026545559770887576", "name": "Curtis Collins", "time": 1624337487291, "rating": 5.0, "text": "Thank you. Y'all saved the day for my daughter", "pics": null, "resp": {"time": 1624338762692, "text": "Thank You so much for your review. You’re so welcome! I am glad that we could help you. Please let us know if there is anything else we can help you with in the future."}, "gmap_id": "0x888bb3e875cc5ad5:0xf71cc8f07b5939ca"}
{"user_id": "106883003906524438841", "name": "Lisa Armstrong", "time": 1572894662071, "rating": 5.0, "text": "Top Notch was amazing. Great customer service. I’ll only rent from them. Great job guys. You made a stressful day better. Thanks so much to all of you.", "pics": null, "resp": null, "gmap_id": "0x888bb3e875cc5ad5:0xf71cc8f07b5939ca"}
{"user_id": "117211912673101474594", "name": "Carol Watts", "time": 1488312410568, "rating": 5.0, "text": "Have used this company several times for tents and other items.  The staff has always been professional and more than helpful every time from deciding what items are needed, to set-up and take-down.  \"Top-Notch\" in my book!", "pics": null, "resp": {"time": 1489675120915, "text": "Thank You So much Carol."}, "gmap_id": "0x888bb3e875cc5ad5:0xf71cc8f07b5939ca"}
{"user_id": "104296710206222080135", "name": "Justin Cannady", "time": 1548778296364, "rating": 1.0, "text": "I would like to commend Top Notch Events and Rentals for the promptness for both days of our event. Everything was delivered and picked up in accordance with the contract.\n\nRegrettably, I was very disappointed in the lack of professional guidance and foresight that the company provided concerning the setup for my event on 1/20/19 at Vulcan Park and Museum. First and foremost, the tent was not placed the way we discussed previously. After the initial discussion and sending a detailed floorplan to Top Notch, I arrived to find the tent's short side positioned parallel to the Vulcan statue. Due to this error and Top Notch’s worker's unwillingness to help change it, a domino effect of massive changes that would ultimately have me working to change the entire floor plan two hours prior to the beginning of my own event – including moving tables, chairs, and other equipment around. The worker did not help with the changes in the floorplan. I even asked the worker if he could get some more sidewall for the other tent. He told me he would and never did.\n\nTo compound the poor set up experience, the tent would not stay warm after being guaranteed that the heaters \"would keep the tent very warm and we did not need any more heaters.\" I think that may have been the case if 1) both heaters worked the entire time and 2) the bottom of the tent would have been secured so the wind would not make them flap. A company that claims to have set up hundreds of events did not even ensure basic set up was accomplished. Due to the temperature inside the tent, the band refused to play. We had to wait nearly an hour before a repairperson arrived to fix the heater. Around 7:00 PM, the band resumed playing.\n\nI have not ever had an experience so horrible and on the day of my wedding reception makes this exponentially worse. As I know mistakes happen, I feel much of these could have been avoided had I been given the correct guidance and Top Notch did their job of securing the tent properly (as well as supplying working heaters). Being unfamiliar with event planning in general and the previous events held at Vulcan, I feel that Top Notch should have provided any additional information to clients to make sure the event would run as smoothly as possible. In addition, I would like to point out I have exhausted every action I could prior to posting this review. I always try to work out differences in a private setting as opposed to in a public forum. Unfortunately, Top Notch was not interested in working things out and felt they were completely absolved from any blame. This company is amateur and unprofessional – pay a little extra and use a company that knows how to properly set up for any event!", "pics": null, "resp": null, "gmap_id": "0x888bb3e875cc5ad5:0xf71cc8f07b5939ca"}
{"user_id": "107440117875640056479", "name": "Flenardo Taylor", "time": 1561637232572, "rating": 5.0, "text": "Great place to rent tables and chairs. Very reasonable", "pics": null, "resp": null, "gmap_id": "0x888bb3e875cc5ad5:0xf71cc8f07b5939ca"}
{"user_id": "108311285334994387531", "name": "Dana Bentley", "time": 1529446135830, "rating": 5.0, "text": "Great company,  can always count on them for all your events or rental needs!", "pics": null, "resp": null, "gmap_id": "0x888bb3e875cc5ad5:0xf71cc8f07b5939ca"}
{"user_id": "109768522690051274083", "name": "Shelley Johnson", "time": 1520779269388, "rating": 4.0, "text": "Very helpful and has everything I've needed everytime...", "pics": null, "resp": null, "gmap_id": "0x888bb3e875cc5ad5:0xf71cc8f07b5939ca"}
{"user_id": "110982073426657542554", "name": "kisha Hall", "time": 1532984088253, "rating": 3.0, "text": "Great selection. But way over priced.", "pics": null, "resp": null, "gmap_id": "0x888bb3e875cc5ad5:0xf71cc8f07b5939ca"}
{"user_id": "109325034268434733865", "name": "Jennifer Conley", "time": 1493085369152, "rating": 5.0, "text": "Very nice and reasonable price", "pics": null, "resp": null, "gmap_id": "0x888bb3e875cc5ad5:0xf71cc8f07b5939ca"}
{"user_id": "100894013897214212975", "name": "K9 Info", "time": 1463084116656, "rating": 1.0, "text": "Terrible. Over priced and poor all around!", "pics": null, "resp": null, "gmap_id": "0x888bb3e875cc5ad5:0xf71cc8f07b5939ca"}
{"user_id": "112400398238472480010", "name": "Chelsey full of life jenkins", "time": 1539887194245, "rating": 4.0, "text": "Expensive but worth it", "pics": null, "resp": null, "gmap_id": "0x888bb3e875cc5ad5:0xf71cc8f07b5939ca"}
{"user_id": "109675299399933062443", "name": "Ricky Townsend", "time": 1455496105005, "rating": 5.0, "text": "Top. Notch  employees", "pics": null, "resp": null, "gmap_id": "0x888bb3e875cc5ad5:0xf71cc8f07b5939ca"}
{"user_id": "113875251445868933246", "name": "D.A. Tynes", "time": 1622612194502, "rating": 1.0, "text": "Complete FAILURE.  NO SHOW.  Thought I had everything in order for my sons rehearsal dinner.  Waited ALL AFTERNOON and they never showed with tent, tables, or chairs!  Had to beg for an apology on Monday at noon.  Never heard from anyone!  HORRIBLE experience.  ZERO STARS.", "pics": null, "resp": null, "gmap_id": "0x88891ee041a01af3:0xdfbe454b15aaf2bd"}
{"user_id": "113647620543837374703", "name": "Christina justice", "time": 1593723055734, "rating": 5.0, "text": "Spoke to Chae (manager) she is amazing. I was so upset about finding wedding chairs that will allow pick up and at an affordable price. Chae made it happen. She went above and beyond to make my wedding happen as I wished. The chairs are for the lake and I cant thank her enough. Super professional and friendly. I will use this company again.", "pics": null, "resp": null, "gmap_id": "0x88891ee041a01af3:0xdfbe454b15aaf2bd"}
{"user_id": "107077161825669564473", "name": "Alexandra Smith", "time": 1596853800268, "rating": 5.0, "text": "Love Che and Emily! They always come through and are so nice.", "pics": null, "resp": null, "gmap_id": "0x88891ee041a01af3:0xdfbe454b15aaf2bd"}
{"user_id": "106583605651064336287", "name": "Hannah Kahil", "time": 1585925070120, "rating": 5.0, "text": "I love working with ERU! They have a fabulous response time and are very professional! Emilee is great to work with and the delivery team is always easy to work with if any changes need to be made day of! Such an accommodating group and personalable! 10/10 would recommend :)", "pics": null, "resp": null, "gmap_id": "0x88891ee041a01af3:0xdfbe454b15aaf2bd"}
{"user_id": "105218610159737771290", "name": "Baylee Smith", "time": 1585926246647, "rating": 5.0, "text": "ERU is the best rental company in Birmingham and possibly even in the state of Alabama. I have had the pleasure of working with Emilee and Cory. Their team is very responsive, punctual, and creative. They make wonderful suggestions and have the BEST inventory. I would highly suggest ERU for ALL parties.", "pics": null, "resp": null, "gmap_id": "0x88891ee041a01af3:0xdfbe454b15aaf2bd"}
{"user_id": "117862908600278963805", "name": "Blue Hoo", "time": 1585926270760, "rating": 5.0, "text": "I love all the staff at ERU! I've had the pleasure of working with them a few times, and the energy is always great. Their selection is endless from linens, to chairs, to flatware, to décor. If you're planning a special event this should be your first stop!", "pics": null, "resp": null, "gmap_id": "0x88891ee041a01af3:0xdfbe454b15aaf2bd"}
{"user_id": "109636792154537337022", "name": "Ruth Lawson", "time": 1592851687092, "rating": 5.0, "text": "ERU was fantastic during my wedding planning process. Emilee helped throughout the entire 8 months. COVID-19 completely changed our plans and ERU adapted so quickly. We replanned everything in 3 short weeks and ERU made sure we had everything we needed. They helped us with last minute changes and setups. The equipment was pristine and the service was second to none. Thank you for making our dreams come true!", "pics": null, "resp": null, "gmap_id": "0x88891ee041a01af3:0xdfbe454b15aaf2bd"}
{"user_id": "115346481724288593577", "name": "Tre Luna Catering", "time": 1586277775241, "rating": 5.0, "text": "Highly recommend ERU.  Cory and Chae go above and beyond to help us take care of our customers.  They have a lot of great options for any event.", "pics": null, "resp": null, "gmap_id": "0x88891ee041a01af3:0xdfbe454b15aaf2bd"}
{"user_id": "109862219132927141235", "name": "Jan Nichols", "time": 1402683857435, "rating": 5.0, "text": "Event Rentals Unlimited- Birmingham provided everything we needed to have a beautiful setting for my daughter's wedding and reception at Ephesians Farm. The tables, ivory table cloths and fruitwood chairs were the perfect touch for the rustic elegance that we had planned. Becky was amazing!  She was so helpful, organized and always responded quickly to any questions or adjustments in our plans. We appreciate the service that was provided. Thanks so much for helping make our day perfect!", "pics": null, "resp": null, "gmap_id": "0x88891ee041a01af3:0xdfbe454b15aaf2bd"}
{"user_id": "115974107666575479236", "name": "David Barrett", "time": 1552498141729, "rating": 5.0, "text": "Rented chairs for my sons wedding and the people I talked to were so helpful and the prices are very affordable. Thanks y'all for helping to make it such a memorable day.", "pics": null, "resp": null, "gmap_id": "0x88891ee041a01af3:0xdfbe454b15aaf2bd"}
{"user_id": "101385154784326173613", "name": "Jennifer Gowers", "time": 1476893439125, "rating": 5.0, "text": "I am so appreciative of Event Rentals Unlimited! They listen to their clients and offer the best customer service and products in our area, and throughout the state.  I cannot imagine a career without them by my side and value their continued support of my business.", "pics": null, "resp": null, "gmap_id": "0x88891ee041a01af3:0xdfbe454b15aaf2bd"}
{"user_id": "112672697657922145809", "name": "Allison Brymer", "time": 1476898839877, "rating": 5.0, "text": "I have worked with Event Rentals Unlimited both personally and professionally, and I am thrilled to have this company in Birmingham. Customer service is top notch and the pricing is competitive.  I highly recommend Event Rentals Unlimited for any event.", "pics": null, "resp": null, "gmap_id": "0x88891ee041a01af3:0xdfbe454b15aaf2bd"}
{"user_id": "108897993621183157092", "name": "J Hanson", "time": 1525539945594, "rating": 5.0, "text": "We had a great experience!  We ran into a few issues with wedding planning that I didn't anticipate and Event Rentals went above and beyond to make sure everything worked out for me, made a stressful day so much better!", "pics": null, "resp": null, "gmap_id": "0x88891ee041a01af3:0xdfbe454b15aaf2bd"}
{"user_id": "109421286311176476050", "name": "Amy Marie Kelly", "time": 1538541698705, "rating": 5.0, "text": "Was able to help my company with there picnic by renting us a raffle ticket drum.", "pics": null, "resp": null, "gmap_id": "0x88891ee041a01af3:0xdfbe454b15aaf2bd"}
{"user_id": "109323307344405103487", "name": "Brielle Mathews", "time": 1525121299578, "rating": 4.0, "text": "A good place to rent from - just be very specific with you need/want. We had a ribbon cutting event and we got everything we needed from them - but here's the problem. While most of the items were downstairs by the stage, some items were used upstairs by reception. The latter items were not found and whoever picked up most of the items left without them. Apparently they tried to pick them up two more times - but the receptionist said she never had them stop by. My guess is that he tried going through receiving and didn't ask anyone where the items were. When we spoke with the manager, he promised they'd be picked up Friday afternoon - well the delivery guy had a delay and couldn't make it that day despite the fact the items had been there for more than a week. If anything, the company is good but pickup/delivery is sketchy. Just be very clear with what you want and WHEN. and you should be fine.", "pics": null, "resp": null, "gmap_id": "0x88891ee041a01af3:0xdfbe454b15aaf2bd"}
{"user_id": "102577107991722300415", "name": "Neillie Butler", "time": 1476901887647, "rating": 5.0, "text": "ERU is a dream to work with!  Mike and Becky are very knowledgeable and make sure to take good care of all our clients.  The Mariee Ami team loves working with ERU and will not plan a wedding without them!", "pics": null, "resp": null, "gmap_id": "0x88891ee041a01af3:0xdfbe454b15aaf2bd"}
{"user_id": "116157565229476767081", "name": "Trina McCall", "time": 1533153875861, "rating": 5.0, "text": "Friendly customer service.  Great experience", "pics": null, "resp": null, "gmap_id": "0x88891ee041a01af3:0xdfbe454b15aaf2bd"}
{"user_id": "107834803725080576123", "name": "Raul Ledezma", "time": 1570217454805, "rating": 5.0, "text": "(Translated by Google) Good\n\n(Original)\nBuena", "pics": null, "resp": null, "gmap_id": "0x88891ee041a01af3:0xdfbe454b15aaf2bd"}
{"user_id": "103706249882472643065", "name": "Wilfredo Ramos", "time": 1547162881795, "rating": 5.0, "text": "(Translated by Google) Good staff\n\n(Original)\nBuen personal", "pics": null, "resp": null, "gmap_id": "0x88891ee041a01af3:0xdfbe454b15aaf2bd"}
{"user_id": "113831546257447556534", "name": "Harry Stribling", "time": 1601727698492, "rating": 3.0, "text": "Janiee was fantastic to work with! Really glad to hear that some changes have been made at the top. I imagine the employees who made that place successful are glad to have some new bosses.", "pics": null, "resp": null, "gmap_id": "0x888cf33638fac8e1:0x140111c9a9df7e9a"}
{"user_id": "102119464814449774095", "name": "Jessica Kohn", "time": 1582914500927, "rating": 5.0, "text": "I have used Pre Events for many work events and they are fantastic. All of their staff is great and easy to work with. Items are delivered on time and in great condition!", "pics": null, "resp": null, "gmap_id": "0x888cf33638fac8e1:0x140111c9a9df7e9a"}
{"user_id": "105138661112403232294", "name": "Fountainview Mansion", "time": 1582842146605, "rating": 5.0, "text": "I have really enjoyed working with Janiee and Katie.  They are very professional, kind spirit, and timely with their information.  The staff is always very professional while on site and delivery and set up service are top-notch!  Thank you!   Leigh Hardy. Fountainview Mansion", "pics": null, "resp": null, "gmap_id": "0x888cf33638fac8e1:0x140111c9a9df7e9a"}
{"user_id": "106425823944247448902", "name": "Skylar Albritton", "time": 1473193805505, "rating": 5.0, "text": "I worked with Mary Louise on a styled shoot in Auburn in August 2016. She set up everything so that it was so easy for me. I showed up for pick up, gave them my account number, they loaded my car + I was set to go. Drop off was as much of a breeze + their farm table + ghost chairs were perfect for my fun bridal shower shoot. Every member of their staff was friendly + helpful. Plus, their rentals photographed BEAUTIFULLY.", "pics": null, "resp": null, "gmap_id": "0x888cf33638fac8e1:0x140111c9a9df7e9a"}
{"user_id": "108630415105639864965", "name": "Chad Cleveland", "time": 1582227414980, "rating": 5.0, "text": "Great service and awesome equipment.  highly recommend for event rental in Auburn/Opelika.", "pics": null, "resp": null, "gmap_id": "0x888cf33638fac8e1:0x140111c9a9df7e9a"}
{"user_id": "115204463519355280175", "name": "Wayne Hobbs", "time": 1574759134989, "rating": 1.0, "text": "Most of the security lights don't work", "pics": null, "resp": {"time": 1574777739263, "text": "Hi Wayne!  Thanks for letting us know,  but we don’t actually offer security lights as part of inventory or services. Please give us a call if you’d like to discuss, as we’d be glad to help resolve if we can."}, "gmap_id": "0x888cf33638fac8e1:0x140111c9a9df7e9a"}
{"user_id": "106141445100402806539", "name": "Katherine Carlisle", "time": 1456827477051, "rating": 5.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x888cf33638fac8e1:0x140111c9a9df7e9a"}
{"user_id": "114554654442485202518", "name": "Blaire Robledo", "time": 1606577932247, "rating": 5.0, "text": "The Pelican Pete Crew did an amazing job making my wedding everything I wanted and more! I will never be able to say thank you enough to this company for making our day PERFECT!!", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "118384993078427004947", "name": "Lisa Barron", "time": 1594243637783, "rating": 5.0, "text": "Thank you to Pelican Pete Party Rentals for all of your expertise and experience in helping us plan our beach wedding! Deanna, Sissy, and Kayla are super professional ladies who helped me organize my beach wedding event from afar. I could not ask for a better group of ladies to work with. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "114819377398776516591", "name": "Lauren Milner", "time": 1606188266610, "rating": 1.0, "text": "I hired Ido Gulf Cost weddings & Pelican Pete Party Rentals (Sissy Cook) for my wedding this past October. It was a destination wedding as we are all coming in from out of town. I unfortunately had to change the date and location of my wedding due to Covid and a hurricane distorting my wedding venue. I had paid Sissy in full for everything planning and rentals and she did not refund me any of it. I lost out on a lot of money. It is stressful enough planning a wedding during these uncertain times, to say how disappointed I am with this company is an understatement. I cannot believe that some businesses do this to people. I would NOT recommend them for anything all they want is to take your money and run. Look elsewhere.", "pics": null, "resp": {"time": 1606763185748, "text": "Lauren, we are so very sorry your initial wedding plans did not go accordingly due to the Venue double booking your date. That was to no fault of ours. Our staff immediately found a replacement venue that was comparable to your original venue. After you choose to go with a venue in Florida, which we are not licensed to work in, I did refund you 100% of your floral invoice. It was a pleasure working with you and your mom and wish you nothing but the best. We hate when things do not work out exactly as planned."}, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "107507479307899405380", "name": "Brendolyn Prince", "time": 1573588637189, "rating": 5.0, "text": "The customer service was awesome", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMq_PG_ZWSPdITXDXLkC6z_JnBVpj2mjyarVw2U=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNCmH3KZ3cBNioxSKkgE-j_xmZu9596WfWY2J6-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM2MNJrDOvEUeZy6-_rSzNYACOdGMUfb_toDNRy=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "110796404145336600612", "name": "Alec Walker", "time": 1596473569467, "rating": 5.0, "text": "Very professional and organized. Highly recommended to work with these guys!", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "117398925196512143333", "name": "Wandering On Earth", "time": 1595095552113, "rating": 1.0, "text": "Terrible business representation. I would not rent from them ever again. There are much better companies in this area to choose from.", "pics": null, "resp": {"time": 1594596709913, "text": "Ariel,\nThank you for taking the time to give us your feedback. We have searched call emails, phone calls, quotes and order and cannot find where we have talked or rented to you. Please fill free to call our office and we will be happy to talk about any negative experience you had with our company. We have a excellent reputation for our customer service in our area and will be happy to talk and make things right."}, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "105192768623282835757", "name": "Miranda McGregor", "time": 1577255893603, "rating": 5.0, "text": "Rented a cotton candy machine for Honeybee Festival for the Robertsdale High School Women's Soccer team.  Super easy to work with Pelican Pete's, staff is extremely friendly and helpful!  Highly recommend for all your party rental needs!", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "104892382223783997100", "name": "Brock Cook", "time": 1497890778674, "rating": 5.0, "text": "Awesome experience! Everything was perfect from the ceremony all the way to the reception. I am in the Air Force so they worked with my wife nonstop to make sure it was everything she wanted and never had any complications. Pricing was awesome.", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "113693849157825763155", "name": "Felicia Cook", "time": 1498083965783, "rating": 5.0, "text": "This company is amazing! They made my dream wedding come true! I can't thank them enough for all they have done. They worked with me every step of the way and everything turned out just as I wished for. I recommend this company!!", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "101019678857481383597", "name": "Heather Bender", "time": 1514930112438, "rating": 5.0, "text": "My son’s birthday party was a success because of Pelican Pete. Their rentals were clean, they were on time, and very friendly! We will use them again and we highly recommend their services.", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "101451343545363088651", "name": "Andrew Stepp", "time": 1522681233339, "rating": 5.0, "text": "The team at pelican gave my wife exactly what she wanted for our wedding. Every little detail was perfect. Thank y’all!!", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "103583301106450739111", "name": "Kaitlyn Stepp", "time": 1523325647895, "rating": 5.0, "text": "The Ido Gulf Coast Wedding and Pelican Pete Party rentals os the dream team of wedding and event planning. Heather and Sissy are dolls to work with. I told them what I wanted and they gave it to us and went above and beyond. The boys were so nice and great to work with.m and really went the extra mile on our setup. Our flowers were incredible. We are so thankful to them for rescuing our wedding after another planner took our money just to blow us off. I can’t wait to renew my vows in 25 years and use them again!", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "117357574095334691515", "name": "Malori Brondum", "time": 1523925049306, "rating": 5.0, "text": "I cannot say enough great things about Sissy and Heather!  They made the planning and everything the day of SO easy, and I literally did not have to think about 1 thing during the reception.  They were also super patient with our huge wedding part of 31!  We could not have done it without them, and I would recommend them to anyone 100 times!\nAll of the items we rented from Pelican Petes were beautiful, and every worker we came into contact with were so professional.  We are 100% pleased with everything we got!\n\nThank you SOO much, you guys rock!!", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "105723635574454760696", "name": "Rachel Rhodes", "time": 1543089957271, "rating": 5.0, "text": "We were very happy with wedding decor. Sissy and Heather are super friendly, helpful, and easy to work with.", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "117822111159584180586", "name": "Tina Brock", "time": 1529452048089, "rating": 5.0, "text": "Excellent Service!!!! I highly recommend them!!!  Their employees are amazing.  They go over and beyond!!", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "112438933965201946507", "name": "Justin and Samantha Davis", "time": 1524761642225, "rating": 5.0, "text": "I am currently in Nevada and my destination wedding is in Gulf Shores, AL where my soon to be mother-in-law lives. I can't explain how prompt and helpful this company is. They answered every email and every questions....which was a lot, as I needed to make multiple changes for budgeting purposes and unexpected expense. I'm 2300 miles away and leaving the control in someone else's hands does not come easy for me. The staff via email and over the phone is more than helpful and the pricing is competitive to other companies. I attempted to use another company and 2 weeks later I still couldn't get a estimate sent over. They have now sent me 3 updated estimates usually within the same day if not the following. HIGHLY RECOMMEND them for any party or event needs.\nThanks again,\nFrom a very happy BRIDE", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "106069533909706970285", "name": "Jordyn Jones", "time": 1497469389375, "rating": 1.0, "text": "Terrible experience. Dropped chairs off for my wedding with no one present. As a result, the chairs were not available for set up, as another group used them for their ceremony. I contacted them for a refund, and after the manager was very rude, did not receive a refund for the chairs I never received. Another company that was waiting the end of another wedding ceremony at the same location let us borrow and set up chairs for my wedding, free of charge. Will never use this company again, nor would I recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "102997321571236601844", "name": "Mark Macgregor", "time": 1509071798984, "rating": 5.0, "text": "We have used these guys for our birthdays and anniversaries for years. Flawless!!!! look forward to the next occasion.", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "110853814871611978264", "name": "Sandra Jansen", "time": 1522165468390, "rating": 5.0, "text": "Great customer service! Really nice people!!!", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "110160418813689692577", "name": "Parker Parker", "time": 1508967373768, "rating": 1.0, "text": "The owner is very rude and unprofessional. Would not recommend using this company for any party supplies unless you enjoy being belittled and almost assaulted.", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "112295199857665996174", "name": "Freshte Zarre", "time": 1508967046131, "rating": 1.0, "text": "The owner, Beaux, is very rude and unprofessional. I wouldn't recommend using this company.", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "110181883466035887824", "name": "Samantha Reed", "time": 1517020772048, "rating": 5.0, "text": "Great place to work!!", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "102479159040606776492", "name": "Renee Hughes", "time": 1510512072158, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x889a098eadd176b5:0xc6b8dbd4e4f9e38a"}
{"user_id": "100637163839509588506", "name": "Veslava F", "time": 1589518218433, "rating": 5.0, "text": "We have used them for years and they are always on time the jumpers a clean and that’s huge. Have had other experiences where the jumpers were filthy and that is a huge concern for me as a parent of 2. I always have always liked the selection for different themed parties. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8890a12a36721f15:0xb2baa763dafc2c38"}
{"user_id": "105858847458927059212", "name": "Robin Burroughs", "time": 1582888930752, "rating": 5.0, "text": "For kids parties highly recommend they have several types and kinds of slides,everyone made sure it was properly handled repeatedly checked each other so for a child party I highly recommend", "pics": null, "resp": null, "gmap_id": "0x8890a12a36721f15:0xb2baa763dafc2c38"}
{"user_id": "105134416370651692283", "name": "Tammy Deram", "time": 1557090777353, "rating": 5.0, "text": "They have every thing!", "pics": null, "resp": {"time": 1557783252002, "text": "Thank you Tammy!"}, "gmap_id": "0x8890a12a36721f15:0xb2baa763dafc2c38"}
{"user_id": "108897416743659539559", "name": "Chrissy Emmons", "time": 1520086041746, "rating": 5.0, "text": "Awesome people!", "pics": null, "resp": {"time": 1557783289867, "text": "Thank you Chrissy! Glad we were able to help with your party."}, "gmap_id": "0x8890a12a36721f15:0xb2baa763dafc2c38"}
{"user_id": "115745884096915983148", "name": "Capree Williams", "time": 1624391835132, "rating": 1.0, "text": "For years Blue Rents was always the place to rent from. Not anymore. They will not give you a quote on anything unless they get approval from the general manager. I stopped in to rent a tent, Chairs and Tables. Took my request but they were not able to rent until the general manager approved the labor fee for delivery.\nDon't expect to hear back from them until the day before your event. I don't understand that. So, I decided to go with a different company.", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "118179275598290868858", "name": "Adrian Darrington", "time": 1623960636670, "rating": 1.0, "text": "Tried to rent a coolant fan Monday and was told it had to be approved by the manager. With me calling numerous times and coming to the business. I found out Thursday that I couldn’t rent it with no explanation of why.", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "116949151140141500067", "name": "Lacey Sumerlin", "time": 1573917777425, "rating": 2.0, "text": "I give it two stars only because the ladies at the desk when I went IN the store were very nice and helpful. I have gone in twice and called two times outside of that to get my quote. They assured me I would get something in my email and haven’t yet.  I am planning a wedding and needed all my ducks in a row. It’s been 4 months and I still have not received my quote after they assured me I would. They have some really nice things available to rent, but after numerous times on reaching out to get the ball rolling, I have taken my business somewhere else.", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "111256062916266109045", "name": "Samantha Autery", "time": 1589568307754, "rating": 1.0, "text": "This was ridiculous the one woman I spoke when I rented them it was great. But on pick up day it took 90 minutes! Between the girl not knowing how to actually finish the transaction at the front to the snail slow folks in the back who you would think knows where everything is since it is their job! But nope. Plus my husband and son did almost all the work. This place is a joke. Will never do business there again.", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "117808287907366912829", "name": "Enocolis Lampkin", "time": 1574307984401, "rating": 1.0, "text": "Real bad customer service went in to rent some items a young lady went to back and got a gentleman he came back out and said they couldn’t rent to me cause I was about to fight an employee. I said you have the wrong person he kept saying they said it was you or someone who may have return your stuff I said couldn’t be cause I was only one who returned my stuff and I sure didn’t get into it with no one. I actually believe they didn’t think I had money and I was black but took my business somewhere else and when the company I work for tried to rent for them I told them what happened to me there and they took they business to this other company I rented from I will never come back into this place or let anyone I know rent from they I was in total shock with them about the false accusations. But it’s all good though found company that appreciate their customers and not make up lies on them.", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "109004248595113424061", "name": "S Johnson", "time": 1499359251614, "rating": 5.0, "text": "I rented a drum sander for one week yesterday from the Mobile,  Alabama location and purchased $100.00 in sanding sheets. (this brought the $ total to $350.00 )  once I was home and my subcontractor arrived to begin work... It was discovered that I was given a sander and sanding sheets for different models. It was after closing so I had no option but to send my worker home and deal with blue rents in the morning.  We arrived at the store before eight and was greeted by a very helpful man who addressed our problem straight away.  He was able to credit the original contract and generate a new one for the actual unit we have at home. At this point, it was discovered that they did not have sanding sheets in the quantity we had purchased originally. I asked for a manager to review our situation. \"Chuck\" arrived within minutes and offered this creative,  beyond expected resolution: keep the model we have until we return the replacement unit.  The sanding sheets we purchased yesterday will work with Unit2. To Summarize: we all make mistakes..the way we resolve those mistakes tells the world how much \"customer service \" matters to us individually and the company we represent.   Blue Rents of Mobile scored off the charts... Thanks to everyone who assisted in this encounter...... S Johnson", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "112126350477636359524", "name": "Andie Jordan", "time": 1418231645809, "rating": 5.0, "text": "My family always rents equipment and event rentals from Blue Rents. They have a variety of equipment rentals that I am able to rent at the last minute to do my weekend yard work.  Thank goodness they are open on Saturdays.  I have even been able to rent a inflatable at the last minute on a Saturday and throw a wonderful tailgate party.  Sundays are always a free rental day which gives me a longer time to use what I rent.  Thanks for being open on the weekends, and having a variety of party rentals and lawn care equipment to help me and my family!", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "107304585553231020843", "name": "Hannah Majors", "time": 1579126667114, "rating": 5.0, "text": "Great Prices ! Great Deals ! Polite Family Owned Business !", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "105428836337584501809", "name": "matthew mcleod", "time": 1284402665963, "rating": 4.0, "text": "Friendly and efficient at the front desk. The guys in the back took the time to explain the operation of the equipment. The equipment performed very well. Rental and return was smooth. Easy access from the I-10 service road. Recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "101701457499948829564", "name": "Trey Pugh", "time": 1502832622899, "rating": 5.0, "text": "Customer service is awesome! Spoke with Margaret & she  as every helpful & professional on helping me decide what best fits my wedding needs! They show they care about your needs!", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "113886564931874897042", "name": "Calvin Dickerson", "time": 1529544530943, "rating": 5.0, "text": "I arrived at Blue rent 4:45pm.I was out of blue rent at 5:00pm   that was some awesome service and I was in the heavy equipment side. Thanks guys for your awesome service.", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "114374186115441064415", "name": "Jacqueline Evans", "time": 1582957151909, "rating": 1.0, "text": "I rented a golf cart and while trying to load it on a trailer it wouldn’t start so we all assumed that it was the battery the dead and instead of the manager buying a new battery he suggested that we waited for it to charge for a little while and suggested that we have jumper cables just in case the golf cart battery dies again we refused and asked the manager again would he purchase a battery since the battery source is right next door and he still refused I got my money back because of the hassle and non customer care that I received the manager acted as if he didn’t want me to rent the golf cart from the beginning with his racist attitude that he presented us with he was very unfriendly and nonchalant about the situation from the start he was very unpleasant when the lady inside forgot to charge me for the damage deposit he came out and asked if I was the one that rented the golf cart I said yes and he unpleasantly stated that I needed to go back inside and pay it as if it was my fault that I didn’t pay and I will not ever rent anything else from a place that exhibits prejudice because my money is green too I give two thumbs down 👎🏽 For blue rents .", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "101945368034428330033", "name": "Jessica Whigham", "time": 1442081401102, "rating": 1.0, "text": "I didn't like the fact that the representative placed me on hold and then the line disconnected (hung up in my face). AWFUL customer service. She could have simply said we're closing please call back Monday or she could have taken my number and called me back Monday. I'm planning an event. I will definitely spend my money somewhere else with good customer service. They ruined a business opportunity before it even began.", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "113759405174030120920", "name": "Kerry Lambert", "time": 1523829533878, "rating": 5.0, "text": "We had a Easter Egg Hunt at our facility.  And rented a big slide from Blue Rents. The kids loved it and so did the parents!", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "114312460594920850864", "name": "Mandi Donald", "time": 1505062644316, "rating": 1.0, "text": "DO NOT USE!!!!!!!!!!!! I hired Blue Rents to provide tables, chairs and tents for my company (a major corporation) for a community event sponsoring a local high school. There were over 300 public officials including law enforcement, firemen, EMTs from the area. Also, the school board and all faculty from the school system. My initial experience with a salesperson, Margaret, was pleasant. I explained my needs and she booked every item as needed. The day before the event- I received a confirmation call for delivery the following day between 12 and 2. This reassured me that everything would go as scheduled. This was not the case. I called 6 times trying to get the salesperson to give me an ETA. This proved to be around 4pm. The event started at 5pm. They sent one guy with part of my order. Because there was only 1 guy- my children unloaded and set up the tables with the table cloths- 18 to be exact! This guy only had the railing for the 2 tents. About 30 minutes later- another guy showed up with a helper. They had to find a faucet to load the water barrels to hold the tents down....After all of this... they had NONE of my CHAIRS! After a call to the salesperson- she had the audacity to say- \"You didn't order chairs\"!!!!!!!!! Thank goodness one of the catering people knew the Vice Principal of this school. Between my children, the lady and my husband- we took our own vehicle to pick up over 100 chairs and set them up ourselves. I cannot stress enough that you do not need to put any faith in this company. They do not stand behind anything they promise. I do not know how they stay in business. I cannot disclose our company name (a major petro-chem company). Just know that you've been warned.", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "104869539218107113995", "name": "Rolounda Hayes", "time": 1498847623687, "rating": 1.0, "text": "Rented a fryer from Blue Rent for a family reunion this past weekend. We were ultimately never able to use the equipment. We purchased about 100 lbs of fish and shrimp for this event and it all went to waste. I asked for a partial refund which was $65. The person who I spoke with told me I would be refunded. Afterwards they stated nothing was wrong with the equipment, and they wouldn't be issuing a refund. I stated we couldn't get it to work properly. We took a much bigger lose then they did. This company is very inconsiderate and I don't recommend anyone to use them.", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "117233649952807417937", "name": "Samantha Moats", "time": 1511036146547, "rating": 1.0, "text": "I have not used this company personally for rentals. However, I work at a venue that is used for weddings. On every occasion, their male staff that helps with set up makes our female staff uncomfortable with remarks they make to each of us.\n\nManagement, please get this behavior under control. We don't show up to your place of employment and hit on your staff; your staff absolutely should not do it to ours.", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "112203209382878356803", "name": "Benjamin Olson", "time": 1581891482033, "rating": 1.0, "text": "Very shady company, they will screw you everywhere they can!", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "108689256533220704437", "name": "Wendi Ham", "time": 1495988904611, "rating": 1.0, "text": "I had a really poor experience with customer service here. We rented a restroom trailer for our wedding. Despite multiple contacts with sales, we were not informed that we needed a water hookup until the day of delivery. When I called to confirm that there was not a onboard water tank, they refused to let me talk with the manager and talked over me until I admittedly lost my cool and was hung up on with no return call from the manager. On the day of the wedding, a neighbor who was kind enough to make sure everything was running smoothly found that the generator had stopped working and was hung up on by the receptionist after trying to contact the person who told him they would fix the problem. We ended up fixing it ourselves. The rudeness of the staff was appalling, especially considering the amount we paid to their company. We will never use this company again and will recommend others to avoid this company at all costs.", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "113458479472871052006", "name": "Mandy Kaiser", "time": 1526930009326, "rating": 1.0, "text": "Poor customer service. Not a pleasant experience working with them and they were not helpful with loading and unloading the materials we rented. Ended up being way more work for us than was expected based on the agreement we came to on the phone.", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "113372807195704297765", "name": "King Champion Entrepreneur Ratheal", "time": 1490556383634, "rating": 4.0, "text": "Rented chainsaw, it did great and customer service was good . Will be using them for more equipment rentals in future", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "108470976107952464251", "name": "Daniel Payton", "time": 1523336394019, "rating": 5.0, "text": "Nice place, many items to rent. Helpful staff", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "104878468687694368696", "name": "Kim Mcginney", "time": 1555606065964, "rating": 5.0, "text": "They r friendly an always willing to help", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "112010174506355858745", "name": "Donny Carpenter", "time": 1543860736737, "rating": 5.0, "text": "Great company.. very honest", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "107320331979803913863", "name": "Jared Hippensteel", "time": 1309535771484, "rating": 5.0, "text": "Terrific service. We basically didnt have to do anything for my sons last birthday. BlueRents handled it all.  I recommend Bluerents", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "113867380362926244149", "name": "Chuck Turner", "time": 1512877381906, "rating": 5.0, "text": "Great staff and amazing tents", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "104906908769361525981", "name": "Sheila Lasueur", "time": 1539385356102, "rating": 5.0, "text": "Love the discounted linens", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "101352935058585413343", "name": "BRANDON MCCLAIN", "time": 1567875973455, "rating": 1.0, "text": "Dishonest owner and workers", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "107495853215977367711", "name": "Deborah Wilson", "time": 1527392451072, "rating": 3.0, "text": "To high. I can order anything for my events, everything I need. Still be cheaper than this company", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "112506302829606744155", "name": "Joy Wright", "time": 1560651241070, "rating": 4.0, "text": "Nice people, very friendly", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "116862549093078450813", "name": "Bob Ustoreit", "time": 1519687340239, "rating": 5.0, "text": "Great place to do business", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "110265113727149957302", "name": "greg moon", "time": 1534947943625, "rating": 5.0, "text": "Quick Professional Service", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "110904217999499961843", "name": "LauraLSodomick", "time": 1528757923676, "rating": 4.0, "text": "GREAT", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "104906111088092554457", "name": "Alicia Lewis", "time": 1525917456094, "rating": 5.0, "text": "Great staff", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "114615353302736661352", "name": "Terry Sweatt", "time": 1524464204060, "rating": 5.0, "text": "Is equipment rental place", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "111940696046616493230", "name": "vince coston", "time": 1528172263619, "rating": 5.0, "text": "Very helpful and informative and friendly employees.", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "113362513574854916299", "name": "ALVIN MIDDLETON", "time": 1496864628401, "rating": 5.0, "text": "Great place to rent hard to find items..", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "104399004749146374749", "name": "Shane Hindle", "time": 1497815579289, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "116134951286012151131", "name": "Steve Coyle", "time": 1512867701003, "rating": 5.0, "text": "A joy to do business with", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "101409160790256415340", "name": "Cleophus White", "time": 1509484163794, "rating": 5.0, "text": "Excellent service also great communication", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "116177175962976691331", "name": "Dvd p", "time": 1492356515247, "rating": 4.0, "text": "They seem to have what I need when I need it. The prices are normal.", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "112490134267847768468", "name": "Billy Obryant", "time": 1431756339062, "rating": 1.0, "text": "Actions speak louder than word's.. I wouldn't go here", "pics": null, "resp": null, "gmap_id": "0x889a4dac0ace2e91:0x2517d03fc5c3068e"}
{"user_id": "110905917397350328047", "name": "Stacy Wiggins", "time": 1574516637543, "rating": 1.0, "text": "I am so disappointed with our experience with Pre Events. I spent an incredible amount of time planning each of the tiniest details for our wedding and sacrificed a lot of extras to make it happen financially.\n\nWhen I arrived to the venue the day of the wedding, I realized that Pre Events had delivered the wrong tables. I spent the first thirty minutes of my time there crying because I had spent so much time planning every detail and these tables looked absolutely nothing like the ones I had ordered. Unfortunately despite the efforts of my MOH and wedding planner, there was no time to have the tables swapped out. It was a hard pill to swallow but I married the man of my dreams that day and tried to let it go with promises that the company would do something to make it up to us.\n\nI have never been talked to the way I was talked to by the VP of this company, Mike. He said the mix up was our fault. BRIDES BEWARE. When you go to their landing page for tables, there are no names. You will only find the item name and detail if you click on each individual photo. Mike said the miscommunication happened when I chose the “farm table” available in the Auburn location but their sales rep in Birmingham thought I wanted the “farm table” in the Birmingham location. With Auburn being only a drive away, and also not even knowing about the other “farm table” I just assumed that the delivery fees included getting me the tables from Auburn.\n\nNot once did their sales rep mention that they had two tables by the same name. Not once did she try to clarify. And to have my wedding day tarnished, TO BE TOLD THAT IT WAS MY FAULT, was completely disappointing to say the least.\n\nWe spent around $6000 total with this company. And if I could do it all again I would’ve given every cent to a company that cares about its customers.\n\nTrying to let go of the fact that a big business wins again and this will never be made right.", "pics": null, "resp": null, "gmap_id": "0x88891ec16cf24d91:0x44584351917a1f47"}
{"user_id": "104275050076383755490", "name": "Colin Griffie", "time": 1579632421682, "rating": 5.0, "text": "Where I work.", "pics": null, "resp": null, "gmap_id": "0x88891ec16cf24d91:0x44584351917a1f47"}
{"user_id": "103359013265102997413", "name": "Kimberly Bivins", "time": 1615071339307, "rating": 5.0, "text": "My brother and his fiancé rented chairs for their wedding from Aabco. The prices were great and I picked them up on Friday. Upon arriving, the staff was friendly and pick up was simple! Thank you all!", "pics": null, "resp": null, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "112936788925810112892", "name": "Amanda Marie", "time": 1621265739651, "rating": 4.0, "text": "The kids loved the bounce house and snow cone machine.", "pics": null, "resp": null, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "110041125485551783926", "name": "Judy Eldridge", "time": 1582979057291, "rating": 5.0, "text": "Great place for rental items. Very nice and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "109340432896664807501", "name": "Lyn Fields", "time": 1563581566203, "rating": 1.0, "text": "Rented a \"mister\" fan for our sons birthday, and luckily we tried it out before using with our guests. Bc only 2 the nozzles worked properly and had valves.  The water was spraying directly into the fan motor.  So my husband did his best to fix it with no luck.  The fan itself was very beat up and barely a difference between low and high.  Upon returning the fan a manager told my husband only $10 of our $60 could be refunded.  Also admitted there were new mister kitsch the back but the guys didn't want to install them...", "pics": null, "resp": {"time": 1564763448786, "text": "Mrs. Fields, I apologize for the problems that you experienced. I have investigated this incident and I discovered that it was a new 'Mister Kit' that was on your fan, but unfortunately it was malfunctioning. Upon return of the fan we offered your husband a refund, but he said to charge him for the fan, \"Because the fan worked and we used it.\" Well, the 42 inch Fan rents for $50 and the Mister Kit addition is only $10 - hence the $10 refund. Again, I apologize to you for the malfunctioning Mister Kit.  I would love the opportunity to make it up to you by offering you a full $60 credit toward any future rental item. Mistakes happen, but we want to make it right with you!"}, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "110571335232585168031", "name": "Tracy Dixon", "time": 1573931004756, "rating": 3.0, "text": "A little  high for the quality of table and chairs I remted for baby shower. Stafg friendly and helpful just need to upgrade some equipment.", "pics": null, "resp": {"time": 1580152340724, "text": "Ms. Dixon, I apologize that the tables and chairs did not meet your expectations. We have some older and some newer tables and chairs, perhaps you received some older ones. The good news is that we’re are taking your advice and purchasing new tables and chairs. They will be here soon!"}, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "100617669746169720634", "name": "fun music mix creativeingenuity", "time": 1533315580055, "rating": 5.0, "text": "I have rented equipment and party goods from AABCO in the past and have had a great experience every time. I have rented chairs, popcorn machines, bounce houses, dunk booth, and even the duck pond game. Generally they are our go to for Birthday Party needs. I wouldn't hesitate to give them a call. One time we had a blower go bad on the moonwalk but we didn't know if it was the blower or the house so they brought us another blower and bounce house and even got the other one working (user error) then let us keep both houses for the weekend. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "117367444823801804367", "name": "G.A.Perkins1", "time": 1596131326317, "rating": 5.0, "text": "Sorry about that u are correct.", "pics": null, "resp": {"time": 1596121365134, "text": "Mr. Perkins, this review is incorrect. This is Aabco Rents Party and Event Rental. We did not work on your pump (we are not a repair shop - we do not do repairs on any type of equipment). We only rent items to people for events. Please remove this one star rating as it does not apply to this business."}, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "114055548748670593719", "name": "Katherine Dickens", "time": 1537405711050, "rating": 5.0, "text": "Katie and Susie are great....I had a very good experience with my rental of chairs....guys loaded and unloaded....great place for your rental need", "pics": null, "resp": null, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "114148795554684491100", "name": "Alex Shahid", "time": 1540911655196, "rating": 5.0, "text": "Great family owned business with excellent customer service.", "pics": null, "resp": null, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "116063269017392885493", "name": "Wallace Brown", "time": 1497200750166, "rating": 5.0, "text": "Everything I needed to make a party successful. Great and helpful staff.", "pics": null, "resp": null, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "106355579023585094587", "name": "Walter Readus", "time": 1560539569539, "rating": 4.0, "text": "Quick and fast service", "pics": null, "resp": {"time": 1564767196112, "text": "Mr. Readus, Thank you for the kind review. We hope to serve you again in the future."}, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "107513993754314588318", "name": "Vicki Wells", "time": 1499135382776, "rating": 5.0, "text": "Good for parties and remodeling houses", "pics": null, "resp": null, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "103099043042599768390", "name": "JOSHUA BROWN", "time": 1599879510862, "rating": 1.0, "text": "Prices are way too high. They quoted me a price of $30 on a roll of strapping that cost $10 . Alexandria mobile home & Rv supply was $15 on the exact same item. So you definitely want to go to Alexandria mobile home and Rv supply in Alexandria instead of this place.", "pics": null, "resp": null, "gmap_id": "0x888bc411ad8daafd:0xde4fce59065cb084"}
{"user_id": "117746835780924346047", "name": "trip kerr", "time": 1607381752510, "rating": 5.0, "text": "Great and understanding people and great service", "pics": null, "resp": null, "gmap_id": "0x888bc411ad8daafd:0xde4fce59065cb084"}
{"user_id": "107004861228804587213", "name": "Hillary Stepka", "time": 1583718750083, "rating": 5.0, "text": "Had to order what I needed (shutters) but super easy to get done and the service was great!!! The mobile home parts store closest to me in Ashville closed so this will be my new go-to place for what I need. Thank you!!!", "pics": null, "resp": null, "gmap_id": "0x888bc411ad8daafd:0xde4fce59065cb084"}
{"user_id": "114038101314202237053", "name": "Fran Castleberry", "time": 1599182402266, "rating": 4.0, "text": "Nice folks,got what u need.", "pics": null, "resp": null, "gmap_id": "0x888bc411ad8daafd:0xde4fce59065cb084"}
{"user_id": "113862830425141510750", "name": "Jerry Douglas", "time": 1579136483600, "rating": 5.0, "text": "Had everything we needed. A big thank you.", "pics": null, "resp": null, "gmap_id": "0x888bc411ad8daafd:0xde4fce59065cb084"}
{"user_id": "107459485962155245281", "name": "Dale Miller", "time": 1571186407621, "rating": 5.0, "text": "Found plumbing parts I needed at  Freedom Living Mobile Homes today.  The task will be easy now.", "pics": null, "resp": null, "gmap_id": "0x888bc411ad8daafd:0xde4fce59065cb084"}
{"user_id": "109418759551299062970", "name": "Vicky Caldwell", "time": 1573166493782, "rating": 3.0, "text": "A good assortment of mobile home parts.", "pics": null, "resp": null, "gmap_id": "0x888bc411ad8daafd:0xde4fce59065cb084"}
{"user_id": "101158480391032870084", "name": "Alabama Cowboy", "time": 1567189810108, "rating": 5.0, "text": "Very good and outstanding service had exactly what I was looking for", "pics": null, "resp": null, "gmap_id": "0x888bc411ad8daafd:0xde4fce59065cb084"}
{"user_id": "104080767952429816299", "name": "Andy Befort", "time": 1597960258457, "rating": 1.0, "text": "Way to expensive!", "pics": null, "resp": null, "gmap_id": "0x888bc411ad8daafd:0xde4fce59065cb084"}
{"user_id": "105818060327433945096", "name": "Johnnie Lynne", "time": 1562072764633, "rating": 4.0, "text": "Had the door that I wanted in stock", "pics": null, "resp": {"time": 1562073467132, "text": "Glad we had what you needed. Come shop with us anytime. Have a blessed 4th"}, "gmap_id": "0x888bc411ad8daafd:0xde4fce59065cb084"}
{"user_id": "106231310348855308142", "name": "Fannie Stockdale", "time": 1568553079907, "rating": 3.0, "text": "It was fair", "pics": null, "resp": null, "gmap_id": "0x888bc411ad8daafd:0xde4fce59065cb084"}
{"user_id": "110615985219548039466", "name": "Michelle A`", "time": 1530798298913, "rating": 5.0, "text": "Freedom Living Mobile Homes", "pics": null, "resp": {"time": 1538143105836, "text": "Hi Michelle thanks for a 5 star review we appreciate the time you took to review us."}, "gmap_id": "0x888bc411ad8daafd:0xde4fce59065cb084"}
{"user_id": "112840005545876474944", "name": "Belinda Hutchinson", "time": 1522557892410, "rating": 3.0, "text": "Too Expensive", "pics": null, "resp": {"time": 1530196183840, "text": "Sorry to hear, however we are always getting in new products and supplies and we are fairly priced for the industry. Hope to see you again soon!"}, "gmap_id": "0x888bc411ad8daafd:0xde4fce59065cb084"}
{"user_id": "116928566401249586659", "name": "Tamara Taylor", "time": 1509918826077, "rating": 4.0, "text": "A bit pricey because they have the Monopoly in Talladega", "pics": null, "resp": {"time": 1538143415088, "text": "Hi Tamara, Thank you for the review, we do our best to provide the highest quality products and services."}, "gmap_id": "0x888bc411ad8daafd:0xde4fce59065cb084"}
