{"user_id": "109916689784347725535", "name": "Kayleigh Storey", "time": 1583397523740, "rating": 5.0, "text": "My massage with Alex was amazing! I’ve had quite a few professional massages and this was one of the best I’ve ever had. She worked out my knots very well to the point that my husband even was amazed because he’s never felt my shoulders loose without knots! Scheduling was even very easy and they were able to get me in the following week. Thank you so much and I will be coming back!", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "116354866446786710157", "name": "susan vinson", "time": 1567276180550, "rating": 5.0, "text": "Alexandria did a great job on me. I feel much better and booked another appointment. I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "104433215674217732460", "name": "Brandon Thompson", "time": 1461085123187, "rating": 5.0, "text": "If you yearn for the days of customer service, then LumaLife Therapy is the massage and wellness center for you.  Upon arrival I was greeted by courteous staff in a cozy atmosphere that promoted relaxation.  In addition to traditional massage therapy the clinic offers modern services such as cupping, wellness coaching, and tailored health services.  The prices are reasonable, so much that its easy to be a return customer.  A massage shouldn't have to mean it's a special occasion, and with LumaLife Therapy it doesn't have to be.", "pics": null, "resp": {"time": 1464031033723, "text": "THANK YOU!!!"}, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "116854133841629679379", "name": "Rebecca Johnson", "time": 1582224680241, "rating": 1.0, "text": "So unprofessional. I cannot believe this place has so many 5 star reviews. They did not gove me a pleasant experience and I did not even receive a massage. I scheduled an appointment for a Massage using Groupon on a Saturday in\nMarch. Later I realized I had a scheduling conflict so I rescheduled for a different day. When I came in they had it scheduled for next month on the same day. I remember distinctly scheduling my appointment for this day this month because I TOOK THE DAY OFF for this appointment. I would not have scheduled an appointment incorrectly when I was specifically scheduling it for the day I asked off. So when I arrived they said that I could reschedule. So I tried to schedule it for a day I’m off so I don’t have to ask off again and apparently Saturday’s are only for members! How did I first schedule my appointment for a Saturday then? I’m not a member but I still had it scheduled! Please give me an explanation for this. However, Groupon helped me with my issue and allowed me to trade in my voucher. If I have any advice for anyone thinking about using this company. Don’t.", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "101069918487860297378", "name": "Joan Marie Stewart", "time": 1467976257616, "rating": 5.0, "text": "The Massage Therapists at LumaLife are extremely well trained!  After my recent 90 minute massage, my neck and back had never felt looser!  I stood taller. The massages are truly therapeutic.  I was so relaxed that I wished someone could have driven me home!  The massage table is extremely comfortable - the bedding adds so much to your massage.  The spa is very private, super clean and relaxing.  If you want to really treat your body and mind with relaxation and rejuvenation, then you need to rely on LumaLife for your massages.  Simply a cut way above and I have had massages all over the world and at world class spas and hotels.  At LumaLife, you are relying on true professionals who care about your massage making a difference for your body and mind.", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "102889741991977268434", "name": "Ilka Porter", "time": 1499881293215, "rating": 5.0, "text": "Amazing! Liz is the best. Hands down, the best. You'll never go to anyone else again. Update: Alex and Kallie are amazing too. Very attentive! I have a monthly membership and it's the best thing I've ever done for myself. And take some time to slow down and take advantage of the quiet room.", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "108032348692166068451", "name": "rebecca kidder", "time": 1469065710393, "rating": 5.0, "text": "The ABSOLUTE BEST massage in the world. I went to see Liz a couple years ago and haven't been to anyone else since. She is very consistent and thorough. Lumalife is the most relaxing atmosphere in such a cozy spot -- I've yet to stay awake for the entire session!", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "108441018713146683017", "name": "Eleanor Inge", "time": 1461085805543, "rating": 5.0, "text": "The LumaLife massage therapists have got the touch!!! So relaxing, so professional, such a beautiful studio! I love to buy gift certificates for friends and family! Liz is the best!! I have never had a better massage in my life! FIVE STARS!", "pics": null, "resp": {"time": 1464031024489, "text": "THANK YOU!!!"}, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "115993840741715517305", "name": "Kelley Lawson", "time": 1531170493234, "rating": 5.0, "text": "This was my first time here. Erika did an amazing job. Very inviting and comfortable environment. I definitely will be coming back!", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "100944248383150792370", "name": "Claudia Hughes", "time": 1592507545915, "rating": 5.0, "text": "Best massage therapy place in southern AL.", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "104036948436921870386", "name": "Kimberly Diane Rouse", "time": 1578071999244, "rating": 5.0, "text": "Kallie is the best!  Alex is fabulous too!", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "116728780677681046600", "name": "Arvid Gaston", "time": 1461796867931, "rating": 5.0, "text": "A very good massage that leaves me feeling that all my knots are gone. I like the pleasant atmosphere and nice people.  The best!", "pics": null, "resp": {"time": 1464030687261, "text": "THANK YOU!!"}, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "100948531205703291324", "name": "Margaret Stimpson", "time": 1469070018221, "rating": 5.0, "text": "Professional, knowledgeable and well trained, the people at LumaLife provide top notch services that leave you rejuvenated! I have had years of pain and the massage has provided much needed relief. Thank you LumaLife!", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "113777279946442251044", "name": "Rufus Rasco", "time": 1534985354539, "rating": 5.0, "text": "This was my 1st massage and my mosusa was Erika. Very professional and great at her job. Will be back there for my next one.", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "118110487018437017867", "name": "Donna Marie", "time": 1529265492773, "rating": 5.0, "text": "I LOVE this place! The attmousphere alone will have you feeling relaxed. Kallie and Alexandria are so kind and attentive. The massage is amazing. If you are looking at this review then you are probably looking for somewhere to get a massage, my advice, go to luma life you won't regret it.", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "103429751365309347453", "name": "Joan Dixon", "time": 1461796983246, "rating": 5.0, "text": "Liz is the best!  I've used a lot of massage therapists over the past 20 years for neck problems and I have found that Liz is exceptional.", "pics": null, "resp": {"time": 1464023029256, "text": "THANK YOU!!!"}, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "115883835106414986022", "name": "Josh Ridgdell", "time": 1461802463453, "rating": 5.0, "text": "It was literally the best massage I have ever had. I felt fully rejuvenated afterward. I highly recommend Lumalife!!!!", "pics": null, "resp": {"time": 1464023018515, "text": "THANK YOU!!!"}, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "106232952710105463383", "name": "Janie long", "time": 1461796874097, "rating": 5.0, "text": "Best massage EVER!!! Very professional and knowledgable staff. Will continue to go back for treatment and relaxation.", "pics": null, "resp": {"time": 1464023053245, "text": "THANK YOU!!!"}, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "109916734469183813639", "name": "wendie hock", "time": 1469070171397, "rating": 5.0, "text": "AMAZING massages, fanatastic mud wrap and love the ear candling! Just signed up for the Silver Membership to see them every month.", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "117504310818350968715", "name": "Martha Mc Neil", "time": 1461796914606, "rating": 5.0, "text": "Wonderful  massage ! Very professional ! Liz work her magic and leaves you relaxed and rejuvenated.", "pics": null, "resp": {"time": 1464023039837, "text": "THANK YOU!!!"}, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "100662667204662953482", "name": "Silvia Zimmerman", "time": 1546529775946, "rating": 5.0, "text": "Alexandria is awesome! Very relaxing massage!", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "106545933807692023897", "name": "Kelly Phillips", "time": 1461086136449, "rating": 5.0, "text": "Best stress reliever in town! Deep tissue massages are the best!", "pics": null, "resp": {"time": 1464031014054, "text": "THANK YOU!!!"}, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "110522402715582842998", "name": "Rebecca Praznovsky", "time": 1501696355346, "rating": 5.0, "text": "Wonderful experience X3!!! Customer service is fabulous, as well!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "117948997537015876122", "name": "John Blanton", "time": 1461089200021, "rating": 5.0, "text": "Love this place!  Great Massage.", "pics": null, "resp": {"time": 1464030995982, "text": "THANK YOU!"}, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "111760381692865080372", "name": "COASTAL PATIO", "time": 1461085065763, "rating": 5.0, "text": "The best massage ever!", "pics": null, "resp": {"time": 1464031044898, "text": "THANK YOU!!"}, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "107504352476116046148", "name": "Anton T", "time": 1582865573528, "rating": 5.0, "text": "Because it looks like a hotel", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "108467721608863606130", "name": "William Cooper", "time": 1583548450136, "rating": 5.0, "text": "Worked it out", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "104294380471744973049", "name": "Jewel Euto", "time": 1510257306414, "rating": 5.0, "text": "excellent massages", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "112756680073298868193", "name": "Jessica Clontz", "time": 1489714521554, "rating": 5.0, "text": "Awesome people", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0xfc2c3fb229e3c541"}
{"user_id": "118325674715462989507", "name": "Carrie Perry", "time": 1596756285500, "rating": 5.0, "text": "Excellent massage by a skilled professional in a safe, clean, and relaxing environment. I will go back again and again.", "pics": null, "resp": null, "gmap_id": "0x889a6de068f23bab:0xbf0f5876b1f93c73"}
{"user_id": "118088490754250322645", "name": "Kenny Cowart", "time": 1500758451434, "rating": 5.0, "text": "The best  in the business\n\nI have had many massages in the past but when I receive a massage from Pimnara she  is very professional and went straight to the problem using all of her techniques and relieved all my pain l feel much better now than ever before, I recommend Pimnara to all of my family and friends", "pics": null, "resp": null, "gmap_id": "0x889a6de068f23bab:0xbf0f5876b1f93c73"}
{"user_id": "111116938895707818024", "name": "Jarrod Smallwood", "time": 1628089505463, "rating": 4.0, "text": "Very nice massage, scheduling is a problem as I have consistently arrived at scheduled appointment and told they are very busy that it will be a later appointment time.. But, when you get in the massage is great!!", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "113661817999428310214", "name": "Shakeria", "time": 1613362949716, "rating": 4.0, "text": "I'm from Birmingham, al and every time I come to Huntsville I go here to get a massage. They're professional, kind, and I LOVE that they don't beg for a tip which makes customers feel more comfortable to give one.\n\nPro: is that you free hot stone included. Get techniques from the therapist. Will work longer on areas that you specify.\n\nCon: sometimes they get the stones when the session is almost over so you don't really get to enjoy it as much. I would work on that consistency if I had to provide any feedback.", "pics": null, "resp": {"time": 1613689031860, "text": "Dear Shakeria, thank you very much for your comments and suggestions. Next time if you come here, you can ask the masseurs first if you have any requirements, including the hot stones that stay longer. They will do it the way you like.  , Try to achieve your satisfaction and look forward to your next visit!"}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "108838294777568529591", "name": "CJ Donovan", "time": 1623455913887, "rating": 5.0, "text": "This was my first massage and I wish I caught the lady’s name she was wonderful. I will be going again soon.", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "100169918371893816447", "name": "Veronica Villa", "time": 1602125335634, "rating": 5.0, "text": "I have experienced the best message in town. Your knowledge of the oils as well as the ability to respond to my personal tensions and strains is exceptional! Will definitely come back. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "103066076422698975422", "name": "Abigail Morey", "time": 1602127441892, "rating": 5.0, "text": "One of the best massages I have ever had! Remarkable and very enjoyable. Came in feeling stressed and left feeling relaxed and happy! Thank you thank you!", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "117705950553304109049", "name": "Michael Lee", "time": 1602124733679, "rating": 5.0, "text": "I had a wonderful massage here in Rose Massage. It was very relaxing, really helped my back pain. Have booked a full session and looking forward to it. :)", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "110890066684195266828", "name": "Terrell Nixon", "time": 1580482509817, "rating": 4.0, "text": "My neck and back hurt so was looking to get it worked out.  Was a little skeptical after reading some of the reviews but thought would give it a try.\n\nI was pleasantly surprised.  I called.to make a appt for a other day as it was late.  They said they had a table open so I went on in.  The place is in a small strip mall but most of them here in Huntsville are.  Once you get inside looks like most small massage places.  I have included a few pictures from their website as they are accurate of what you actually see.\n\nThe lady was very nice and very professional.  She gave me a very relaxing massage.  I would have like a little more work on my neck but I did say anything as I wanted to just see what was their normal.  Only other improvement I can think of is she did not do the front of my legs at all.  Since I do alot of lifting and crawling around that is always a sore spot.  But over all I left feeling very relaxed.\n\nI did opt for the shower table as some recommended to get the oil off.  Again very professional and make sure \"everything\" that needed to be covered stayed covered.  Thought it might be awkward but the way she did it made it feel very professional so really did not even think about it.\n\nThe only real negative I can say is the same as of other peoples reviews.  They leave the door slightly open so anyone walking by can see in.  I understand from a security view but the walls are paper thin (like most every other place you get a massage) so you can hear everything so I do not really see that the pros outway the cons for doing this.  I could not really relax and although I really like this place it was the reason for 4 stars vs 5 stars.  It also would be the one thing that made me look somewhere else ☹.\n\nAlso one note since it came up in some of the other reviews.  No one pressured or even asked me for a tip.  I did give her one as she did a good job but she never asked.  The only thing they asked was if I would like a 4 hand massage (I only booked a 60 min) and when I said not tonight that was that.\n\nOver all a great place and so far I recommend it for a great relaxing massage if you dont mind everyone that walks by your door seeing in 🧐.\n\nWill update if I go back.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOA1FbHtCamDoFPPdQMGkYztFVFx2ThZNK83lYB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPzJSml9LE8V6WWeNTZyOMMsnBursNL_BGv5fqt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMNHV4HZpfhPDmPBQ9S1sMAcpQGLrFHWfO65-f7=w150-h150-k-no-p"]}], "resp": {"time": 1590289416354, "text": "Hello, Terrell. Thank you for giving us the opportunity and we are glad you like our services. We keep improving our management and services base on our customers' feedbacks. Thank you for your business and hope to see you soon."}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "113848142815553842767", "name": "andrew ausin", "time": 1600109087914, "rating": 5.0, "text": "Always very nice and courteous, I always call ahead and can get in same day. I’ve gotten the standard massage every time and they always help my back feel a lot better!", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "114489989722112835516", "name": "Jack Smith", "time": 1570119675842, "rating": 1.0, "text": "This was not a good experience at all. I thought I would give them a try. Opted for the 4 hand massage as it was supposed to be their best. The whole time door left open so one of the masseuse could go and deal with people coming in dealing with them at my door, and answer the phone. The 2 ladies talked the whole time to each other like gossiping, but couldn't understand them. The lady answering phone and stuff wasn't even in room half of the time. She finally just brought the phone in with us and just started answering it there. As I was leaving the girl giving the massage ask for tip. I thought well she did give pretty good massage herself and tipped her. Then she fussed saying it was 2 of them I needed to tip the other lady to! And kept insisting! I just left, $120 massage and $20 tip. Save your money and go elsewhere.", "pics": null, "resp": {"time": 1590272689788, "text": "Hello, Jack. Thank you for your feedback. We appreciate our customers' feedbacks because that’s how we can improve our management and services. We do have rules like no talking during massage sessions, no asking tip after services etc. We now have highly trained therapists and and we will prevent these happening again. Thank you. We try to create a relaxing and comfortable atmosphere for our customers. That’s how we gain so many loyal customers. Thank you."}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "118105687681576768947", "name": "Prodigal Son", "time": 1596740360131, "rating": 1.0, "text": "Real bad experience I had with these people first I called 20 mins before coming in I was told to do so once I get to both locations they told me they made a mistake and that they were closed. BAD BUSINESS", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "114878690611147766973", "name": "Gary Counts", "time": 1547070213555, "rating": 5.0, "text": "This location bis conveniently located behind Whole Foods off Memorial Parkway.  They have a useful online web page for making appointments.  There wasn't any wait.  The quality of the service was quite high and they very generous with the time.  The price is reasonable and they off a hot towel after the massage.", "pics": null, "resp": {"time": 1556402224709, "text": "Dear customers, thank you very much for your feedback. We hope every customer will be satisfied with the service, hope to see you again"}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "107588215146063683385", "name": "Cole Joe", "time": 1524527623238, "rating": 5.0, "text": "Great location! Love the new system with the iPad. Tranquility room is nice and I had the best massage of my life with Jesse! I needed to focus on my neck and shoulders and that's exactly what we did. Thoroughly enjoyed my visit and can't wait to come back", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "100688449388526103103", "name": "Rell Global", "time": 1598476760598, "rating": 1.0, "text": "I called to schedule an appointment over the phone a couple of times and got hung up on. I just asked if they take walk-ins..", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "117394848795114473365", "name": "Daniel Ramos", "time": 1567111630259, "rating": 5.0, "text": "Anna was amazing! I’ve already let her know I’ll be back shortly! Very professional and made me smile and relax!", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "101280566979106369866", "name": "Michael McCorvey", "time": 1544589469651, "rating": 5.0, "text": "Tonight was my first time going and it was great! My masseuse took care of my problem areas and made sure the experience was enjoyable the entire time. Definitely going back!", "pics": null, "resp": {"time": 1556402238182, "text": "Dear customers, thank you very much for your feedback. We hope every customer will be satisfied with the service, hope to see you again"}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "116045986498584128866", "name": "Jersey Mara", "time": 1524526835635, "rating": 5.0, "text": "Just went today and the massage was great. They ask you if you have any areas that need to be focused on instead of giving you a basic massage. I highly recommend.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM1r1wfYbQgfQ0ogCML9SiNr21laOqiqfcofcrH=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "109460631276443145530", "name": "Een angle", "time": 1525836987111, "rating": 5.0, "text": "This place is a gem! I started going here after my spin instructor told me about this place.  I can get in almost immediately when I call.\n\nThey don't speak english very well but it doesn't matter.  They have a 60 min $60 special and you can't beat that.  The massage therapists always ask how much pressure you want, and if you want deep- some of them go DEEP... so make sure to let them know.\n\nI don't want to tell you who I request because you will steal them from me.... Okay... Hidy and Sheliy are who I really like.  I have used others and they are great too but these two really know how to get into my target areas.\n\nSide note: when they leave you alone for a few min don't get scared (I did the first time) but they are getting hot towel to remove the oil.  Just wait it out...\n\nEnjoy!!", "pics": null, "resp": {"time": 1527364835788, "text": "Thank you for your evaluation of rose massage. We will always provide the best Asian service for every customer."}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "109393312889510791773", "name": "Gene Peppers", "time": 1568629813366, "rating": 5.0, "text": "Very nice people, Great Massage, Reasonable Prices", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "106360557388026069862", "name": "Mongo Slade", "time": 1580434494663, "rating": 4.0, "text": "Would give a 5 but begged for a higher tip", "pics": null, "resp": {"time": 1590291128348, "text": "Hello, Mongo. Thank you for your feedback. I am the manager of Rose Massage. We never allow therapists to ask for more tips and we will dismiss the therapists who get three warnings. We apologize for what happened. Thank you for your business. We now have well trained professional therapists will offer the best customer service!"}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "108100791045573897721", "name": "Bill Collins", "time": 1536199981877, "rating": 1.0, "text": "Don't waste your time.", "pics": null, "resp": {"time": 1590289027977, "text": "Hello,Bill. Thank you for your feedback. We appreciate our customers' feedbacks because that’s how we can improve our management and services. Please let us know specific what was the wrong with your service. Feel Free to contact us anytime. Thank you."}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "118059502858276407216", "name": "Joseph Kalsic", "time": 1565141352118, "rating": 5.0, "text": "Excellent and very professional.", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "113438411969094385186", "name": "T", "time": 1544560123938, "rating": 1.0, "text": "Rushed service....not going back", "pics": null, "resp": {"time": 1590289248106, "text": "Hello, dear customer. Thank you for your feedback. We keep improving our management and services base on the customers' feedback. In order to prevent rushed services, we time every customer's services to make sure there is no short for time. Thank you."}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "104046406647023113419", "name": "Jeremy Alexander", "time": 1538413335790, "rating": 5.0, "text": "It was great!", "pics": null, "resp": {"time": 1556402248760, "text": "Dear customers, thank you very much for your feedback. We hope every customer will be satisfied with the service, hope to see you again"}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "109604214495856757315", "name": "Traci McDaniel", "time": 1624501001294, "rating": 5.0, "text": "My friends and I went for a girls day. We all received the hour massage with 15 min foot reflexology...it was so amazing, we talked about it all weekend! I've traveled all over the place for good massages. The resorts are expensive and very disappointing! Tao Massage is the only place I will ever go from now on! Mike and his staff are so nice, and very well trained. They know where your hurting muscles are and are willing to do whatever it takes to make you comfortable and relaxed. I'm from Tuscaloosa, and went last week for the best massage of my life! Yes, its worth a 45 min drive, and I can't wait to go back in a couple of weeks! Finally, a place I can afford and I absolutely love!! Thank you Tao Massage!! See you soon!! - Traci McDaniel", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "104216575957484547608", "name": "jackie foley", "time": 1624975129608, "rating": 5.0, "text": "The owner mike is so nice and professional. Only had one issue and it was quickly resolved. Wendy is the best.", "pics": null, "resp": {"time": 1624983973802, "text": "Thanks Jackie\nHope we see you soon ."}, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "114897105072564236289", "name": "Timmy Dixon", "time": 1619740202782, "rating": 5.0, "text": "This was the most beautiful massage of my life. The ladies that work there were absolutely phenomenal. The aroma and environment of the place was off the charts some may consider the best massage place in Central Birmingham.", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "116689328519469215999", "name": "Ray Guh", "time": 1623189075031, "rating": 5.0, "text": "My husband & I went for a couple massage for 90 mins for $120. Long amazing deep tissue massage. It was raining afterwards & he walked us out with an umbrella . Very nice & friendly. I would definitely be returning.", "pics": null, "resp": {"time": 1623190635337, "text": "Thanks Ray: see you next time ."}, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "107099916937017479351", "name": "Laura Nichols", "time": 1614044939332, "rating": 5.0, "text": "My massage today at Tao was superb!  My masseuse was Simon, and he gave me the most thorough back massage I've ever had.   I also complained of discomfort in my piriformis muscle, and he did his very best in an effort to work out the tightness in this muscle.  I was super pleased and bought a package of ten massages for my husband and me.", "pics": null, "resp": {"time": 1614051934997, "text": "This is Mike , owner of Tao massage Thanks laura .glad you like our massage .we will continue to do our best to help our customers ."}, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "105132500194082968652", "name": "Lucie Watkins", "time": 1614478796828, "rating": 5.0, "text": "Such a great massage! The place I normally go for a massage canceled on me, so I called Tao Massage and they were able to get me an appointment the next day. I told them about my lower back pain and having to carry my baby around a lot. It is not a fancy place by any means, but after my massage, my back no longer hurt and I was walking better as well. I will definitely be back!", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "115171811373289303851", "name": "Kimberlee King", "time": 1621199080754, "rating": 5.0, "text": "Fantastic massage . Strong hands, and offers many wellness choices. Very affordable and relaxing", "pics": null, "resp": {"time": 1621258111895, "text": "Thanks Kimberlee. See you next. Time ."}, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "109699517128010298019", "name": "Paul Filipowich", "time": 1610263177930, "rating": 5.0, "text": "I wanted to leave another review for Tao Massage Parlor on HWY 280 Birmingham Al. I've been a client for several years and I have been extremely pleased with my services and the owner Mike, he is very sensitive to your massage needs and he will make sure someone will get you in one of his 3 different massage parlor's in Birmingham. Mike is very knowledgeable in massage therapy and with a pandemic going on with the cornavirus, I was very hesitant in going to get a massage but Mike reassured me and answered all my worries, the therapist take their own temperature and shows you their temperature,  they also take the clients temperature, hand washing, rooms and tables are sanitized along with mask being worn by both the therapist and the client. The Tao location is very clean with a comfortable atmosphere, they are all very professional. I can't say enough about Simon, he is one of the best massage therapist I've ever came in contact with,  he's very professional, covers your entire body head to toe, applies the right amount of pressure and will adjust according to your preference, he's very knowledgeable about the anatomy of the muscles and will apply the amount of pressure and hits all the pressure point's, their prices can't be beaten, I always get a 3 hour deep tissue massage and I'm never disappointed, the money is worth every penny. I work in the medical field and have herniated discs with sciatica, I'm always on my feet and Simon knows every spot to hit, his hands are magical and it de-stresses me.I recommend any of Mike's parlor' s if you get a chance to go ask for Simon he is awesome and you couldn't ask for anyone better than Simon. Mike has a great business, I don't think I've ever had to make an appointment they say come on in and they will get you seen by a therapist, Mike will always do his best to accommodate you and your schedule. 5 star service!!!", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "111803018205095608249", "name": "James", "time": 1594923555072, "rating": 4.0, "text": "The massages themselves were very satisfying. My fiance and I felt so much better afterwards. The tension in our backs and in my legs were eased off. Rating 4 stars out of 5 because the massage therapist worked my neck too hard and made it really sore for days. But everything else was worth it. The price was good for the both of us, and they got us in the same day that the appointment was made.", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "117293895856128094933", "name": "Bo Shin", "time": 1612102927601, "rating": 5.0, "text": "Absolutely the best massage place I've ever been to!  And you can't beat the price!", "pics": null, "resp": {"time": 1612155682919, "text": "Thank you Bo Shin. Hope we see you soon ."}, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "103302425448941787194", "name": "PrincessJolly30", "time": 1619051737439, "rating": 5.0, "text": "Oh my God.  The best in Birmingham, al", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "113912109752245430660", "name": "James Buird", "time": 1593781644669, "rating": 5.0, "text": "This was my second time getting an hour massage.  It was awesome! I was asked if I wanted a hard massage & I said yes.  Well worth it! She got up on my back & used her knees which was unbelievable.  I'll be back again for more!", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "100830374699795647301", "name": "Aaron Alexander", "time": 1590457171892, "rating": 5.0, "text": "I’ve been to Tao Massage twice now,  and both times, the service and massage was amazing. Both experiences, I called the same day and they were able to accommodate us. I enjoyed a full body couples massage on my first occasion and left feeling brand new!!!  BEST MASSAGE IN THE BIRMINGHAM AREA!!!", "pics": null, "resp": {"time": 1590534398671, "text": "Thanks\nCome back see us again ."}, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "100835908811097797638", "name": "Crystal Watkins", "time": 1566786961399, "rating": 5.0, "text": "My husband and I called for a last minute massage. This was our second visit to Tao. No frills here like higher end places but quality of massage for the cost is top notch. Couples room was too small so we went in separate rooms which was fine with us. Both times have been best massages we have ever had. Very professional staff and great massage. Highly recommend!", "pics": null, "resp": {"time": 1566788264149, "text": "Thanks crystal"}, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "107268228627825099212", "name": "Joanna", "time": 1622773512219, "rating": 5.0, "text": "Always a great experience.", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "101507376688467644295", "name": "Timothy Gossett", "time": 1591458949947, "rating": 5.0, "text": "This was by far the best massage I have ever had 😁 they accommodate your needs.  Can come to you.  I have only positivity to speak about my experiance.  Eva was my therapist and she did an AMAZING job. Very professional and didn't skip a beat. I'll definitely be calling Yao massage again.", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "100313256567742371825", "name": "Tia K", "time": 1601078032960, "rating": 5.0, "text": "My 60 minute deep tissue massage was amazing! Will be back in a couple of weeks!", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "106925868312040152126", "name": "LaWayne Perkins", "time": 1600118854777, "rating": 5.0, "text": "Wonderful massage, Summer did what I asked with light pressure just so I could get a relaxing massage and it was perfect, she was very sweet and fun personality. I will be back.", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "103070821526506978452", "name": "Thu Hehe", "time": 1573094111465, "rating": 5.0, "text": "My husband I have been visiting here 1 or 2x a month for chair reflexology in the past 4 months. We never feel rushed or have to wait if we make an appointment. The rates are great and the team does a great job!! We always leave feeling very relaxed. Highly recommend! Everyone is very nice!", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "111359539578394809658", "name": "Ralph Leonard", "time": 1556152448846, "rating": 5.0, "text": "I needed to loosen my back for my golf league last night. I walked in without an appointment and I was please to see the co-owner there, she was very accommodating and professional and she was able to get me a massage right away. Best massage I ever had and thanks to my great massage and stretching I was able to hit the golf ball an extra 15 yards.  I will be back and I am so pleased that the co-owner accommodated my urgent needs. She is phenomenal and an asset to her business.", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "105091983476587760745", "name": "Nancy Davis", "time": 1622425372069, "rating": 5.0, "text": "Mike,\nAfter over a year of our pandemic mode, our daughter was able  to visit us and asked if we needed anything?  We had the most wonderful massage! Our time here was so special! A long awaited healing! Truly grateful for your professional massage therapist. Thank you,", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "112534692706877378144", "name": "Lori Cox", "time": 1566774470500, "rating": 2.0, "text": "Massage was lacking. Tons of oil. Same stroke over and over. Obvious knots were ignored. Had a couples massage and my partner rated the same way. Very disappointed. Cost was reasonable for a massage and not an oil run down. Didn’t get a massage. Felt like I wasted money and 60 minutes of my life.", "pics": null, "resp": {"time": 1566778966867, "text": "This is owner Mike.\nI am so sorry what had  happened Lori.\nwe have  shorted people recently and get two people help temporarily. I thought they are  ok which  they are not. I diffidently will have this corrected. would you please give us second chance. I will give you 4 free one  hour massage to come back  to see  our  improvement.\nI promise you will be happy.\n\nThank you again for your feed back."}, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "100920066144302968290", "name": "REBECCA TAYLOR", "time": 1573875522378, "rating": 5.0, "text": "I had a wonderful experience here. I had a great massage and the owner was extremely kind. I will definitively be returning.", "pics": null, "resp": {"time": 1573879347248, "text": "Thanks Rebecca. See you next time."}, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "114172047806322372901", "name": "Yiyun Zhang", "time": 1590530735531, "rating": 5.0, "text": "better skill than massage envy. great experience.", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "107427481158999687845", "name": "Crystal Davis", "time": 1621651930249, "rating": 3.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "100214858365194661703", "name": "John Wymer", "time": 1587486958428, "rating": 1.0, "text": "Good luck getting an answer on the phone or via website quote request. SMH", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "101245479083329145622", "name": "Freestyle Reese22", "time": 1538237360967, "rating": 5.0, "text": "If you want to feel like a new person come here. They take their time and will focus on the areas you ask the most. I just tell them whole body but they can feel where you are most tense. I love this place. Prices are very reasonable. I’d take this over Massage Envy all day!", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "102744301144810096656", "name": "Michael Ball", "time": 1548642319752, "rating": 5.0, "text": "I took the wife and treated us to a couples massage tonight and it was the best massage I have ever had.  I am sorry that I did not get the masseuse name as I plan to return again!  The wife was also very pleased!  I highly recommend this place!", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "109627125966157106208", "name": "Elena GRAFOVA", "time": 1551805247783, "rating": 5.0, "text": "Here is the best place to go and have a very professional massage! Highly recommended! Especially if you need to get a deep tissues or a sport massage.", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "103901933823995382983", "name": "Andrekia Forbes", "time": 1551680896464, "rating": 1.0, "text": "My boyfriend and I went here after looking at the reviews online so we booked an appointment thinking that we were going to have a nice relaxing day, definitely didn’t turn out that way. The ppl were nice but the woman spoke very little English, the room we were in was SUPER small the ladies barely had enough room to work. But the worst part about the whole experience they don’t have a receptionist, so the  masseuse had to stop SEVERAL times to answer the phone and talk to walk in customers. And my back hurts worst now than before I went!! WILL NOT BE RETURNING!!!!!!", "pics": null, "resp": {"time": 1553013797618, "text": "My name is Mike, Owner of Tao Massage.\nI am so sorry what happened. And also thank you for the feed back.\nwe have made some changes and continue make changes after your feed back.\nI am going to keep the receptionist in the front only answering the phones and receiving  customers. I am also increasing the size of the couple room soon.\nwould you please come back to see our improvements? I will offer your two couple massages for free. I would really appreciate it if you would give us a second chance and have the review removed.\nThank you."}, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "109656465156784750923", "name": "Global Direct LLC", "time": 1556482496992, "rating": 5.0, "text": "My therapist was fantastic and worked on my tight muscles due to traveling. The environment is serene yet friendly. I will be back.", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "113290984210864670070", "name": "Jennifer Yee", "time": 1544388971924, "rating": 5.0, "text": "My husband and I were in town for the weekend and decided to get 1-hour massages. This was the first place listed on our Google search. I got a $60 shiatsu style (no oil) and my husband got a $70 deep tissue sports style. We were both really happy with our massages and the friendly service. Wish we had a place for this value back in Atlanta! Facilities are simple but clean and warm. Will definitely be coming back next time we're in town.", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "105834618485824413057", "name": "Darrell Garner", "time": 1619663905633, "rating": 5.0, "text": "Great hands", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "107799897542928286706", "name": "Amanda", "time": 1515544212606, "rating": 5.0, "text": "My husband and I have visited twice and absolutely LOVE the hospitality and relaxing massage therapy Mike and his staff offer. We are definitely going to be regulars! The services are very affordable and the therapists are great at listening to and caring for your needs, aches, and pains. Enjoy!", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "101390723436680484976", "name": "Kim", "time": 1558534729715, "rating": 5.0, "text": "Awesome deep tissue massage, the best I've ever had, massage therapist dosen't speak much english, but reception does, low cost and accommodating. If you are looking for something romantic with a couple don't go there, there are no frills, but, if you are looking for a great massage, this is it, going back!", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "110161257251870608041", "name": "Sylvester Steward", "time": 1561234179255, "rating": 5.0, "text": "Good customer service and wonderful massages. I will definitely be going back in the near future.", "pics": null, "resp": {"time": 1561235039854, "text": "Thanks Sylvester. Glad you enjoyed the massage. Looking  forward to see  you again."}, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "110357122786107633119", "name": "Jared Havens", "time": 1515857739259, "rating": 5.0, "text": "Great experience! My wife and I have been going together - perfect opportunity for us to relax and let stress melt away. The staff has gone out of their way to be friendly and accommodating!", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "117683184607508508493", "name": "Chase Beason", "time": 1549339744654, "rating": 5.0, "text": "Best deep tissue massage I have ever had! Will definitely continue to use this place.", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "114202598589570567490", "name": "Jameka Merritt", "time": 1577022949165, "rating": 5.0, "text": "Best full body massage ever!", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "105032449347374296711", "name": "david mesa", "time": 1545065057784, "rating": 5.0, "text": "This was the best massage place by far! Sofia was very professional and nice. 😁👍", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "106875946680873195529", "name": "Sanh Truong", "time": 1536626648691, "rating": 5.0, "text": "Coming from Atlanta this is one of the best massage I had in Birmingham. There was come communication issues at first. But when he started working. It was over. Worked out some of my most troubled spots", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "106478215701694837071", "name": "Stephanie Ford", "time": 1590680668589, "rating": 5.0, "text": "Wonderful massage and reasonable prices. Ask about their special, always a good deal.", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "117784168611083460129", "name": "Crystal Parker", "time": 1539778165670, "rating": 5.0, "text": "Have chronic headaches Mike did a accupressure massage and I also had Kim give me a full body, left feeling awesome and was treated great, going back this week.", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "114470612977155998531", "name": "My Business", "time": 1519093771030, "rating": 1.0, "text": "My huband and I called and booked an appointment for 1:15. When we are arrived a little after 1 (We were early cause we for the first time in a long time did not have kids for the day so we were ready to treat ourselves) they told us they let walkin customers do a 90 minute massage and asked if we could COME BACK!!! And it wasn’t in a little while. They asked me to come back in 3 hours!!! My appointment was at 1:15 and they wanted me to come back at 4. When I told her I didn’t want to because I live 30 minutes away and that would be pointless she just kept saying I’m sorry come back at 4. She had no care in the world of what she did. The first time going there and it was so awful!! Never again. How can you just let a walk in go knowing you have an appointment scheduled. Simply unacceptable.", "pics": null, "resp": {"time": 1520624801407, "text": "Kaitlyn, I am the owner. Please accept my apologies for the mix up that happened with your appointment. I have addressed this with the staff. I am sorry that this happened..\n\nIf you will allow us to make this right, I would like to offer you and your husband both two complimentary massage sessions. Please contact me and I will get it taken care of for you and again- please accept my apologies regarding your appointment. My number is 205-222-0124. Thank you."}, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "114684619365727929536", "name": "Victoria Fields", "time": 1550867602382, "rating": 5.0, "text": "They take special care of their customers and have great services for massages and couple's massages. I will return again most definitely.", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "105042443581313689199", "name": "Ryan Covington", "time": 1523129644629, "rating": 5.0, "text": "This is a great massage with good prices. Very relaxing environment, would recommend", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "111590816308244712239", "name": "William Robbins", "time": 1537646015059, "rating": 3.0, "text": "Nice environment, technique was a little lacking, very little pressure should be applied directly to the spine. So stepping on in is not ideal technique.", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "100471944064888444957", "name": "christina castorini", "time": 1511052642437, "rating": 5.0, "text": "One of Houliang's foot reflexology and massage locations; the original is in Vestavia and the other is on 31 in Hoover. Great service, as well as great prices and I always leave feeling like a wet noodle (aka amazing and relaxed)!", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "107860430238720549188", "name": "Maranda Benson", "time": 1598192169072, "rating": 5.0, "text": "The masseuse was very professional and performed with mask on", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "112303334181662070921", "name": "Marshall Nichols", "time": 1551231315438, "rating": 4.0, "text": "Friendly staff and good massage.", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "109745231240852552932", "name": "Andrew Gamblin", "time": 1544006520978, "rating": 4.0, "text": "Typical experience of what you would expect from an Asian massage place. Very professional but only a descent massage.", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "116382167691002772240", "name": "Brandon Crosby", "time": 1593233597331, "rating": 5.0, "text": "Great masseurs", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "117097590346646117872", "name": "Cameron al Shaqar", "time": 1539207465329, "rating": 5.0, "text": "Great massages responsible prices", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "114509920475532816566", "name": "Kalista Alexander", "time": 1520026477802, "rating": 5.0, "text": "Excellent!!!!!! Casey was amazing!!!!", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "105022598687108213128", "name": "ZACHARY LENNIX", "time": 1527829377405, "rating": 5.0, "text": "AWESOME!!!", "pics": null, "resp": null, "gmap_id": "0x888917ae03e50bcd:0x5719a7c375d783e0"}
{"user_id": "107860916702283371455", "name": "Primetimesha", "time": 1623261852346, "rating": 1.0, "text": "Made an Appointment For A Combo Massage an Booked way ahead of time which was 6-2-21 for an appointment for 6-9-21 which is today just to give him my name an say I booked Online For Him To Say No You Don't which was Very Rude! I Showed him Where I Booked online an mind you I had been getting confirmation emails saying it was Confirmed ‼️ He Didn't try to reschedule me just said sorry it's best to call an sent me on my way!", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "102440902724397360869", "name": "G’Renee (G'Renee Luxe Beauty)", "time": 1623614851455, "rating": 1.0, "text": "Booked online on their website, received confirmation email the day of booking a week ahead. Received another confirmation email the day of appointment. Drove an hour for them to say they don’t have my scheduled. Showed the emails that I have received the day of and all I received was a sorry. Barely can’t understand the broken English that was spoken. Very poor communication skills and poor receptionist/customer service!", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "111844579957274088446", "name": "Mengshi “Victoria” Pei", "time": 1621958397007, "rating": 3.0, "text": "I made an appointment online. Confirmed the day before the appointment. Then, 10 minutes before my appointment, as I was about to drive to the place, they called, and after a few minutes, I finally understood the girl, saying they don’t have the availability at the time I booked and told me to go an hour later. I never got to get my massage 😟", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "113476985766885355043", "name": "McArthur Ray", "time": 1617500627114, "rating": 5.0, "text": "The masseuse I had was very talented and skilled and her massage techniques! I left feeling refreshed and recharged. Thanks again and I look forward to my next visit.", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "103027278622766354361", "name": "Kimmie Stewart", "time": 1610472670749, "rating": 4.0, "text": "Very quick and professional service. No wait time at all. Only 4/5 stars because I had a really hard time understanding what they were saying to me. Wish the communication skills were a bit better but great service otherwise!!", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "106080292934758404676", "name": "Jacob Stewart", "time": 1610814983674, "rating": 5.0, "text": "Second time going and I have to say the workers are very professional and know exactly where to massage. The prices are also really fair. Availability is great, only had to book one day in advance.", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "104844030788851609622", "name": "Earnest Bolton", "time": 1615894696044, "rating": 4.0, "text": "Great prices and the staff was very good", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "116427260303633216438", "name": "Ethan Rayhorn", "time": 1606160983252, "rating": 5.0, "text": "I made an online appointment for the same day and it was confirmed within 5 minutes. I got a 90 minute deep tissue and hot stone massage and it was wonderful. You get a FULL 90 minutes. There was a variety of techniques that I hadn't experienced before and it worked amazingly well on my sore back and shoulders. I love that they are open late too, so I can come in after work. The prices are very fair, and I will not hesitate to come back! Most importantly, I felt like the facility was clean. They wore masks, cleaned the table and headrest with alcohol, changed the sheets and washed their hands. They ask you to wear a mask when face-up on the table. I would want a massage therapist to be clean any time, but especially with covid, it was nice to see that they were doing things right. They also had their alabama LMT licenses at the front counter which is always nice to see when going to a new place and wanting to make sure it is legitimate.", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "103682946384522194561", "name": "Laurie Waddell", "time": 1608264078798, "rating": 5.0, "text": "They  are Awesome  .Please  try the  Hot  Rock\nI will be back.", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "108175664566368524073", "name": "Huizhen Zhong", "time": 1607207102984, "rating": 5.0, "text": "Good choice. The ladies are very nice and helpful!", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "110774391430616455511", "name": "Deanna Poe", "time": 1577767590255, "rating": 5.0, "text": "Best massage ever! Not fancy, didn't have to book appointment, no paperwork required. Just good deep tissue and hot stone massage experience. Will be back!", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "113736822787196411404", "name": "Rachel Bagley", "time": 1581893390294, "rating": 5.0, "text": "I have had many massages in my life. I used to work for a different massage clinic. This was, by far, the best massage I ever had. The prices are excellent, the people are kind, and the service was exquisite. 10/10 will return.", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "117663902483672250593", "name": "Leonard Phillips", "time": 1614832668689, "rating": 5.0, "text": "Was very relaxing", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "101205521817803483271", "name": "Todd Beckner", "time": 1601670958181, "rating": 5.0, "text": "Excellent deep tissue massage!", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "115619936753389280257", "name": "Lijun liu", "time": 1531431922008, "rating": 4.0, "text": "I enjoyed my massage there. I was very comfortable, relaxed, and it felt good. It was not to soft, but had the right kind of pressure applied for me. This was thanks to my masseuse Sunny .I felt incredibly relaxed after my massage.", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "103142325114498153957", "name": "Eric Takenne", "time": 1534113143124, "rating": 5.0, "text": "I enjoyed my massage there. First time to have massage with hot stone, very comfortable, relaxed, and it felt good.\nI felt incredibly relaxed after my massage.\nI will for sure visit again.", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "116454539570831162546", "name": "Jamie Wiseman", "time": 1533731395643, "rating": 5.0, "text": "Awesome professional massage! The hot stones were amazing. Highly recommend this place.", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "117955437576990137473", "name": "BigPoke Gaming", "time": 1589676953562, "rating": 5.0, "text": "Been having horrible pain in my back but now I feel like a new man", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "109628429482528803176", "name": "junxiu lyu", "time": 1531166201503, "rating": 5.0, "text": "They walked on my back and stretched my entire body, very professional massage, very relaxed, fair price, courteous staff, will soon come back and recommend it to anyone.", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
{"user_id": "108068757067044036423", "name": "ramona soper", "time": 1566321717349, "rating": 4.0, "text": "Relaxing", "pics": null, "resp": null, "gmap_id": "0x88861db3416f46fb:0x73cae4f8c496652c"}
