{"user_id": "107373578747965377165", "name": "James McCrary", "time": 1626720129291, "rating": 5.0, "text": "Very professional and detail oriented!", "pics": null, "resp": {"time": 1627425276565, "text": "Thank you for your feedback, James. Best wishes."}, "gmap_id": "0x88892324714bf263:0x39d3fc7f8e29f644"}
{"user_id": "110229001605108355798", "name": "Matt Trombley", "time": 1611841653569, "rating": 5.0, "text": "I've known the owner, Cory, for several years and I can say with complete honesty that he is a man of integrity, hard work, and resolve. What this would mean to any Footprints customer is that they would benefit from an honest estimate, timeframe for work, and commitment to see it through. I can't think of better traits for someone working on my home, and so I would highly recommend Cory to anyone looking to have a flooring project completed.", "pics": null, "resp": {"time": 1612201570763, "text": "Hello Matt, thank you for the five-star review of our flooring installation business and your incredibly kind words!"}, "gmap_id": "0x88892324714bf263:0x39d3fc7f8e29f644"}
{"user_id": "108127912775681228903", "name": "Matt Elsner", "time": 1612209368300, "rating": 5.0, "text": "I have been fortunate to work with Cory on a number of projects, and I will go out of my way to continue to work with him when I can.  Honesty and integrity are two traits that you can expect from him.", "pics": null, "resp": {"time": 1612374374237, "text": "Hello Matt, thank you for the review! We appreciate your kind words."}, "gmap_id": "0x88892324714bf263:0x39d3fc7f8e29f644"}
{"user_id": "116739485628185613042", "name": "Shelley", "time": 1623972877383, "rating": 5.0, "text": "I cannot say enough great things about Cory and his installation crew. The entire process, from start to finish, was amazing. Everything was thoroughly explained, I was kept up to date, and there were no surprise fees. The installation team far exceeded my expectations. They were very friendly, efficient and highly skilled. They cleaned up everything before they left and made sure I was happy with everything. I had put my kitchen floor project off for a long time because I can't stand having strangers working in my home as it is so stressful. This company put me at ease and I am so grateful I gave them a chance. My new floor is beautiful! If you are hesitant about having strangers in your house and need a great job at a very fair price, call Cory!", "pics": null, "resp": {"time": 1624295952281, "text": "Shelley, Thanks for the kind words! We are happy to read that our team has been able to provide exceptional service for you. As always, our team is avaible if you need anyhting else. Best wishes."}, "gmap_id": "0x88892324714bf263:0x39d3fc7f8e29f644"}
{"user_id": "105136136738780715928", "name": "Martha Eskridge", "time": 1627310068803, "rating": 5.0, "text": "We used Jubilee to replace our old worn out floors and they did such a great job. Blair went above and beyond to help us find the perfect color and style. Everyone was so professional and hardworking to make sure we were satisfied. Would definitely recommend Jubilee Flooring, especially Blair.", "pics": null, "resp": null, "gmap_id": "0x889a4179ec84b5d7:0xfbca1ab891acf261"}
{"user_id": "111209572351090041497", "name": "Sean Wojtowicz", "time": 1602891838702, "rating": 5.0, "text": "Absolutely excellent service! These people know what they are doing and got me hooked up with high quality service and an excellent price to match. I purchased flooring with professional installation but they offer many products and installation of those items.", "pics": null, "resp": null, "gmap_id": "0x889a4179ec84b5d7:0xfbca1ab891acf261"}
{"user_id": "103767440009539624229", "name": "Glenn Dumas", "time": 1608088814091, "rating": 5.0, "text": "We have worked with many flooring companies, for our many renovations.  The service at Jubilee in the showroom is top notch. The selection is huge, and the installation crew obviously knew what they were doing.  Everything came out looking fantastic.", "pics": null, "resp": null, "gmap_id": "0x889a4179ec84b5d7:0xfbca1ab891acf261"}
{"user_id": "106632215940223431630", "name": "Mary McGahagin", "time": 1556031597483, "rating": 1.0, "text": "BEWARE of this company. Have a one year warranty on my carpet and had to fight just to get them to rip it up and replace it with lvp in common area when my bedroom was THE WORST out of them all. They refused to acknowledge that so I ALLOWED them to stretch it....BAD IDEA. Causing it to back out nails on my baseboards and rip seams. Called them back and they refused to come and replace the carpet as requested to be done in the first place. They sent out the owner named TERRY who only came to BULLY me by RECORDING in my home. She was very mean and aggressive. DONT USE THIS COMPANY. WORST CARPET AND FLOORING I HAVE EVER SEEN. THEY WILL DESTROY YOUR HOME AND THEN WASH THEIR HANDS. This is not a fake review and can prove otherwise.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOm9vkLkCIBXk_JYvjRmFdqcCjXbW3uNgJLRexZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOVXh06-pHeHK-FeNQ_rgTn1Q0r7-4GARCSGLO5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPODHhvUx9PZDRSS4Ddp1oDCIsoxPRtBMDeupXb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM2tJj3VD9KMFo_xUKniqzEudX7iq4gHeXhE4OM=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4179ec84b5d7:0xfbca1ab891acf261"}
{"user_id": "110321238437241310136", "name": "Don Leslie", "time": 1555365220001, "rating": 5.0, "text": "Excellent experience! We worked with Will and he really knows his stuff. No pressure sales pitch at all. Very professional. Nice store. If you're looking for a great place to buy flooring along with guidance then I highly recommend this store.", "pics": null, "resp": null, "gmap_id": "0x889a4179ec84b5d7:0xfbca1ab891acf261"}
{"user_id": "102468689323918937803", "name": "Kristin Lucas", "time": 1593140661510, "rating": 5.0, "text": "Blair from jubilee flooring was so helpful and my floors look perfect. They exceeded my expectations and the crew was very friendly and professional and did an amazing job.", "pics": null, "resp": null, "gmap_id": "0x889a4179ec84b5d7:0xfbca1ab891acf261"}
{"user_id": "107328933852221992075", "name": "Bryan Minchew", "time": 1580406316320, "rating": 5.0, "text": "Excellent staff and awesome service. I enjoyed the interaction .", "pics": null, "resp": null, "gmap_id": "0x889a4179ec84b5d7:0xfbca1ab891acf261"}
{"user_id": "110212518210422756005", "name": "Cory Johnson", "time": 1533996812013, "rating": 5.0, "text": "We just used this company to pull our old carpet and lay vinyl plank floors. Chris was awesome to deal with and very professional. We would highly recommend Jubilee Flooring for your next project.", "pics": null, "resp": null, "gmap_id": "0x889a4179ec84b5d7:0xfbca1ab891acf261"}
{"user_id": "103242837446034584981", "name": "Kelly Stanley", "time": 1533941191942, "rating": 5.0, "text": "We couldn't be more happier with their service. Terri was amazing and very helpful. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4179ec84b5d7:0xfbca1ab891acf261"}
{"user_id": "105143641635184452745", "name": "Eileen Mayo", "time": 1517353627985, "rating": 1.0, "text": "BUYER BEWARE.  I am terribly disappointed!  Don't buy from this store.  The salesperson C Woodward  is no hardwood flooring expert!  He even came to the house and still the flooring is mismatched and the finish worse!!!!!  I will replace as soon as financially possible.  DO NOT BUY.", "pics": null, "resp": null, "gmap_id": "0x889a4179ec84b5d7:0xfbca1ab891acf261"}
{"user_id": "116937197939678587383", "name": "Bill Hart", "time": 1519069172842, "rating": 5.0, "text": "Went looking for some good flooring.. Chris was very helpful and professional!  Thanks for the good experience!", "pics": null, "resp": null, "gmap_id": "0x889a4179ec84b5d7:0xfbca1ab891acf261"}
{"user_id": "106738619137973725477", "name": "Jessica Richardson", "time": 1519069204655, "rating": 5.0, "text": "Good selection of a variety of products. Staff was all friendly and helpful, especially Chris.", "pics": null, "resp": null, "gmap_id": "0x889a4179ec84b5d7:0xfbca1ab891acf261"}
{"user_id": "108151338728022085073", "name": "Margaret W.", "time": 1571023094310, "rating": 1.0, "text": "There not honest and the work is shoddy at best", "pics": null, "resp": {"time": 1571151057146, "text": "We are sorry your unhappy. We have been in business 23 yrs and have a great reputation. We would be glad to find out about the problem but we can not find a invoice were you bought from us."}, "gmap_id": "0x889a4179ec84b5d7:0xfbca1ab891acf261"}
{"user_id": "117459205647267173843", "name": "David Nowlin", "time": 1483107812430, "rating": 5.0, "text": "Best understanding of my needs, wants, and budget. Made it happen.", "pics": null, "resp": null, "gmap_id": "0x889a4179ec84b5d7:0xfbca1ab891acf261"}
{"user_id": "112712013709068150180", "name": "William Enoch", "time": 1571109191754, "rating": 1.0, "text": "Beware of there bad work", "pics": null, "resp": null, "gmap_id": "0x889a4179ec84b5d7:0xfbca1ab891acf261"}
{"user_id": "107698027119853778285", "name": "James Gibson", "time": 1527615482468, "rating": 5.0, "text": "(Translated by Google) I and I.\n\n(Original)\nI i I", "pics": null, "resp": null, "gmap_id": "0x889a4179ec84b5d7:0xfbca1ab891acf261"}
{"user_id": "115684338898093899586", "name": "Derek Herscovici", "time": 1625097313321, "rating": 5.0, "text": "The first thing that let me know I had picked the right general contractor was Jordan Latimer’s attention to detail. Other GC’s weren’t willing to take the extra measurements, or recommend quality parts, or go the extra mile to make sure this project was done right.\nWhen the renovation process began, he communicated the process every step of the way. He let me know where there were issues and promptly set about fixing them with almost no time lost. He helped me achieve my vision for this bathroom and shower remodel and brought in a team of specialists and experts to see it through to completion. He does nothing halfway and values your input too, instead of overriding your ideas. I have gotten to know Jordan a lot during this process, and he is not only a fabulous contractor, but a man of great heart and compassion. He understands people as well as he does home remodeling and does not skimp on either. I cannot reccomend him enough. YOU WILL NEVER NEED ANOTHER CONTRACTOR AGAIN.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOdPBBaWk3njDZF003k-d9vs7pfz6PZN4_eQYGb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipODw-rGTd6-DT3DHfAMCNU1x_8hVE8s5C3MXiVY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNWwsNKZhlc4mIDi3FU1lSanRNnZlhqValPmNO_=w150-h150-k-no-p"]}], "resp": {"time": 1625100981142, "text": "Thank you Derek! That was very kind of you to say those words. I take a lot of pride in my work and I will never take a shortcut to jeopardize the integrity of a job. It has been wonderful getting to know you and I look forward to the continuing work we have going forward from here. Once again your kind words are very much appreciated."}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "113761444590318659955", "name": "Anthony Spina", "time": 1617832784974, "rating": 5.0, "text": "Jordan is a top notch contractor. He went well out of his way to make sure all of our needs were taken care of. He even fixed things we never asked him to fix at no additional cost. Jordan is a perfectionist and pays attention to every detail of his work. I would highly recommend him.", "pics": null, "resp": {"time": 1617839933202, "text": "Anthony, thank you so much for the kind words! I really enjoyed working for your great family and if you ever need us we are always here for you. Thanks again!"}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "111367446420738321926", "name": "Ben Burnett", "time": 1600099560656, "rating": 5.0, "text": "Jordan and his crew did a magnificent job.  Jordan is a honest guy, and his attention to detail in his work is second to none.  I trust him and his craftsmanship.  I knew it from the first time he came to do an estimate.  I would not want anybody else to do my work.  Our kitchen that they did is really beyond words.", "pics": null, "resp": {"time": 1600123490022, "text": "Thank you so much Ben! We are so very thrilled to know that y’all are happy with the kitchen. Looking forward to the future jobs and will get you guys some adjusted numbers just as soon as we can."}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "115787643806721794140", "name": "Tracy Witte", "time": 1620855297792, "rating": 5.0, "text": "Jordan does excellent work and really prides himself in getting a job done correctly. We have hired his company for several jobs over the past 4 years and have always been extremely pleased with his work.  Unlike many local contractors, who are hard to track down, Jordan communicates so well, which makes it easy to work with him. He is *so* responsive by phone, text, etc. We recommend him highly to all of our local friends and will hire him again in a heartbeat for any future repairs/remodeling.", "pics": null, "resp": {"time": 1620863666952, "text": "Tracy, we are so thrilled that you are happy with the outcome of your new front door. It goes so well with everything on the house and this whole project has been a major transformation. You guys are some of my favorite people to work for and thank you so much for the kind words!!"}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "102615839456427204727", "name": "Steve Sforzini", "time": 1615056897331, "rating": 5.0, "text": "Jordan recently did a countertop installation for us.  It was not a huge job but did require some creativity and ingenuity for this particular job.   Jordan came up with a way to do the job and communicated with us every step of the way.  I would describe Jordan as a very conscientious and dependable professional home remodeler.  We are ready for him to do our next job.", "pics": null, "resp": {"time": 1615057688423, "text": "Thank you Mr. Sforzini! We really appreciate the kind words and we will get you an estimate for the next job as soon as we are able."}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "106372914318406106945", "name": "Belle Winful", "time": 1613532917719, "rating": 5.0, "text": "I don' t even know where to begin with this review. I wish I could provide all pictures of our home before and after the complete renovation to see how amazing of a job that was done. JL Remodeling & Home Repair made our home more beautiful than we even envisioned. What I love most about Jordan, the owner, is that he will not improvise the integrity of work being performed by cutting corners. He Is extremely detailed and takes so much pride in his work! You will see it the moment you hire him. He is trustworthy, resourceful, and extremely professional. From how fair and detailed our estimates were in the beginning, to our home being left spotless at the very end; you can have confidence in all work that is done. This is so important because you do not want just anyone handling something as valuable as your home. We are very grateful for him and his company and we will use them for any future remodeling or home repair needs.", "pics": null, "resp": {"time": 1613585842278, "text": "Thank you Mrs. Winful. We really appreciate your kind words and enjoyed working with you guys so much during such an exciting time for your family."}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "104361709111885164596", "name": "Seth Donaldson", "time": 1596741247241, "rating": 5.0, "text": "JL remodeling was a great group of guys to work with. The flooring was done quickly, it looks incredible, and Jordan was very open and easy to communicate with. If I ever need any other repairs done, this will be the first place I go.", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "101898632317564346667", "name": "S Gitter", "time": 1592938932195, "rating": 5.0, "text": "We've had Jordan do several jobs for us. He has always done a great job. We are always more than satisfied with the work and service that he and his team provide.", "pics": null, "resp": {"time": 1592943903576, "text": "Thank you so much Mr. Gitter! It’s been a long time since we have heard from you so I hope you and the family are well! We sure have grown quite a bit since the last time we’ve done anything for you, but would be glad to help you on anything in the future no matter how big or small. Thanks again, as your review is much appreciated!"}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "106018302572371561814", "name": "Emily Joyner", "time": 1584148398225, "rating": 5.0, "text": "I highly recommend Jordan and his group. Every interaction I have had with him has been professional and he is always willing to go above and beyond to make sure I am happy with his work. I recommend him for any work you need done!", "pics": null, "resp": {"time": 1584217543885, "text": "Thank you so much for the kind words Emily! We look forward to working with you again in April!"}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "108204650543647335324", "name": "Rena Cannon", "time": 1561709640043, "rating": 5.0, "text": "Jordan prepares very detailed quotes in a very timely manner. Jordan replaced the mini gutters on my mobile home in Auburn. He did a fantastic job! He also replaced the master bath tub and surround. Again, he did an excellent job. I highly recommend Jordan and will continue to do business with him.", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "117689713259256770977", "name": "A Duke", "time": 1571010679873, "rating": 5.0, "text": "Jordan did an exceptional job remodeling our kitchen. There was an extensive mold issue when we bought our house so he basically gutted the whole area and made sure the mold was completely out.  Overall, I am very impressed with his work and absolutely love our new kitchen!! Jordan was awesome to work with, paid attention to the details, and went above and beyond to make our vision come to life. I would highly recommend him to anyone who is doing a major renovation. He is excellent!", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "105980454704524975478", "name": "Will Miller", "time": 1565570434565, "rating": 5.0, "text": "Jordan at JL Remodeling is the most honest and conscientious contractor we have ever worked with. He was thorough and always kept an open line of communication with us throughout the remodel. He does a very professional job and finished the project in a timely manner. We highly recommend Jordan and found that there's no job he can't do!", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "110141762078877313252", "name": "Margie Rush", "time": 1553558229864, "rating": 5.0, "text": "\"Thank you for helping us with our bathroom remodel. We are very pleased. Great work. Very dependable and professional. Detailed estimates and will use again if needed.\"", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "106084934866979419675", "name": "Colleen S.", "time": 1566080166947, "rating": 5.0, "text": "Replaced an existing tub/shower with a shower.  Great job, impressive work ethic, excellent value.   Highly recommend  you give them a look.", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "112241814163773453683", "name": "Pat Margreiter", "time": 1560557573199, "rating": 5.0, "text": "We have used JL Remodeling for 3 very different projects for our property in Auburn. All have been done professionally, on time and at a fair price. We highly recommend him and will most definitely use Jordan again.", "pics": null, "resp": {"time": 1560559174613, "text": "Mrs. Margreiter, you guys have been a pleasure to do business with and we will gladly take on anything you may have in the future. We’re always just a phone call away!"}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "114289751674439498901", "name": "CHERYL HALE", "time": 1546877344506, "rating": 5.0, "text": "JL Remodeling did a wonderful job on our home in Auburn, AL.\nThe mold remediation and repair of the leaky ceiling has been a success for a year now. We hired them again this week to do more renovation projects around the home. Very knowledgeable, professional, efficient, timely proposal, reasonable pricing and attention to detail. I Highly recommend this company for all of your repair/renovate needs in Auburn area.", "pics": null, "resp": {"time": 1546994962719, "text": "Mrs. Hale, you’ve been a pleasure to work with and we will gladly take on any projects you ever have."}, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "117762930173050630356", "name": "Carolyn Mitchell", "time": 1556044561596, "rating": 5.0, "text": "I recently had my master bath remodeled, and the transformation is amazing.  Since I was at home during the work period, Mr. Latimer consulted me frequently about the details making sure everything was done to my satisfaction. I am very pleased with the workmanship and cost of the project -- Well Done!", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "110522838957337927003", "name": "Brenda Woods", "time": 1558796001408, "rating": 5.0, "text": "Jo remodeling & home repair did an excellent job remodeling our kitchen and bathroom. We are very pleased with the results and would recommend them highly.", "pics": null, "resp": null, "gmap_id": "0x888c59eea6dabef9:0xec23a7d6017cf65e"}
{"user_id": "103939690930579465759", "name": "Joy Pintovidal", "time": 1624385651340, "rating": 5.0, "text": "We moved here from Colorado and bought an older house. We needed the floors to be completely redone before our furniture arrived within a week. We worked with David Cox and he got our flooring scheduled and completed within the week. The guys worked long hours and did an excellent job. The flooring looks beautiful and the staff was over the top friendly. I would highly recommend them for any flooring job that you need. You will get a high quality job and excellent customer service.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "104140845922021883219", "name": "Dj Burls", "time": 1620216977938, "rating": 5.0, "text": "I highly recommend Prattville Carpet. They carry quality material which they stand behind and their staff is both friendly and knowledgeable. I purchased their 22mil vinyl flooring which is a commercial grade that you can't view on the floor at the chain stores.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "107904501006619233408", "name": "Janet Kissane", "time": 1626292122729, "rating": 5.0, "text": "A big THANK YOU to David Cox and his crew of Prattville Carpet!  Great service, great work and I love my new carpet!", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "103748348622716496122", "name": "Tami Gorman", "time": 1619440759808, "rating": 5.0, "text": "Very friendly  great customer service, however my floors have not been installed so I will let you know after that.. I heard they do a wonderful job but I also was told  that they broke a friend of mine's lamp and she had to pay a lot of money to replace it , also they knocked stuff off wall let her to wire back up her tv they should have paid for the lamp !!! but that was her experience not mine...", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "117380284859075873616", "name": "Leah Taylor", "time": 1607484667202, "rating": 5.0, "text": "We had a great experience with Prattville Carpet. David was super friendly and not only helped us pick out exactly what we wanted but was able to help us coordinate a time to get our new flooring in. The staff & David communicated with us throughout the whole process. We absolutely love our new flooring. Thanks David & Prattville Carpet!", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "107553029175112296385", "name": "Jan Sticka", "time": 1585528622004, "rating": 5.0, "text": "The beautiful Mohawk laminate flooring installed by Prattville Carpet. Great customer service from start to finish. Highly recommend them for your flooring needs.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNeqxOXatHIDuJOtPLaoi8iymg8LVTIZHCOA43y=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "117120611443798787042", "name": "Victoria Lowman", "time": 1612460895014, "rating": 5.0, "text": "Great price and very happy with completed floor!!", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "110003917008369891311", "name": "Tina Taylor", "time": 1586140259620, "rating": 5.0, "text": "Terry and team went above and beyond to help me. Terry was able to work around my crazy schedule and  get the job completed, quick, and to perfection. I highly recommend Prattville Carpet. We will definitely be using them again on other projects.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "105675921166083124568", "name": "Cathee Gipson", "time": 1495465121889, "rating": 5.0, "text": "A master bathroom renovation seemed more than daunting until we reached out to Ray Boles at Prattville Carpet.  His design expertise proved invaluable.  His installers were prompt, courteous, and professional.  His contacts and recommendations for the entire project were beyond helpful.  The process was stress free and fast thanks to Ray and Prattville Carpet.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "116446196322829226465", "name": "Tracey Cannon", "time": 1558805712910, "rating": 5.0, "text": "Ronnie and David have been fantastic in helping me pick out my floors and shower tile.  I highly recommend Prattville Carpet", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "110172031862463209819", "name": "Chris Jarrett", "time": 1551707636750, "rating": 5.0, "text": "Barry and his team of installers where amazing. From start to finish great job. Barry came to my house after I got off work (well after 6) to show me the samples. Lots of option with zero pressure. They installed quickly and with very little interruption in our lives. On the day of the install I got home from work and thought they hadn't come that's how well they cleaned up. It wasn't even apparent they had been there until I walked in and saw my amazing floors. Zero interest payments for 12 months was a nice bonus.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "100511141865234058846", "name": "J.K. Jones", "time": 1494463223851, "rating": 5.0, "text": "Prattville Carpet put new tile in our house and did a fantastic job!  From helping us select our tile to the installation,  everyone was great.  They even moved all the furniture!", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "113443639146901200226", "name": "Kelli Hill", "time": 1524758555602, "rating": 5.0, "text": "Prattville Carpet went above and beyond to help me after my house flooded.  New flooring in the living room and bedroom areas and it is gorgeous.  I couldn't be more pleased with the flooring and customer service.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "109183369016725841693", "name": "Marty Sutley", "time": 1412274812838, "rating": 5.0, "text": "I have had multiple experiences with Prattville Carpet and the Boles family.  They have always been honest and reasonable to deal with.  In an industry such as Floor Covering, it is refreshing to find a business owned and operated by people you can trust to do what they say they will do.  It makes all the difference.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "114041522895259255541", "name": "Angela Addison", "time": 1554224982456, "rating": 5.0, "text": "Super friendly staff. Prices are reasonable, actually better than competition up the road.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "117579639395437397980", "name": "Robin Kitchens", "time": 1553362904656, "rating": 5.0, "text": "David was very nice about helping me pick out carpet for my house", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "105415956406803641400", "name": "Gaye Pelkey", "time": 1548365562228, "rating": 5.0, "text": "They put in all new carpet and flooring in rental home..great job and great service..", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "110303723420445418753", "name": "adam pike", "time": 1545344913268, "rating": 5.0, "text": "Quality service, friendly sales staff!", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "106015993468339647334", "name": "Alabama Lucey", "time": 1625605787997, "rating": 4.0, "text": "We have done business here before and once again the employees were OUTSTANDING!  They even took us in the back to show us their kitchen flooring so we could have a better feel for what it would look like   Another place you have got to at least check out if you're in the market for flooring.  But they have other items also like tile for backsplashes.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOa7J9q9oz_cwGElMUoYY5WxI9giAtdNTRxc2Iz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMpSqPk_GjNgJQm85iQTEty-JLP3O0GYNujC6Gt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPCOmTUjh--5JyhRJ_HbT1LB1svllE8vDMBkFmS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPx5M67YE5CKkUOIhgZKtHxJ4tj8ijCsGC4C2nV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMl_Aa1YoxxouFmdH61XXvRfqw_AAx-YUp5TW1x=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNLC59Evt1ECCI1aRnZyBlQ6b6hQmtL7GMGO3zt=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "102365181481903847186", "name": "Jordan Smith", "time": 1624489603446, "rating": 5.0, "text": "Blake was amazing! I wasn’t having much luck getting ANY responses (email, phone, etc) from other local flooring stores but Blake kept in touch and worked with us on getting us the BEST price and made the process SO easy!!!!! Will recommend to everyone I know, & be using them for all future needs!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "108623454228907601944", "name": "Tracy Sedlack", "time": 1596936751352, "rating": 5.0, "text": "Needed a quick install to sell a house. Customer service was outstanding. Jim worked with me and helped find me a great deal on new flooring. Installed two days later and looks great. Can't thank Jim and the installers enough for the great service and help picking a great looking carpet for the whole house.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMpKyVmjjTRGL2BhgHTVdPCxGj_2qApomVQ0grX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNPOgkyelpS4ASD8Cb2SJN0EFShjkMJU9x0sD3k=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN2cfp-PhD6aMVQj5vj6xMjqmXcdElZAi8xv1oU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "109587481776307648339", "name": "Ashley Carson", "time": 1617127251867, "rating": 5.0, "text": "Most definitely a one stop shop!!! I am so very happy we chose American Flooring, Cabinet, and Granite to take care of all our needs in building our new home. My husband an I finally built our dream house this year;  we were treated like family from all the staff and installers from start to finish.  We did LVP flooring throughout it is absolutely gorgeous. They helped us pick out the perfect tile and accent pieces for our walk-in shower. The solid wood cabinets were just fantastic they went perfect with the quartzite we chose for the kitchen an master bath, it makes my heart beat fast, it's so beautiful. They have a large selection from all over he world, slabs I have never seen before anywhere.                                        I want to thank everyone there for making our experience a little less painful, anytime you build a house things come up and we were very pleased how they worked with us on our scheduling.  I highly recommend American Flooring, Cabinet, and Granite to all my family and friends. We are so very happy!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "101412820628372191874", "name": "Melanie Lobel", "time": 1616004968202, "rating": 5.0, "text": "First visit to American Carpet and had the best experience picking out carpet. Johnny Marino was such a professional and assisted me with making great selections at a terrific price. They were able to meet my installation requirements immediately. The quality and service was so remarkable that I went back 2 days later and purchased gorgeous marble for my fireplace surround. What a pleasure doing business with American Carpet and Flooring. Definitely ask for Johnny. Great guy.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "106852215908119072573", "name": "Tazman Reid.", "time": 1625695887269, "rating": 5.0, "text": "The sales lady was fantastic, she pretty much took care of everything over the phone, I went to the store and was out of there in 10 min.\nA 10 for Marisa !", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "114570039299034401076", "name": "Gerald Drakeford", "time": 1614206391101, "rating": 5.0, "text": "Mr. Don Williams always has a warm smile and greeting each time we visit the store. Johnny facilitated our flooring and granite orders and was great to work with as well!\n\nWe had hardwood floors as well as granite countertops installed.  Glynn and his crew did a great job on the flooring. They were on time each day and were very attentive to details during the installation.\n\nLikewise, the guys that installed our granite countertops were top shelf as well, detail oriented, and very professional.\n\nWould definitely recommend American Carpets and Flooring!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "106947545531976446298", "name": "Kishina Brown", "time": 1609199926737, "rating": 1.0, "text": "I was looking for purchasing new flooring for the rest of my house. I walked in with a large piece of carpet in hand to see what would look good with my new carpet. As I entered I was not greeted. I noticed three men in a corner talking and I walked close by and again never greeted. So I will not ever step foot in this store again.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "101554162029775948900", "name": "James Sessions", "time": 1598480748262, "rating": 5.0, "text": "My wife and I decided to totally remodel our master bathroom which was a big deal for us.  After making visits to several stores and getting conflicting advice on what we could and should not do. We were so confused but knew how we wanted the new bathroom to look.   I suggested that we stop by American Flooring which we decided to be the last stop before leaving Mobile and head to Baldwin County or even Pensacola. American Flooring should have been our first stop.  We met Johnny Marino and shared with him what we wanted to see in our new and updated bathroom project.  He took our the contractor's proposal along with many pictures that my wife had gotten off the internet, how we wanted our new bathroom to look.  He provided us with expert advice.  He took the time to tell us what we needed.  He was more than a salesman... I considered him an expert in flooring.  We are so excited, we cannot wait until the job is completed.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "105366377189058722485", "name": "Burchfield lc", "time": 1599342220206, "rating": 5.0, "text": "Great service from picking out flooring to the install! Highly recommend! They are a locally owned company with fantastic prices, I will be back next time!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "111979773792994848010", "name": "Sandra Mikul", "time": 1594921337563, "rating": 5.0, "text": "Beautiful installation! Michael and Cliff were pleasant, efficient and we love the final product.  Glad we decided on new counters! Also, Robert gave us good advice on choosing colors while we were looking at the large inventory.  Thanks", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "103804285607193038083", "name": "Daniel Garrido", "time": 1578984122599, "rating": 5.0, "text": "Amazing store to buy from, great people and service. Definitely recommend!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN7-Ai_AbaCI-9EEmMmP-6-3R9zPf56mPGfyB2a=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "111964048522762970615", "name": "Ashley La Bounty", "time": 1597380561659, "rating": 5.0, "text": "Our experiences has been amazing!!! The quality flooring and staff is amazing. Had the pleasure of working with the owner himself and he make us feel right at home every time.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "107245293847523842491", "name": "Quintin Wilder", "time": 1606336925435, "rating": 5.0, "text": "I only deliver packages to them but every time I go they always helping someone with a great attitude.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "110002926730751455212", "name": "Stanley Self", "time": 1597330236110, "rating": 5.0, "text": "Great. Carpet and pad.  Wonderful flooring.   Installers were very friendly and respectful.  Salesman was very friendly and helpful.  Very satisfied.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117031730763445449523", "name": "Theresa Seibert", "time": 1590596225290, "rating": 5.0, "text": "American Flooring and Granite has impeccable customer service very knowledgeable on all the products.  I love the fact that they use a 15 year sealer on all the natural stones. They have a large selection to choose from. My counter tops are beautiful!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "118277219069483773175", "name": "Richard Moore", "time": 1575942723017, "rating": 1.0, "text": "NEVER AGAIN!\nThis level of incompetence is unfathomable. My installer calls me up to verify directions, ten minutes later one of the employees calls me to tell me \"We can't sell you this flooring\" ( That the salesman practically begged us to pay for weeks earlier) Half my house is on my porch and in my yard at this point. They had their third \"problem\" reported two days earlier but didn't bother to call the people who had bought any of it. The sales man was an absolute joke. I don't know whos brother-in-law he is but that is the ONLY way he could keep his job!\nThe Installers....were AWESOME! (Sub contracted).\nThis is only part of the issues I had....all I can say is,\nAmerican Flooring will NEVER get another dime from me.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "101370247566958826845", "name": "Jesse Brewer", "time": 1502760071136, "rating": 5.0, "text": "We did a major  2 1/2 bathroom remodel at our home and American Flooring Cabinets & Granite did a great job! It was a pleasure working with  Jennifer who helped us pick out our porcelain tile and exotic granite.  It did not stop there she took the time to pick out the paint color that would compliment the exotic granite and porcelain tile.  The  selection of porcelain tile and granite options we viewed that day at American Flooring Cabinets & Granite was  top quality.  The workers did a top notch job.  At the completion of the job, Jennifer came out and looked over everything and made sure we were satisfied with everything.  All of our questions were answered.  Our future flooring projects will definitely be handled through American Flooring.", "pics": null, "resp": {"time": 1502807432418, "text": "Thank you, Jesse! Glad we could serve you!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "115407434266322970944", "name": "Donna Dicken", "time": 1573583095201, "rating": 5.0, "text": "My husband and I are very please with the whole experience from buying our flooring to the two gentleman who put it in. They did a fantastic job. We LOVE our new floor. We recommend American Flooring, Cabinets & Granite and will use again in the future.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "100871770003133492545", "name": "Steven Duquette", "time": 1506094777655, "rating": 5.0, "text": "I had a great experience at AFC&G from the minute I walked through the door until the minute the job was completed.  Don and Jennifer were so helpful throughout the entire process and what a selection of materials they have in the storeroom to choose from.  My granite counter tops and custom designed shower turned out like a showroom display.  Many thanks to Roland who did the design and installation.  Every measurement and cut he made was with laser precision.  I highly recommend you visit the showroom to see what they carry and talk with their very knowledgeable sales reps.", "pics": null, "resp": {"time": 1506095564974, "text": "Thank you Mr. Duquette! We loved the finished product and are glad to have you as a loyal customer! If you need anything at all, you know who to call."}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117510542557733207554", "name": "jay trammell", "time": 1559960940685, "rating": 1.0, "text": "Stay away from this place. Salesman that helped me was great. Owner is crazy to work with I was giving quote and come in to store and he changed it. Very low to do. Obviously does not care about business . This 5k plus Job was going to be a 12k plus job when done so business is not his priority. Other stores did honor their quotes.  Check your options as they lost me and a lot more business because of this guy. Pathetic customer relations .", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "116634315422112267553", "name": "Forest Dixon`", "time": 1519424301693, "rating": 5.0, "text": "American Flooring, Cabinets & Granite is the best place to go if you're interested in perusing some remodeling a home. We just had some new carpet installed in our house and couldn't be more pleased with the outcome! Mr. Don Williams is personable, yet professional. He gave us a fair up-front price as soon as we gave him our measurements. Ms. Jessica also helped us and she was a pleasure to work with as well. Even the installers were professional, quick and did a wonderful job. We are planning on remodeling our bathrooms with new cabinets, granite counter-tops and porcelain tile, so we know exactly where to go for our next project!", "pics": null, "resp": {"time": 1520862170784, "text": "Thank you, Forest! We appreciate your business!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "111231804867099643802", "name": "Maggie Ainsworth", "time": 1562606126956, "rating": 5.0, "text": "American Carpet did an AMAZING job on my new vinyl flooring!!! Workers were professional, punctual, and friendly. I would highly recommend them to anyone interested in new floors. Will definitely use them again!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "106482303702287774593", "name": "Mike Doggett", "time": 1502749320110, "rating": 5.0, "text": "Great Selection!! This store has a TON of products. Jennifer was our salesperson and guided us every step of the way. We looked at engineered wood and solid wood flooring, but ended up getting a beautiful tile that looks exactly like a wood floor. Guests are shocked when they find out it's tile. We also got a backsplash and granite for our bar and it looks amazing. We will be going back when we get ready for cabinets.  I would recommend this company to anyone looking upgrade their home. They had a amazing selection of vinyl plank and vinyl tile that would be perfect for a bigger family on a budget.", "pics": null, "resp": {"time": 1505741762879, "text": "Thank you, Mike! Great doing business with you!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "106054624322724094989", "name": "HM M", "time": 1576021878267, "rating": 1.0, "text": "I walked in and was not greeted. I walked up to two people at desks and they didn't seem interested and couldn't seem to help even though I had a tile in my hand. They called another guy. I asked him about finding a similar size to my vintage tile because Lowe's only had 4x4. He said it would have to be measured and hesitated. He said he would see if he could find a tape measure. He came back and measured and said 4.25x4.25 and that was custom. He said I would have to buy a box but wasn't positive he knew how many tiles that was. He did a bunch of stuff on a calculator until he quoted me 100 tiles for $62. I needed 14 so I told him I would check back after searching. He told me he had the same problem when he did his bathroom. He said okay and maybe I would find an open box somewhere. I walked into Home Depot and 4.25x4.25 is a standard size. I bought 14 tiles for $2.46. I'm not sure what to say about that. I will let you come up with your own conclusions.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "108630299565623962172", "name": "Lynn Sigouin", "time": 1520610762148, "rating": 5.0, "text": "Thank you once again for another beautiful and professional installation. Our stairs look like the center piece of our new home thanks to our wonderful Irene who gave us great customer service and always followed up with calls, Jonathon and Stephen who installed with perfection for detail and so,so polite and so talented.\nAnd for the kind, sweet voice on the other end greeting me this morning,  Jessica who assisted all my needs.\nGreat team you have, Don...Jay, I am sorry to have missed you my friend but we couldn't be more pleased .\nBlessings to all,\nThank you again,\nRay and Lynn Sigouin (Principe)", "pics": null, "resp": {"time": 1520862146281, "text": "Thank you so much, Lynn!! We are so thankful for your business. Please let us know if you need anything else in the future!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "108057886593171219422", "name": "Belinda Hall", "time": 1599083189436, "rating": 1.0, "text": "I came to this store for cabinets.  It is going on 2 months. The are not hung. The parts of the cabinets they just ordered without ever coming to my home for any type of measurements are under my carport blocking so I can't park my car. I have called repeatedly,  people have been rude, hung up on, talked down, and still no progress!!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117787036663477905789", "name": "Nina Propst", "time": 1562852054807, "rating": 5.0, "text": "We are very satisfied with our new carpet and with the service we received.  We recommend checking them out for all of your flooring and countertops first...it will save you lots of time and stress!  Special thanks to Don Williams.  We will be back.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "113328340343186174231", "name": "Mendy Nilsson", "time": 1475770457823, "rating": 5.0, "text": "Shannon Williams is fantastic. He listened to my needs and showed me lots of options giving the pros and cons of each type of floor. That allowed me to choose the best floor for my needs and WOW I'm so thrilled with my luxury vinyl plank flooring. So beautiful and so easy to clean it makes cleaning house fun. Thank you Shannon and American!!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "113970014622307309182", "name": "LeBarbara Stinson", "time": 1506745563941, "rating": 5.0, "text": "I had the opportunity to have my Luxury Vinyl Plank floors installed by Mr. Glenn Smith. He had his team members with him. They were the kindest men. They worked hard and didn't half step on anything! They are funny and welcoming. I would recommend them anytime. I thoroughly enjoyed them. They were professional and operated on total and complete excellence!", "pics": null, "resp": {"time": 1506950838480, "text": "Thank you, LeBarbara!! We will let Glenn know he did a great job. We appreciate your business!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "111416900792223991488", "name": "Susan Allen", "time": 1590878893482, "rating": 5.0, "text": "Very informative, professional, and helpful!\n\nThanks Don Williams.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "101100780463141592614", "name": "Lisa McGhee", "time": 1513869536331, "rating": 5.0, "text": "I want to say that I won a contest with American Carpets. My prize was 250$ off any area rug in the show room. I went in yesterday to pick out my rug, and was greeted by the owner Mr. Don.. I never expected to have the experience I had with the owner and or any of the showroom employee's they were all so nice and helpful. The owner was there to help me the whole time and made it very memorable he is a very great guy.. I would never hesitate about sending someone in to get any flooring these people treated me with the up most respect and dignity as if I was a paying customer and I'll never forget that... Thanks again to all the people at American Carpets.. y'all are the best... Thanks again Mr. Don glad to have met you...", "pics": null, "resp": {"time": 1513948177848, "text": "Thank you, Lisa! It was our pleasure!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "114561379651249873993", "name": "Mr. Curtis", "time": 1506004714295, "rating": 5.0, "text": "In the past I've remodeled homes for a living, but was never in the position to actually come out of pocket and select carpets, etc.\nIt turns out making the right choice is lots harder than you think! With the fierce competition now days, it's easy to be told what you want to hear, given prices that you can't judge properly, and ultimately, run around in circles ending with products that are NOT to your satisfaction.\nThese issues do not arise with American Flooring (the Mobile location is the one I've become acquainted with). The woman who answered my calls, Jessica, was absolutely wonderful to speak with, and the sales person she brought me to the table with, Shane, was both professional, and compassionate.\nSuffice it to say I will be returning very soon!", "pics": null, "resp": {"time": 1506005641756, "text": "Thanks you, Mr. Curtis!! We look forward to hearing from you soon, and in the meantime if you have any questions at all, you know who to call!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "103818978067295149003", "name": "t h", "time": 1505054545999, "rating": 5.0, "text": "I have recently completed a kitchen renovation and love the outcome. Don helped me select the perfect quartzite countertop for the new island, we purchased luxury vinyl plank for the new floors plus found a beautiful new rug too. Thank you so much for all of your assistance! I am pleased and feel I got a great deal and great service at American Flooring. I would highly recommend them to all of my family and friends.", "pics": null, "resp": {"time": 1505741724783, "text": "Thank you!! We loved the way your kitchen turned out. Looking forward to doing business with you again in the future!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "109170999786149336161", "name": "candes ritter", "time": 1528755297028, "rating": 5.0, "text": "I’ve had several rooms carpeted and have always received excellent service, prices and installments.  Absolutely...... this is your first stop if you need flooring!", "pics": null, "resp": {"time": 1529938086003, "text": "Thank you, Candes! We really appreciate your business!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "110647611947034005455", "name": "Gary Stiegler", "time": 1540443305316, "rating": 1.0, "text": "My wife came in with a sample and the info for the flooring which had been purchased at AC.  Johnny,  the salesman immediately let her know without looking around that they didn't carry the item.  She proceeded to look around the store on her own, no one asking if she needed help, but after 20 minutes, found the exact piece of flooring!  Found Johnny, and he gave her a price of almost $200 for a 12 piece box of vinyl flooring.  Thanks, but NO THANKS American Carpets!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "105141951524097154911", "name": "Sally Faucheaux", "time": 1471873045321, "rating": 5.0, "text": "Thank you Jennifer ..... She  was my floor and cabinet specialist..... And thank you for all your expertise,   Also want to thank every one else at  American flooring this is not  the. first time that they have done work for me.  I was very pleased in the past,   It has been some years ago I am changing now because I don't want carpet anymore I want to change to ceramic....great job then, and I am sure they will do a awesome job this time as well, after all   I came back for more ;)", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "113660126408283553855", "name": "Rachel Jenkins", "time": 1509468604976, "rating": 5.0, "text": "Jennifer Vaughan is amazing to work with.   She saw my vision and brought it to life.  She also prepared me for the installation experience by explaining it honestly and in depth.   I will never use anyone else in the future except her.   American Flooring needs to hold on to her.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "106479852329186106783", "name": "Sharon Thompson", "time": 1507040325676, "rating": 5.0, "text": "I am a mortgage lender in the Mobile and Baldwin county areas and have referred more clients than I can count to the Mobile and Gulf Shores locations over the years. Whatever your home needs may be, American Flooring is well rounded with an amazing selection of products, and a wonderful team of sales reps and installers. Be sure you follow them on Facebook, they do lots of giveaways and sales you don't want to miss! If you want to call before you go in and actually schedule ahead, ask for Jessica and she'll make sure someone is there to greet you and meet whatever needs you have!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117040202545697376479", "name": "Jessica Bates", "time": 1513098225059, "rating": 1.0, "text": "I'm only giving one star because the material itself was great. The guy that did our template for our countertops measured wrong and only half of my notch was able to be done. The installers flooded my bathroom because the water wasn't off when they took the pipes apart. They knocked several holes in my walls and left without mentioning any of them. After a SIX HOUR install, I still had no water to my sinks and only half of the kitchen done. My stuff wet and laying everywhere and holes in walls in every room they worked in.", "pics": null, "resp": {"time": 1513099726486, "text": "Thank you for taking the time to let us know about the situation. We are reaching out to the installation crew and will make this right for you, whatever it may take. We apologize for any inconvenience this may have caused.\n\nUpdate: Thank you for allowing us to fix all of the issues. We appreciate your business!!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "116401465991465306335", "name": "Leslile Reddick", "time": 1423752030323, "rating": 1.0, "text": "I used American Carpets to install my granite, carpet and laminate flooring in my kitchen.  This was done in August 2013.  My carpet separated between rooms and along the kitchen and living room and nails are sticking up.  My under counter sink is loose.  I have been trying to have this fixed for months now with no resolution at all.  Chris in installation has been out to my house twice to \"look\" at it with promises of it being fixed.  Nothing has been done.  I feel that the work that was done was unprofessional and cheap.  I spent a lot of money on this and would expect it to last longer than a year and if not, at least for it to be fixed in a timely manner.  I will never refer anybody to American Carpets as my experience has been very dissatisfying.  I have never written a review before, much less a negative one, but I felt I had to because I have been getting the run around for months.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "112051624005515480683", "name": "Steve Baker", "time": 1493588377767, "rating": 5.0, "text": "Very friendly folks. Not only did I get a great job on my ceramic flooring​, I think that this business has a lot of Christian people and that is why it is doing so good. Chris and his son that laid my flooring did a great job. Shane the salesman also knows his job. A plus to this business.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "108856669990873646097", "name": "Lacy Hilliard", "time": 1501614043493, "rating": 5.0, "text": "Craig Crawford and his crew did excellent on the installation of vinyl flooring. They were personable, well mannered and addressed my concerns immediately . This is the crew you need for your installation! Showroom time was quick and precise with my needs.", "pics": null, "resp": {"time": 1502807682245, "text": "Thank you, Lacy! We've let Craig know how great of a job he did. We look forward to doing business with you in the future!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "107646176517346174831", "name": "Kem Hall", "time": 1495299730107, "rating": 5.0, "text": "I googled wood floorings and came up with this store. For years I thought they only sold carpet.  I found a vast amount of everything needed for a home; granite, cabinets, wood flooring, tile, rugs, vinyl plank, you name it and its here.  This is a ONE STOP SHOP. Employees are welcoming, helpful and knowledgeable to help with everything. They have good deals too.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "101853443802132720285", "name": "Kyla Gaston", "time": 1518029527616, "rating": 5.0, "text": "I GOT THE OPPORTUNITY TO WORK WITH JENNIFER V. AND JAN R.  - OH MY GOODNESS THEY ARE A TERRIFIC TEAM. I HAD AN ISSUE WITH MY FLOOR WHEN MY HOME WAS BUILT DUE TO THE WRONG DOOR BEING PLACED IN THE HOME, MY WOOD FLOORING HAD TO COME UP DUE TO WATER DAMAGE AND I HAD TO REPLACE IT WITH ANOTHER PRODUCT. JENNIFER AND JAN SAW HOW UPSET I WAS AND WAS ABLE TO MAKE FEEL BETTER AND REASSURED ME THE SECTION OF MY FLOOR WOULD LOOK FABULOUS. I AM SO HAPPY WITH THE TILE AND MOSIAC ACCENT TILE FOR THE FLOOR AREA, IT LOOKS LIKE THE HOME WAS ORGINALLY BUILT THAT WAY. I CAN NOT SAY ENOUGH FOR JENNIFER AND JAN TWO WONDERFUL LADIES AND THEY ARE GREAT AT THEIR JOBS.", "pics": null, "resp": {"time": 1520862213675, "text": "Thank you for your business, Kyla!!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "107643177770399754051", "name": "Ethel Moore", "time": 1460319740957, "rating": 5.0, "text": "My husband and I received a warm welcome upon entering the storefront and we were treated wonderfully! I explained to Shannon,  our sales rep,  what I wanted and he took us right to it!  It felt as if we were old friends.  I was never pressured to purchase anything which is a PLUS.  I cannot count the many times that I left a place due to the pressure to buy something that I'm really not looking for.  We also met the 'big man in charge' -as I affectionately refer to him.  You know,  the 'open 8 to 8 so don't be late' gentleman.  Lol.  Very warm and professional.  The carpet they installed looks AMAZING!  It's exactly what I wanted at the price I wanted! I will DEFINITELY recommend American Flooring and Cabinets. Ask for Shannon,  HE IS A GEM!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "107707794170294401374", "name": "Lynn Zimmerman", "time": 1497716097916, "rating": 1.0, "text": "We had Johnny also five years ago and are sorry we went there. We asked for the best pad that they had and also wanted quality carpet and were told that we had ordered it. Now we have \"humps\" in our carpet from stretching and we have to replace it soon. They tiled our foyer, hall and kitchen and while we love the tile they are uneven and chipped. Afterwards they fixed some but in order to make it right they would have had to redo most of it.  For $6,000+ we just expected better.  Make sure that you know what you are getting is right and the quality that you expect. We went to the Mobile store to have our work done.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "110867929909355066555", "name": "AllDone3", "time": 1502979966395, "rating": 5.0, "text": "Not only did they sell me on buying material from them instead of the competitors in the are, they educated me on WHY was more durable or waterproof than another and explained the difference in the products that I was interested in.\n\n\"People buy from people, not companies.\"\n\nThese people took fantastic care of me and my home.", "pics": null, "resp": {"time": 1503061999030, "text": "Thank you, Aldon! We look forward to doing more business with you in the future!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "115722297709588678394", "name": "Katie Azevedo", "time": 1549474581896, "rating": 5.0, "text": "We love our new carpet! The prices were reasonable and everything was done quickly and professionally.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "110594986656957890844", "name": "Mallory Howard", "time": 1562361944716, "rating": 1.0, "text": "So, my impression was great when I left the store but quickly changed. Salesmen were very helpful. Acted eager to help us get our remodel done. They showed me a countertop that they had in stock. It was ok, but not exactly when I was looking for but they insisted it looked great. I again, said no, I’ll keep looking. Kept looking and found the one, the countertop that would look the best. Left the store with the salesman’s card to call back with measurements. My husband called them 2 hours later to get a quote. Salesman tried selling him the countertop they had in stock but was not what I looking for. My husband told him no, she wants the other. He quoted him a price. Then called back and DOUBLED the the first quote because they’d have to order it. Seems they were eager to help sell what they had in stock, but be darned to sell what they’d have to order. We won’t be making a purchase from this store. Our business will go else where.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "111823440820378354845", "name": "Scotti Bee", "time": 1544726827548, "rating": 5.0, "text": "Great place. Everyone I worked with was fantastic. Great attitudes, wonderful customer service.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "103199519475517768154", "name": "Apple Henderson", "time": 1504216358877, "rating": 1.0, "text": "Well..well well, what can I say??  I sought help and met a man named Johnny at American.  We were needing granite and flooring.  He showed us a couple of choices and suggested we go to the warehouse in Loxley to pick granite and took our info and said  let him know what we decide on and we'll get a quote.  Needless to say he lost our info and forgot who we were.  We contacted him and reminded him of the quote.  He was to get with us on several occasions and did not!!  The lady who answered my call was aware of my frustration and got a owner/manager to take my call.  Got another we'll get you the answer and call you spill again.  We are not from here and should have believed reviews...SOOOO grateful to have been referred to HARD ROCK GRANITE....they are professional, personable,  thorough, quick and they treat you like family. If quality everything choose HARD ROCK they will be honest and get you a better deal too!!!!!", "pics": null, "resp": {"time": 1504219425037, "text": "April,\n\nI am so sorry to hear about your unfortunate experience. We really appreciate your feedback, and hope that in the future you give us the chance to make it right."}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "100418002630902400509", "name": "Logan Crouch", "time": 1475035900830, "rating": 1.0, "text": "I came in with a friend and Johnny Marino was our salesmen. I have never had a worse experience. He was introduced to us as 'the man who knew it best' and that he had 'been in the business for 43 years'. However, he was not polite, seemed to talk over us as we explained our needs, treated us as if we had no idea what we wanted, and overall was completely unprofessional: not only to us, but for other customers who were in the store. We were shown one product, and after the purchase, were shown a completely different colored product; then were argued to repeatedly that it was the light causing the color difference.\n\nThe business had a wide selection of products, and I'm sure with another salesman we would have had a better experience. But this particular transaction just left a bad taste in my mouth.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "114089316454675169832", "name": "Joshua Carper", "time": 1582784525996, "rating": 1.0, "text": "Dont shop here they are crooks!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117391671372413098311", "name": "Victoria Wilson", "time": 1561134408013, "rating": 1.0, "text": "Advertised \"Open 8 to 8\". Arrived about 5:40 unaware of new store hours. Came to buy flooring for 3 rooms. Salesman took me to the back to look at sheet vinyl rolls and remnants. Told me to browse while he figured out how much I needed from the measurements that I provided. I thought he was taking a little too long. Went to look for him and discovered that everyone had left and locked the doors. That's when I saw a sheet of white paper on the front door with new store hours 8-6. I HAD A PANIC ATTACK! Called my sister. She called Mobile Police Dept. MPD came. A woman in another vehicle then arrived and told him how to get me out. I left a note on the salesman's desk with my name and phone number and what had happened. I picked up my floor plan and measurements and left. NO ONE EVEN CALLED TO APOLOGIZE.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "100870931229571003310", "name": "Michael A", "time": 1457630008683, "rating": 5.0, "text": "Service was excellent. Shane Gros was very helpful. Definitely the place to shop. Can't go wrong. Thank you Shane for all your help!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "115666149050338080865", "name": "Todd Burley", "time": 1429800439217, "rating": 5.0, "text": "Visited this place on April 2nd to shop for new carpeting for our new house in Semmes. After we shopped around at several stores we found this place the most useful because of their helpful staff, affordable prices and financing. We ended up buying 1500 sq ft of carpet and had it installed last week, my wife loves the carpet and I love being able to get out of bed barefoot. We are very happy with American Flooring and would recommend them to anyone who needs a good deal on carpet", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117025975305460744902", "name": "Cyndi Booth", "time": 1460990865568, "rating": 5.0, "text": "I love, love, love my new kitchen granite countertops. They look great with the new cabinets recently installed by American Flooring, Cabinets , and Granite . I had the tile floors installed in a few rooms about 6 months ago. Everything is coming together and looking beautiful! Next is the bathroom shower and countertops and a bedroom needs hardwood flooring and........American Flooring, Cabinets, & Granite \"Your One Stop Shop\" for all of your remodeling needs!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "109266193797410791492", "name": "John rohman", "time": 1521160462034, "rating": 5.0, "text": "They have a beautiful showroom and staff was very helpful it was a great experience no stress,ill be back", "pics": null, "resp": {"time": 1521207459266, "text": "Thanks, John! We are looking forward to it!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117076347066617113149", "name": "Danny Woodard", "time": 1500739486402, "rating": 1.0, "text": "Attended the event they had last week where they said they were giving away prizes. I was told by a young lady there the drawings wouldn't be until late that evening and that I had to buy something to get a ticket. I then decided to buy a bottle of cleaner and was told that wasn't enough value for a ticket into the drawing. Clearly a bait and switch tactic to get people in their expensive store. Buyers Beware!", "pics": null, "resp": {"time": 1501006940255, "text": "No purchase was necessary to enter the contest or win. In fact, 4 out of 5 of our big prize winners didn't shop with us that day. We did not find this customer in our database of transactions that day. We appreciate all of our customers who came in for our 45th anniversary customer appreciation day event and hope to continue being your one stop shop!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "112977216569026173651", "name": "Diane james", "time": 1502988783377, "rating": 5.0, "text": "LOVE my new rugs! Will definitely be doing business with y'all in the future!", "pics": null, "resp": {"time": 1503062016602, "text": "Looking forward to it! Thanks!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "100618850160735047178", "name": "Norma Beachman", "time": 1506864146747, "rating": 5.0, "text": "We got everything we asked for .the company is number 5 you\nAnd their employment Ronald STEGMEIER is So Good At his Job\niWould Give Him A 10\nHe made Sure the Job was done Right And worked untill it was Finished\nOn A Saturday we would Recommend your Company and  Employee\nRonald STEGMEIER to anyone.\nRobert and Norma BEACHMAN", "pics": null, "resp": {"time": 1506950932066, "text": "Thank you, Norma!! We appreciate your business and I believe you meant Roland? We will let Roland know of his stellar job!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "104093080593887491080", "name": "val hansen", "time": 1501517000703, "rating": 1.0, "text": "When you place an order for 14 boxes for laminate flooring and get 3 boxes you think maybe it was just 1 mistake.  When you also place an order for ceramic tile for the facing of your fireplace at the same time you ordered the laminate flooring and you get 3/4 of it you start to wonder about this store that's been in business for so long. When you place an order for 3 boxes of ceramic tile for the inside of your fireplace at that very same time and you get 1 box because they FORGOT to order 3 and  you have PAID for it ALL!!!!  I am wondering WTH is THEIR problem!!!!  I took back the 1 box of ceramic tile since I didn't like it,  it didn't match, got a refund, pkd up the 3 boxes of flooring and tried to give me the other 2 boxes of ceramic tile I had gotten a refund on?????  Yes, I know had for me to believe too!!  Finally got all of my flooring. Had to reorder more fireplace facing tiles, pd for it, was told it was ordered as I was in the store and would be in that Friday, it came in the next Tuesday!!!! Found out it was NOT ordered until the day AFTER I ordered it!!!!  BTW, I finally went to LOWES, and got the rest of the ceramic tile I needed for the inside of my fireplace that they had IN STOCK!!  All this going on as my contractor was doing what he could with what we had!!!  Needless to say HE was not very happy and will be writing a review also on this store.  I live 18 miles 1 way from this Mobile store.  I made a trip 6 days in a row.  My sales person was Shane Williams.  I would NEVER recommend this store to anyone and will tell everyone I know of my experience.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "115158994240707227703", "name": "J H", "time": 1393281602049, "rating": 1.0, "text": "Misleading sales. If they make a mistake you are stuck with it...no returns! I tell everyone not to shop here. Salesman called me \"sweetie\" when he refused to correct his mistake..how demeaning. Similar incident with an acquaintance of mine, so must not be a rare occurrence.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "107762932826141481779", "name": "Leigh Stewart", "time": 1509484574891, "rating": 5.0, "text": "Don has always help us in anyway that he can.  If I ever had a problem,  Don take care of it himself. We have been with him for many, many years.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "118414276853890684407", "name": "Hannah Saenz", "time": 1447170793676, "rating": 5.0, "text": "This is most definitely a one stop shop, bought my counter tops, cabinets and flooring here. The prices were very affordable and I highly recommend this place to everyone!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "101758304990908887038", "name": "Jonathan Cunningham", "time": 1539007918594, "rating": 5.0, "text": "Good place friendly service", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "113681901621026223863", "name": "Jason Pyon", "time": 1517948519847, "rating": 5.0, "text": "Great people, great floors!", "pics": null, "resp": {"time": 1520862227750, "text": "Thank you, Jason!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "105090492168884359582", "name": "jessie james", "time": 1600095598542, "rating": 5.0, "text": "Awesome Customer Service!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "100447168247335546352", "name": "Tiffany Middleton", "time": 1516397427585, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": {"time": 1516407373391, "text": "Thank you, Tiffany. We appreciate your business!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "105897648709098992834", "name": "Kyle Patterson", "time": 1509545845019, "rating": 5.0, "text": "Very good experience", "pics": null, "resp": {"time": 1509547905471, "text": "Thanks, Kyle! Who was your sales rep?"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "108730415867708162165", "name": "Michael Farrier", "time": 1517445406499, "rating": 4.0, "text": "Helpful", "pics": null, "resp": {"time": 1520862242977, "text": "Thank you, Michael!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "116304123264346053058", "name": "Joshua Southard", "time": 1613134842882, "rating": 5.0, "text": "They are very nice and extremely helpful to the extent of looking at pictures of the wall color and getting a good match for the floor and not clash. They have everything you need to get a floor done with real hardwood, laminate hardwood, vinyl and tile carpets and rugs. If u can walk on it THEY will have it. I'm still waiting on the free home estimate and I will update this post after with pictures.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMoNDUz1nUwQ3clPi7Ms8eA1or37X9T7mmjgGa4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNNrR14rt5OBblvzCaG8AnP6Nx0p74ThsgWqcY4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMt37P91ft1XcOSoqdngMR_WVNKqjIvkuVDRHK4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNPmoio3E6HGanV6zgzyFHWmDOyZ23eSVMWh1hP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMVYU_ojO2WiFbdy8fmwewbqmYBF11fTFv05A1H=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "116917318814881034780", "name": "Traci Reed", "time": 1618606757888, "rating": 5.0, "text": "What a wonderful experience today at this establishment working with Kim! It was so refreshing to work with her and Dinah!! And we got Everything we wanted and needed. We love All we picked out!! Can’t wait to see it all in our New Forever Home!!!!", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "107629545306958167693", "name": "Mike Measels", "time": 1608559238516, "rating": 5.0, "text": "Shane and David did great. They were committed to and take great pride in their job. They were punctual every day and if they were going to be a little late would notify us. They have the process of refinishing floors down to a science and a lot of hard work.  They were also courteous and friendly.  We highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "105287292938466275483", "name": "Merri Bass", "time": 1619228954789, "rating": 5.0, "text": "Staff is the best!! Helpful and very knowledgeable about all things flooring.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "110191424794442440645", "name": "Steven Stovall", "time": 1610211978182, "rating": 5.0, "text": "Very nice and willing to answer all your questions Good people", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "110690283404264893827", "name": "Jacques Cockrell", "time": 1600868952658, "rating": 5.0, "text": "Great experience. Very professional and knowledgeable. Nice selections and great attitudes.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "105605293847708323016", "name": "Balinda Adams", "time": 1496180859701, "rating": 5.0, "text": "This place has just the right amount of a variety of flooring without making you overwhelmed. The young guy at the desk was very nice and attentive to us when we came in. Shane went out of his way to make sure my parents found everything they were looking for. He even gave them a sample of wood to take home to see if it matched the staircase. He also gave them a quote that was much cheaper than the other flooring store we had went to. He was honest and very upfront. If you go by, ask for Shane and he will take great care of you and even help with design questions.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "116341789387237960125", "name": "Adam Baker", "time": 1496176180003, "rating": 5.0, "text": "We were pleasantly surprised when we walked in the door! Not only did everyone greet us but several were busy with other customers yet they made sure we were taken care of. We told Vicki what we wanted and she read my mind and presented several options. We will not only mention them to our friends we will shop with them again very soon. Thank you for your hospitality and commitment to making sure we got what we wanted, in the budget we had to work with and all installed in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "109741078409095936113", "name": "T W", "time": 1509557415869, "rating": 5.0, "text": "Update to a review with only 1 star rating several months ago from De W. As the customer who wrote it, we made an effort to update the rating but could not seem to do so. However, please know that all concerns with the installer were addressed and done so professionally. In reality the concern was simply a breakdown in communication. No one is perfect and they did what was right and corrected our concerns. Ryan was excellent and prides himself on taking care of the customer. Please omit the rating from your decision process on where to buy your flooring. They truly deserve a full 5 star rating.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "102835260080024832829", "name": "Vicky Brown", "time": 1495749793814, "rating": 5.0, "text": "Very Helpful and Knowledgeable Staff.\nGreat Selection to choose from... well\nlaid out showroom.  I would Recommend\nto others.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "102435517894712712524", "name": "Judy Croft", "time": 1496023792475, "rating": 5.0, "text": "Our overall experience was outstanding, from the selection to the service. Thank you for your design advice, it really helped us make the right selection for our project. I would recommend to everyone. Thank you.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "114202475013389505625", "name": "De W.", "time": 1495725608505, "rating": 1.0, "text": "They promise you ethical treatment, integrity & flawless service. Don't believe it.\nOnce carpet was selected - salesman assured quality professional installers in a timely manner.\nThe installer arrived late; talking highly of himself and did not reply or respond when asked questions. Once carpet installed, we inspected job. Carpet had high strips where Sean's were like the carpet was doubled at the seam. I pointed it out to installer (Terry), and he pulled on it saying it won't come loose. I said I wasn't worried about it coming loose but the seam was obviously thick.\nHe ignored my concern. A week later I called back and spoke to sales person who came our days later to look at it. It took another week to get a call back where salesman asked for a convenient time for installer to come back. I gave him 2-days and timetable around my work schedule. Salesman said he would call installer and get back with me on day & time. I was assured installer would be back to repair on one of the days I provided but he would call back to confirm.\nOn the day installer was suppose to be here for repair I received a call from installer saying he was calling to set up the appointment. What?! You were were suppose to be here....\nI called the store and I got excuses from the lady sales person saying the installer was trying to call me.\nDon't bother calling these people..they don't know what they're doing and they are not customer service conscious. I won't be using them again.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "106807615328526239216", "name": "J Bin8148", "time": 1565017455588, "rating": 1.0, "text": "Price I was quoted for materials changed drastically after work was done. I was told those were the in stock prices. Had no choice but to pay I was never contacted saying the quote was going to be different. Stay away", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "116220530764713666634", "name": "Catrina J", "time": 1536353196536, "rating": 1.0, "text": "No customer service. My husband and I visit the store this morning looking to purchase some flooring. When we entered, no one greeted us or said one word to us while we were there. We looked around and nothing. Waited near the desk, nothing. We left! If you are with a customer or busy, all it takes is 10 seconds to say \"Hello! welcome! We will be with you shortly\"\nWe spent our money elsewhere.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "106169342884188317776", "name": "Lillian Black", "time": 1566244678583, "rating": 5.0, "text": "Very happy with experience from sales to fantastic installers. Price exactly what estimate was.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "105161777829111765850", "name": "Mark G.", "time": 1495766006608, "rating": 5.0, "text": "We bought our flooring from Alabama Custom Flooring  and Design and couldn't ask for a better experience.  The service was beyond my expectations.  I highly recommend them for all you flooring needs.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "115050475612973215501", "name": "Jared Toone", "time": 1485363215715, "rating": 5.0, "text": "Great selection and pricing. Order came in quickly and all went well.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "104703748919011224951", "name": "michael joseph", "time": 1519008355255, "rating": 5.0, "text": "easy experience. helpful/knowledgeable sales person", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "101529749488321458616", "name": "Michelle Hockersmith", "time": 1470497843147, "rating": 5.0, "text": "Thank you to Ryan for the excellent service.   I highly recommend Alabama Custom Flooring & Design for all your flooring needs.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "112513230607243614302", "name": "Stan D", "time": 1529441783316, "rating": 2.0, "text": "They quote cheap prices by the foot, and then over measure by nearly 20%...be careful with this place.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "116084288399862673075", "name": "Dana Lee", "time": 1495762361900, "rating": 5.0, "text": "Great place to find flooring.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "102447324698511197542", "name": "Dave Quandt", "time": 1627313763989, "rating": 5.0, "text": "Great product and prices and outstanding service", "pics": null, "resp": null, "gmap_id": "0x888ca3578d2096cb:0x7ba550de697389be"}
{"user_id": "112403097659107694907", "name": "Paige Thorn", "time": 1599272003735, "rating": 5.0, "text": "Love Gibson's. They as friendly and more when coming to making their customers satisfied.", "pics": null, "resp": null, "gmap_id": "0x888ca3578d2096cb:0x7ba550de697389be"}
{"user_id": "104904680913926603464", "name": "Melanie Gallagher", "time": 1582994364909, "rating": 5.0, "text": "Best flooring you can buy and really good people and very professional installers", "pics": null, "resp": {"time": 1583030567123, "text": "Thank you so much!"}, "gmap_id": "0x888ca3578d2096cb:0x7ba550de697389be"}
{"user_id": "106322593233779536347", "name": "Kevin Breuers", "time": 1616848203184, "rating": 4.0, "text": "I worked with Bonnie. She was awesome. The young man at the counter and the guy who pulls your supplies are awesome.  There is a guy there who usually answers the phone that is anti customer and wants to close early 3:50 to count the drawer. You would think he would do that after 4:00.", "pics": null, "resp": null, "gmap_id": "0x88626b9244e284cd:0xf80bc9b62fde0276"}
{"user_id": "100919019098656982016", "name": "Ray Young", "time": 1597635376731, "rating": 5.0, "text": "Good selection of tile with knowledgeable friendly staff. Was allowed to take samples home to compare.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP3Lkh-def9F08FhCncLMdcx7le0m7FCk-Z1v0A=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOOfF6CImurGVsqvAfsnANXUYDdVChd8ZxyASUe=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN6m6SUf_TQ6ALI-QBt5cgP-69WiqsPqz38dLyv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMsc7w6YgbtLo7jf_5gB5v-vf-3ZDLUMMjiCwBB=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626b9244e284cd:0xf80bc9b62fde0276"}
{"user_id": "111515344380832647375", "name": "Chris Bramon", "time": 1616328852823, "rating": 5.0, "text": "Good selection, great help. The folks that work there know the tiles and are very helpful and have good taste.", "pics": null, "resp": null, "gmap_id": "0x88626b9244e284cd:0xf80bc9b62fde0276"}
{"user_id": "105592991171998906390", "name": "Janis Williams", "time": 1609166511780, "rating": 5.0, "text": "Bonnie does an excellent job with clients with questions!  She is knowledgeable, professional, and understanding.  RFH Tile has beautiful and ample products from which to choose.  Promised times are spot on and quick!", "pics": null, "resp": null, "gmap_id": "0x88626b9244e284cd:0xf80bc9b62fde0276"}
{"user_id": "112964875787536105651", "name": "Darren Byers", "time": 1545594055543, "rating": 5.0, "text": "Great selection and service", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNdq8RG89fXT5u9nvGmsrErFpntvjXFQeqmneSP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP-DHsXN4__hYCrUg3B_e3gBtNG-O-sCNuGmqBW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMikQDwnpAxp7q83vmr4ECIlyFaE2lQM26Z8t9D=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626b9244e284cd:0xf80bc9b62fde0276"}
{"user_id": "108867830462464293264", "name": "Todd Ballentine", "time": 1609248311787, "rating": 5.0, "text": "The lady that works there is very nice and she helped us greatly when we were choosing tile for our bathroom renovation.  Nice stuff and nic people.", "pics": null, "resp": null, "gmap_id": "0x88626b9244e284cd:0xf80bc9b62fde0276"}
{"user_id": "102550120748026171021", "name": "Google customer", "time": 1615885811217, "rating": 5.0, "text": "Great group of people here! Awesome experience", "pics": null, "resp": null, "gmap_id": "0x88626b9244e284cd:0xf80bc9b62fde0276"}
{"user_id": "105075038705965168381", "name": "A Todd Baker", "time": 1601471292926, "rating": 5.0, "text": "They have everything you need. Very organized & helpful with a large selection.", "pics": null, "resp": null, "gmap_id": "0x88626b9244e284cd:0xf80bc9b62fde0276"}
{"user_id": "105166900290835817341", "name": "Cindy Vann", "time": 1489158768839, "rating": 1.0, "text": "I will never again buy tile from these people.  The lady that helped us initially was pretty awesome.  She was helpful in helping us pick out our tile for both of our bathrooms that first day.  I called back to place my order & they told me the total that would be charged to my card.  When it cleared it was $65 more & when I called back she said she forgot to charge shipping.  We got a call that part of our order was in so we went to pick it up & that's when they completely dropped the ball.  The cashier lady wanted me to pay for my order again.   She couldn't figure it out because her computer said it was not paid.  Finally got that cleared up but the pick up process was incompetent to say the least.  We ended up going back & they messed up on the tile order on the 3rd pickup - which they said that it was completely not their fault & it was the manufacturers.   It's too expensive to get service like that.  I would never go back & I certainly don't recommend this place.  Anywhere but Robert H Henry Tile!", "pics": null, "resp": null, "gmap_id": "0x88626b9244e284cd:0xf80bc9b62fde0276"}
{"user_id": "104316218342947390487", "name": "Victoria Mcanally", "time": 1487368847772, "rating": 1.0, "text": "Is this place for real? Where is the 0 star option? I ordered their \"Old Chicago Brick\" tile option. During the consultation the salesperson (tall thin white woman with mid length brown hair) mentions to us that some of them come broken. On our second conversation after waiting 30 minutes to be acknowledged the sales girl (black woman with short hair) we ask how many are broken in each box? She can't tell us... we decide this is a risk worth taking and order the brick. After installing we have 7 bundles left over. We decide to take them back despite the enormous 25% restocking fee. The sales girl and man who restocked tells us they can't accept the return because the bricks are broken. Are you serious??? We confront the sales girl that we had spoken to before. She admits that she told us some would be broken in every bundle, but has the nerve to tell us we shouldn't have taken them home. After being treated like a criminal, and pitching a fit I was finally able to get my money back (minus the restocking fee of course). I WILL NEVER DEAL WITH THESE SHADY CROOKS AGAIN. I would rather pay 3 times as much then work with them ever again. I HOPE YOU GO OUT OF BUSINESS.", "pics": null, "resp": null, "gmap_id": "0x88626b9244e284cd:0xf80bc9b62fde0276"}
{"user_id": "117912810243993123745", "name": "Jeff Pike (Mr. Pike)", "time": 1520805251649, "rating": 5.0, "text": "Great staff , great prices, and great selection. You can't beat R.F. Henry for all your home and commercial needs. I have used them at my work and my home, and will again.", "pics": null, "resp": null, "gmap_id": "0x88626b9244e284cd:0xf80bc9b62fde0276"}
{"user_id": "105534718351317026009", "name": "Reba Geller", "time": 1490733778628, "rating": 5.0, "text": "I had a wonderful experience with this company.  The staff was pleasant, knowledgable and eager to help!  I'm beyond excited with my renovation. I will definitely use them in the future and refer friends and family to them.", "pics": null, "resp": null, "gmap_id": "0x88626b9244e284cd:0xf80bc9b62fde0276"}
{"user_id": "100386425429642777456", "name": "Sharon D", "time": 1541441921086, "rating": 5.0, "text": "Beautiful store. Very nice employees! Selection is to large for me to choose.", "pics": null, "resp": null, "gmap_id": "0x88626b9244e284cd:0xf80bc9b62fde0276"}
{"user_id": "108923129341066305362", "name": "Blake Landry", "time": 1510769626663, "rating": 5.0, "text": "I have worked with Henry Tile on multiple jobs.  Always professional and helpful through and through.  Bonnie is fantastic!   Great selections, pricing and staff.", "pics": null, "resp": null, "gmap_id": "0x88626b9244e284cd:0xf80bc9b62fde0276"}
{"user_id": "107873372845863598331", "name": "Jim Boyle", "time": 1523026609479, "rating": 5.0, "text": "This team knows how to help, and make sure that you have what you need to get the job done right", "pics": null, "resp": null, "gmap_id": "0x88626b9244e284cd:0xf80bc9b62fde0276"}
{"user_id": "109540263167337746152", "name": "Beth House", "time": 1490629603620, "rating": 5.0, "text": "Knowledgeable staff and nice showroom with large selection of tile", "pics": null, "resp": null, "gmap_id": "0x88626b9244e284cd:0xf80bc9b62fde0276"}
{"user_id": "101017338598883415376", "name": "Gina Terry", "time": 1505875149905, "rating": 5.0, "text": "Great variety and salespeople...Bonnie is fantastic!", "pics": null, "resp": null, "gmap_id": "0x88626b9244e284cd:0xf80bc9b62fde0276"}
{"user_id": "100639935617813355222", "name": "Michael Sellers", "time": 1467076483729, "rating": 5.0, "text": "Lots of tile options and knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x88626b9244e284cd:0xf80bc9b62fde0276"}
{"user_id": "106152146475897106094", "name": "William Walski", "time": 1623882116185, "rating": 5.0, "text": "Excellent experience with Lisenby Construction.  Great work at a reasonable price.  Kept us informed throughout the entire process of remodeling a bathroom and painting 3 additional rooms.  Would definitely recommend this company.", "pics": null, "resp": {"time": 1623883202636, "text": "Thank you sir! We hope to be of service in the future."}, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "118074576770209133235", "name": "Rick Harris", "time": 1611436058364, "rating": 5.0, "text": "Lisenby Construction just finished a three-week remodel of our kitchen and living room, and we could not be more pleased.  The project involved demo of some existing kitchen cabinets, replacement of a cook top and stove with a range, replacement of a vent hood, installing new kitchen lighting, laying tile, painting cabinets and bookshelves, painting trim, and painting walls.  All of this was handled by David's crew without having to sub out any work. The quality of the work done was really top-tier.  We used David's decorating consultant, Lindy, to help pick out colors, and the result has significantly brightened and beautified the two rooms where we spend most of our waking hours.\n\nWhen you undertake a project that takes this much time, you quickly realize that you have invited some strangers into your home for a lengthy stay.   Well, the guys David sent did not stay strangers for very long.  They were cheerful, friendly, and helpful to us.  They added, without cost, some features to the project at our request, even though these features were not in the original contract-- for example, installing a dimmer switch in the kitchen, replacing flood lights in our dinette area so they would match the color put out by our new kitchen lighting, cutting out the trim along one wall of our living room so our bookcase could lay flat against the wall, and installing wall outlets in our bookcase.  They cleaned up after themselves every day and hauled away their own trash.  When they moved furniture around to do some painting, they always put it back where it had been.  It got to where we enjoyed having the company at our house.  At the end of the job, we were glad it was completed, but we were sorry to see the guys leave.\n\nAll the work was done with great attention to detail.  They found and installed tile to match our existing kitchen backsplash tile.  They worked on our project every weekday for three weeks.  On some days, they worked on our cabinet doors and bookcase at their shop, but on the days when they did not come, David always called us to let us know they would not be there and what they would be doing that day.\n\nWe will certainly call on Lisenby Construction if we undertake new remodeling projects.  Highly recommended!", "pics": null, "resp": {"time": 1611446113000, "text": "Thank you Rick for your kind words and for trusting us with your home remodeling needs!"}, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "110433211010891134289", "name": "Susan Schneider", "time": 1576534959189, "rating": 5.0, "text": "The end product exceeded our expectations. The quality of the craftsmanship was excellent. The Lisenby team was courteous, professional and provided excellent quality work. I would recommend them to anyone anticipating a home upgrading.", "pics": null, "resp": {"time": 1576590824814, "text": "Thank you Susan! We enjoyed working with you guys! Your new Kitchen is beautiful!"}, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "106901412222143011814", "name": "Caitlin Singletary", "time": 1547866693291, "rating": 5.0, "text": "This was our first remodel, and it could not have gone smoother! The team was easy to talk to, and they were easy to reach when we had questions. They kept us up-to-date on expectations and the timing of everything. The remodel took 4 days (from demo to completion). The team arrived early each day, and they even worked holidays. They cleaned up daily (vacuumed and cleaned stainless steel appliances). We were also impressed when working with a company they contracted with. While the other company was doing their part, the Lisenby team was present, and they made sure the job was done right/well. In fact, at one point, the Lisenby team told the other team to fix something before leaving. Overall, we were highly impressed, and we intend to work with Lisenby again in the near future when we do additional remodeling!", "pics": null, "resp": {"time": 1547912032578, "text": "Thank you for letting us work on your kitchen Caitlin, we will look forward to working with you again! And thank you referring to us as a team, we work hard on developing a team culture here."}, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "108460659560847510072", "name": "Julie Freeman", "time": 1607009607857, "rating": 5.0, "text": "We have used Lisenby construction on numerous projects over the years. Each has been designed and completed with care and pride. We love our home and the renovation they provided. In fact, we are planning to work with David and his crew again on another project we hope will begin soon. It is so nice to have someone so dependable, competent, and professional.", "pics": null, "resp": {"time": 1611446438115, "text": "Thank you for allowing us to be of service over the years. We look forward to your next project! Having repeat customers like you, has been the key to our success!"}, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "104221357618915476706", "name": "Patricia Griffin", "time": 1597965337502, "rating": 3.0, "text": "I called to have the glass replaced in my back door and found out that they do not do this type of work.", "pics": null, "resp": {"time": 1597976733334, "text": "Sorry we don't offer the type of service that you needed."}, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "109767279964229292034", "name": "Mitch Robinson", "time": 1523928664508, "rating": 5.0, "text": "We are very pleased with Lisenby Construction. They were very knowledgeable, detail oriented, and responsive to feedback. Our kitchen, and master bath was transformed into pure beauty. All we can say is thank you very much!!", "pics": null, "resp": {"time": 1523968378934, "text": "Thank you Mitch! It was certainly our pleasure!"}, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "105244001319415628811", "name": "Janie Marsh", "time": 1445368428576, "rating": 5.0, "text": "I was very impressed with the quality of the work Lisenby Construction did. Our porch extension matches perfectly with the original structure. The workers were all very nice and they constantly maintained a clean work area. We are extremely pleased with how our project turned out.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "101751032293932920764", "name": "Brett Kenny", "time": 1417025014974, "rating": 5.0, "text": "Lisenby Construction build our house, they did such a good job completely exceeding our expectations. We would recommend them to anyone looking for a home improvement or a new home. They are great!", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "114685191949913046461", "name": "Clayton Clark", "time": 1413991311594, "rating": 5.0, "text": "I recently got my kitchen done by Lisenby construction and was very satisfied with the work they did. I found them online by chance and was pleased that they did a good job. Thumbs up!", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "103331390083931195091", "name": "Denise Ortiz", "time": 1410976178340, "rating": 5.0, "text": "I really appreciate the way the team helped us set up subcontractors such as hvac, electric, and plumbing. We also had to change the design of our house and they were able to provide us with different options to be able to address the issue. It was nice to have choices.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "117351359317494909099", "name": "Gwen Allen-Smith", "time": 1553969395494, "rating": 5.0, "text": "Really good people and high quality work.", "pics": null, "resp": {"time": 1611446605639, "text": "It was such a pleasure to work with you on your kitchen remodeling project! It was a joy and pleasure being around your positive and high energy personality!"}, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "109455369958148239127", "name": "Luke Mayben", "time": 1524075502032, "rating": 5.0, "text": "Mr. Lisenby did what he said he was going to do... at the price he quoted...in the time frame he said it would take. He was one of the most professional people I found while trying to get our kitchen remodeled.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "103972756467998183116", "name": "Jessyca Henderson", "time": 1458675615885, "rating": 5.0, "text": "I cannot say enough good things about Lisenby. I would rate them 10/10 for every category that there is. They have have completed three different projects for me!", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "115490137556493774754", "name": "Mike J", "time": 1428024308886, "rating": 5.0, "text": "They did such a great job in all areas that they helped us in our house. Everything was completed in a timely manner and we loved the end results.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "107258695112207669916", "name": "Harry Vaughn", "time": 1395949441247, "rating": 5.0, "text": "Working with Lisenby Construction was great. They did an excellent job. The employees that completed the project were efficient and friendly.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "102522546700711773422", "name": "Chelsea Harris", "time": 1407942733597, "rating": 5.0, "text": "Lisenby Construction built our house. They worked with us one on one to discuss the design of the house and how many bedrooms we were going to add. Originally we wanted only 2 but they talked us into 3 for resale value.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "104982619671247673526", "name": "Glenn Cole", "time": 1403202273275, "rating": 5.0, "text": "Lisenby Constructoin worked diligently to get the project done. We were very impressed by the finishing look and we would definitely hire them again.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "108948886232224973779", "name": "Keith Raby", "time": 1425906919139, "rating": 5.0, "text": "We found Lisenby Construction from searching around online. We were so pleased with the work they did and would use them again if we decide to do another project.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "109669312587129241675", "name": "Parker Bryars", "time": 1435328057399, "rating": 5.0, "text": "Lisenby updated our kitchen and did excellent work. We were more than pleased with their professional service.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "110050521955619089407", "name": "McMullen HOA", "time": 1394304009721, "rating": 5.0, "text": "David Lisenby Delivers. Honesty and quality in every aspect of his work and relationships.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "109360253925259825435", "name": "David Brownstein", "time": 1417456440188, "rating": 5.0, "text": "Lisenby did work for us on our kitchen, it was more than we could have asked for. It included everything we wanted and we were beyond happy with the result.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "112591465024524214591", "name": "Rudy Sparks", "time": 1438093451185, "rating": 5.0, "text": "David was great about responding to any issues. If I called saying there might have been one, he was always there to check on it.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "100088273833441436015", "name": "Seth Hansen", "time": 1400782151385, "rating": 5.0, "text": "Lisenby Construction always does a great job for us. They always exceed our expectations.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "110977646911590374298", "name": "Byron Machen", "time": 1443189713532, "rating": 5.0, "text": "I was very impressed with the quality of the work.  Our porch extension matches perfectly with the original structure.  The workers were all very nice and they constantly maintained a clean work area.  We are extremely pleased with how our project turned out.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "106110588058575609080", "name": "Al Yates", "time": 1434996305276, "rating": 5.0, "text": "Excellent, professional, and courteous service with attention to detail!", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "105393906012046600948", "name": "Latoya Cole", "time": 1527716254078, "rating": 4.0, "text": "😀😎😍😘😗😺😻 my father work there for 32 years bro.Cole", "pics": null, "resp": null, "gmap_id": "0x887d4825539c083b:0x3756c4437127f09c"}
{"user_id": "104064282007656109895", "name": "Albert Pullen", "time": 1597360352921, "rating": 5.0, "text": "Employed there", "pics": null, "resp": null, "gmap_id": "0x887d4825539c083b:0x3756c4437127f09c"}
{"user_id": "102729350135049851246", "name": "Ashlyn Jones", "time": 1605890811371, "rating": 1.0, "text": "Really wish I could give 0/5 stars because that's exactly what you will get working with Issis and Sons Flooring. During our previous home renovation, everything this company touched had to be fixed twice. Bathroom tile was laid un-level and a cracked piece was installed. Not to mention, the guy used so much self leveler it leaked through into our basement! A complete mess! 1500 SQ FT of LVP had to be removed and reinstalled due to no prep work involved and cracked pieces installed. Most quarter round was cracked and not even stained on the ends. Not to mention, they could not even provide ONE piece of missing quarter round that was requested for two weeks. POOR QUALITY AND CRAFTSMANSHIP. Stairs were stained twice and still had paint brush bristle hairs in the stain. Called it quits with these guys and will find someone to finish the job they already started. BEWARE...it's not worth your time or money.", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "102524139582533387217", "name": "daniel weber", "time": 1599797604248, "rating": 1.0, "text": "The guy I spoke with had a terrible attitude.\nI called there today and asked them to send one of their estimators over to do measurements and give me a bid on replacing carpet.\n\nAfter I told him that I would like to have the opportunity to introduce myself our company and products to them as well, he was very rude and said that he didn't need my business, then hung up the phone.\nI believe in doing business with organizations that want to do business with you and keeping money local.\nApparently this gentleman has all the business he needs and doesn't care about local businesses.\nDONT WASTE YOUR TIME HERE, WHEN THERE ARE MANY OTHER (LOCAL) FLOORING COMPANIES THAT WOULD LOVE TO WORK WITH YOU AND EARN YOUR BUSINESS.", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "102852085930204115695", "name": "mano de dios", "time": 1604430506994, "rating": 4.0, "text": "The guys at the ware house work hard to help you out . Good service the only thing I don't like about it is they need to have more tools for tile installers.", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "103046098306749220655", "name": "Shawn Armstrong", "time": 1538012385238, "rating": 5.0, "text": "After 3 months of getting the run around from two very non-professional flooring companies and walking over torn up wood, Issis and Sons stepped in to save the day! Not only were they quick to respond and sent a wonderful crew, they came when they said they would. We could not be more pleased with our beautiful flooring! We would recommend them above all others! Thank you Issis and Sons!", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "102870396781173999256", "name": "botcwc1", "time": 1522359143119, "rating": 5.0, "text": "Put 4 inch hardwoods in our master suite and closet. Excellent job. When I was putting furniture back I accidentally scratch the floor and Jimmy immediately send somebody out to fix it at no charge. Top-notch service. Thanks again :-)", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "100234670222462545800", "name": "David Gibson", "time": 1472273004446, "rating": 5.0, "text": "I can't say enough nice things about this company!  They have done work at my home and office, and always with great integrity and dedication to doing great work.  Great selection and pricing!", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "105328904311404814617", "name": "Michael Lawrence", "time": 1551878259499, "rating": 5.0, "text": "Largest selection of flooring in the entire state. The place to visit to purchase rugs. Knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "105044342388785199237", "name": "Paul Nurre", "time": 1583094439477, "rating": 5.0, "text": "Outstanding selection at reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "104233710197418078517", "name": "Sue Irwin", "time": 1520431421264, "rating": 1.0, "text": "I bought 3 rugs from Issis for my new house to put on my refinished hardwood  floors,   The rugs are beautiful and Issis came and installed them.  I later learned that the pads they had put underneath them were cheap and could deteriorate .  My the time I found out and replaced them my new hardwood floors already had spots where the pad had stuck to the floor and left a sticky residue.  You would think after buying expensive rugs that Issis would put better pads under them or at least tell you that you needed to buy pads.  The fact that they put pad under them that could ruin my floors is appalling .", "pics": null, "resp": {"time": 1521126820341, "text": "Sue, our apology for the slow response. I took over for the role of communication manager recently and would like to know what we can do to make you happy. Please email me at issis.furniture1@gmail.com or contact your sales representative directly. Thank you"}, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "117396401249301773631", "name": "Leigh Webb", "time": 1525319026725, "rating": 1.0, "text": "i had two staircases changed out from carpet to hardwood.  the work was well below average.  they returned and repaired most of the botched stain and paint, but it still looks below average.  the ironwork and railings were not replaced properly, and the wood on the stairs was not installed properly.  very disappointing as it cost over $10,000.\nthe salesman never returned my messages.  i took pictures to the billing manager-who agreed the work was substandard.", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "103824642941885797850", "name": "Bert Davi", "time": 1539993061559, "rating": 5.0, "text": "High quality flooring and the best service in town how can you beat that.", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "100292360040917359534", "name": "Davtopgun", "time": 1525351150680, "rating": 5.0, "text": "Great customer service, and good prices! Quality is top of the line!", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "109516307536481677410", "name": "Jeremy Jacobs", "time": 1575661090479, "rating": 5.0, "text": "Your one stop shop, for all your flooring needs.", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "118370281462972662792", "name": "Matt Herndon", "time": 1515190927290, "rating": 1.0, "text": "We will see how all of this works out.", "pics": null, "resp": {"time": 1521126837324, "text": "Matt, our apology for the slow response. I took over for the role of communication manager recently and would like to know what we can do to make you happy. Please email me at issis.furniture1@gmail.com or contact your sales representative directly. Thank you"}, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "109440576790090948440", "name": "Tammy Johns", "time": 1532047816326, "rating": 1.0, "text": "I found them very pushy, rude and arrogant. We decided not to buy from them before we walked out their door.", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "105733533758339015292", "name": "pandy agnew", "time": 1507298973982, "rating": 5.0, "text": "Best people to work with ever!", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "104559423800807966101", "name": "Donnie Sapp", "time": 1522250006878, "rating": 5.0, "text": "Excellent service and beautiful store", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "116104403017786492446", "name": "Dewayne Green", "time": 1551372802580, "rating": 5.0, "text": "Good business", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "110084280145127445433", "name": "Matthew Patmon", "time": 1513814014510, "rating": 5.0, "text": "Very knowledgeable", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "102833056806295618753", "name": "Teresa MacDonald", "time": 1596229413275, "rating": 5.0, "text": "I love my new countertops! Thank you so much to everyone at Executive Granite for making this such a great experience🙂🙂", "pics": null, "resp": null, "gmap_id": "0x889a0fff27197b9f:0x6f5ea7293cdad61"}
{"user_id": "110857015520018782513", "name": "Sylvia Elizabeth", "time": 1576780658483, "rating": 5.0, "text": "These people at this company are all wonderful!", "pics": null, "resp": null, "gmap_id": "0x889a0fff27197b9f:0x6f5ea7293cdad61"}
{"user_id": "103557045848986014589", "name": "Sherri House", "time": 1530805743072, "rating": 5.0, "text": "These guys are amazing. They do great work and their customer service is outstanding!", "pics": null, "resp": null, "gmap_id": "0x889a0fff27197b9f:0x6f5ea7293cdad61"}
{"user_id": "112287847975437221083", "name": "John Kolaczek", "time": 1619043180901, "rating": 5.0, "text": "Donnie, Hector and their crew from Altract did a great job painting the interior and exterior of our home! They were very professional and maintained a very positive and pleasant attitude in every aspect of the job. I highly recommend this company!", "pics": null, "resp": null, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "114479794937898206730", "name": "Alec Durand", "time": 1565528265778, "rating": 5.0, "text": "Lauren Green and I coordinated a painting and roofing job on a commercial building. She is a breeze to work with, did everything she said she would, and the work was phenomenal! Highly recommend!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOYaccIlPh1E8unYb_Ulxf-2pCSKz5udekZ65IX=w150-h150-k-no-p"]}], "resp": {"time": 1566915036112, "text": "Thank you, Alec! Lauren has been doing an outstanding jobs taking care of all her customers needs. Please let her know if there is anything else we can do for you."}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "113379196514673025738", "name": "Fred Krischke", "time": 1623252012652, "rating": 5.0, "text": "Very prompt and professional. I was pleased with the work quality adn the price was fair. I'd use them again!", "pics": null, "resp": null, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "111418938944848934437", "name": "Angela Corbett", "time": 1615764721980, "rating": 5.0, "text": "This was a complete modernization of my kitchen.  I was so pleased with how it looked as well as the service from the contractor.   I have used Altract for so many projects and have always been pleased and is why I continue to use them.", "pics": null, "resp": {"time": 1615765450160, "text": "Thanks for the kind words Angela. We appreciate your business. Your kitchen does look great!  We may have done the work but you did an excellent job picking out the colors and the tile also."}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "102883856411546276209", "name": "Brooke Gamble", "time": 1570845274530, "rating": 5.0, "text": "Altract did a great job on painting our home!   They met all of our expectations and if something wasn't correct Jordan made sure it was fixed in a timely manner.  We will definitely use them again in the future!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOLfZtpNRkFtRVdeuIiTyPElpDD6R-z0ArF32Ki=w150-h150-k-no-p"]}], "resp": {"time": 1571181455309, "text": "Thank you, Brooke! We looking forward to assisting in anything you may need! Thank you so much for the opportunity to serve you and your family. Have a great Halloween"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "111077159659073905063", "name": "Brian Boackle", "time": 1623947821717, "rating": 1.0, "text": "When it came time to get my house painted, I did my research and found Altract to be highly rated so I gave them a shot.  What a COMPLETE DISAPPOINTMENT!  Bryant Darby came for the initial consultation and was very thorough and detail oriented, so I could only assume the painters would follow suit. Long story short, the painters were absolutely terrible! The crew dripped paint EVERYWHERE.  Inside and outside of my house were covered in drips of white paint.  **UPDATE:  The paint drips were on a brand new deck (less than 2 years old); a new rug (less than 2 years old) and newly installed flowerbeds/rocks less than a month before the paint job.  THIS WAS NOT FROM A PREVIOUS PAINT JOB!!!!   Every time they returned to fix something, they'd leave their mark on something else.  It finally got to the point that I didn't even want them on my property any longer.  The lame attempt they made to clean up after themselves was laughable and I was ready to cut my losses** The house wasn't prepped correctly and I have fresh paint peeling already!   They broke bulbs on my string lights and not only didn't tell me, but didn't bother to clean it up!   This crew was completely lazy and careless.  I'm glad others had a pleasurable experiences with Altract, but I would award zero stars if google would allow.", "pics": null, "resp": {"time": 1623942555535, "text": "Brian, I'm sorry you were unhappy with your painting experience.  The painters did come back to the house to clean off any drips and as we discussed with you onsite many of the drips were from the previous times the house was painted and could not be cleaned.  To my knowledge any drips or spills we were responsible for were cleaned from the house.  If you do have peeling paint from the current job we did for you please remember you have a 3 year warranty that covers any peeling, flaking, or fading. Likely this is not a product of incorrect prep but the conditions in which the paint was applied.  If any moisture gets trapped between the paint and the wood it will peel no matter how well the house was prepped.  This is why we offer the warranty we do.  Please feel free to contact us to schedule any necessary warranty work.  We are happy to fix anything we are responsible for."}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "107611241280046320573", "name": "Claire Green", "time": 1618952906735, "rating": 2.0, "text": "Terrible communication. What should have been a straightforward,  2.5 day job turned into a 5 week nightmare. I give 4 stars for the completed work (some pieces were still not replaced as discussed). However, I give the \"supervisor\" 0 stars for communication. No call/no show multiple days, even numerous days when weather was not a factor and they could have completed work. Voicemail box was so full I couldn't leave a message. After our color boards were dropped off, we NEVER saw Donnie again. Not once did he come to the jobsite after saying multiple times that he would, even though his crew (and their equipment) was at my house off and on for a month. What a shame because they came recommended by 2 family friends. Very disappointing...", "pics": null, "resp": null, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "105120802382963784393", "name": "Jesse Harris", "time": 1606768087224, "rating": 5.0, "text": "Donnie and crew did a outstanding job painting the interior of our house. Would use again and recommend them.", "pics": null, "resp": {"time": 1606800117470, "text": "Thanks for the kind words Jesse!  It was a pleasure working with you."}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "101378955593412329247", "name": "Sam Warren", "time": 1564089107440, "rating": 5.0, "text": "Altract did a great job painting some rooms in my home! They showed up on time, were very friendly, and didn't leave a mess! Jordan is easy to work with, and honest. I will be using them again!", "pics": null, "resp": {"time": 1565391106138, "text": "Thank you, Sam! Greatly appreciate the opportunity!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "116173584017306027382", "name": "Jenna Brady", "time": 1571066270202, "rating": 5.0, "text": "I highly recommend Altract Co. Jordan Means was easy to work with and provided good paint color recommendations. The prices were reasonable and the work done was impeccable. They finished in the time estimated and didn’t leave until I was completely satisfied. We had Altract Co. paint every room in our house, including ceilings, trim, doors, and walls. They did an outstanding job and our house feels so fresh and new! I would use Altract Co. again for any paint job.", "pics": null, "resp": {"time": 1571181205071, "text": "Thank you, Jenna! We greatly appreciate the opportunity to serve you on your painting needs. If there is anything we can do for you, please do not hesitate to call. Best wishes"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "109625795908644078122", "name": "Tori Quinn", "time": 1563995625717, "rating": 5.0, "text": "Jordan and the guys at Altract are phenomenal at what they do. Their customer service is top notch and their work is impeccable. All my friends that have used their services can't stop raving about how great a job they did. Definitely recommend. They do both inside and outside the house and even help you pick out the color making your life easier. Love love love!", "pics": null, "resp": {"time": 1566914963970, "text": "Thank you for your business, Tori!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "111205339057402325431", "name": "Joshua Snable", "time": 1564683298314, "rating": 5.0, "text": "Jordan and the guys at Altract are top notch. Pricing was very reasonable and the workmanship was impeccable. The Historic Enslen House makeover was no easy task, but Altract did it. Highly recommend!", "pics": null, "resp": {"time": 1565391078355, "text": "Thank you, Josh! You were a great pleasure to work with. Jordan and everyone greatly appreciated the opportunity to work on your home."}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "116451171296952717678", "name": "Mark B.", "time": 1564066841799, "rating": 5.0, "text": "Jordan and his team are the best when come to caring about their customer's satisfaction. Recommend them for my projects and others.", "pics": null, "resp": {"time": 1566915062695, "text": "Thank you, Mark! Jordan is one of our best!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "112789703384349632947", "name": "Brad Bradley", "time": 1565387401571, "rating": 5.0, "text": "Fair price. Timely completion. Excellent work. I recommend them without any reservation. Lauren was a pleasure to work with.", "pics": null, "resp": {"time": 1565390940599, "text": "Thank you, brad! Lauren has been killing it and doing an awesome job with all of her homeowners. Thank you so much for giving her and Altract the opportunity to serve you on your painting needs. We look forward to working with you in the future!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "107426084929796286187", "name": "Annabelle Hall", "time": 1571688737795, "rating": 2.0, "text": "The painting crew painted my windows shut! They pretended to remedy the problem but I finally had  to have it remedied  by another company. Cannot recommend them.", "pics": null, "resp": {"time": 1571690446998, "text": "Hi Mrs. Annabelle, I am sorry to hear about your experience. However, I cannot locate your information in our records. I have spoken to all of our estimators and project managers and no one has your name listed in our records or has knowledge of your name. Are you sure Altract Co painted your house? There is a company in Birmingham by the name of Atract Painting, who is not us. If something like this has occurred, we will always take care of it no problem. Please visit our website for our company information so we can get to the bottom of this. Thank you"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "101211663897998044861", "name": "Paige Robinson Briggs", "time": 1563971828072, "rating": 5.0, "text": "Jordan Means is a fabulous asset to Altract. He’s thorough and has high expectations on how work should be done.", "pics": null, "resp": {"time": 1566915172552, "text": "Thank you, Paige!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "105537099135984802255", "name": "Mike Bostick", "time": 1571160231561, "rating": 5.0, "text": "Lauren was a pleasure to deal with.  Her crew was prompt and did a good job of prep and painting two houses for us.", "pics": null, "resp": {"time": 1571181346612, "text": "Thank you, Mike! Lauren has been doing a great job taking care of her homeowners, making sure the job goes smooth and pain free. If there is anything you need, please do not hesitate to call. Take care"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "109411404578475139605", "name": "Jamie White", "time": 1563367316674, "rating": 5.0, "text": "Altract painted my office. The painters were on time and completed the project within the quoted timeframe. I would highly recommend this company.", "pics": null, "resp": {"time": 1566915203125, "text": "Thank you for your business, Jaime! You were a pleasure to work for."}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "115886720447889046617", "name": "Linda Smith", "time": 1534071111381, "rating": 5.0, "text": "I contacted a few companies in regards to getting estimates for my parents home. Tony was very professional, not pushy and a great communicator.  They did an outstanding job. Workers were professional and friendly. A very clean job! I would not hesitate to hire them again.  They will always be my go to company for painting jobs. Thanks guys!!", "pics": null, "resp": {"time": 1562939977218, "text": "Linda, it was a great pleasure working with you. Please do not hesitate to call if there is anything we can help with."}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "101258243481284499393", "name": "Rory Doyle", "time": 1563982331487, "rating": 5.0, "text": "Altracts atention to details and quality of work stands out. I have no problem referring This company to anyone in our sphere of influence.", "pics": null, "resp": {"time": 1566915103360, "text": "Rory, we greatly appreciate your candor and referrals. It keeps our business running and growing. Thank you so much for your business."}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "110500818666655555266", "name": "Casey Bentley", "time": 1563971924830, "rating": 5.0, "text": "Jordan Means and Altract Painting are great resources for ALL your painting needs.", "pics": null, "resp": {"time": 1566915137090, "text": "Thank you, Casey!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "115241158781197888624", "name": "Emily Kinnell", "time": 1566081267447, "rating": 5.0, "text": "Excellent experience with Jordan and his team! Would highly recommend them.", "pics": null, "resp": {"time": 1566914997927, "text": "Thank you, Emily! It was a great pleasure serving you in your painting needs!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "112973676233019122422", "name": "James E", "time": 1525897431634, "rating": 5.0, "text": "I got my exterior trim for my home painted and washed by Altract this spring. The painters were very professional and courteous. They also did an outstanding job. Tony was very professional and always considerate when I needed to speak to him regarding an estimate, scheduling the work, giving me a fair price, etc. He also came by as the painters were finishing up to make sure I was satisfied with the job. I absolutely recommend this company to do any painting you need done. Great group of guys and they even used top notch paint with a guaranteed warranty that was a full YEAR longer than any other company or contractor would offer. I'll definitely use them again in the future.", "pics": null, "resp": {"time": 1562939985467, "text": "Thank you, James!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "102888913225214980447", "name": "Quentin Dunn", "time": 1563973032961, "rating": 5.0, "text": "Jordan makes your home sexy again.", "pics": null, "resp": {"time": 1566915127228, "text": "haha Thank you, Quentin. I am glad Jordan could make your home sexy again"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "104310815458163873627", "name": "Joanna Stockard", "time": 1552748956855, "rating": 4.0, "text": "After a couple of miscommunications this Company went above and beyond to ensure I was satisfied. Jose was a complete professional in handling my project.", "pics": null, "resp": {"time": 1562939947518, "text": "Thank you for everything, Joanna!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "102315012630163601583", "name": "Elizabeth Sanfelippo", "time": 1558538730729, "rating": 5.0, "text": "We hired Altract to paint and replace the ceilings of our exterior porches, paint our exterior staircase, and repair and paint some soffits. Donnie Kuba was wonderful to work with. I had gotten quotes from several companies, and Donnie gave me the most detailed scope and line item pricing as requested. They were extremely reasonable with pricing and did a great job. Donnie made sure all items and details were handled. He was also patient with us as we have HOA mandates that require several quotes.  I highly recommend Donnie and Altract!", "pics": null, "resp": {"time": 1562939931446, "text": "Thank you so much, Elizabeth! Look forward to working with you in the future."}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "103509765661869836443", "name": "Mark Lilla", "time": 1555338554259, "rating": 5.0, "text": "Highly recommend", "pics": null, "resp": {"time": 1562939936968, "text": "Thank you!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "104274184268364850840", "name": "Jerome McReynolds", "time": 1621557399677, "rating": 5.0, "text": "I was very impressed with how they first called and informed me they were running behind schedule. When they arrived , they were very professional in asking questions and giving me their opinions. I tried to assist but they told me that they had it, but thanked me anyway. The technicians ( Ben & Blake )who did my work or did my service left me as a very satisfied customer. I would recommend this company to anyone without hesitation, and thanks again technicians for the fantastic service you gave. 5 stars 👌👌", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "108256535551356686186", "name": "CM Enfield", "time": 1592836963896, "rating": 5.0, "text": "Wow! We just rented a house that needed a total move-in spring cleaning. I knew the floor grout wasn't supposed to be black, and this company worked its magic to reveal the true beige color. A different team came out to do our carpets. Both were nice and professional, and the results were money (out of our own pocket) well spent!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOMhy0VhUAHeqMBgwYxVu2lVWMqgihsghLvMCop=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "100003811449885227083", "name": "Chris Daniel", "time": 1596135804612, "rating": 5.0, "text": "Very friendly and efficient to schedule. Tech was timely and professional. The floors looked fabulous and I could see the tech took special care of areas we had discussed during the walkthrough prior t ok cleaning.  This was at a rental home and I will be using Peaches N' Clean at the home I purchased. Great work.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "108831394462764944954", "name": "Mary Evans", "time": 1598485076875, "rating": 5.0, "text": "Called and got an appointment in 1 day. Cleaned 3 pieces of furniture in a timely fashion. Got rid of odor and stains!", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "108733450443150391535", "name": "Tommy Lawrence", "time": 1603316838602, "rating": 5.0, "text": "Good folks. Cleaned the carpet in my RV. Showed up right on the scheduled time.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "109068627345393167588", "name": "Jean Maccinile", "time": 1595614394875, "rating": 5.0, "text": "Got here when they said they would, cleaned carpets did an excellent job will  use again.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "107978750137499308434", "name": "christina novello", "time": 1589983844910, "rating": 5.0, "text": "Wow, these folks were professional and what a difference.  They got stains out of carpets and restored our tile to new. We bought a new house and the grout was black, it is white now!!\nHighly recommend  them!!", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "102059787182338555615", "name": "Mr. Dodds", "time": 1577214651949, "rating": 5.0, "text": "They did an amazing job on my floor tiles. Would definitely recommend them.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "104502209081344096589", "name": "Tolanda Beal", "time": 1579905234731, "rating": 5.0, "text": "Getting ready for our optimist District meeting.   Great place!", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "115101419679977199349", "name": "Autumn Hooper", "time": 1508859709839, "rating": 5.0, "text": "Incredible job on both an area rug and very tough to clean white couch. Highly recommend for carpet and upholstery and extremely friendly to work with. You won't be disappointed!", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "107562805379525930994", "name": "Barbara Marshall", "time": 1526951637774, "rating": 5.0, "text": "They cleaned an extremely soiled, 30+ year old, expensive authenic oriental 6x9 area rug.it was in awful shape...I thought about getting rid of it.  First time it had ever been cleaned in the 30 plus years I've had it.  Purchased it in Japan.\nI'm giving them 5 stars.....they deserve 6!\nThis rug looks new......it was costly, but worth every cent!  Great customer service as well!!....", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "107850941627328347402", "name": "Eric Friese", "time": 1496412647728, "rating": 5.0, "text": "We've used Peaches and Clean to clean our couch and clean carpets. They do amazing work! The couch looked new after they finished! They are my go to for cleaning services on the Eastern Shore.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "117556634074577234849", "name": "Katelyn Mcdonnell", "time": 1566526937247, "rating": 5.0, "text": "Defintely will be using Peaches’N Clean again! They were friendly and professional and did an awesome job on my carpet!", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "117157069867296229211", "name": "Dalphne Wilson", "time": 1558439586551, "rating": 4.0, "text": "Technicians arrived early and did a terridic job. I will definitley use Peaches 'N Clean in the future and recommend them to my neighbors.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "103478072782317202725", "name": "Rozanne Robinson", "time": 1564785011688, "rating": 5.0, "text": "Great service and good food.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "106301868249650439535", "name": "Carmen DiNunzio", "time": 1535389657008, "rating": 5.0, "text": "Did a great job cleaning the floors and oriental rug at Dr. Todd Roth's office.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "110476262666472443013", "name": "Troy Wiggins", "time": 1211907619007, "rating": 5.0, "text": "I was a little apprehensive when I saw the crew (young guys), but that was quickly put to rest with the professionalism and pride that they were putting into their work.  I also forgot a few things (not having water to the house, etc.) and they were very understanding and even had their own water truck to get around this.  Will definitely use again!!", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "114448670716666360729", "name": "julian jones", "time": 1529875163114, "rating": 1.0, "text": "Horrible service. They ruined the finish on my antique dining room table by leaking fluid on it, and then argued about it when my 91 year old mother called to complain. The manager was incredibly rude when I called him to protest both the destruction of the table and his inexcusable treatment of an elderly woman. I still regret that I did not sue for the value of the table as I should have done. I complained to the Better  Business Bureau which is a joke.  The company responded by saying that the manager was a \" youth minister \" at some church and so could not possibly be the jerk that I described! HA! Avoid at all costs. I tried to give them 0 stars, but will not let me.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "106741746079189902393", "name": "Dr. Brian Pleasant", "time": 1557418796631, "rating": 5.0, "text": "The did a great job", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "103928093621604817127", "name": "Annie Bishop", "time": 1554330382472, "rating": 5.0, "text": "Always does an AWESOME job!!", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "109137129221092745491", "name": "Dick Martin", "time": 1465939572185, "rating": 1.0, "text": "Terrible, totally incompetent service.  Stretched carpet, cut it short and left carpet short of tile so tack board nails are exposed.  Complained and they did nothing.  Did not stretch carpeting is a couple of rooms because they said they couldn't; actually did not want to move any furniture. The guy talked like a expert, but don't know didly-squat about what he was doing.", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "111278087079935969113", "name": "Harold Marks", "time": 1471653006505, "rating": 1.0, "text": "Yesterday, Thursday the 18th of August, I Harold marks and My fiancé Ambreshia Landrum had our carpets cleaned by them. they couldn't get all the stains out, even though we paid 140$. More importantly, coincidentally, my fiancés engagement ring disappeared after they left. Even though we can't prove they stole the ring, connect the dots for me. Be careful who you let in your house!", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "116199467977539803996", "name": "Daniel Hadden", "time": 1496330014134, "rating": 5.0, "text": "great company does good work", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "105376671315046224679", "name": "Judy Marshall", "time": 1564582388553, "rating": 3.0, "text": "To cold", "pics": null, "resp": null, "gmap_id": "0x888c299d9abc69ad:0x35ced07756123f95"}
{"user_id": "102965939881991180847", "name": "Terrial White", "time": 1610473652259, "rating": 4.0, "text": "Great place to get tile", "pics": null, "resp": null, "gmap_id": "0x886284f3a629322d:0xb8f01128f61005b3"}
{"user_id": "116463965998747276596", "name": "Rosa21 Hernandez", "time": 1477584501392, "rating": 5.0, "text": "Excellent work always", "pics": null, "resp": null, "gmap_id": "0x886284f3a629322d:0xb8f01128f61005b3"}
{"user_id": "102749941841067026920", "name": "Foster White Jr", "time": 1622313920274, "rating": 5.0, "text": "Great service. Call Randy and he will get you what you need.", "pics": null, "resp": null, "gmap_id": "0x888ced35054a2a75:0x6a311a010e4689f7"}
{"user_id": "116362318794893683951", "name": "John Folta", "time": 1473973769009, "rating": 5.0, "text": "Bi City has done many projects for us and we have always been super happy!  Randy, the owner, does an excellent job explaining how the project will progress and answering any question I have. He always goes \"above and beyond\". He offers an incredible warranty!  I would highly recommend them for any floor covering project.", "pics": null, "resp": null, "gmap_id": "0x888ced35054a2a75:0x6a311a010e4689f7"}
{"user_id": "116413293052156526165", "name": "Annette Oldham", "time": 1567082638056, "rating": 2.0, "text": "Never been there", "pics": null, "resp": null, "gmap_id": "0x888ced35054a2a75:0x6a311a010e4689f7"}
