{"user_id": "105174974441049847394", "name": "Carter Baldwin", "time": 1627568856861, "rating": 5.0, "text": "most fun fishing trip i’ve been on! captain jason put us on them! worth every single penny!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO6RlsoCgwdDoUhV4pUqjCQnhCrVBEr0BybLPNr=w150-h150-k-no-p"]}], "resp": {"time": 1629061895682, "text": "Thanks so much, it was my pleasure! Had blast! Hope to see you again!"}, "gmap_id": "0x889bb2f98e63f643:0xeca6a12312165f5c"}
{"user_id": "103356517091315690014", "name": "Clare Lisenby", "time": 1626268350427, "rating": 1.0, "text": "Terrible attitude. Acts like everyone should be grateful to go fishing with him", "pics": null, "resp": {"time": 1626284215214, "text": "To whoever this is….I don’t know who you are or have never met you. It’s hard to believe you can give a correct assessment when you have never used my service or talked to me. I have never had a bad attitude with my customers. They let me do what I love. I treat them like gold."}, "gmap_id": "0x889bb2f98e63f643:0xeca6a12312165f5c"}
{"user_id": "107739112992379123748", "name": "Brad Weaver", "time": 1603938401608, "rating": 5.0, "text": "Amazing trip. Caught fish about every second we were on the water. Captain Jason did an outstanding job with putting me on the fish. Highly recommend using Red Sky for a guided trip.", "pics": null, "resp": {"time": 1603999198920, "text": "Hey! man thanks!! I enjoyed having you! You tore them up for sure!"}, "gmap_id": "0x889bb2f98e63f643:0xeca6a12312165f5c"}
{"user_id": "105503423085430913341", "name": "Todd Foulks", "time": 1593132184069, "rating": 5.0, "text": "What a day! I traveled from NC to go fishing with my parents and was a little crushed to see that the weather was not expected to cooperate on our scheduled day. Captain Jason stuck with us and low and behold, the clouds parted and he put us on the fish! We had a great time pulling in some truly magnificent speckled trout and could have caught white trout all day long. A terrific host, extremely knowledgeable person about a lot more than fishing, and just an overall pleasure to hang out with. I'd highly recommend him if you're in the area and in the market for a guide/charter. Thanks Jason!", "pics": null, "resp": {"time": 1629061941164, "text": "Thanks so I have for taking the time to do this review! Thanks for the kind words and hope to see you again!"}, "gmap_id": "0x889bb2f98e63f643:0xeca6a12312165f5c"}
{"user_id": "110453516140782534330", "name": "Brad Hall", "time": 1587996475451, "rating": 5.0, "text": "Captain Jason Gamble is very knowledgeable about the area. He comes highly recommended on previous reviews and they are all accurate. Will definitely be fishing with red sky and Captain Gamble again.", "pics": null, "resp": null, "gmap_id": "0x889bb2f98e63f643:0xeca6a12312165f5c"}
{"user_id": "107978494347125855422", "name": "MLE K", "time": 1577976644389, "rating": 5.0, "text": "I wanted a super relaxed fishing and private tour around Mobile Bay, and that's exactly what Jason gave me. Professional, approchable, knowledgeable, and fun, Jason runs an excellent charter service. Although he is a professional, sponsored fisherman, if you're hoping to lay out on a beautiful, comfortable boat and enjoy the scenery, Red Sky Fish Co is the way to go!", "pics": null, "resp": null, "gmap_id": "0x889bb2f98e63f643:0xeca6a12312165f5c"}
{"user_id": "104203157718339038189", "name": "Olivia Borlovan", "time": 1557619137516, "rating": 5.0, "text": "Based on reviews I read prior to booking my fishing trip with Captain Jason, I was confident I had found the best charter along the Gulf Coast in my area, and he did not disappoint! Jason is extremely amiable and down-to-earth..He was so accommodating and did absolutely everything in his power to ensure we were comfortable the entire time and had the best fishing trip possible! Safety and giving us a fun trip were his priorities. Jason is an extremely experienced fisherman, captain, and guide and knew the waters and fishing spots better than the back of his own hand. He was so knowledgeable and helpful throughout the entire trip that I had no qualms putting full confidence in everything he told us. We found Jason to be a very honest, trustworthy and personable individual we cannot wait to fish with again!  I think it's safe to say that he took me on the funnest, most enjoyable fishing trip of my life! His passion for fishing shows and doesn't allow him to do anything but provide his customers with the best experience possible! If you're thinking about booking a trip with him, stop thinking and do it!!", "pics": null, "resp": null, "gmap_id": "0x889bb2f98e63f643:0xeca6a12312165f5c"}
{"user_id": "102219204199574007429", "name": "Patrick Hugh", "time": 1553648861442, "rating": 5.0, "text": "We had a great fishing trip with our Captain Jason. He is so experienced and knowledgeable about the fishing details. He was very pleasant and courteous. I highly recommend him and would definitely book another charter with him again.", "pics": null, "resp": null, "gmap_id": "0x889bb2f98e63f643:0xeca6a12312165f5c"}
{"user_id": "109253451766962425454", "name": "Jai Butler", "time": 1537133850791, "rating": 5.0, "text": "I’ve gone with Red Sky Fish Co. and Captain Jason Gamble a few times with my family and there was never a dull moment or any down time. My 4 year old daughter loved every minute of it and he was great helping her catch some fish. Our last trip, my wife and I caught tournament size Red Fish, my daughter caught a Baby Drum and we all caught Speckled and White Trout. If your looking for a fishing charter with someone who will go above and beyond to get you what you want, Red Sky Fish Co. and Captain Jason Gamble are the fishing charter you need and deserve.", "pics": null, "resp": null, "gmap_id": "0x889bb2f98e63f643:0xeca6a12312165f5c"}
{"user_id": "108986829808616666539", "name": "Andrew Kuykendall", "time": 1524328155945, "rating": 5.0, "text": "Incredible fishing trip. Captain Jason put us on plenty of reds and trout and we had an absolute blast. Great guy and great times with a group of 4. Young guy with a lot of energy and interest in making the trip a blast for groups of all ages. Highly recommend Red Sky Fishing Co Mobile.", "pics": null, "resp": null, "gmap_id": "0x889bb2f98e63f643:0xeca6a12312165f5c"}
{"user_id": "109932830882553654955", "name": "Doug Young", "time": 1525177651287, "rating": 5.0, "text": "We were in from out of town and had an awesome day on the water with Jason. He is incredibly knowledgeable about the area and brought us to some great spots — none of us left empty handed! The boat is great, the ride was smooth, the fishing was 💯 and we had all kinds of fun. Thank you!", "pics": null, "resp": null, "gmap_id": "0x889bb2f98e63f643:0xeca6a12312165f5c"}
{"user_id": "114479923328404309934", "name": "Kayla Butler", "time": 1537134293156, "rating": 5.0, "text": "Captain Jason Gamble with Red Sky Fishing Co really takes care of his customers! I cannot get over how great he is with my 4 year old daughter. He has patience with her and takes the time to really teach her how to fish. This was our 3rd trip and we are already planning a 4th trip during the fall! I will not go anywhere else. You get more than your moneys worth here; take advantage of it! Captain Jason is knowledgeable, respectful, motivated, and an all around great guy.", "pics": null, "resp": null, "gmap_id": "0x889bb2f98e63f643:0xeca6a12312165f5c"}
{"user_id": "107046304163218384839", "name": "Matt H", "time": 1525711591424, "rating": 5.0, "text": "Captain Jason is an awesome guide!  He put us in the best spot, and we hammered some fish.  If you are going to be in the Mobile Bay area and want to go fishing, Captain Jason is the man!", "pics": null, "resp": null, "gmap_id": "0x889bb2f98e63f643:0xeca6a12312165f5c"}
{"user_id": "109420299036856617840", "name": "Paul Scott", "time": 1525362421676, "rating": 5.0, "text": "Captain Jason Gamble was a great guide and made our trip fun and memorable. My wife and son had a blast and we definitely recommend this trip.", "pics": null, "resp": null, "gmap_id": "0x889bb2f98e63f643:0xeca6a12312165f5c"}
{"user_id": "110395528854033404253", "name": "Juan Pardo", "time": 1552255844175, "rating": 5.0, "text": "Went this morning with my father and two brothers and Cpt Jason couldn't have been more helpful. We all had a wonderful morning and look forward to going out with Red Sky Fish again.", "pics": null, "resp": null, "gmap_id": "0x889bb2f98e63f643:0xeca6a12312165f5c"}
{"user_id": "115329741354144352161", "name": "Robert Young", "time": 1553648621411, "rating": 5.0, "text": "Wonderful day fishing with Jason made my day Robert and Betty from ocala Florida.", "pics": null, "resp": null, "gmap_id": "0x889bb2f98e63f643:0xeca6a12312165f5c"}
{"user_id": "110483405128460557214", "name": "melissa dailey", "time": 1530813191722, "rating": 5.0, "text": "Jason knows where to find the fish.  On the first day my 30 year olds fished with Jason aand they had the best fishing trip ever. On the secind day we fished with our 5 year old Grandson and he had the time of his life. Jason is great with any age and any size group. Book early.", "pics": null, "resp": null, "gmap_id": "0x889bb2f98e63f643:0xeca6a12312165f5c"}
{"user_id": "115204676554254693980", "name": "Brittney Rush", "time": 1519186454143, "rating": 5.0, "text": "Great captain who had no problem finding us fish and wonderful views!", "pics": null, "resp": null, "gmap_id": "0x889bb2f98e63f643:0xeca6a12312165f5c"}
{"user_id": "102228618891179759463", "name": "brandon hartline", "time": 1524769939996, "rating": 5.0, "text": "Jason is a professional. Best money I have spent in a really long time.", "pics": null, "resp": null, "gmap_id": "0x889bb2f98e63f643:0xeca6a12312165f5c"}
{"user_id": "100283604086190790820", "name": "Tami Butters", "time": 1623867898360, "rating": 5.0, "text": "Michelle was amazing!  We scheduled a tour about 3 years. We happened upon one of MLK's former neighbors (Ms. Vera Harris) and got to sit with her on her porch swing and hear stories shared by Ms. Harris and her children and grandchildren.  Something we will never, ever forget and still talk about to this day!  Thank you, Michelle!", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "116658281037238512933", "name": "Rochelle Walker", "time": 1622784257394, "rating": 1.0, "text": "Promised family reunion skit. Never called never showed up. Johnson Reunion 2017", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "115012334055617999591", "name": "Nancy DeCicco", "time": 1609642868696, "rating": 5.0, "text": "Michelle made the trip interesting and personalized.  Would highly recommend it to anyone visiting Montgomery.  Great job Michelle!!", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "113438286098069781352", "name": "Susan Sanford", "time": 1548183483886, "rating": 5.0, "text": "I joined Michelle’s Selma-to-Montgomery tour and loved loved loved it. Michelle is a wealth of historical and local knowledge. I learned so much about the people and events leading up to the multiple match attempts to Montgomery, and we took an eye-opening visit to Selma, which has such a beautiful built environment and potential and people.\nTip—racial injustice in the US is so complex. I believe there is a lot of guilt and need on white people’s part sometimes to explain their experience of civil rights, i.e., to convey they are not racist. Try to limit your outbound communication and really use Michelle, ask questions and listen more than you go on about how racially enlightened you are. That’s my recommendation given with love.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNrauN51fW_bO2etPNst16LwKTZjVTHJxIe5PZk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "108910401718791844032", "name": "Lee Pedinoff", "time": 1547140075916, "rating": 5.0, "text": "Do it.\n\nMichelle is a gem, and she led our 40+ person group on a tour of Montgomery that we’ll remember for a long time. The tour was unlike anything we’ve ever experienced. It was packed with incredible stories, music, and surprises.\n\nMichelle is one of a kind. It’s clear she poured her heart and soul into creating a special experience. And it shows.", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "103813407702347257750", "name": "Katherine Borsecnik", "time": 1544361064985, "rating": 5.0, "text": "We had a moving, informative tour with Michelle. it was a wonderful experience for us because of her personal touch, deep knowledge, sensitivity and creativity. The things we saw, the people we met, the stories we heard will stay with us a long time. We were inspired and I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "109328075607335703012", "name": "Ryan B", "time": 1530553122837, "rating": 5.0, "text": "Book this tour. It is amazing, unique, intimate, and informative. Michelle is an incredible and engaging person; she will make you think, reflect, and laugh. We asked her many random questions – about Montgomery's past and present – and she had answers ready to go. You will see and learn so much about Montgomery's history, from the slave trade to the Civil Rights Movement and beyond. I cannot recommend this tour enough!", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "103826375414557800908", "name": "Glenda Argo", "time": 1526053884531, "rating": 5.0, "text": "Fantastic tour!!! I realized while touring how much I did not know about the city in which I have lived for 32 years. History comes alive on this tour of downtown Montgomery. Michelle makes this tour fun but incredibly real. I highly recommend More Than Tours!", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "107130242733026035721", "name": "Katy Lamb", "time": 1502232049994, "rating": 5.0, "text": "I had THE BEST experience with Michelle! Despite being in Montgomery for a couple of weeks already, she uncovered so many hidden spots that I had never found out about anywhere else! She is an amazing guide, and has such a heart for the city, it's really infectious! She's incredibly knowledgeable about the historical and political landscape of Montgomery, and the stories she weaves into the tour are refreshingly honest about Montgomery's history, and the people who shaped it. Can't recommend her enough - do yourself a favour and book on to a More Than Tour while you're in Montgomery - I know it will make your day, and maybe even your trip!", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "114558522275868490211", "name": "Steve Strain", "time": 1517091042334, "rating": 5.0, "text": "This tour is amazing!!!  As a military person we are expected to know history and learn from it. We are especially expected to know the history within our fantastic country.  Michelle does an outstanding job reminding us and enlighten us on the history from the civil war to the civil rights in Montgomery, Alabama. Right outside the gates of the historic Maxwell Air Force Base is the up and coming city of Montgomery and all the history it holds.  Michelle opened my eyes. If you think you know the history of our country, I challenge you to sign up for Michelle’s tour. You will learn (probably sing) and marvel about the good, bad, ugly and beautiful history in Montgomery.  You will undoubtedly be entertained, but more than anything, you will be a more knowledgeable and proud American after this tour.", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "108381510504973617890", "name": "Buena Browder", "time": 1529468709976, "rating": 5.0, "text": "I had guests visit last week from Chicago and Alanta. We took Michelle's More than a tour they enjoyed her and the tour so much they are coming back with their youth group from Atlanta and a mission trip for adults from Chicago. Michelle's tours are having a impact in Montgomery. I hope the powers that be realize her worth. We are so proud of her.☺", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "104957288882446435307", "name": "Marianne", "time": 1564525587893, "rating": 5.0, "text": "We fid the Civil Rights tour and this was the best part of our daytrip.  Michelle gave insightful information about Montgomery.  I had no idea the depths of history in that city. I have a much better opinion of the city. You have to take her tour especially if you go to the Legacy Museum and the memorial.  Michelle's tour tied it sll together!! Very reasonably priced as well!", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "113928421058678731373", "name": "delanebr1", "time": 1503339380268, "rating": 5.0, "text": "Michelle is an amazing guide. She really brings civil rights history alive and creates a unique and interactive experience. Her tour was the highlight of our trip. Don't miss it!!", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "111091360748952137282", "name": "Andrew Gomory", "time": 1522791425379, "rating": 5.0, "text": "Best tour ever? Anywhere? We came to Montgomery as the first stop on a self-guided civil rights tour that culminated in Memphis for MLK50. Michelle is knowledgable, interesting, fun and, despite her modestly, a good singer. She customized the tour as our interests and level of knowledge became clearer and filled in LOTS of interesting and pertinent info about life in Montgomery today. She is well known in the community and was constantly saying hello to people along the route. She had excellent recommendations for what to do after the tour as well. Couldn't recommend more highly.", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "112155664463424877162", "name": "Charalaina Heard", "time": 1570458448340, "rating": 5.0, "text": "Amazing Tour!!! We will book with her again when we return to Montgomery AL.", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "118060875314205110887", "name": "Eileen Mariano", "time": 1526477433338, "rating": 5.0, "text": "Michelle’s tour was fantastic! She is knowledgeable, kind, full of energy, and was very flexible with the tour scheduling! She tells a truthful history of Montgomery, and I learned so much about the city’s history. I recommend that every visitor to Montgomery take Michelle’s tour!", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "104888001770642382474", "name": "Nancy Snyder", "time": 1508532324710, "rating": 5.0, "text": "Wonderful tour - both educational and fun.  Love the passion Michelle shows for her city, history and tourist.", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "114357654593892778227", "name": "ARR", "time": 1531955296179, "rating": 5.0, "text": "This tour talks about Real history. sometimes it's hard to hear but montgomery was a key hub for slavery so overlooking the facts of what happens means you missed the history of the city. I highly recommend this knowledgable company to breakdown what actually went down. the good, the bad, the ugly.", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "116692071160650638904", "name": "Stephen Allen, MD", "time": 1522283378594, "rating": 5.0, "text": "Michelle is a rare find. Combining history and heart, wit and wisdom, heinous and humor, story and song. We learned many things on her tour including the powerful energy which forms the arc of history bending towards justice is alive in Montgomery. We will be back and she is a significant reason why.", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "106745481142380730554", "name": "Dale McGhee", "time": 1516899807686, "rating": 5.0, "text": "She is da Bomb!!!!!!!!  Always at the precipice of what is happening.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN3_vuoyZJH-k92Pa7LBinhLGFnf9NLQQfVK5rM=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "115645515755855313104", "name": "Milan Gokhale", "time": 1521230380816, "rating": 5.0, "text": "This was the most incredible historical, artistic, political city tour experience that we've ever had. The highlight is, of course, Michelle Browder, one of the most important contemporary voices in America today. Michelle follows in the footsteps of thousands of great African Americans in Montgomery who fought for equity, justice and self-determination. On her tour and in person, she's every bit as funny, passionate and incisive as her TED talk. We learned a ton about who she is, and why this tour is so important to her: she's run for office three times, she's related to the famous Browder U.S. civil rights court case, she's involved in running youth programs for the community, and she comes from a background of justice organizing and political activism.\n\nThe tour itself does a great job of highlighting recent civil rights wins in Montgomery, but also tells the hidden stories and secret histories that aren't visible or celebrated in the city. Michelle customized the tour once she heard we were particularly interested in learning more about Indigenous history and criminal justice reform, plus she tailored her stories to connect our experiences with the Montgomery reality.  Overall, we were so thrilled with this tour and we told all of our friends about it. Do yourself a favour and book this tour asap!", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "112934179087684866220", "name": "Jeff Becker", "time": 1504998973635, "rating": 5.0, "text": "Amazing energy and excitement made this a great tour during a bad time under evacuation from Hurricane Irma. Thank you Michelle!", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "107670200544318274283", "name": "Cherrel Turner-Callwood", "time": 1534883473229, "rating": 5.0, "text": "She knows her stuff.  Very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "110812453223627118371", "name": "T. Rick", "time": 1541549407697, "rating": 5.0, "text": "5 super power stars fer Michelle Browder!", "pics": null, "resp": null, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "101125912802298009249", "name": "Ken Greenwood", "time": 1526428043846, "rating": 1.0, "text": "Very disappointing.  We had expected a tour of Montgomery  with explanations about the different buildings, etc.  Instead we were told only about slaves and their suppression.   She said segregation is not over.  It is only evolving . Wore pins about black power,  etc.\nWe did not want to pay  $20 for lesson on segregation.", "pics": null, "resp": {"time": 1589902561778, "text": "We should have charged him 50.00 since he was clueless about Montgomery history and foundation."}, "gmap_id": "0x888e816e8af189d3:0x5261fa4e011e3272"}
{"user_id": "107711991461897190389", "name": "Adrian Breedlove", "time": 1623864025972, "rating": 5.0, "text": "The crew at Middle Tennessee Hot Air Adventures is top notch. I booked a flight for my wife's birthday, but it had to be rescheduled due to weather. TN Balloon doesn't control the weather, and like Logan said this morning while we were soaring over Williamson County, \"I'd rather be on the ground wishing I was in the air than in the air wishing I was on the ground.\" The entire crew works hard to ensure your ballooning adventure is a great memory for a lifetime, so we were happy to reschedule. This morning we arrived at the meeting point and were whisked away to a launch site. When the balloon was ready, we took off just in time to see the sunrise over the horizon. Floating over Williamson County was an amazing experience that our pilot Logan made seem effortless. He explained the theory & science of balloon flight, the controls, and what to expect with an easy professionalism. The entire flight was something that we'll remember forever, and experiencing what seemed like a precision touchdown was awesome.\nIf you've always wanted to float above the earth while hearing everything below you and around you, then I highly recommend TN Balloon. They stay booked up, but it's 100% worth the wait. We'll definitely fly with them again.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMsYSF91vKWDfwr4OoJtk3bSqheOYqSkR1ZVWut=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMTVv25_ABynAY2ur3QVSk6naBgD8ohJsyPCPuC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOh0Zg_QpGVLWgKFaDyR4_vzXcLXVE4V7pamnej=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMfRqG6PNRrIA-_7SUWmap0R_C0SfFG6LPh-_-H=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNzpIEtmpCLIXlJsgi_DguK46hfN1meO0fdX1eQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOeWeEcAnhhkfzGpi_LbSKF0baJ0AQ9CjAXj_1u=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN17F6oeha5tZsaTBF8xXS4nRS_t2A4CPM7dbvh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOW7QjT2oKw_8ob3uf2Vv5NDhaxRqro4I2NMGuu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOOmzRg7jPf8TjtMxZtCVwrQ69ux2gjsdosPqpX=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "108149841516168486328", "name": "Lisa Berry", "time": 1621891098566, "rating": 5.0, "text": "The flight was amazing.  The crew verified the night before (sunrise) flight was good to go.  They were prompt at the pick up site.  Gave a good safety brief and had the balloon ready to go in no time.  Due to no fault of the crew flight had to end early.  They handled everything quickly and safely.  The pics were great.  You can tell they love what they do.\nDefinitely will do again for the sunset flight.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMVJC-Vwui_NCux1ryFLecWnCpoTyQam7_TmLG6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP_fQIh83YJKj9GZNtLDSM3AnDmXw7Gb9P66m26=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNfPaRUxI-4O5tt3AnU0-phkGzbzDdpCIRXqpXr=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "117447784370922376641", "name": "Brenda Vicente", "time": 1623119386636, "rating": 5.0, "text": "This has been on my \"bucket list\" for years and this was a wonderful Mother's Day gift. Logan and Tina were professional and very friendly. So knowledgeable, you were never concerned or worried. Smooth start and smooth landing! I highly recommend Middle TN Hot Air Adventures and Logan.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNkvP80NOoUMutGQHoOVhIfJl0OBiPSMQ6fGrjw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO2DnwwP4QwjqkS0AwdIar1FB7wZJwDaTBg0_PD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMI7qf66PXfuF543Hd8A7fa4AoP21HAMyJiAAGJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPxi_EVmKgH8JZjdtqrDhFRmwwbInKk6fqDW38b=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "106647878554566505350", "name": "Leslie Pardue", "time": 1624032590121, "rating": 5.0, "text": "We had such a great experience!  Don't wait, just book your flight! You will not regret it!  The crew was so friendly and professional.  This is definitely the best way to appreciate our beautiful area. We will be repeat customers.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPcTMQcj8xxVYWRXSXO7uAeNN8uHRP2khHFxXM0=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "108891062486129372414", "name": "Shawn Nelson", "time": 1617586663190, "rating": 5.0, "text": "Logan, Bennett, and Tina provided a first rate experience for my wife's birthday surprise. Their knowledge, thoroughness, and charisma far exceeded our expectations. Their proficiency was readily apparent in the expedience of the ballon preparation as well as the crew coordination through all phases of the flight. Thank you guys for a very memorable experience!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMwzRThHnaHFVoWPSgA_ccgVxOR4V2eWR_ArgQK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPeupshyYYHoVHwv_1XoWyJHKQwbWA-ACxmJgh4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNrrmRgQiQ8BOXFu-rvE-IUE612abuK3-DxbNDn=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "102810581020801450489", "name": "Melody Clayton", "time": 1621697309900, "rating": 5.0, "text": "Trip of a lifetime!  The Logans are professionals, informative and made me feel very comfortable.  I have always wanted to take a hot air balloon ride.  It was amazing seeing the world in such a smooth and peaceful way!  Totally recommend this company for seeing beautiful Middle Tennessee from the air at 17 mph for over 5 miles as the bird would fly!", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "105182938430889722659", "name": "Bruce Thompson", "time": 1619100197514, "rating": 5.0, "text": "We flew last Friday morning April 16, 2021 and it was simply incredible. Logan and his pilot and crew were on time, extremely experienced, and very warm and accommodating. We were originally scheduled to fly the day before but had to cancel because of weather. Logan worked us in for the next day and my out of state guests really appreciated that. Several in my group said that they were afraid of heights, but this flight was just different and did not seem to bother them. The views from above were breathtaking as the sun was coming up. Without a doubt, I will certainly use them again with other guests. Great job guys!", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "110740013831716158822", "name": "Jill Austin", "time": 1619476302487, "rating": 5.0, "text": "Logan and Tina were so awesome to work with on our \"bucket list\" hot air balloon ride this morning!  We had to shift the days to get excellent weather and they were so accommodating!  It was so smooth and as exciting as I thought it would be!! Can't wait to go again!", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "112681174471874370952", "name": "Tonya Grissom", "time": 1617486075327, "rating": 5.0, "text": "Our hot air adventure was AMAZING! I am scared of heights, and our pilot Bennett gave me some tips that got me over it quickly. It was such a smooth and peaceful experience! Riding in a joy air balloon was on my bucket list...so glad I choose Middle Tennessee Hot Air Adventures to check that off my list!", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "101291280043997758397", "name": "Bob Long", "time": 1621186890418, "rating": 5.0, "text": "One of the best experiences we have ever had! Logan and Tina were the Best! We want to go back and take our friends.", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "103480436415732198982", "name": "Jay Power", "time": 1591577255558, "rating": 5.0, "text": "Had an amazing time. Logan and Tina are awesome and made us feel like friends. Logan is a local native and familiar with every little area. Highly recommend!! Morning flight was beautiful.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMu1GVmX188IHdAml6yHw1OWU0lhDYC0N37hKZF=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "115397203870005548857", "name": "Tina Duffey", "time": 1571406178678, "rating": 5.0, "text": "Beautiful experience! I highly recommend Logan and MTHAA for a ride filled with breathtaking views, some history on notable landmarks, and excellent communication including clear directions and expectations.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPpjw8_z7h77jGZknb6JYC52sPSpDrcNPoD2gSS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOLI6doSentxFUsmXEny-876lPEdkLmeEtMQ6yz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM4Sy5Mt87o7N7KbIwTluDW1t3Tlo5JUsxQJnvs=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "104311156887385829462", "name": "karen ledford", "time": 1521948656649, "rating": 3.0, "text": "Attended one of the festivals they put on at the Westhaven Town Center in Franklin. Pretty cool, but I still don't understand why they don't lift off. That would be cooler.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNUq8H2U7nLH9-daAXbD_qgsg8Re_-HvUPxXN9k=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPX2ek_qxeIjfu4aGjaBdZ4dtweBcf55C8Mi5dW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMvdUvw5z28Iki382KCCVjH1_6hDpK3i4rZXICw=w150-h150-k-no-p"]}], "resp": {"time": 1521990189074, "text": "Karen, I am confused by this review as we do not \"Put on\" any of the balloon events.  We are simply hired by the event to provide the balloons, they tell us what they want us to do.  We do not lift off because they do not want us to and they pay us to stay there and do a balloon glow, not fly away from the field.  I understand your frustration but I would appreciate it if you remove this review as it is something that is not in our control or we have any decisions making power over.  If you have a complaint about a balloon event I would talk to the people organizing the event."}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "103603772746550010828", "name": "Tanya Chabot", "time": 1571407626097, "rating": 5.0, "text": "So, let me tell you just how amazing this husband wife duo was. I flew in from Boston and was surprised with this gift, 30 minutes before I was lifting off the ground. With a flawless set up, clear expectations of what to expect and perfect timing. We gently lifted off the ground to watch the sun rise. We floated over the “square” saw the beauty of Tennessee’s landscape with the mountains peaking up into the sky. Logan was thorough in sharing with us what he was doing, where we were and how we were going to land. An hour later we gently touching down, to learn a little history of hot air balloons and share a toast before being shuttled off back to our vehicles. It was an experience of a life time. If you haven’t done this, you have to with this team! Thanks Logan and Tina for the best experience I could hope for you.", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "113525439556357041220", "name": "Tim Jaskoski", "time": 1567267027897, "rating": 5.0, "text": "Wonderful experience with Logan this morning!  There is nothing like floating above the trees, hearing birds chirping in the morning light and observing the world below. Professional but fun crew. I can’t wait to do this again!", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "116578341093644836117", "name": "VFX Blender", "time": 1536341454381, "rating": 5.0, "text": "I went balloon riding today in Franklin and I must say it was most enjoyable. I had contacted the staff earlier about weather related, days before flight and they responded to my concerns. Their team were very professional and I felt very safe riding in the balloon. I also got some great pictures.", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "110915694455690678260", "name": "J Gray", "time": 1499524460613, "rating": 5.0, "text": "I'll start with the fact that this was my first experience with a balloon ride. Logan (the pilot) and his lovely wife were clear, attentive and friendly the entire time! For anyone who may be concerned going in that they don't know what to expect or how to behave- when you take off, you absolutely will. They make it totally clear in concise terms. You'll really feel confident going into the ride.\n\nThe experience is one that is surprising! Take off and landing are gentle yet exciting- far more so than a plane! The views are spectacular and Logan remains in constant communication with the ground crew. In addition to all of that you'll learn about the history of ballooning! I won't spoil it all, but don't hesitate to take this leap with this company! They are amazing people and will provide an amazing experience! Support local business!", "pics": null, "resp": {"time": 1532638414490, "text": "Thank you for the review, we are truly honored to share our passion with passengers on every flight."}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "116056171764579705927", "name": "Tracy Poth", "time": 1530807145405, "rating": 5.0, "text": "1st time in a balloon. Logan, Tina and the rest of the crew were phenomenal! Very professional and personable at the same time. I will go again in the fall. Plan to make it apart of my budget to go at least twice a year during different seasons. A great way to unwind and enjoy peace and tranquility. Worth every penny.", "pics": null, "resp": {"time": 1532638491821, "text": "Tracy, thanks for the review.  Each season provides a unique variation for ballooning over Middle Tennessee.  We are happy you had fun on your adventure and look forward to more!"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "111536336082218873812", "name": "Evan R. Murphy", "time": 1466053353758, "rating": 5.0, "text": "The whole experience was fun and fascinating, a real treat. Getting up before sunrise with family and friends (you can go in the evening if you prefer). Watching them set up the balloon (surprisingly awesome to watch!) Climbing into a basket with 9 other people. Going up in the sky and taking in Nashville from great heights. Learning about ballooning from a very knowledgeable pilot like Logan. The jokes and fun and interesting stories with Logan and Tina both. We all had a wonderful time, and I highly recommend it!", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "102081948684529953480", "name": "Landon Reef", "time": 1463772023018, "rating": 5.0, "text": "Amazing team effort by a group of really great people. Our weather wasn't ideal for our original flight and they were able to reschedule for the next morning. It was an amazing ride I will never forget. I would recommend these guys be your first stop if you are thinking about taking a ride in the skies!", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "101486352818060445661", "name": "Steph Waldrop", "time": 1469812041173, "rating": 5.0, "text": "Middle TN Hot Air Adventures provided a tethered ride for guests at our corporate picnic/barbecue. They were extremely professional throughout the entire process - from booking the event through to the last ride. Logan and his team are highly skilled and bring a depth of experience that is second to none. And, our guests LOVED the balloon ride -- it was the hit of the party for sure!! We can't wait to have them join us for another event!!", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "117824375591109854955", "name": "Jeff Hart", "time": 1500477103750, "rating": 5.0, "text": "Logan and Tina run a tight ship!   Excellent experience from start to finish.  Our first ever hot air balloon ride, and these guys made us want to do it again!", "pics": null, "resp": {"time": 1532638558917, "text": "Jeff, thank your for your review.  We strive to make each adventure fun and memorable for the passengers.  What make our job so much fun is the passengers that we get to share it with!"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "115085932891367060371", "name": "John Coode", "time": 1499261071465, "rating": 5.0, "text": "Great trip with fabulous views. Logan was very professional and was accompanied by a very competent crew and his wife Tina who was a great host for the trip. A wonderful experience!", "pics": null, "resp": {"time": 1498482124225, "text": "John, it was so much fun taking you and your family flying and celebrating a few birthdays! Hope to see you guys again, maybe next time you can log some flight time!"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "117534217950707202703", "name": "Aimee Clever", "time": 1465775198953, "rating": 5.0, "text": "Fantastic! So surreal to see the sunrise and the beautiful country side from this vantage point. The weather was beautiful, and we felt completely safe with our pilot Logan. There is such a feeling of peace and quiet as you float along at the same speed as the wind, this is a trip not to miss! Thank you! :)", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "111026273515077331276", "name": "Mela Masser", "time": 1442320083977, "rating": 5.0, "text": "We had the best time with Logan and his crew!! Can't recommend these guys enough! We were on our honeymoon and wanted to something fun to mark the occasion. So glad we flew with them as they really took care of us. It was an experience we'll remember forever :-)", "pics": null, "resp": {"time": 1456424254668, "text": "Mela,\nFirst I want to apologize for taking so long to reply to this review.  We really appreciate your kind words, and it makes us so happy to know we were able to add some fun and excitement to your trip.  Thank you again,\nLogan"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "100346504749929069277", "name": "H. Ray Wilson", "time": 1444640355030, "rating": 5.0, "text": "Can't positively comment enough to describe how great THE HOT AIR BALLOON RIDE was.   Logan and crew were very professional, informative and friendly.  The view was naturally spectacular and didn't expect anything less from Middle TENNESSEE.  Hoping to carry my 13 year old Grand Son and other family members in the not to distant future.\nH. Ray Wilson, Eads, TN", "pics": null, "resp": {"time": 1456423518740, "text": "H. Ray, we are happy you were able to fly with us.  It was a pleasure to take y'all flying.  Thank you for the kind words, we are always working to make your experience better.\n\nThank you,\nLogan"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "107743794690208673628", "name": "Tom Todd", "time": 1414675958771, "rating": 5.0, "text": "What a wonderful experience! On Oct. 25th my husband and I had a flight with Logan and Tina.  The view was spectacular and everything was explained fully. Peaceful is the word I would use to describe how it felt. I have talked to friends about it and 4 of them are looking forward to going in the future. Thank you for such a fantastic time.\n\nCarol Todd", "pics": null, "resp": {"time": 1436845589877, "text": "Carol, we are so excited to know that we met your expectations for a wonderful ride.  Thank you so much for recommending us to your friends and make sure they mention you when they fly!! We always say the passengers make our job so much fun!"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "107598472877036025421", "name": "French Snapp", "time": 1443005064861, "rating": 5.0, "text": "The balloon ride was a anniversary gift for my Wife and I must say it was fantastic from start to finish.. We loved every min and highly recommend it.", "pics": null, "resp": {"time": 1456424109245, "text": "French,\nWe wanted to take some time to say thank you for your kind review.  We know you do not have to take extra time out of your day to do so but we want you to know that it means a lot to us.  We are happy we could help make your Anniversary one to remember and are pleased to hear you enjoyed it.\nThank you,\nLogan"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "118164341787195143386", "name": "Wilma Leming", "time": 1444741999894, "rating": 5.0, "text": "It's hard to describe. It was a very uplifting experience for me. I hope to do it again next fall.", "pics": null, "resp": {"time": 1456423864673, "text": "Wilma,\nThank you so much for your review.  We were so excited to have you fly with us and we are glad that Wayne was able to join in on the fun!\nThanks again,\nLogan"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "117627743500346434766", "name": "Lori Vines", "time": 1444493390988, "rating": 5.0, "text": "Hands down the way to go if you are looking for a hot air balloon ride. They truly care for the customers safety and to make sure you have the best experience you possibly can.", "pics": null, "resp": {"time": 1456423981944, "text": "Lori,\nWe really appreciate your kind words.  I am glad you were able to see how much we care about your experience.  It is why we fly hot air balloons. We hope your experience is something you will cherish for a lifetime!\nThank you,\nLogan"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "105195013429070456203", "name": "Kimberly Edgeworth", "time": 1447707717204, "rating": 5.0, "text": "Had a fabulous experience!  Very impressed and pleased with our hot air balloon ride!", "pics": null, "resp": {"time": 1456423618409, "text": "Kimberly,\nThank you for the kind words.  It means a lot to us to know that our passengers are happy with their experience.  We are always striving to set ourselves apart and provide you with the most unique trip.\nThank you,\nLogan"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "116924457386778995694", "name": "Jackie Miller", "time": 1439819083382, "rating": 5.0, "text": "Hot Air Ballooning should be on everyone's bucket list! If you've thought about it, don't wait - DO IT NOW!  You will be so glad you did!\n\nLogan and the folks at Middle TN Hot Air Adventures have the experience and the equipment to make it an experience of a lifetime!", "pics": null, "resp": {"time": 1456424366259, "text": "Jackie,\nI am happy to know how much you enjoyed your experience with us.  We truly strive to make each flight unique and the best experience for each individual.  Thank you for choosing us, and thank you for recommending us to others.\nLogan"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "112343900810187398769", "name": "Jennie P Ingram", "time": 1496667712880, "rating": 5.0, "text": "My husband and I took a ride with Middle Tennessee Hot Air Adventures to celebrate our 10th anniversary, and it was a wonderful experience. Our original date had to be rescheduled due to storms, but Logan was great about tracking the weather and keeping us informed. It is obvious the second you meet them that Logan, Tina and the crew truly care about giving people a memorable flight. We took off from Arrington Vinyards, and floated over Arrington, Peytonsville, and Franklin for an hour. Set up and packing up were both fast, and fascinating to watch happen. We enjoyed the Balloonist's Toast of champagne, and the fun of meeting new people on our adventure. If you've always been curious about ballooning, take a trip with the good folks at Mid TN Hot Air Adventures. You won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "110958770210895406230", "name": "Claudia Pinto", "time": 1453947935478, "rating": 1.0, "text": "He rescheduled multiple times over several months. When I asked for my money back, he refused and would only give a partial repayment.", "pics": null, "resp": {"time": 1456423415267, "text": "Claudia,\nI am a bit surprised by your review.  After checking our records it seems you purchased a discounted Holiday Gift Certificate for $360 on 12/18/2010, that is 6 years ago.  Our gift certificates are non-refundable as are most gift certificates in the United States.  The next transaction I have with you is 12/10/2012 where I refunded $300, which you agreed to, and canceled the gift voucher.  I am not sure why you waited another 3+ years to write this review.  I find it fair to refund most of original cost for this Gift Certificate which is non-refundable to start with.  I am sorry you were not able to fly and yes we rely on good weather to safely fly.  Please read through all of our information available on the website and if you have any further questions please call us before making any purchases.\n\nThank you,\nLogan"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "104487700593845080424", "name": "Jabberwocky4k", "time": 1543249470929, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "114723348851265397542", "name": "Andy Hargrove", "time": 1623898200852, "rating": 5.0, "text": "Great trip with Capt. Patrick!  He was great with my 8 year old, put us on the fish, and made sure we had a good time.  I will definitely book again if we head out to Mobile Bay!", "pics": null, "resp": null, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "114337320036072770007", "name": "Eric Wittig", "time": 1623450952825, "rating": 5.0, "text": "Captain Patrick did an awesome job listening what we wanted to catch on our trip and putting us on a load of fish. The morning definitely flies by when everyone is catching fish and you get to land some fish on a variety of tackle setups. I would highly recommend Ugly Fishing to anyone who is taking a trip down to the coast! Book now, you won’t regret it.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMgEDwbKVNDjkzRMn88-EdRi87PoWmqjSVbeLQp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPEUbmaUJZG69r3QY2-AM39NJ49iXdZbaGkysGm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMs4MugQcfW2X9wVZbyyBLNcwxgyqjPlLcCWwPT=w150-h150-k-no-p"]}], "resp": {"time": 1623503350441, "text": "Thank you sir for the review and for the business. It’s a real joy for me as a guide for anglers to be able to experience a variety of fish and or tactics. You and your dad did fantastic and I hope to be your guide again in the future."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "101519326332276940404", "name": "Jamie Lindsey", "time": 1623962231251, "rating": 5.0, "text": "Captain Patrick is awesome.  We had been on 5 trips with him and we always have a great time and catch lots of fish.  His wit and wisdom make the trip very enjoyable", "pics": null, "resp": null, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "112288867397054591227", "name": "Davina Hood", "time": 1617237763679, "rating": 5.0, "text": "Love our trips out with Captain Patric! He put us on some good fish to catch. We have booked 2 trips with him to date and for sure will book when we come back again. Captain Patric has us spoiled to fishing, which is only made better by family competition!\nI definitely recommend using Ugly fishing LLC. This is definitely a new family favorite that our kids look forward to! Thank you for such a great time !", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO1AHVBK3xOGOS_xrbh1XzYj_QkddDT1gHT10oX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMn_qCrhFQP7ulQDz39gO1pk4wwK9wi6dquxgIi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN-lk-c-hBLjxew8hVUKjAwmehjth8VhvmJx4n_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOiSrEqgOI_HJu28Fy770J_VnFXTQ8PazDlptMQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMSOzRfx-3anwdD5LYazbaIoL-9R6EEZdP56oEH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNkBNhF0uvhX8qecIXl9KZOgQfPF5obkKW4OcxX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPZMD0P9RIhK8fUB80tld83DsNX6dfPRjtoz3nh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNaJ-zuq1Q30ESFpKzRS8ACn14GlYHzxN0arwbf=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP0AIPN_bESW1rffLKA6chqHdVKkVvhCQ5Mn5F3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPUUIIu17n9snqBTLxGheg5Vwt8cygDfLYpRQxp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMjisHin81_jXNv-7SJgVPDNUlK4UvXWsVlUsQ0=w150-h150-k-no-p"]}], "resp": {"time": 1617276174965, "text": "Thank you so much for continued business and for the awesome review! It’s a real pleasure to be your family’s fishing guide and I absolutely love the competitive nature."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "102679475974695426697", "name": "Bryan Viles", "time": 1623873486637, "rating": 5.0, "text": "Captain Patric is a class act. He put us on the fish! We  connected with multiple trophy sized speckled trout! Definitely the guy to call if you’re in the area and looking for an excellent fishing experience.", "pics": null, "resp": null, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "112990195166020509561", "name": "Daniel Barbier", "time": 1611782199084, "rating": 5.0, "text": "I highly recommend Capt. Patric if you’re in the Mobile Bay Area and want to catch fish. I was on a family trip in Dauphin Island and wanted to make a solo trip to try and find some bigger speckled trout and we did just that.  Within 45 minutes of leaving the dock, I had a 22” we each had a 20” in the boat along with some others that were in the 15-18” range.  Overall I was very pleased with the trip, Capt. Patric was very knowledgeable and the boat was really nice.  I’ll definitely be giving him a shout next time I’m in the area. Thanks again Patric!", "pics": null, "resp": {"time": 1611803585497, "text": "Thank you for the review Daniel! It’s my pleasure to have put you on the fish you were after. I hope you enjoyed your trip to South West Alabama. Please give me a shot again in the future."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "115438660589731222329", "name": "George Moore", "time": 1623459461954, "rating": 5.0, "text": "This was the best inshore charter. The boys wanted  to catch Shark and man we caught them. Two fifteen year old boy slept good that night.", "pics": null, "resp": {"time": 1623503478124, "text": "Thank you for the review and for the business. It was a real pleasure to serve y’all. The boys were very appreciative of everything which makes my job that much more rewarding. I hope to guide y’all again in the future."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "108254130219600471690", "name": "Todd McGarrity", "time": 1619444860742, "rating": 5.0, "text": "I have fished with Captain Patric multiple times and have a great experience every time. He is knowledgeable and fun to hang with but most importantly - you can tell he LOVES what he does. Can’t wait to fish with him again soon!", "pics": null, "resp": {"time": 1619832075205, "text": "I like that I’m fun to hang with 😁! Thank you for the review Todd. I look forward to y’all’s next trip to Mobile Bay."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "106776952162476267099", "name": "Marc Nations", "time": 1615560151930, "rating": 5.0, "text": "The day fishing with Patrick was great. He put us on fish quickly and took care of us all day. He knows his stuff and he made sure that we knew how to fish successfully. I highly recommend him as a Mobile bay fishing guide.", "pics": null, "resp": {"time": 1623672866129, "text": "Thank you for the review and thank you for choosing me to be your fishing guide. I hope to be your guide again in the future"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "112515393976709127737", "name": "Victor Menoni", "time": 1617729566331, "rating": 5.0, "text": "Fantastic experience. Patric was very courteous and knowledgeable. Put us right on the fish. Nice haul of redfish and speckled trout. Highly recommended.", "pics": null, "resp": {"time": 1618058247835, "text": "Thank you for booking and for the review! I hope to be your fishing guide again in the future."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "115976875975145618180", "name": "Vic Wiggins", "time": 1617710770012, "rating": 5.0, "text": "I took my son and grandson Sheephead fishing with Patric and we couldn’t have had a better experience. Patric is extremely knowledgeable and really makes the trip a lot of fun. He put us on the fish immediately and we caught a lot of really nice Sheephead. We all had a great time ! I will definitely be booking another trip with Patric later this year. He’s the best !", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN7I4FmyZ-yErnbdfNFQauBMHpsIi8rGGYm6dXM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM2LezITeLCBu9PqbA7vBBWZIIGGbNBIXiRDJTI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPtZd7FCIQzVH1U29baa2VViNI-5nOUvSH6ZD1w=w150-h150-k-no-p"]}], "resp": {"time": 1617714602394, "text": "Thank you for the review Vic. It was a pleasure to show y’all a small portion of the Alabama Coastal fishery. Thank you for booking and I look forward to our next trip."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "106504844261527888618", "name": "Shane Taylor", "time": 1609368353166, "rating": 5.0, "text": "20 stars if it would allow it. Our family had a great fishing trip with Captain Patric. We had a family of 5 and his boat accommodated us very well. He worked hard taking us to several spots to get us on some fish. We were able to keep 38 sheepshead and 1 spotted trout.  I really respect how he will meet you at the boat launch that gives us the best shot at catching fish for the day. He's now our choice of charter while visiting the beach. Absolutely will be booking again soon. Thanks Captain Patric for a great day on the water.", "pics": null, "resp": {"time": 1611089561085, "text": "20 stars would be awesome and I’d give y’all a 20 star review for being awesome customers! I am looking forward towards our trip you scheduled in March."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "108323363346242959095", "name": "Beard Face", "time": 1618258335206, "rating": 5.0, "text": "Great fishing trip. Patrick knows where the fish are. We had a great time.", "pics": null, "resp": {"time": 1618259141601, "text": "Thank you for the review. It was a great pleasure to be your fishing guide today."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "111488906388231439760", "name": "Cawthon", "time": 1619831024874, "rating": 5.0, "text": "If you want to get put on the fish, Capt Patric Garmeson is the guy.  Already looking forward to our next trip!", "pics": null, "resp": {"time": 1619832191364, "text": "Thank you Cawthon! I too will be looking forward to our next outing. Thank you for the return business and I will be anxiously awaiting the new baby photos"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "102617461385412036297", "name": "Patrick Bane", "time": 1617736680419, "rating": 5.0, "text": "We had a great father/son trip!  Captain Patric is very knowledgeable and great with kids!", "pics": null, "resp": {"time": 1618058185233, "text": "Thank you for choosing me to be your fishing guide and thank you for the review! You and Hutton did great! I hope to guide y’all again on future trips."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "104327447995684552345", "name": "MIKE Stanley", "time": 1620159583938, "rating": 5.0, "text": "Great Captain Chris very personal good guide will come back!!", "pics": null, "resp": {"time": 1620321433839, "text": "Thank you for booking with us Mike. I’m great full we were able to get Capt Chris to help us with your group."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "108292637759880513255", "name": "Tommy Lauderdale", "time": 1624024219833, "rating": 5.0, "text": "We always have a great time fishing with Captain Patrick After several years of fishing with him I can say with confidence that you won’t go wrong going with ugly fishing. We always have a great time", "pics": null, "resp": null, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "100633466778598357067", "name": "Chris Stano", "time": 1603374310046, "rating": 5.0, "text": "Had a great time out with Capt. Patrick and we caught fish the whole trip. If you are ever in the Mobile area I would recommend you reach out to him to plan a trip.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOBmq_bAf5Xxy7-OE9UYED6x9CxRv85h_jGo8b3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPncryAGkViwzvXcZv6zetPTSRXUwCDDfPg6GLn=w150-h150-k-no-p"]}], "resp": {"time": 1606087400980, "text": "Thank you for the review and for booking with me. I hope to be your guide again some day."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "110639886361457674238", "name": "Susan Jernigan", "time": 1610935015262, "rating": 5.0, "text": "Had the best day catching trout and sheephead today!! Highly recommend Captain Patrick and Ugly Fishing. First time for trout, catch 8 and had fun with this big sheephead!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOoG_SnOQu5zY--8J0CUfv8-BbjsLNak2fvxxBM=w150-h150-k-no-p"]}], "resp": {"time": 1611089486787, "text": "Thank you for the review Susan! It was a real pleasure to be your fishing guide and to net your fish! Its an honor to know that I guided you to your first speckled trout 😁"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "114373837102055768484", "name": "larry bailey", "time": 1602119325575, "rating": 5.0, "text": "Been going fishing with Captain Patrick for four years now. Sometimes twice a year. Never disappointed, and have a blast. Best fishing guide around, and I’ll\nNever use anyone else. We come from KY just to fish with him. He’ll put you on the fish and it’s an experience you’ll never forget or regret!  You want a fishing trip of a lifetime? Then plan a trip with Captain Patrick @ Ugly fishing !!", "pics": null, "resp": {"time": 1606087993740, "text": "Thank you for the review and for the repeat business. I always enjoy guiding my Kentucky guys! Till next time my friend!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "101684729814506271779", "name": "Tim Gentzlinger", "time": 1600026928985, "rating": 5.0, "text": "Captain Patric of Ugly Fishing in Mobile Bay Alabama is a top notch fishing guide. He put us on a redfish bite like I have never seen before. He completed my quest to catch a redfish in Alabama within the first 5 minutes of the trip. Very knowledgeable of the area and a pleasure to fish with. Can’t wait to get another day on the water with him. Once again thank you for the memorable day on the bay. Fish on brother 🔥", "pics": null, "resp": {"time": 1606087820099, "text": "Tim, it was a real pleasure to be your fishing guide. You have know idea how happy I was to be the guy who put you on your first Alabama redfish. Thank you for booking and I hope you can do it again sometime."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "102546391256786209798", "name": "Greg Pridgen", "time": 1602372268213, "rating": 5.0, "text": "CPT Patric got us on the fish early and kept us on them all day.  He’s very knowledgeable of the area and was fun to be around.  We were able to land a few big Jacks in addition to a few nice Reds, some Specs and White Trout....  we even got an unexpected flounder.  Definitely plan to book him again in the future.", "pics": null, "resp": {"time": 1606087580583, "text": "Greg I really appreciate the review! I love a nice mixed bag day like y’all had. Thank you for your business and I hope to be your guide again some day."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "103511089747163787260", "name": "Gail Moore", "time": 1602558188281, "rating": 5.0, "text": "What a great fishing trip with Captain Patrick. Early we caught so many speckled trout we lost count. While we were doing this Tom and George each caught a big bull red. Then it was off to look for more redfish which we found and caught. Captain Patrick was so helpful with instructions and giving us different baits and lures to try when the bite would occasionally slow down. What a fun day. We will definitely book with Captain Patrick again.", "pics": null, "resp": {"time": 1606087481278, "text": "Thank you for the review Mrs. Gail! It was a real treat to be y’all’s fishing guide for the day. I hope to see y’all again."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "106966110518514246451", "name": "Chris Gurner", "time": 1623957552133, "rating": 5.0, "text": "I have fished with Ugly Fishing for several years now and can say that every year the experience is top notch. If you are looking for a guide service that knows where to fish and how to fish you’ve found it with Patric.", "pics": null, "resp": null, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "114746379913204352311", "name": "Bill Meadows", "time": 1611085809758, "rating": 5.0, "text": "Had a blast fishing for trout, sheephead  and flounder with Captain Patrick. It wasis a very cold day and he didn’t hesitate to take us fishing and show us a great time!", "pics": null, "resp": {"time": 1611089387626, "text": "Thank you for the review but most importantly thank you for booking with Ugly Fishing! We aim to please 😃"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "114697752129989772463", "name": "Brandon Davenport", "time": 1602119090325, "rating": 5.0, "text": "Had a blast fishing with Capt. Patrick was awesome. I’m not much on fishing but hooking into those jacks was amazing! Never thought I’d have as much fun or stay as busy on fish as we did both days. Going to try and get out there again next year for sure.", "pics": null, "resp": {"time": 1606087924409, "text": "Thank you for the review Brandon! It’s always a pleasurable day on the water with my boys from Kentucky! I’m pumped the jacks were so cooperative and those snapper were awesome as well!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "111663804439205299813", "name": "Ian Bjuro", "time": 1606673835519, "rating": 5.0, "text": "I have been fishing over a handful of times with Patric. He is by far the best and most knowledgable guide in the Coastal Alabama area. He will put you on fish!", "pics": null, "resp": {"time": 1606733435566, "text": "Thank you for the review Ian! Most importantly thank you for the return business!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "114934986020092099079", "name": "Jacob Chandler", "time": 1606090157909, "rating": 5.0, "text": "I can not say enough good things about Capt Patric Garmeson and Ugly Fishing Charters. Over the last few years my family and I have been on several trips with Patric and not once did we come back without smiles on everyone’s face.  Capt Patric has a true love for his profession and it shows through the knowledge he freely shares with his guests. If you are considering trying Ugly Fishing I suggest you book early because his schedule stays packed!", "pics": null, "resp": {"time": 1606091021595, "text": "Thank you for the review and the continued support. You are correct I absolutely love my job and the fishery I get to guide on. I love taking the boys fishing but it was nice to actually be your fishing guide this last time around. Till next time my friend."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "114934986020092099079", "name": "Jacob Chandler", "time": 1606090157909, "rating": 5.0, "text": "I can not say enough good things about Capt Patric Garmeson and Ugly Fishing Charters. Over the last few years my family and I have been on several trips with Patric and not once did we come back without smiles on everyone’s face.  Capt Patric has a true love for his profession and it shows through the knowledge he freely shares with his guests. If you are considering trying Ugly Fishing I suggest you book early because his schedule stays packed!", "pics": null, "resp": {"time": 1606091021595, "text": "Thank you for the review and the continued support. You are correct I absolutely love my job and the fishery I get to guide on. I love taking the boys fishing but it was nice to actually be your fishing guide this last time around. Till next time my friend."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "117057127693547295735", "name": "randy white", "time": 1603766518520, "rating": 5.0, "text": "Very knowledgeable of the Mobile Bay.  Taught me techniques and tactics that I didn’t previously utilize.  Highly recommend for anyone from beginner to expert in inshore fishing.", "pics": null, "resp": {"time": 1606087357824, "text": "Thank you for the review and for booking with me. I hope to see you again either as a customer or on the water using the techniques you learned."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "113538655632242926802", "name": "Marshall Short", "time": 1606091735017, "rating": 5.0, "text": "It got real ugly out there!  He got us on to some monster reds! Patric was great! He has the best boat we've ever been on as well.", "pics": null, "resp": {"time": 1606087687222, "text": "I love the review! Yes it did get Ugly! Ugly in a good way. Thank you for your business and I hope to be your guide again some day!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "115283198002902827536", "name": "Chris Graves", "time": 1596806211655, "rating": 5.0, "text": "Patric kept us busy from the time he picked us up until the time he dropped us back off.\nCouldn't have asked for a better day or trip.  My 10 year old son hasn't stopped taking about the 12 foot hammerhead shark!  Highly recommend taking a boat ride with Patric. We will be back.  Thanks again!!", "pics": null, "resp": {"time": 1596840163184, "text": "Thank you for the review! It was a real pleasure guiding y’all on the Gulf. The hammerhead is certainly the highlight of my summer as well."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "102797417447031717786", "name": "Forrest Meeks", "time": 1590531144598, "rating": 5.0, "text": "My family had a great time fishing with Patrick. Conditions weren't favorable for snapper so he put us on the trout and redfish. He was awesome with my 3 girls ages 9 to 15. Two of which had never been out a charter trip.", "pics": null, "resp": {"time": 1590694121610, "text": "Thank you for the review and most importantly thank you for choosing Ugly Fishing. The girls were awesome, polite and coachable! It was a real pleasure to guide you and your family on Mobile Bay."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "108449632326853164609", "name": "Mark Sabol", "time": 1597186985242, "rating": 5.0, "text": "Captain Patric was outstanding, he was patient with the kids, taught the adults a few new things and most importantly, we caught a lot of fish.", "pics": null, "resp": {"time": 1598205185169, "text": "Thank you for your review Mark. Most importantly, thank you so much for your business!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "111823433838779965024", "name": "T Tat", "time": 1581012402479, "rating": 5.0, "text": "Patrick is absolutely the best guide! We took my 5 year old nephew with us, he spent the day helping him so we could fish. Caught a bunch of fish, Patrick was very informative and knowledgeable in the different species. Great gear, great guide, great time, cannot wait to get out on the water with him again", "pics": null, "resp": {"time": 1581069302677, "text": "Thank you for the review. I really love my job which many people can see my passion when we are on the water. Thank you for the kind words."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "106548525713807228147", "name": "Justin Williams", "time": 1596836237817, "rating": 5.0, "text": "Had a blast with Patric. Highlight of the trip was definitely the hammerhead!! Will book again!!", "pics": null, "resp": {"time": 1598205955579, "text": "The hammerhead was a highlight of my career! As an inshore/nearshore Captain I don’t carry tackle big enough to handle a shark of that size. It was awesome! Thank you for booking and the awesome review!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "113425921858795304073", "name": "Dan Walsh", "time": 1597110431720, "rating": 5.0, "text": "Fantastic trip.  Knowledgeable and friendly guide.  Will hire again.", "pics": null, "resp": {"time": 1598205307557, "text": "Thank you for your review and thank you for choosing me to be your fishing guide."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "102707685768080587444", "name": "gary roberts", "time": 1581190743760, "rating": 5.0, "text": "We been out with Captain Patric a couple times he always put us on the bite. The last time we went to a natural gas rig, there were multiple boats fishing we had the only boat catching fish. We limited out on red snapper then went after redfish. Captain Patric is very knowledgeable and makes fishing a great experience for everyone. I wouldn't use anyone else for my fishing trips", "pics": null, "resp": {"time": 1581195567321, "text": "Thank you for sharing your experiences. Y’all are a pleasure to guide and it’s an honor to be your only guide! Thank you for the repeat business and I look forward to our next outing. And thanks for stopping by to say hello at the baseball field it was good to see you!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "102707685768080587444", "name": "gary roberts", "time": 1581190743760, "rating": 5.0, "text": "We been out with Captain Patric a couple times he always put us on the bite. The last time we went to a natural gas rig, there were multiple boats fishing we had the only boat catching fish. We limited out on red snapper then went after redfish. Captain Patric is very knowledgeable and makes fishing a great experience for everyone. I wouldn't use anyone else for my fishing trips", "pics": null, "resp": {"time": 1581195567321, "text": "Thank you for sharing your experiences. Y’all are a pleasure to guide and it’s an honor to be your only guide! Thank you for the repeat business and I look forward to our next outing. And thanks for stopping by to say hello at the baseball field it was good to see you!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "114998074481087603160", "name": "John Christian", "time": 1585014997256, "rating": 5.0, "text": "Had a great trip with Patric and highly recommend. Patric is extremely knowledgeable and works hard to ensure his clients have a great experience. I can’t wait until our next trip!", "pics": null, "resp": {"time": 1590694670260, "text": "John, thank you so much for the review and for booking with Ugly Fishing. The boys did great and I hope to be your guide service again one day."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "113180987557622259168", "name": "kyle lapp", "time": 1618173771844, "rating": 5.0, "text": "Went out on with my 6 year old son and within minutes of being on the boat we were on some speckled trout. After catching many, we moved on to catch some redfish and that didn’t take long either. We both had a great time.", "pics": null, "resp": {"time": 1590694507429, "text": "Thank you for the review and most importantly thank you for booking with Ugly Fishing. It was a lot of fun helping Eastwood catch fish. I’m so happy the trip was a success."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "111386227579196049736", "name": "Jeffery Carter", "time": 1581012257318, "rating": 5.0, "text": "We had a blast.  Super knowledgeable guide. Caught a ton of fish and leaned even more along the way", "pics": null, "resp": {"time": 1581069405501, "text": "Thanks Jeff. I hope to share a little something with my guests each time out. I’m happy to know you were soaking in the info I was sharing."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "116982197408484833753", "name": "J. Brongo", "time": 1568137771336, "rating": 5.0, "text": "Excellent fishing.  Guide is top notch and the boat is very comfortable and clean.  I would highly recommend Patric to anyone who wants to catch fish!", "pics": null, "resp": {"time": 1568516705664, "text": "Thank you for the business and the 5 star review. I hope you make it up my way again for a future fishing trip. I’m not 100% sure I can top the results of your first trip but I will certainly attempt to do so."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "105894341016168064605", "name": "Shane Brooks", "time": 1581021685682, "rating": 5.0, "text": "I have fished all over the country with guides.  Professional & Sincere,  are hard attributes to come by and Patrick has them.  He wasn’t there to take us on a “boat ride” he wanted us to create some memories; And we did! -great job", "pics": null, "resp": {"time": 1560132459774, "text": "Creating memories is what I do! Thank you for choosing me to be your fishing\nGuide!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "113206989759206162488", "name": "John Coll", "time": 1581172908854, "rating": 5.0, "text": "Captain Patrick made this fisherman's dream come true. We started with world class Sheep Head and ended up successfully sight fishing for Bull Reds. We caught plenty of quality fish including a state record hooked by Pat. The whole experience was truly memorable.", "pics": null, "resp": {"time": 1581181643458, "text": "Thank you for the review John and It was an honor to share that day with you. Let’s do it again!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "105919898551956926329", "name": "David Johnson", "time": 1592525680042, "rating": 5.0, "text": "Best fishing experience I’ve had in years", "pics": null, "resp": {"time": 1592622403848, "text": "Thanks for the review David and I enjoyed being your fishing guide."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "101930706416925829801", "name": "Tommy Copeland", "time": 1514663408522, "rating": 5.0, "text": "Captain Patric was awesome my son and I had a blast and left with plenty of reds and specks ..Have done several fishing charters through the years ..Ugly Fishing out shined them all..will recommend it to anyone interested in charter fishing. Captain  was very knowledgeable and personable..thanks for a great time", "pics": null, "resp": {"time": 1515515253939, "text": "Thank you for the kind words Tommy. It was a real treat to be able to provide the service for you and your son. I absolutely loved watching him reel in all those fish!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "103807721201829083166", "name": "Tamara Akins", "time": 1585267829017, "rating": 5.0, "text": "Absolutely the most fun!!!  Attentive and engaging.  Highly recommend Captain Patrick!!!!", "pics": null, "resp": {"time": 1590694576163, "text": "Thank you Tamara! I really enjoyed guiding and teaching you and Jerald on how to catch sheepshead."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "114863785628835590114", "name": "Greg Kennedy", "time": 1546038727368, "rating": 5.0, "text": "Patrick took us out Christmas week and we had a great trip!! The weather was questionable but with Patrick’s local fishing knowledge with cleaned up!! Filled the cooler with speckled trout, white trout, black drum and a redfish! We’ll be frying fish for weekends to come! Thanks for a great memorable trip! Well be back for sure!", "pics": null, "resp": {"time": 1546043308253, "text": "Greg, thank you for the review and opportunity to guide y’all. I really enjoyed teaching the three of you how to catch the winter time fish in deep water. I hope to be your guide again."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "108619786373232586356", "name": "Joshua Knight", "time": 1574713589226, "rating": 5.0, "text": "Patrick put us on fish all around the bay! Awesome boat, highly recommend, the man knew his stuff.Thanks again.", "pics": null, "resp": {"time": 1578989238520, "text": "Josh, thanks for the review! Two things I can always control. 1st my effort into putting customers on fish. 2nd the quality of my equipment. It means a lot that you noticed and that you highly recommend me and my company. Till next time my friend!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "103466349702030848580", "name": "Vanessa Hale", "time": 1541720325573, "rating": 5.0, "text": "Capt. Patric was great! He took great care of us, even baiting our hooks! Super fun day out on the bay!!! Thanks so much!", "pics": null, "resp": {"time": 1541721633636, "text": "Thank you so much for the review Vanessa. Y’all caught some great fish! I hope I can be your captain again someday."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "104966177620278515749", "name": "Dan L.", "time": 1559673938729, "rating": 5.0, "text": "Captain Patric is a true pro.  He's patient with inexperienced fishermen,  works hard for his clients, gets results, and is simply a pleasure to go fishing with.  Highly recommended.", "pics": null, "resp": {"time": 1560132254785, "text": "Thank you for the kind words Dan. It was a real treat to be able to teach Vaughn how to catch a fish."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "104649308760577411732", "name": "Craig Newton", "time": 1581013363222, "rating": 5.0, "text": "Very knowledgable captain that works hard to keep you on the fish!!", "pics": null, "resp": {"time": 1581069146659, "text": "Thank you Craig. Trying to learn a little bit each day and pass that along."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "115491344976019991529", "name": "Ried Baker", "time": 1543725416534, "rating": 5.0, "text": "A very knowledgeable captain. He was able to put us on top of some fish. It was a very good time.", "pics": null, "resp": {"time": 1543748972883, "text": "Ried, thank you for the review! Your fishing trip was a lot of fun! I’m still amazed by the size of some of the fish y’all caught!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "115370310546403957076", "name": "Andrew Carpenter", "time": 1533667436319, "rating": 5.0, "text": "Had a blast, and caught a lot of fish. Captain Patric kept us on top of the fish all day, and there was not a dull moment. He taught me a lot about saltwater fishing, and you could immediately tell he loves what he does and is very good at it. I will definitely be back and plan to make it into at least a yearly trip.", "pics": null, "resp": {"time": 1534379586777, "text": "Thank you for the awesome review, Andrew. It’s a real pleasure to take anglers like yourself fishing on Mobile Bay. The bay is my home and I thoroughly enjoy my job."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "109081194534742327040", "name": "Kevin Gore", "time": 1531613170077, "rating": 5.0, "text": "Went fishing with Captain Jeff yesterday morning. We had a great time catching red snapper, Spanish makrel and a nice jack. Captain Jeff is very knowledgeable of the area and I would highly recommend Ugly Fishing to anyone!", "pics": null, "resp": {"time": 1534379959947, "text": "Thank you for the review Kevin. Jeff is a   New addition to the team and he certainly has his heart in the job. Thanks for choosing Ugly Fishing as your fishing guide service"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "117318952124579621874", "name": "Danielle Davidson", "time": 1530499936037, "rating": 5.0, "text": "We went fishing today with Capt. Patric on the eastern shore of Mobile Bay. Patric is an extremely knowledgeable guide with an affinity for making his anglers feel safe, confident, and fulfilled. We are experienced anglers that are new to the area and feel that we can now head out on the water with a solid plan. Patric is a fantastic teacher, we learned about the area, local techniques, and  seasonal patterns. No questions about recommending Captain Patric to anyone from novice to expert for a great day on the water, he will go above and beyond to make your personal experience the best it can be.", "pics": null, "resp": {"time": 1530571026250, "text": "Thank you so much for the review Danielle. It was a great honor to be your fishing guide. You and Nobel are both great anglers and it was a treat to be able to share with you what I have learned over the years."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "104243180211938944554", "name": "Hank Arnold", "time": 1570624593117, "rating": 5.0, "text": "Fished with Patric for redfish last week. Took some buddies from South Georgia that have fished for trout and redfish their whole lives, Patric impressed them in the delta. Limit of redfish plus trout, drum. lots of catfish and a bass. Lots of action, lots of over slot fish to throw back. Patric never quits, I tell him its like having a buddy with a cool boat that knows how to make it happen! Spent the day \"whackin pumpkins\". Thanks for the great time, we will be back, the \"bucket list\" keeps growing. KWE!!", "pics": null, "resp": {"time": 1578989417550, "text": "Hank, it is about time to go whack some more pumpkins sir! Thank you for the review and the detail you put into it. For those who don’t know a pumpkin is a term used for a redfish that is really orange in color much like a pumpkin. This coloration also tends to show up the most in the fall of the year."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "109467048007286505542", "name": "Josh Ayers", "time": 1532568069715, "rating": 5.0, "text": "Booked at noon same day last minute and Patrick had no issues taking us out for a few hours. Very patient with the rookies. Would definitely recommend for any bay fishing....", "pics": null, "resp": {"time": 1534379764512, "text": "Josh, thank you for your review! It is frustrating for me when I have customers calling and I can’t get them on the water. I’m so glad that we were able to work things out."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "108092105618536322369", "name": "Harrison Balzli", "time": 1516996208379, "rating": 5.0, "text": "Awesome morning out in the delta rivers. Went for reds and had our limit in less than a hour. They were the larger slots as well as quite a few bulls that were tagged and released for another day! Also had a few bags of speckled trout to bring home. Patric was a great host and really knows how to navigate these waters well and find the fish!Thanks for the trip", "pics": null, "resp": {"time": 1517015501907, "text": "Harrison, thank you for the review! It was a great pleasure to spend the morning with you and your father and I hope to be able to teach you more about Mobile Bay in the future."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "112541612860712208953", "name": "rhoward2780", "time": 1559343940955, "rating": 5.0, "text": "If you like catching fish, Captain Patric will put you in the middle of the action. Had a great day of catching red fish, speckled trout, and a variety of other fish. Ugly Fishing, LLC is the way to go on Mobile Bay!", "pics": null, "resp": {"time": 1560132363177, "text": "Thank you for the great review. It was quite enjoyable to teach you how to catch Speckled trout and redfish on artificial lures."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "115180146382403877781", "name": "Amanda Griswold", "time": 1546207255042, "rating": 5.0, "text": "Amazing!! Patrick is a very well educated guide. He made the trip enjoyable by sharing facts of the surrounding environment, his knowledge about different species of fish, and how to catch them. He did a great job keeping us busy and moving around as needed. As well as being patient, and stepping in to assist with casting if needed. It seemed he would do as little or as much as you wanted him to, and somehow could pick up on it without a word. It was an excellent trip. We asked for Redfish and got the most I’ve ever caught. We will be back to try out more fishing in the spring.", "pics": null, "resp": {"time": 1546212868723, "text": "Thank you so much for the review, Amanda. I am really glad that we were able to get this trip put together on such short turnaround. Y’all did a great job listening and capitalizing on the bites. Nice work and congrats on catching some great redfish. Check out The post I made on Facebook and Instagram."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "104032130813831683492", "name": "Jimmy Ray Smith (JRay)", "time": 1540925662980, "rating": 5.0, "text": "On time and ready to catch fish. Patric took great care of us from beginning to end. Caught a bunch of red fish and trout.", "pics": null, "resp": {"time": 1540939484335, "text": "Your the man Jimmy Ray! Thank you for the review"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "113661204694900054203", "name": "jason pepperman", "time": 1486055309603, "rating": 5.0, "text": "Went out after speckled trout with Patric on New Years Eve morning. He's very knowledgeable about the fish as well as the water we were fishing. He suggested a couple of different hard baits and we got the trout biting. We caught a lot of fish in just a couple of hours and I caught my biggest trout ever that morning. Great trip. Looking forward to going again.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMPtHNCov8wqv2QsZd7a9B7H3rsGioXrpEKuumF=w150-h150-k-no-p"]}], "resp": {"time": 1486061446053, "text": "Thank you for the review Jason. Teaching people new techniques and strategies while figuring out what the fish want is so much fun. I am very excited about being a part of you landing your trophy speckled trout. I look forward to our next outing."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "113549603117243814220", "name": "The Barn at Big Oak Hill Ranch", "time": 1499216297492, "rating": 5.0, "text": "We had a great day on the water today with Captain Patric with Ugly Fishing. He was very patient, incredibly knowledgeable of the area, and knew exactly where the fish were biting! We caught our limit on Red Snapper and Speckled Trout. Almost every cast was a bite! He even took great photos and video footage of all the action that we will treasure forever! We highly recommend booking with Ugly Fishing Charters and look forward to booking again!", "pics": null, "resp": {"time": 1501528736004, "text": "Thank you so much for sharing your story with everyone. I really enjoyed spending the day with you and your family and thanks for rescuing me."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "112794738939712005807", "name": "Patrick Landry", "time": 1508620987949, "rating": 5.0, "text": "This is my second charter fishing trip in Mobile Bay Area. Last year was my 1st & I went with a group charter that was good (3) at best. This trip with Ugly Fishing by Captain Patrick was great. Patrick called fellow colleagues to get the most up to the minute reports where conditions were good for catching desirable fish. He moved around looking for favorable conditions. We limited out on Speckled Trout and caught two 15-20 pound Jack  Crevalle's that were released. He cleaned and bagged our Speckled Trout. It was a Great Trip.", "pics": null, "resp": {"time": 1508838844706, "text": "Thank you for the review, Pat. It’s very important that our clients feel as if they received maximum effort. Some days we can drive straight to the fish and catch them as soon as we begin and other days we have to hunt and peck to find them."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "115834778715793748970", "name": "Joseph Steele", "time": 1582317505767, "rating": 5.0, "text": "IT BE WAS FUN", "pics": null, "resp": {"time": 1582321518447, "text": "Thank you for the five star review!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "113526031255055308348", "name": "Joshua Weaver", "time": 1522190219188, "rating": 5.0, "text": "Took a trip March 2018.  Captain Patric is fantastic.  We did an inshore trip due to the East wind.  We caught a few redfish and trout early on and covered some water.  We then pulled into Weeks Bay and the last couple hours just hammered redfish.  It was a blast.  At one point, we had three on at once.  My kids (2 boys - 9 and 11) called it the best!  Without a doubt recommend Ugly Fishing and Capt Patric.", "pics": null, "resp": {"time": 1523471448892, "text": "Thank you for the great review Josh! The conditions certainly were challenging but I try and roll with the punches that Mother Nature throws our way. I really enjoyed spending the day with you and your family. I hope to fish with y’all again in the future"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "105692210380610616167", "name": "BamaBassFishing TV", "time": 1525657027891, "rating": 5.0, "text": "Booked a trip for speckled trout fishing with Ugly Fishing LLC on 3/4/18 with family and I can honestly say Capt. Patric Garmeson did not disappoint! He is very knowledgeable of the sport and lifestyle of fishing teaching us alot of tips and tricks on how to be better fishermen. He made sure to put us on some fish and make us more than satisfied. He went above and beyond to make sure our only worry was getting our fish to the boat he took care of any entanglement or hooked fish to make sure we got back into the water and fishing asap. We caught our limit on speckled trout and even got into a mess of redfish. We will definitely be booking with Capt. Patric again in the near future! -Chance Mosley", "pics": null, "resp": {"time": 1525823999728, "text": "Thank you for the awesome review! It’s our pleasure to provide a memorable experience."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "104861631481787973643", "name": "Corey Mosley", "time": 1525545816119, "rating": 5.0, "text": "May 4 2018 I called to schedule my First speckled trout charter with my boys. We were taken out by Captain Patrick.\n\nthings started a little slow at first then he put us on some redfish.\n\nwe caught a nice mess of fish only keeping 4 nice size reds then we moved around looking for specs with a hit and miss here and there .\n\nWe caught  a shark we released.\n\ntime moved on and we went to another spot where we started getting hits.\n\nthe spec bite turned on and we sat in that one spot and  limited out of some really nice specs.\n.\nWe had a blast out on the water all day\n\nCaptain Patrick was very knowledgable teaching us stuff and helping out .\n\nhe handled everything  all we had to do was fish.\n\nWe hooked up three and four specs at once multiple times  he definitly worked hard keeping our baits in the water to catch more fish\n\nI will defintily be goin back again lots of fun to be had when fishing with him. Corey .", "pics": null, "resp": {"time": 1525823836042, "text": "Thank you for choosing Ugly Fishing to be your fishing guide provider. Captain Patric strives for a high quality fishing and on the water experience. We hope to work with you and your family again."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "104587862144712224183", "name": "Bill Holland", "time": 1499303486967, "rating": 5.0, "text": "Had a fantastic trip today with Ugly Fishing. Caught redfish, sheepshead and some of the largest speckle trout we've ever seen. Cptn. Patric was super, even when my grandson and his buddy (both 15) got lines tangled. We saw other boats struggling, but we got the fish. We HIGHLY recommend Ugly Fishing. Bill from Brandon Ms.", "pics": null, "resp": {"time": 1501528619889, "text": "Thanks for the awesome review Bill. I enjoyed watching the boys catch fish and don't you worry about the tangled lines because they will happen almost everyday. I hope that we can do it again."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "102625499132121910309", "name": "Arrow Networking (Carl)", "time": 1509660850516, "rating": 5.0, "text": "I have fished with some other fishing guides but Patric with Ugly Fishing has to be the most versatile fisherman there is on the Gulf Coast. Twice I booked at charter at two different locations we were vacationing at, once at lower Mobile Bay and the other time at Dauphin Island. How he can find fish to catch no matter where he is amazes me!\nThe other time we have been fishing with Patric was on Christmas Eve day, wind blowing, cold, but we filled the cooler with delicious white and speckled trout!\nDon't think the price of the Ugly Fishing's charters are expensive. Patric works hard to make sure you have a great time and he has quite a lot of money tied up in his boat and tackle.\nPatric is a humble guy but he is top-notch in my opinion. Whether you are a seasoned fisherman or a first timer, don't hesitate to give Patric a call.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPHIA5_5tE8oSHkHxlqPeEhzbEAbsDePiVu4_ji=w150-h150-k-no-p"]}], "resp": {"time": 1510441145446, "text": "Thank you so much for the review Kyle. I look forward to our next trip.\n\nI enjoy learning the entire Mobile Bay and northern Gulf Coast to ensure that I can provide a very memorable fishing experience for all of our clients. Alabama may have a small coast line but we have a tremendous amount of high quality fishing."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "107947675458331170884", "name": "Jason Haas", "time": 1529398467145, "rating": 5.0, "text": "Just Passing on several people's opinions.", "pics": null, "resp": {"time": 1530571048214, "text": "Thanks for the recommendation pal!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "108579639544778534420", "name": "Leah Creighton", "time": 1623722354555, "rating": 4.0, "text": "Take my oldest for her bday they lived it. They even got to drive the boat they that was the coolest part. 😂", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPocN1lg5T8FYHjlID19JR6KyZcA4CgG6xA8I1p=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNrAlckDidjx5HglElzTkgZsK0bVWqzQS4-e5ZW=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "112192490589212665804", "name": "Guadalupe Nash", "time": 1612342347124, "rating": 4.0, "text": "Ahhhh, I miss Dolphin Cruise Aboard Dolphin Tales. Prime people watching spot in a great little park. Love grabbing an iced coffee and venturing over here to chill out for a little while. There are tons of dogs running around, families, lots of variety with excellent views. One thing to note, for people coming here for the first time is that there's generally A LOT of weed around. Maybe make a friend and partake - who knows? Definitely love this spot.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "117245258728726629465", "name": "Ice Dog", "time": 1617146160568, "rating": 5.0, "text": "Fun time.   5pm cruise.    Lots of dolphins.   Everyone onBoard seem to have a lot of fun.   Super nice and friendly people operating the cruise.  Would do it again and highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "115208759976134476996", "name": "Danny Embry", "time": 1617640335583, "rating": 5.0, "text": "Incredible morning dolphin watching and cruising the bayou. Had a great time with Tabby and Capt. Bart.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "105662236206396688878", "name": "Katie Eickman", "time": 1564182147869, "rating": 5.0, "text": "This cruise was awesome! We saw lots of dolphins, the people running it we're interactive, fun, great with involving kids and informative. It was so relaxing. I would definitely go again. It made my son's year! :)", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNe7DRuMPdjRXpYxJpx_T3s7lQsydg1rQxlsisW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNepuq2z_HeahTRwMl5eFpcvkye44KJur1XpaIh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP14ux2swZSaZaR-47PJomL-7jfghp7aYvpdDvk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "111425850136832634748", "name": "Alisha Wheat", "time": 1592605958225, "rating": 5.0, "text": "We called the day of and was able to get a snorkeling cruise.  The lady that answered the phone was so sweet!  On the cruise the Captain was very cool and answered all our questions.  Great price and very friendly!!", "pics": null, "resp": {"time": 1615237066332, "text": "Alisha, thank you for the kind words and the awesome 5 star review! These reviews encourage us so much. You are like the cheering squad that keeps us going. We sure appreciate you taking your time to leave this review and we hope to see you again aboard Dolphin Tales! Happy Blessings to you and your family until then."}, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "117814990979880397607", "name": "Chris Pittson", "time": 1570578217543, "rating": 5.0, "text": "We enjoyed the 5pm sunset dolphin cruise. Nice modern boat.  Only takes 24 passengers. It has room for more so it wasn't crowded.  Captain was super nice and informative. Saw plenty of dolphins which was the point. Excellent!", "pics": null, "resp": {"time": 1581819454870, "text": "Thank you so much for the great review! We enjoyed having you! So glad you enjoyed your cruise!!"}, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "109857569106460805144", "name": "Yareli Tena", "time": 1594142184681, "rating": 5.0, "text": "We had a an absolute amazing time. The staff was friendly and even offered directions by text. The captain allowed our kids to steer the boat and we saw the dolphins for a generous time.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "116142378045170410246", "name": "Kyle Knell (Kyle Von Clausewitz)", "time": 1554288667175, "rating": 5.0, "text": "Our cruise started slow, but ended with lots of dolphin the closer we got to sunset. We had 9 people, ages 11 & up and everyone was entertained.  Captain Bart and Tammy were friendly and interactive and it was a great bargain.  They definitely made our day.  Bring some money for a tip. :)", "pics": null, "resp": {"time": 1554294252050, "text": "Kyle, Thank you so much fun the 5 star review! Capt. Bart & I do our best to provide you with a fun and informative cruise. It’s so kind of you to remind others to bring tip money, and we do appreciate the gratuity.\nPlease come back to cruise with us again and try a Blue Angels or a Snorkel excursion, or just another dolphin cruise- as every cruise every day is totally different. We spot different dolphin on different days. 🐬 My southern accent must have been extra thick that day. We don’t have a deck hand named Tammy, but we do have me- I am Tabby and I appreciate you taking the time to give us a good review.\n\nUntil we meet again, kind regards,\n\nTabby & Capt. Bart"}, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "117975492908289729252", "name": "Carolyn Park", "time": 1529979319019, "rating": 5.0, "text": "Best dolphin experience ever! Lots of dolphins, great guide with time and attention given to detailing interest of passengers. We saw shrimp fishermen casting nets and plenty of dolphins feeding, while birds and pelicans flocked alongside. Mid tour we enjoyed the fireworks and yacht lights at The Wharf at the intracoastal waterway. My family loved every minute. Family operated and well maintained.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "102089806994950900683", "name": "Ryan Hall", "time": 1468022370654, "rating": 5.0, "text": "We had a great time on the early morning dolphin cruise. The captain and his wife were VERY knowledgeable about the habits and life of the dolphins. They even had names for some of them! Answered all of our questions about the dolphins and shrimp boats. They had a life vest for my 2 year old and snacks and drinks for sale on board. I really liked how they are a family business and you can't beat the price! I highly recommend this cruise for young families looking for a fun local activity", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "114751403720308136884", "name": "Lorri Rhodes", "time": 1460143042692, "rating": 5.0, "text": "2 trips & LOVED both! One with my 3 year old and he and I both LOVED it! They even let him think he was driving the boat, which was a huge hit. Then I went during the Winter with a group of Winter Guests. We saw a few dolphin that time of year even though it was pretty cold. Plus we saw Pelicans diving for bait and deer on the back bay. Great outdoor experience for all ages!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "112496847007657216202", "name": "Louise Whitney", "time": 1460343623513, "rating": 5.0, "text": "We had the most amazing afternoon aboard Dolphin Tales. We enjoyed a mid-day cruise on this comfortable boat. It was chilly, and they even offered us blankets & they have these nifty roll down clear curtains that totally block the chilly air. I don't know how anyone rides on one of the open boats during the spring. This ride was much more enjoyable than others I've been on while vacationing here.\nThis is the best cruise in town!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "106711388889879367595", "name": "Betty Meeks", "time": 1462311453032, "rating": 5.0, "text": "This is the best dolphin cruise I've taken.\nThe boat is so comfortable & relaxing.\nNice cool ride with a top over the whole boat.\nI'm a senior citizen & I appreciate the easy on/off accessibility of the boat. The bathroom on board is a nice amenity too.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "109841551078308656054", "name": "Dan Valcarcel", "time": 1455335487593, "rating": 5.0, "text": "Great fun and worth every penny! We saw dolphins, yes, but more than that enjoyed a magical time in the boat. Super friendly pilot...great with the kids. He even went back to fish out my son's shoe that fell in the water. A great highlight of our stay in Orange Beach. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "117226587426963801393", "name": "S Klasing", "time": 1480355610809, "rating": 5.0, "text": "What an experience! We loved it! Please take cash aboard to tip your captain. ( I had no idea about tipping and felt like a butt when everyone tipped at the end of the cruise).. He's great and doesn't worry about going a little over the time limit to ensure you have the best time possible.. ( Or maybe we just got lucky being the last crew of the day). A must do!!!!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "117901407131475379956", "name": "Billy King", "time": 1490316013402, "rating": 5.0, "text": "Great time with our family of 6. Saw many dolphins. Was able to take our own cooler and snacks.  Entire trip was 1.5 to 2 hrs.  Bart was very friendly and knowledgeable.  Will use them again!!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "114153869139102579674", "name": "Paula Grimes", "time": 1476464149315, "rating": 5.0, "text": "My family came to Gulf Shores from Kentucky last year and we took the dolphin tales cruise and loved it! This year we came back and haven taken two cruises with them. They are very friendly and we always see dolphins. We enjoy the cruise very much!!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "115261980406437716119", "name": "Apolinario Casarez", "time": 1460232585269, "rating": 5.0, "text": "Awesome dolphin sighting trip. Very friendly captain and crew. Our trip went a little longer than two hours due to being determined to see dolphins. When we finally saw some we saw many. Great tour and will return.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "103639949881503341176", "name": "Tabitha Bowers", "time": 1435554997705, "rating": 5.0, "text": "HOME OF THE $10 DOLPHIN CRUISE!!!!! FAMILY FRIENDLY PRICES. SHADED BOAT. BATHROOM ON BOARD. PADDED SEATS. GREAT CAPTAIN AND STAFF!\nA PERFECT CRUISE WITHOUT BREAKING THE BANK.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "100255081497124568261", "name": "Erin Breuker", "time": 1459803505053, "rating": 5.0, "text": "What a fun tour! Laid back and casual, we were allowed to keep our shoes on! Captain Bart and Tabi were kind and accommodating as well as knowledgeable. Can't be the price and the experience was great. Saw plenty of Dolphins and Dolphin Tales are respectful to the Dolphins. Strongly recommend!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "109898343113306978900", "name": "Wes Singleton", "time": 1462920002101, "rating": 5.0, "text": "My Wife and I had a great time, and saw many dolphins on our sunset cruise.  Captain Bart and his wife Tabitha were very kind and welcoming.  I was looking for a less crowded, smaller boat, and this fit the bill.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "116947744608301081547", "name": "Hank Mastalerz", "time": 1476464077974, "rating": 5.0, "text": "Turned out to be a great trip with a lot of great dolphins along the entire way. The crew was very nice and made the experience great, especially with the knowledge and insights they shared. Definitely recommend for anyone for a great morning or afternoon.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "114074261434875381905", "name": "Faye Pendergrass", "time": 1461765944906, "rating": 5.0, "text": "On a recent girls trip to the beach we chose to take the Dolphin Tales Cruise.  It was the highlight of the trip.  The boat was great and comfortable.  We felt so \"at home\" with the crew and their attention to detail.  Hope to go again when we get back to the area.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "110522455934723270760", "name": "Amanda Beavers", "time": 1464964004005, "rating": 5.0, "text": "Our family had a blast yesterday on the 5:30 Dolphin Tale cruise! We saw A LOT of dolphin's & made some beautiful pictures! Captain Bart & Mrs.Tabitha were wonderful!!!! Thank you both for an amazing experience!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "111094566359891802433", "name": "Ricky Johnson", "time": 1459797159187, "rating": 5.0, "text": "Great experience! Nice that it was a husband /wife team.  Made it more personal.  We got to see plenty of Dolphins.  Not a bad view on the boat,  with great comfortable seats with plenty of space to roam the boat.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "101721860818759199955", "name": "DeSoto's Restaurant", "time": 1461814165224, "rating": 5.0, "text": "We have had a wonderful time while dolphin cruising with Dolphin Tales. It is a great boat run by nice people. They will even book private excursions. The sunset cruise was amazing.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "117972968357802805227", "name": "Jeri Ann", "time": 1460289848744, "rating": 5.0, "text": "The boat was great!  There isn't a bad seat and the canopy keeps you protected from the sun.  They also circle around the dolphins so everyone gets a good look.  You definitely can't beat the Monday Madness price!!!  It's a must see!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "111094566359891802433", "name": "Ricky Johnson", "time": 1459797159187, "rating": 5.0, "text": "Great experience! Nice that it was a husband /wife team.  Made it more personal.  We got to see plenty of Dolphins.  Not a bad view on the boat,  with great comfortable seats with plenty of space to roam the boat.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "117972968357802805227", "name": "Jeri Ann", "time": 1460289848744, "rating": 5.0, "text": "The boat was great!  There isn't a bad seat and the canopy keeps you protected from the sun.  They also circle around the dolphins so everyone gets a good look.  You definitely can't beat the Monday Madness price!!!  It's a must see!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "106832040702319556145", "name": "Christine McFarling", "time": 1530546162997, "rating": 5.0, "text": "I went with my grand children and we loved it. The have snacks for sale and they know a lot about the animals. We will be coming back!", "pics": null, "resp": {"time": 1554295528279, "text": "Thank you so much for such a kind review. Your review of what we do daily is precise, true and correct.\n\nBest Regards\n\nTabby & Capt. Bart"}, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "111077576682607990742", "name": "christy Daniel", "time": 1461878900276, "rating": 5.0, "text": "This was a great trip and the people are very friendly.  It's the best dolphin cruise in Orange Beach.  We've been on several and we will definitely come back to Dolphin Tales.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "112051732957582265356", "name": "Stephen Hayden", "time": 1528568853134, "rating": 5.0, "text": "A great deal and such nice owners! We had a blast on this tour. We saw many dolphins too!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "101402354208201875401", "name": "Zach Wagner", "time": 1537723257189, "rating": 1.0, "text": "We tried to book the cruise for the day we wanted and everything was fine until the receipt printed and showed a date more than a week away. We called the company to find out how we could book the trip for another day or what our options were and all we got were rude, snide remarks from the owner saying that \"It was your fault because the computer always asks what day you want.\" The only solution was to process a refund and charge a 20% fee due to their error. You would think that when you work in the tourism industry, your customer service would be a little better.", "pics": null, "resp": {"time": 1554294567919, "text": "Hi Zach,\nI checked my manifest and don’t have a customer in the history of 4 years worth of manifest since the inception of this business with a first or last name matching the name you used here. I am sorry for what you endured and there is a company in town using a very similar name as mine.\nI wish you well.\nOne thing I am not is”rude”, so I am very confident you did not speak to me.\nHope you are having a better day.\n\nBest wishes,\n\nTabby"}, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "103440033835416696116", "name": "Deena Powell", "time": 1468096640480, "rating": 5.0, "text": "Awesome tour. Very friendly staff. We highly recommend.  We started seeing dolphins shortly after we left dock and continued seeing them throughout the trip.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "116124302945552806528", "name": "Tori Navigator", "time": 1488868138988, "rating": 5.0, "text": "We cruised last weekend and had a blast!\nDolphin Crusing for $10 cannot be beat!\nWe prefer the Dolphin Tales boat and can't wait to come later in the summer and go out on the smaller boat.\nCaptain Bart & Tab always give a 5 star experience.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "116638368185803093726", "name": "Brianna Edler", "time": 1519000829405, "rating": 1.0, "text": "One star is being considerate. Back in August we tried to take the Dolphin Tales sunset cruise. There was 14 of us, who drove an hour out for the cruise. We were told to arrive at 5:30 to board at 6 for our sunset dolphin cruise from 6-8pm. After 6:00 came and went we were wondering where the boat was. No communication from the company. After posting a review saying they were a no show and we were disappointed, they contacted us and said there was an emergency in the family. They said if we REMOVED our post we would be given 6 certificates. We removed the post. This week we tried to book our makeup trip for tonight (Sunday Feb 18th) we were told to be at a different place at 2:30 for our 3-5 sunset cruise. We arrive at 2:45 (we took 4 cars all driving an hour away). Again. No boat. We call the company and they said they already left, they left at 230 for the 3pm cruise.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "111607970492685226070", "name": "Ashley Yanosky", "time": 1463940609420, "rating": 5.0, "text": "Lovely dolphin tour hosted by a husband and wife team with true southern hospitality. Family and budget friendly. We will definitely be back.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "113632573920508357550", "name": "Brian Harvey", "time": 1459978539283, "rating": 5.0, "text": "Family friendly, very accommodating, reasonable prices.  Went with 4 kids five and under, they had a blast.  Captain Bart even let them drive.  Definitely would go again.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "114058192163773114228", "name": "Kasey Blanks", "time": 1467244006711, "rating": 5.0, "text": "We took our 3 yr old son it was nice friendly people it was Monday they off a good deal made reservations thru the Facebook page that linked me the there page. Easy to find it was rainy but they boat ride was nice and we seen dolphins! Comfortable seating and the boat had a roof! I definitely recommend going.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "115495258428860733451", "name": "Valerie Smyder", "time": 1463869185476, "rating": 5.0, "text": "Warm & welcoming husband & wife team. Byob, no restrictions on alcohol. Toilet on boat, mostly shaded! Especially loved their eco-friendly, dolphin-friendly approach... we saw a lot of beautiful & natural dolphin activity without inciting unnecessary (& sometimes dangerous) thrill-seeking behavior from the dolphins. Hosts were full of information about dolphins, other creatures & local sites.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "111782256061862786848", "name": "Timothy Gardner", "time": 1497547867765, "rating": 5.0, "text": "If I could give 6 stars I would! We made a mistake and went to Orange Beach to the wrong company. Made contact with them and they said they would wait. We had no time to spare to make it to Perdido Key, FL. We showed up 15 minutes after the scheduled cruise was supposed to start. They went out of there way to come pick us up at the dock. Welcomed us onboard and we had a great time. Very informative crew! We loved it!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "105961538381187437352", "name": "Christopher Newton", "time": 1530191596760, "rating": 1.0, "text": "Do not recommend, bad customer service, no one can give you a straight answer, the staff were rude, the area and boat was dirty. Do yourself a favor and go elsewhere.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "118232865668469808908", "name": "Kevin Mccarty", "time": 1530545859535, "rating": 5.0, "text": "My family had an amazing time! The kids loved how close we were able to get to the dolphins. I'll ve uding thrm again!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "115026047298172639027", "name": "Ericka Wheeler", "time": 1439087885289, "rating": 5.0, "text": "This tour was the most memorable part of our trip to orange beach this summer! Loved the island, the ride, and of course the dolphins! I'm not sure who had more fun, the kids or adults ;-)", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "105615625436077000420", "name": "Charlie Wilson", "time": 1459820744232, "rating": 5.0, "text": "This is a great cruise!!!  The Dolphins came right up to our boat and it was so cool!  Definitely choose this one!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "111597847919506389035", "name": "Joe Cerven", "time": 1460154729398, "rating": 5.0, "text": "Excellent way to spend an afternoon.  Numerous sightings and smooth ride despite windy/choppy conditions.  Great hospitality as well!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "105150473771775109482", "name": "Dialyn Powers", "time": 1461732701065, "rating": 5.0, "text": "I know you have a lot of choices but the smart one is this dolphin cruise. My friends and I never stopped laughing. Make sure you add it to you To Do list. I swear the owner must be a dolphin whisper.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "116172582033453677368", "name": "Independent Posts", "time": 1462611615298, "rating": 5.0, "text": "An unforgettable experience on the Dolphin cruise! Lovely crew, too! Strongly recommend!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "112210808699288513917", "name": "Cat Huss", "time": 1467320044071, "rating": 5.0, "text": "Great trip. Friendly people. LOADS of dolphins!!! Super trip. We plan to book again soon!!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "107773592223844163756", "name": "Errol Jones", "time": 1469111426270, "rating": 1.0, "text": "They had rescheduled us on a different time slot the day before and I did not get the text until an hour before the cruise. They would not provide us with a refund. After standing in the hot sun for over an hour they offered us a ride on a sail boat without any shade. The kids would have been toasted. What ever happened to customer service? The lady on the phone was loud and rude!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "116401116682271604110", "name": "Desiree Johnson", "time": 1459795347491, "rating": 5.0, "text": "Shaded with padded seats. Very family friendly! Had a great time!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "108785358955322341498", "name": "karen wilder", "time": 1532125056103, "rating": 1.0, "text": "Bored, idled  forever, no information about dolphins or area, no music, deck of boat was dirty, no laughs, peoples kids got bored and fussy, worse dolphins  cruise I have ever been on, even the captain looked untrue sky\nThey dont even check for payment!\nPay a few bucks more for alot more fun!!", "pics": null, "resp": {"time": 1554295470960, "text": "Karen,\nI checked my manifest for 37 weeks ago, and even went back 4 years, and could not find your name. I have no clue which boat you actually cruised on, but I believe you were on another boat.\nMy mother (aka my best friend/right arm) died last season and two weeks later, I was back on the water, trying to give my customers a great dolphin experience. There has never been a day that we don’t bring forth our “A” game, and put aside any personal issues we might have- including the death of a loved one.\nI’m sorry for what you went through on someone’s boat, but I am confident it wasn’t mine.\nAnd as far as checking for payment....if you cruised with someone without paying...shame on you.\nWe all (all dolphin cruises) work very hard and occasionally, due to most customers paying online prior to the cruise, and no need to “check for payment”, we/any cruise company miss collecting and if you did not speak up, SHAME one you. What are you trying to accomplish by announcing that on a public forum?\nAre you encouraging others to stiff us too? Wow. That speaks volumes.\nP.S.\nThere is another company in town who copied my business model, and had a very similar name as me. Perhaps you cruised with them.\nEither way, I hope you find what you’re looking for in life, because it’s pretty sad to leave a small business such a stinking review.\n\nKind Regards\n\nTabby"}, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "116792684444044814152", "name": "Brittney Franklin", "time": 1460149073960, "rating": 5.0, "text": "We had a great time with our family! We got to see the new baby dolphin too!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "114784091219852163973", "name": "Steve Honican", "time": 1463056896505, "rating": 5.0, "text": "If you are in Gulf  Shores this is the best tour around. Captain Bart will put you next to the Dolphins.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "107699886666573992213", "name": "Stephen Masterson", "time": 1461791227580, "rating": 5.0, "text": "Dolphin Tales - think great views, great people, great guides and a wonderful time! Love these guys!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "112549171287345688881", "name": "Alissa Luciani", "time": 1465955722934, "rating": 5.0, "text": "We took the cruise and snorkel trip. It was the highlight of our vacation there were 7 of us and we couldnt wait to do it. The boat was comfy and shaded  the island we snorkeled at was beautiful we found a starfish and hermit carbs. The family enjoyed theirselves and thats hard to do with ages ranging from 8 to 40. But it was an experience we will not soon forget. Would definitely do again. Thank you for helping us make great memories.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "102098719554549791351", "name": "Mandy Sims", "time": 1451163513099, "rating": 5.0, "text": "Captain Bart was fun and very good with getting kids involved.  Lots of fun!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "113542179171768361585", "name": "Ashley Imperato", "time": 1461853813154, "rating": 5.0, "text": "What a beautiful experience! I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "114515770349929107698", "name": "Sarah Mathes", "time": 1461764592688, "rating": 5.0, "text": "This is the best and friendliest cruise out there, can't wait to go again !!!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "113803257821510995961", "name": "Emily Stutts", "time": 1464967193902, "rating": 5.0, "text": "We had a wonderful cruise!!! Very enjoyable and saw lots of daulphins!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "109719190988891109341", "name": "Mylan Mitchell", "time": 1462639629918, "rating": 5.0, "text": "Great Experience! Highly recommend?", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "112426047076897768082", "name": "HK K", "time": 1461734556043, "rating": 5.0, "text": "Great cruise with friendly staff who go the extra mile! Greek friendly during spring break!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "118047883692800988646", "name": "Tim Carn", "time": 1438108059935, "rating": 5.0, "text": "Our friends at Dolphin Tales always take great care of our guest!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "109899290053222716730", "name": "Brian N Kim Collins", "time": 1462582312137, "rating": 5.0, "text": "Had a wonderful time, great hospitality thanks everyone", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "108845044689207491459", "name": "Nicole Freeman", "time": 1499112622260, "rating": 5.0, "text": "Seen tons of dolphins! Great eexperience HIGHLY recommend!!!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "114239461284087563672", "name": "Agustin Tena", "time": 1530116299021, "rating": 1.0, "text": "I will never bring my family and friends here again. The place is dirty and customer service terrible.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "102687094637083164874", "name": "Rebekah Newton", "time": 1530116869064, "rating": 1.0, "text": "One star because I can’t rate any lower. Property was disgusting, captain was so rude, ship was dirty, and it’s so poorly managed. Would never recommend anyone come here.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "106698272938466022310", "name": "Amanda VanCappellen", "time": 1461757641282, "rating": 5.0, "text": "Very friendly and knowledgeable!  Great tour for all ages!!!!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "107478253000577083699", "name": "Jason Severson", "time": 1454383979031, "rating": 5.0, "text": "Great captain and fun experience!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "107587672642446552658", "name": "dave bonds", "time": 1461770273327, "rating": 5.0, "text": "Blue angle trip was awesome!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "109668696159979367594", "name": "peggy lindsay", "time": 1461632281937, "rating": 5.0, "text": "Great family experience, fun times", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "107277645618338952572", "name": "Patricia Louagie", "time": 1530545993647, "rating": 5.0, "text": "Had an awesome time.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "113034954292639459525", "name": "Linda Baker", "time": 1476464134123, "rating": 5.0, "text": "Dolphin Tales is our favorite thing to do .", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "104854955167512411709", "name": "Jennifer Morgan", "time": 1461766127640, "rating": 5.0, "text": "Wonderful experience!", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "112104306589541675015", "name": "Christopher Rider", "time": 1466272275365, "rating": 5.0, "text": "Excellent.", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "104805687290545669528", "name": "Zach Adams", "time": 1466619990975, "rating": 5.0, "text": "We saw dolphins", "pics": null, "resp": null, "gmap_id": "0x8890a80e22f552af:0x2493a14e64598a8a"}
{"user_id": "108407344065464300418", "name": "Adam Knapp", "time": 1494210297097, "rating": 5.0, "text": "I had an amazing day with Capt Chris. I was traveling through the Fairhope, AL, area for work and found myself with a free morning.\n\nCapt Chris was consummate professional. He communicated clearly about where and when to meet him and the expectations for the trip. We were blessed with an idyllic day - blue skies, gentle breezes, and calm waters.\n\nCapt Chris worked hard to put me on the fish. He explained the technique and put me in some productive water to start. We moved around a bit to find some more active areas, and boy did we find one. By the end of the day, we had caught a bunch of beautiful redfish, a black drum, and a speckled trout.\n\nFishing with Capt Chris was like fishing with an old buddy, and fortunately, one who has nice equipment and knowledge to find and catch fish. I hope I find myself in the area again to fish with him.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPE5DF0JaBRTW28Yqv1rbP5T6wDK00s1UzO-1oj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPK662br86Pa-FXjUn29ZygtDQtEOlB84Nk8M-R=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMaC_a5ExgxmE9iKtiDUCav5P2LdGEUyU_Jb5Qo=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a16225bbd3af3:0x949566d260f3e754"}
{"user_id": "108484004627272085125", "name": "Jessie Smith", "time": 1589657100380, "rating": 5.0, "text": "I highly recommend fishing with Captain Chris me and my son had an awesome experience and my son's first experience and we'll definitely be doing it again.", "pics": null, "resp": null, "gmap_id": "0x889a16225bbd3af3:0x949566d260f3e754"}
{"user_id": "117909624265655211153", "name": "julesjrtx", "time": 1593736493029, "rating": 5.0, "text": "Chris put us on the fish despite having to dodge the rain much of the morning.  A great guide, and a greater man.", "pics": null, "resp": null, "gmap_id": "0x889a16225bbd3af3:0x949566d260f3e754"}
{"user_id": "107018486758583554454", "name": "Gary Sullivan", "time": 1564856633012, "rating": 5.0, "text": "My wife and I fished with Capt Chris and couldn't have enjoyed our day any more! He was a great captain and guide. The sights, the fish, the conversation, and the information was all superb. We will absolutely be repeat customers with Southern Exposure Inshore Fishing!!!", "pics": null, "resp": null, "gmap_id": "0x889a16225bbd3af3:0x949566d260f3e754"}
{"user_id": "110173676387161914386", "name": "Jamie Carabin", "time": 1577539393653, "rating": 5.0, "text": "Chris is fantastic! Our family of 4 had a blast...slayed the red fish! Was really fun, some great memories for sure. Thank you Chris!", "pics": null, "resp": null, "gmap_id": "0x889a16225bbd3af3:0x949566d260f3e754"}
{"user_id": "106762672111241930281", "name": "A Pettitt", "time": 1524112840663, "rating": 5.0, "text": "I would recommend Southern Exposure to anyone looking for an amazing fishing experience!  Couldn't have asked for a better guide. Captain Chris has a wonderful personality matched with years of experience.  He treated us like family and put us on some very nice fish.  I will definitely be back to Alabama fishing with Captain Chris again.", "pics": null, "resp": null, "gmap_id": "0x889a16225bbd3af3:0x949566d260f3e754"}
{"user_id": "112234412836187956723", "name": "Malcolm Carson", "time": 1435877673439, "rating": 5.0, "text": "My son and I fished with Captain Chris on 7/1/15.  We had a very successful trip.  Catching fish was superseded only by our captain's personality, character and professionalism. We will definitely be calling him for a charter again.  Thanks, Chris       Malcolm and Maxwell Carson", "pics": null, "resp": null, "gmap_id": "0x889a16225bbd3af3:0x949566d260f3e754"}
{"user_id": "112732953399848174443", "name": "Kathy Kawka", "time": 1456929700592, "rating": 5.0, "text": "We had the best time fishing with Capt. Chris Tew.   He really knows what he's doing when it comes to fishing Mobile Bay and/or the inshore waters of Weeks Bay.  We've been on the water with him several times and it's always been great.  Fishing with adults is one thing but his kindness and patience towards our grandchildren was memorable and we'll definitely charter with him again. If you haven't chartered with Capt. Chris or gotten to know him you're missing a great experience.", "pics": null, "resp": null, "gmap_id": "0x889a16225bbd3af3:0x949566d260f3e754"}
