{"user_id": "105326586134204499215", "name": "Gabriella Williams", "time": 1609181594820, "rating": 5.0, "text": "We had a great experience living at Shelton Mill townhomes. Family friendly neighborhood and always felt safe.  The pool and park was great for our little kids.The property manager and staff was always very kind, helpful, and easy to work with. Any maintenance that needed to be done was taken care of almost immediately and followed up to make sure everything was done and working fine. I would definitely recommend living here.", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "117868212023089358477", "name": "Emily Chapman", "time": 1582324681319, "rating": 5.0, "text": "Super spacious, well-maintained properties! If you want a quiet, safe, peaceful place to live in Auburn, this is where to go! They've renovated a lot too! Right before I moved in, they put in entirely new cabinets. Plus, the maintenance staff is always on top of it, and even got one of my repairs done three days early!", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "114232759880135295113", "name": "Tori Thomas", "time": 1592407749358, "rating": 1.0, "text": "AVOID renting from here as long as the property manager is Kristi. The worst thing Shelton Mill ever did was lose Tami and then replace her with this joke of a \"manager.\" She could not possibly care less about the residents than she does now. We have lived in many many rental properties over the course of the last decade due to nature of work, but this experience with Kristi taking over has been hands down the worst and we would not have ever returned to SM had we known she would be the replacement. She lies about things being done (ie: a neighbor was told their filter was DEFINITELY changed when it was clearly COVERED in filth, and Kristi only backed down when the neighbor walked into the office with the NASTY filter as proof), but also just seems to lie a lot in general. When we had to leave for a work move, she spent months telling us she would try to get it rented early, but then listed the unit as available for the month after we had already paid up to. When confronted with that she claimed they were telling people it was ready earlier than what was listed on literally every outlet. Rather than just being honest from the start and saying no I can't (aka- don't want and have no interest in) help you. Her little sidekick in the office is even more useless and twice the nasty attitude. If you call for anything and she happens to pick up, just try again later because she will have no clue what you're talking about and speak to you like dirt. I really don't know what they are paying this girl for at all to be honest. They basically have children running an entire property and they are doing an EXTREMELY poor job at it.\nThe ONLY, and I mean ONLY, good thing left about this place is Makeyma. They are raising rent yearly on absolutely trash townhomes without any updates. Even the brand new one we lived in, and paid ridiculous monthly amounts for (I'm talking we pay less on a 3000 sq ft mortgage than we did here) we found sloppy construction all throughout, cheap paints and carpets, cabinets that were not level, doors that wouldn't shut, etc. When Tami was around, we never had a single issue- any we did have was fixed same day without the side eye and snarky attitude, and this was honestly a wonderful place to live in a great location.", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "112658799121425547318", "name": "Aaron Nawrot", "time": 1576518271187, "rating": 5.0, "text": "I have lived in Shelton Mill for 2 years now and I love it. The staff is the best, and I have never had a problem.", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "108436667856169803722", "name": "Alexandra Williamson", "time": 1489100035939, "rating": 2.0, "text": "I really wish I could rate this complex higher - it has the potential to be so great.  Like previous reviews, the carpet was FILTHY when I moved in.  They should have replaced the carpet before I moved in because there were stains, discoloration, and it was coming a part from the seams/thresholds to other rooms.  Most of the stains I covered with rugs, but I steamed the carpet myself before I moved my stuff in and the water was black.  Additionally, the microwave should have been replaced as well - it was so old that it was a turn-dial style!  The stack washer and dryer they installed was too large and the doors couldn't close, so I kept it shut with a bungee cord.  I had to move out early because I got a job in another state and had to pay essentially an additional 2 months of rent and didn't get my deposit or pet deposit back.  None of this, however, compares to issues I had with my air conditioning.  My air conditioner broke FIVE times over a hot Alabama summer before they replaced the unit.  I had to get very forceful in my emails to have her take my concerns seriously, which is ridiculous.  It's a shame.  The landscaping is great, the units are large with a good layout, location is convenient to AU and shops, it's quiet and the tenants are very friendly.  If they maintained the units better and took their tenants concerns seriously, then this place would be fantastic.  I just don't think it's worth the trouble.", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "112619152255932589748", "name": "Sam B", "time": 1628257320366, "rating": 5.0, "text": "Birds are real", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "103809121317098932349", "name": "Kim P", "time": 1560805498931, "rating": 1.0, "text": "When our son moved in, the apartment was somewhat in disrepair, and after compiling a list -- nothing was worked on unless an extreme situation (when a washer stopped working or the HVAC trap backed up), and on departure a year later, after leaving the apartment in immaculate condition, we were charged $25 for replacement drip pans (for the stove).  I had washed the pans in the dishwasher, then individually scrubbed each one with a non-abrasive cleaner. The charge was, per Christie, because \"the bottom side of the pans had stains\" but she did not keep the pans to show us. We tried to be reasonable this past year, including paying $300 early on for permission to have a dog on the premises for a week's time...but the last charge was just an insult, pure and simple. I would not recommend the apartments here under any circumstance.", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "106815585604145844554", "name": "Rnm Enterprises", "time": 1573060177829, "rating": 2.0, "text": "First some background of me:\nA recent transplant to the area, I hold a professional white collar job in medicine and have a high expectation from those around me as well as those I do business with.  We rented a 3/2, single story townhouse here.\nWhere to begin:\n1. Pool closes after Labor Day, despite the fact that the summer weather is still here.\n2.  Management is hit or miss with keeping appointments they make.  We have the obligation of making the house available for them to install air filters on a given day at a given time.  The last time they didn't arrive for 3 DAYS without a phone call of explanation.  It's as though they expect their tenants to either put their lives on hold, or just give them carte blanche to enter whenever they feel like it.  Case in point, again:\n3.  Management will give YOUR KEY to any workman that says they need access to the house to do repairs.  We didn't need any repairs, but had a pair of workers enter our house with a key they received from management, while my wife was not dressed in a state to receive guests.  No phone call per the requirements of our lease agreement... invasion of privacy.\n\nTownhouse is decent enough and the location is peaceful which is what drew us here in the first place.  Would love to talk to the contractors that wired the thing though as they placed light switches in the craziest places.  Also we notified one of the handymen about what appears to be a short in one of the closets, but as is expected, no followup.\n\nUntil the management actually starts servicing their customers the way they themselves would want to be treated, or unless you are extremely patient and don't mind people either walking in unannounced or making you wait 3 days, I would explore different townhouses.  If I had known it would be like this, I wouldn't have moved in.", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "100035347969367060215", "name": "QUA HUSSEY", "time": 1563478142777, "rating": 1.0, "text": "If I could’ve give 0 stars I would’ve have. By any means do not apply or stay at this apartment. 1st We were given the wrong information regarding the application process by josie. Only to call and have Christie tells us a completely different story. Over the course of the 3 weeks we called and was told that her boss was out of town and emailed (with no response might I add.) supposedly had sent out a letter 3 weeks prior and instead of telling us we were given the run around. Poor communication, poor customer service. Can’t imagine how they handle their tenants.", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "103627553896000861656", "name": "Nikki Richardson", "time": 1565800137428, "rating": 4.0, "text": "Nice homes , nice staff. Just a little high in prices.", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "103531639648771048134", "name": "Darcy Meijer", "time": 1500560425910, "rating": 2.0, "text": "This collection of townhouses WAS wonderful when we moved in. Unfortunately, the owner has stripped a long, beautiful layer of trees from one whole side in order to build more units.\nIt's a shame since this used to be one of the few housing groups in Auburn that offered space, privacy and wildness. It used to be cool.\nThe almighty buck has turned someone's heart yet again.\nShelton Mills Townhomes will be another typical Auburn apartment complex.\nAh! July in Alabama and the sweet sound of SAWS cutting down virtually all the trees on the street side of the complex. And they start at 7:45 every morning on weekdays. We pay more than $1,000/month for this.", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "114140090033278686714", "name": "Donnie Bartlett III", "time": 1543117593904, "rating": 5.0, "text": "The management here is incredible. Tamie helped us to the best of her ability and she was always quick to respond to maintenance requests and questions. Great place to live and Makeyma (the maintenance manager) is incredible. The two friendliest and most helpful people we have ever had as property management are right here at Shelton Mill. If you live here while these two are working here, you will be in great care.\n\nTamie, the property manager, will go through the whole lease with you before you put your autograph on the paper. We ended up having to buy out our contract and leave early as well which is, like I said, completely normal for most leasing contracts. I paid attention to the lease when I signed it, so this was no surprise to us. It states very plainly if you leave early, you don't get your security deposit back either.\n\nAnyway, this is a great area to live and the homes themselves are nice. They are a bit on the older side (the one we stayed in was one of the oldest units there), but Tamie and Makeyma (the maintenance manager) will do whatever they can to make sure everything is up and running. They helped us with a couple of time sensitive repairs in a very quick and painless manner, and they were always great about returning phone calls and keeping in contact with us when we needed it. Makeyma needs to have his own maintenance business with how efficient he is, and he's just good people.\n\nThey were building new townhomes here too, which looked really nice. Like I said though, the old ones are not bad at all and actually pretty charming. Good, hardworking people like Tamie and Makeyma deserve fair reviews.", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "111503026747842350868", "name": "하지용", "time": 1612728591756, "rating": 4.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "116810745970109428204", "name": "Desmond Boswell", "time": 1495138039783, "rating": 3.0, "text": "When we moved in, the carpets were stained/frayed and the appliances outdated/cheap. However, that is not even the main issue. Our air conditioner was broken for over a month, and they would not install a new one. They just kept sending their handy-man (who is a great guy btw) out and repeated empty promises of having the air unit fixed \"soon.\" Living in Alabama without an air conditioner is HELL. These people that run this place are cheap and do not care about the comfort of their tenants. You have been warned!\n\nUpdate - management has been working with me in getting moved out, so I added a star. Will update after the move out process is complete.", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "100372498229471492301", "name": "Phil Forrest", "time": 1500412935485, "rating": 3.0, "text": "Meh. The grounds are nice but the units need remodeling.", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "102749440436251526002", "name": "Lisa Olds", "time": 1482897408475, "rating": 1.0, "text": "Unless you want to deal with constant noise from these thin walls don't move here. When I complained about the noise to the new manager the attitude towards me was like ok sorry but oh well. Smh. Never offered trying to solve the problem. I've been a great paying tenant for the year I've been here. Seems to me you'd want to keep good paying tenants that pay ahead of time every month. Terrible customer service. Glad I made the decision to move where there's peace and quiet.", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "108336075753027610055", "name": "Ashly", "time": 1464738647303, "rating": 1.0, "text": "When my husband and I moved in to the town home the carpet was filthy. As was pretty much everything else in the place. We cleaned  everything. We steam cleaned the carpets several times and each time clumps of black hair came up and the water was always black.  We ended up buying out of our lease  and a month later we get a letter in the mail saying we owed shelton mill another $880 dollars. After we had already paid the buy out fee and the months rent that we did not live there. I had been emailing the manager, Marcia about this. She says we really only owe $285 but she would give us $30 off ... she claims we damaged the carpet. I requested to see a picture of the damaged carpet and she then turned my husband and I over to collections (not even a week after we got her first letter) So, because she replaced the carpets with hard wood ( they had someone come in and measurs the floors while we still lived there) she could not show me a picture of the floors that she is lying about saying we damaged. Turning someone over to collections after nog even a week is ridiculous. The letter we got from you marcia, was not even accurate nor did it have a due date. I urge everyone to find somewhere else to live. They will not fix anything and they will screw you over when you move out.", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "101347730298734530871", "name": "Jos Meijer", "time": 1502631939909, "rating": 1.0, "text": "SUNDAY morning, 8 a.m., and the bulldozers are out there in my backyard right now making a racket. Management has lied for months about the extent of the construction - they keep cutting deeper into all our rental lands.", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "108625246550722286460", "name": "Wayne Brewer", "time": 1536172404971, "rating": 5.0, "text": "Fast fresh and friendly and clean", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "115085127175650762698", "name": "Marian Carter", "time": 1530314599690, "rating": 5.0, "text": "I love this place.", "pics": null, "resp": null, "gmap_id": "0x888cf2d1e8f931c5:0x84a5ba34dd595c28"}
{"user_id": "107993742675625795789", "name": "THE ONE THEY CALL WISE", "time": 1627497919292, "rating": 5.0, "text": "Neat", "pics": null, "resp": null, "gmap_id": "0x888917983a5041a7:0x68e622fd2355fe45"}
{"user_id": "104938303233756056531", "name": "Zoe", "time": 1593913163039, "rating": 5.0, "text": "The townhouses are very large! The cluster is cute and I love the fountain! The rooms have great space and overall they quite nice. Some weird angles in the room but it adds to the charm.", "pics": null, "resp": null, "gmap_id": "0x8889192eef6d09db:0x3b3ed06553882296"}
{"user_id": "105137868885545864097", "name": "Dru Vendetta", "time": 1479647504349, "rating": 5.0, "text": "Great properties .gorgeous on the inside with spacious floor plans and updated styling", "pics": null, "resp": null, "gmap_id": "0x8889192eef6d09db:0x3b3ed06553882296"}
{"user_id": "110648880769680571549", "name": "EPICSHE", "time": 1490091035405, "rating": 5.0, "text": "I use to clean these town homes for someone to move in. They are huge in the inside 3 floors. I had to walk around twice as I was amazed never seen nothing like it.", "pics": null, "resp": null, "gmap_id": "0x8889192eef6d09db:0x3b3ed06553882296"}
{"user_id": "106178598294286035568", "name": "LENIN BLADIMIR PARIS SOLORZANO BARAHONA", "time": 1558843008483, "rating": 5.0, "text": "(Translated by Google) First apartments of two and three bedrooms. Bathrooms, kitchen, laundry, excellent!\n\n(Original)\nApartamentos de primera de dos y tres recamaras. Baños, cocina, lavandería, excelente!", "pics": null, "resp": null, "gmap_id": "0x8889192eef6d09db:0x3b3ed06553882296"}
{"user_id": "117773544034175837297", "name": "rd g", "time": 1600618816017, "rating": 1.0, "text": "Thay won't let you have company over or have a good time", "pics": null, "resp": null, "gmap_id": "0x88626c88c1341b47:0x9af0f4886cb2ae00"}
{"user_id": "104980493034884092636", "name": "Steve Ewing", "time": 1613929920355, "rating": 1.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x88626c88c1341b47:0x9af0f4886cb2ae00"}
{"user_id": "102332456733667936297", "name": "Monique Smith", "time": 1498280436480, "rating": 1.0, "text": "Thanx for the info. DINO! Very helpful! I was all excited about this place until I came across some of these reviews. It's funny, I was just talking to our old coworker yesterday about u and lil'D 😊. Hope all is well!", "pics": null, "resp": null, "gmap_id": "0x88626c88c1341b47:0x9af0f4886cb2ae00"}
{"user_id": "104768789128552868941", "name": "Wendolyn Ewing", "time": 1609710689287, "rating": 3.0, "text": "I like it", "pics": null, "resp": null, "gmap_id": "0x88626c88c1341b47:0x9af0f4886cb2ae00"}
{"user_id": "107118055437133193340", "name": "Mark Duncan", "time": 1593540931358, "rating": 5.0, "text": "Excellent staff and phenomenal homes! We were all sad to leave. All the neighbors were so friendly. This place is the best in Birmingham!", "pics": null, "resp": {"time": 1596055322913, "text": "Thanks Mark!   We will miss y'all!"}, "gmap_id": "0x88892286f07baf09:0xed7c8baa7675231f"}
{"user_id": "116932230839172833498", "name": "Chris Mahan", "time": 1596645168831, "rating": 5.0, "text": "Excellent property with a dedicated helpful staff and management.", "pics": null, "resp": {"time": 1596650014458, "text": "Thanks for the 5 star rating!"}, "gmap_id": "0x88892286f07baf09:0xed7c8baa7675231f"}
{"user_id": "102000331586935827482", "name": "Billy Crane", "time": 1588803484816, "rating": 5.0, "text": "Very nice community with great amenities and townhouses that have a variety of floor plans.", "pics": null, "resp": {"time": 1591991305009, "text": "Thanks Billy!  We have enjoyed having you as a resident and glad you re-newed your lease!"}, "gmap_id": "0x88892286f07baf09:0xed7c8baa7675231f"}
{"user_id": "101670323930461767803", "name": "Michael Jones", "time": 1569372357774, "rating": 5.0, "text": "Beautiful architecture and landscaping, the interiors are luxurious, spacious and efficient. Easy access to freeways and shopping, great place to live!", "pics": null, "resp": {"time": 1570138978531, "text": "Thanks!  Nice seeing you at the cookout!"}, "gmap_id": "0x88892286f07baf09:0xed7c8baa7675231f"}
{"user_id": "109548007011997509548", "name": "Sharon Carter", "time": 1551059660880, "rating": 5.0, "text": "These are awesome. I am planning to wait for the next phase to be developed. Maggie has been so helpful and I am looking forward to working with her in the near future.", "pics": null, "resp": {"time": 1570139042828, "text": "Thanks!"}, "gmap_id": "0x88892286f07baf09:0xed7c8baa7675231f"}
{"user_id": "101327372872832336148", "name": "Nina Early", "time": 1569359768665, "rating": 5.0, "text": "I love the landscaping and the pool. Great place to live!", "pics": null, "resp": {"time": 1570139007077, "text": "Thanks!  Good seeing you at the cookout!"}, "gmap_id": "0x88892286f07baf09:0xed7c8baa7675231f"}
{"user_id": "118446232523586722083", "name": "Philip Gibson", "time": 1549584770752, "rating": 5.0, "text": "My wife and I have lived here since the building was constructed six months ago. The townhomes are beautiful and spacious, and either the walls are thick or my neighbors are quiet. Either way I think there are so many things one might consider in a review that only important question this: if I could go back would I still choose to live here. And to that I would say we're glad we made the choice and plan to stay here for as long as we're in Birmingham.", "pics": null, "resp": {"time": 1570139126151, "text": "Thanks!  Good seeing you at the cookout!"}, "gmap_id": "0x88892286f07baf09:0xed7c8baa7675231f"}
{"user_id": "107562324081309652971", "name": "Chase Beard", "time": 1571091999460, "rating": 5.0, "text": "Beautiful place to live. The pool and gazebo area is the best in town!", "pics": null, "resp": {"time": 1588622874947, "text": "Thanks for the 5 star rating!"}, "gmap_id": "0x88892286f07baf09:0xed7c8baa7675231f"}
{"user_id": "114401395902405809347", "name": "J C", "time": 1569361381728, "rating": 5.0, "text": "Beautiful town-homes!!  I cannot wait until the condominiums are built!", "pics": null, "resp": {"time": 1570138989234, "text": "Thanks!  Me either!"}, "gmap_id": "0x88892286f07baf09:0xed7c8baa7675231f"}
{"user_id": "110703606409420360330", "name": "James Greene", "time": 1526560530474, "rating": 5.0, "text": "Great new upscale townhome development with private pool. Kadco home builders.", "pics": null, "resp": {"time": 1570139111856, "text": "Thanks!  Been nice working with you!"}, "gmap_id": "0x88892286f07baf09:0xed7c8baa7675231f"}
{"user_id": "116121572761406527640", "name": "Beth Clark", "time": 1550853010331, "rating": 5.0, "text": "Gorgeous townhomes & pool", "pics": null, "resp": {"time": 1570139197472, "text": "Thanks!"}, "gmap_id": "0x88892286f07baf09:0xed7c8baa7675231f"}
{"user_id": "114620510880927839221", "name": "Amber C", "time": 1574871804411, "rating": 5.0, "text": "Pretty Christmas decorations", "pics": null, "resp": {"time": 1588622859323, "text": "Thanks!"}, "gmap_id": "0x88892286f07baf09:0xed7c8baa7675231f"}
{"user_id": "107713824130201915305", "name": "szilxhguvbcnawfljvzrsnn jgvgufjihebvds", "time": 1624291865600, "rating": 4.0, "text": "I reccomand these apatments and i give it a 4 because the maintnist just walks in without knocking or anything but these are lovely apartment i would live there", "pics": null, "resp": {"time": 1624375699057, "text": "Thank you for your stellar review! We are happy to find that you are loving the elements of our community and would like to improve your stay as much as possible. Please feel free to contact us if you have any questions or would like to further discuss any concerns."}, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "117209329316727385985", "name": "Amaris Watson", "time": 1620753965508, "rating": 2.0, "text": "I was considering moving into these lovely townhomes despite the grounds being unkept. For almost a week now I’ve been trying to move in with no prevail due to the unprofessional and lazy nature of the office staff. I wouldn’t recommend anyone move into these townhomes.", "pics": null, "resp": {"time": 1621021738309, "text": "Amaris, thank you for sharing your feedback with us. We understand your frustration, but assure you that our team of professionals is working tirelessly to get you moved in as soon as possible. Please reach out and we would be happy to update you on the status of your move-in. We hope to speak soon and clear up any misunderstandings!"}, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "105524466882392253260", "name": "Jessica Hope", "time": 1614799105158, "rating": 1.0, "text": "If I could give zero stars I would! The worst place to live! Maintenance walks in on you unannounced (no knocking, ringing the doorbell or anything. Just walks in), they break things instead of fixing it, they tow your vehicle for no reason and make you pay for the tow and to get it back! They fix toilet chains and cabinet doors with zip ties. The office staff will lie to you on multiple occasions and then accuse you of lying. They try to force you to turn over your medical records to them. Do not rent here! It’ll be the biggest waste of money!", "pics": null, "resp": {"time": 1614884602543, "text": "Thank you for bringing your concerns to our attention. Our staff is dedicated to providing thorough, accurate service and ensuring our residents' peace of mind, and we are saddened to learn that your stay has not been a more accurate reflection of the positive living situation that we strive to offer. We will be reviewing this information with our team so we can improve our service experience for residents and prospects such as yourself, and we encourage you to contact our office directly if you would like to discuss any of your concerns further with our management team."}, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "113022600841131679081", "name": "Lyn A", "time": 1609883903970, "rating": 1.0, "text": "Lights are out.  See someone living in black SUV by the entrance off 90.  Just seems like the owners don't care.  It also seems the workers don't care either.  Always trash n other things all over the place.  U see all the roofs covered with tarps and such, that right there makes it an unwelcoming place to live. Besides the fact things are constantly stolen from residents.", "pics": null, "resp": {"time": 1610473489075, "text": "We appreciate you bringing your concerns to our attention, Lyn. Please know, our team is dedicated to addressing all of our residents' concerns in a thorough and timely manner, so we are disappointed to see your negative perception of our community. We would appreciate a second chance to impress you with our excellent service, so we encourage you to reach out to the office via phone or email at your convenience. Thank you, and we hope to hear from you again soon.​​​​​​​"}, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "116824030662213604829", "name": "James Bolton", "time": 1616148988927, "rating": 1.0, "text": "Stayed here for 3 months and broke lease because roof was leaky, my truck kept getting messed with and the office would never pull security footage to take to the police. Would not recommend.", "pics": null, "resp": {"time": 1616518707800, "text": "We are sad to see you hold such a low perception of our community at this time, James. Please know, we care deeply for each and every resident of our community and we regret that you received the opposite impression. If you have any outstanding questions or concerns that you would like to discuss with our management team, we encourage you to reach out to our office directly at your convenience. Nonetheless, we wish you well in your future endeavors."}, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "104900576989955534652", "name": "Trever Stearns", "time": 1614826731281, "rating": 4.0, "text": "Too many speed bumps for a low rider. But super safe for the kids.", "pics": null, "resp": {"time": 1614814331582, "text": "Thank you for taking the time to leave us this feedback. If you'd like to discuss your concerns regarding our community's road safety measures, please don't hesitate to reach out to our office directly at your convenience - we'd be happy to speak with you!"}, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "111738582508355943263", "name": "Letherius Miller", "time": 1588736213268, "rating": 1.0, "text": "This place is bug infested. I mean bad. I wouldn’t be surprised if they shut the whole complex down within a year. Multiple people have complained about the same thing I saw, multiple bugs swarming in the complex and when we alerted the office they said it was nothing they could do about it. I broke my lease to get out of there as well as a friend I have who also experienced the same thing. Do no do not do not move here. That’s the only warning I can give you", "pics": null, "resp": {"time": 1590880224100, "text": "We’re discouraged by this characterization of our community and regret that your experience here has been anything less than exceptional. Please know that we are diligently working to address the pest control situation with our residents on a case by case basis, and encourage anyone with concerns or questions to reach out to our office directly. We appreciate you taking the time to share your experience and wish you well in your future endeavors."}, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "117137108208689964434", "name": "braden chestang", "time": 1621818702224, "rating": 3.0, "text": "Ok place", "pics": null, "resp": {"time": 1621880667465, "text": "Braden, thank you for taking the time to leave a review for our community. We strive to provide five-star service, so please don't hesitate to let us know what we could do to get those last couple of stars! We hope to speak soon."}, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "102266142795600390242", "name": "lucian13 ReaLHD", "time": 1483549586470, "rating": 3.0, "text": "Maintenance crew is quite slow with no attention to detail in the experience I had with them. They seem to spend more time riding around in carts than they do actually fixing things. The mowing crew is particularly annoying with all the blowing of leaves. That's fine but pick them up and not just blow them from one place to another. Parking is an issue as well. Not sure who it is, whether a contractor or staff, but they have their car parked right in front of the unit they are working on. They need to park in a common area so those that live here can park in front of their own building. Also, none of the windows in my unit were even touched and don't look like they've been cleaned in years. Now, that's not the properties issue as far as how clean someone who lived here was, but when they get it ready for the next person at least clean out the crap that has accumulated in the \"groove\" at the bottom of the window. I hope things get better and yes there are definitely too many dog owners here. I moved from out of state so I didn't have the luxury of checking it out before moving. Not trying to complain just let people know how my experience has been.", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "116758891309086949726", "name": "Chelsie Jacobs", "time": 1453915203990, "rating": 5.0, "text": "I have been a resident at Sandpiper for almost two years now. The office staff has been nothing but extremely welcoming and professional any time I enter the office for any reason. The monthly resident events are always such a fun time and the staff really puts in an effort to make everyone feel welcomed. Alison and Kim make a great management team, and the maintenance staff is always on top of anything I have requested to have fixed. I definitely plan on resigning my lease for a THIRD year at Sandpiper!", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "101286322524091612751", "name": "Kimberly Hardy", "time": 1421787038832, "rating": 1.0, "text": "I have lived at the complex for 3 years. I have never had a late payment or an issue. Our apartment manager went out on leave and her replacement manager KIM, was rude and had poor manners. When I was faced with an hardship I was quoted on thing over the phone but when I wrote my letter to terminate my lease which was 60 days short of their policy, but we had a unexpected lost of income. When I explained the hardship to KIM, she was at first, very understanding and stated that I would only have to pay ABOUT $700 and that they would put me on a payment plan to do so. When I took my letter to the office I was told that I would get a phone call back by the end of the week letting me know the exact measures to take. Well, of course I never got the phone call and an entire week went by. KIM sent someone to place the letter on my door stating that I would owe double of what I was quoted. When called for a better understanding, I was cut off when I tried to speak, and KIM was very rude after about 5min into the phone call. She got very aggravated while I questioned her for a better understanding. When asked for her last name so I could contact cooperate office she refused to give me her name. So, when dealing with Sandpiper and KIM is the manager do not discuss business over the phone. I know that is a known fact but dealing with management prior to her I never had a problem so I felt comfortable doing so", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "110004167717749288355", "name": "Kieys j", "time": 1578772701383, "rating": 5.0, "text": "Didn't actually visit may have been near this location &GPS just picked it up stating I were here sorry.", "pics": null, "resp": {"time": 1578959744324, "text": "We appreciate the 5-star rating! If you find yourself in our neighborhood again looking for a new residence, please feel free to stop by and check out all the great features we have to offer. Take care!"}, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "104049908529139271616", "name": "Samantha Brinkman", "time": 1557089916755, "rating": 3.0, "text": "Good friends live here, very neice complex, though care of the property could be a bit better.", "pics": null, "resp": {"time": 1557245040987, "text": "Thank you for taking the time to leave us this valuable feedback. Our team works hard to keep our property looking clean and inviting and are happy to take a look at areas that might need a little extra attention. We would love to speak with you in greater detail to learn more about how we can make your experience in our community even better, so please feel free to reach out to our office at your convenience if you would like to discuss with our management team."}, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "107109756975171428452", "name": "Cole April", "time": 1479826386387, "rating": 3.0, "text": "We enjoy the location and the townhouse. We wish the bathrooms was bigger and the parking spots was marked off. Our new neighbors continue to take our spots, especially in front of our door. We complained about the issue but the staff said there was nothing they could do about it which is not understandable since it's their property. My aunt is older and I just recently had a injury and we had to find a parking spot just to get in the house which was disheartening.", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "114701720619982816900", "name": "Natasha Landrum", "time": 1514845267286, "rating": 1.0, "text": "The place os very overpriced and the worst part for me is to pay so much in rent and can't even park in front of your own door,  a place this expensive should at least have assigned parking.. Can't wait to leave and never look back...  So irritated..", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "114262408840965140313", "name": "Anthony Wilson", "time": 1532594948437, "rating": 5.0, "text": "The view by the pool is awesome in the summer....dear management , stop running off the guest with tiny bikinis", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "105949241372143909478", "name": "Artester Griffin", "time": 1549412494831, "rating": 1.0, "text": "Do not move here * management is horrible my place was broke into twice nothing was done I had to sleep with a busted down door 3 nights ask if I could be moved to the front they stated I would have to do another credit check as well do lease & deposit over .. had mold on my roof no one sprayed or came out tub stops up bad toliet over flooding no one came out we have to walk all the way down stairs to use bathroom going on 3 weeks no the workers are liers an try to get bad on young people requested higher level management no one reached out or contact me", "pics": null, "resp": {"time": 1549661451397, "text": "We are truly sorry to hear about your experience in our community. We aim to provide a comfortable, up-to-date environment for all of our residents, and we sincerely apologize if we have not matched up to your standards. We would appreciate the opportunity to speak with you further regarding your experience directly with our management team. Please reach out to our office at your earliest convenience, thank you."}, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "111803642711538583276", "name": "Ashley Hamilton", "time": 1465502481984, "rating": 4.0, "text": "Great place to live very quiet, my only dislike is the people let their animals use the bathroom anywhere and there are kids that like to walk around and play, I think people should take there animal to the proper location ,it would be gladly appreciated...", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "103121116844898927429", "name": "allie tubb", "time": 1486185986605, "rating": 2.0, "text": "Maintenance service call response time is days if ever. Pool cleanliness lacking, office staff generally friendly, but charges lots extra to ALL RESIDENTS for dog park even if you have no pets. Residences on main road sides of buildings hear lots of lots traffic.", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "112996995946796620761", "name": "Margaret Payne", "time": 1495899644788, "rating": 5.0, "text": "I loved living there, the ladies at the office are amazing and professional.", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "113376121892364837758", "name": "philip ritch", "time": 1443290455872, "rating": 5.0, "text": "Very nice Apartments and the office staff is professional. The maintenance team is on the ball, fixing things immediately!", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "117838639184720805196", "name": "Stephanie Boyer", "time": 1499257032820, "rating": 5.0, "text": "Never had a problem visiting my aunt who stays here", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "106331421789807655871", "name": "Megan Weaver", "time": 1494401477505, "rating": 1.0, "text": "Worst place I have ever lived in .I have lived here 2 months and my apartment plus my to neighbors apts are infested with spiders and silver fish bugs . also health problems have appeared since we have lived here .daily asthma attacks with one of my children but before we moved here never !! She had been to a asthma and allergy Dr to confirm .I have reported it to office about bug issue that i have papers stating my child is allergic to the roaches and bugs this place so happens to be infested with it can kill her they still have done NOTHING!!! Along with cough and congestion with all people that live here in my apt . but never had all these issues before unless sick . Another child of mine has been coughing for days now but not sick and puking tonight that's why im letting everyone know before they have same issues or children have to suffer . I will be contacting bbb and whoever is above this place .on top of illness the place started falling apart within 1 week of moving in such as cabinets,hall  doors closet doors. Also wallpaper literally peeling and falling off my wall. I thought this place was good safe from creeps and burglars and was a decent apt.for over 1000 monthly plus utilities people are better off in a run down trailer park .probably get better maintence nicer people and not weird creeps harassing the women that live here .DO NOT MOVE HERE no matter what they say .we asked they lied also they will play friendly to your face when looking into moving here and will turn into mean rude unprofessional people here after .if anyone is looking for the truth send them to my review .and not the staged scripted reviews left by employees. And don't WASTE your MONEY!! Also keep a close eye on YOUR KIDS if you do move HERE .good luck to anyone who decides to live at the piece of junk place !!!!", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "106726520794741659607", "name": "Felicia Copeland", "time": 1505222853218, "rating": 5.0, "text": "Very nice community, very clean and well maintained", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "115375709624653896173", "name": "Kim W", "time": 1466679222559, "rating": 1.0, "text": "I spoke with Kim in the office at sandpiper about my apartment search and filling out an application and viewing an available unit. Kim informed me in order to fill out an application there would be a 50 dollar application fee and 49 dollar deposit that was due at the time application was filled out. I specifically asked was deposit refundable if I didn't move in because at the time I was undecided and viewing several other apartment communities. I was told by Kim that the application fee was non refundable but deposit which was in the form of a money order would be refunded and endorseded back to me. After I didn't move in Kim denied telling me that and I was told I couldn't have spoken to her (which I know it was her being we have the same name) and I forfeited my deposit when I changed my mind. This was very unprofessional. Even though it was only 49 dollars you shouldn't be tricked by anybody just to get your money and have them deny saying it because you chose not to move in their apartments.", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "113208442258312962339", "name": "Leazetta Williams", "time": 1522959514192, "rating": 1.0, "text": "I would not recommend these townhouses to anyone. They need to be remodeled my ceiling has a big wet spot from the toilet. for the price that we pay you would think they will be a1 facility  (so not worth the price). the parking is horrible you cant even park in front of your doors at times and as soon as you call the office their response is there are no assigned parking, which is BS if I'm paying almost 800$ I should be able to park in front on my door. I think they should assign your apartment number in both (2) of your parking spots. Sandpiper are some schemers they went up on our rent $10 without letting us know and expect us to just go along with no ma'am.  My husband and I have called the office several times to speak with Bridgette the manager and they keep lying saying she's not available and she would call us back (but never received a phone call). I will be calling corporate because this is unacceptable and very unprofessional.", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "118162204032735868568", "name": "Virginia Pierce", "time": 1490193723946, "rating": 1.0, "text": "We've had issue after issue with this place. The management is rude and unprofessional everytime. Neighbors were broken into and 2 of our cars broken into within weeks. Several other friends in sandpiper have yet to have leaks fixed and maintenance is horrible good luck getting anything done.", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "101662871063598781943", "name": "Angel Kerney", "time": 1506688677433, "rating": 5.0, "text": "Beautiful place to live but very costly better have some coins ready!!!", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "116928463769955968338", "name": "Kenny Warren", "time": 1532357347449, "rating": 5.0, "text": "Great place to live", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "118410630245950606095", "name": "Sandy Rosson", "time": 1583015164554, "rating": 2.0, "text": "Dirty", "pics": null, "resp": {"time": 1583263154481, "text": "Our team works hard to create an inviting and up-to-date environment for all our residents, so it’s disappointing to see your negative perception of our community. At your earliest convenience, please contact the office so we may have the opportunity to discuss your concerns in more detail. Thank you."}, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "117867627155627066470", "name": "Cody Davis", "time": 1510148810330, "rating": 4.0, "text": "Could reasonably ask for more", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "117441185353954047393", "name": "Paris White", "time": 1505168671001, "rating": 5.0, "text": "Because it is beautiful", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "103275927585691573199", "name": "Latisha Samuel", "time": 1495389785377, "rating": 1.0, "text": "There infested with termites...", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "107104726522447433532", "name": "sam stanley", "time": 1505515352444, "rating": 3.0, "text": "Older apts", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "105010673302702053867", "name": "Hunter Hollis", "time": 1499614273755, "rating": 2.0, "text": "No thank you..", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "102430821921380931801", "name": "Ninjamonkey LZ500", "time": 1439498953546, "rating": 2.0, "text": "Really nice apartments but Kim the office clerk was extremely rude and disrespectful every time my wife or I had any contact with her.", "pics": null, "resp": null, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "101057340680251048465", "name": "Gerlis Gomez Berdugo", "time": 1578781753531, "rating": 5.0, "text": "(Translated by Google) insurance\n\n(Original)\nSeguro", "pics": null, "resp": {"time": 1578959740373, "text": "(Translated by Google) Thank you so much for the five-star rating! We aim to provide a comfortable and inviting community, and we appreciate your feedback. Our door is always open if you have anything you would like to add.\n\nThank you very much for the five star rating! Our goal is to provide a comfortable and welcoming community, and we welcome your comments. Our door is always open if you have something you would like to add.\n\n(Original)\nThank you so much for the five-star rating! We aim to provide a comfortable and inviting community, and we appreciate your feedback. Our door is always open if you have anything you would like to add.\n\n¡Muchas gracias por la calificación de cinco estrellas! Nuestro objetivo es proporcionar una comunidad cómoda y acogedora, y agradecemos sus comentarios. Nuestra puerta siempre está abierta si tiene algo que le gustaría agregar."}, "gmap_id": "0x889a4caf761d2acf:0x19c7911d4be26305"}
{"user_id": "100042177046116373968", "name": "eden nagy", "time": 1614874485695, "rating": 1.0, "text": "Absolutely loved this place when we first moved in, had very few complaints and any that we had were always fixed. So we signed for another year not knowing they were getting a new landlord who is doesn’t care whatsoever. Rent has gone up and nothing is being done about any of the issues going on. We’ve had cars broken into but nothing done about it, it’s not hard to install some cameras cause a lot of people got stolen from. There’s a big bug issue that never gets fixed, they spray every 3 months and If you tell them about you having bugs they just tell you to wait till then. And the parking is ridiculous, people continuously take parking who don’t even live here and guest parking is available. I’ve had to park clear across the parking lot from my home many times because of this. So highly don’t recommend moving here", "pics": null, "resp": null, "gmap_id": "0x88926f01976e4db9:0xc9953966dcfb717a"}
{"user_id": "117809268161535897382", "name": "Linda Hinton", "time": 1547499412748, "rating": 5.0, "text": "Okay I was at my Auntie Kathy house she got me against only one for my birthday# Tweety Knows Best", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNDrdw4mtRPOAOU0jMZXTVeu5i2nREvixNrXp7d=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88926f01976e4db9:0xc9953966dcfb717a"}
{"user_id": "104511605145182344381", "name": "jennifer martin", "time": 1619458461173, "rating": 4.0, "text": "Nice and quiet but no parking for guest hardly", "pics": null, "resp": null, "gmap_id": "0x88926f01976e4db9:0xc9953966dcfb717a"}
{"user_id": "108432504857903991335", "name": "Jackie James", "time": 1608218561995, "rating": 4.0, "text": "I don't know what this place is like, I walk through the parking lot here. That's all, but it looks nice from the outside.", "pics": null, "resp": null, "gmap_id": "0x88926f01976e4db9:0xc9953966dcfb717a"}
{"user_id": "117077132221677972626", "name": "Troy Worch", "time": 1599319145224, "rating": 5.0, "text": "My son rents a townhouse here. It is great for a young adult or small family that just needs a roof over their heads. It isn't top of the line but it is economical and can fit most budgets. My son's place has small problems but the staff here is super friendly and works hard to make things right. This is an obvious choice for transient Army personnel coming to Fort Rucker for school or training.", "pics": null, "resp": null, "gmap_id": "0x88926f01976e4db9:0xc9953966dcfb717a"}
{"user_id": "105318904716882814131", "name": "Alfredo V.", "time": 1603789234655, "rating": 5.0, "text": "Easy parking, Clean, Dog area", "pics": null, "resp": null, "gmap_id": "0x88926f01976e4db9:0xc9953966dcfb717a"}
{"user_id": "112401794724114763173", "name": "TheRealRiclio", "time": 1568321785808, "rating": 5.0, "text": "The site manager was super helpful and the apartment units looked great!", "pics": null, "resp": null, "gmap_id": "0x88926f01976e4db9:0xc9953966dcfb717a"}
{"user_id": "114801555476384300042", "name": "Joseph circeo", "time": 1602469059689, "rating": 1.0, "text": "near run down apartments.", "pics": null, "resp": null, "gmap_id": "0x88926f01976e4db9:0xc9953966dcfb717a"}
{"user_id": "106055999922886281977", "name": "Linda Mac", "time": 1546794511073, "rating": 5.0, "text": "I love the spacious rooms only family", "pics": null, "resp": null, "gmap_id": "0x88926f01976e4db9:0xc9953966dcfb717a"}
{"user_id": "116135368000885529684", "name": "Linda Mac", "time": 1547494516101, "rating": 4.0, "text": "A my Auntie Kathy house for my birthday sad sad she tried she gave me a gift", "pics": null, "resp": null, "gmap_id": "0x88926f01976e4db9:0xc9953966dcfb717a"}
{"user_id": "114902341240828371086", "name": "No More", "time": 1311793113549, "rating": 1.0, "text": "Make sure every maintenance complaint you file you do in writing and send a certified copy to the home office. The staff will yell you that's unecessary, and of course it is unless you want proof later.  After a year of insane utility bills due to old or malfunctioning equipment, drug dealing neighbors, a mice, and a new \"rule\" each week, we left a clean apartment. We received a bill for over $500 full of items we had complained about many times that they refused to fix. Since all complaints were made by phone, no papertrail equals no legal standing. Don't rent from here.", "pics": null, "resp": null, "gmap_id": "0x88926f01976e4db9:0xc9953966dcfb717a"}
{"user_id": "114825594111851707052", "name": "Linda Lovemac", "time": 1546480454114, "rating": 5.0, "text": "Love your family", "pics": null, "resp": null, "gmap_id": "0x88926f01976e4db9:0xc9953966dcfb717a"}
{"user_id": "115505158588837565110", "name": "Austin Noakers", "time": 1550432989216, "rating": 5.0, "text": "Great place to live", "pics": null, "resp": null, "gmap_id": "0x88926f01976e4db9:0xc9953966dcfb717a"}
{"user_id": "108087264797335319286", "name": "Will Stycklemeyer", "time": 1546268586676, "rating": 3.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x88926f01976e4db9:0xc9953966dcfb717a"}
{"user_id": "117474655413719446443", "name": "JR", "time": 1621527198965, "rating": 1.0, "text": "I moved out December 2020 and after almost SIX YEARS of living there they hit me up for an alleged $61 balance 5 months after I moved out. They kept my $250 deposit and applied it whatever balance they claim I owed and charged me for carpet “repair” when carpet is supposed to be replaced after three years anyway.\n\nWhen I first moved in, I loved it. The property was quiet and tucked away. My neighbors were all quiet and nobody bothered you. The office staff was nice and worked with me during brief unemployment periods.\n\nThe current management (Anji specifically) is emotionally detached from their residents. All they care about is getting money. The rent is raised every year with no real explanation and the only changes that were made were done to the building exterior. New building paint one time shouldn’t warrant an annual rent increase.\n\nI had someone break into my apartment and the patio door was never really fixed. To this day the bent security bar is there even with new tenants.\n\nI complained several times about possible mold in my bathroom from a water leak upstairs and was told to buy a mildew spray and use my fan when showering although I kept a clean unit. The best they could do was repaint my unit to cover up the spots.\n\nIn December, when it came time for me to move (I bought a house) they tried to get me to pay three months of rent in order to break my lease which ended the following February. The only reason I didn’t pay it is because I went to corporate about all of my issues (including photograph & email evidence) and they waived the remainder months.", "pics": null, "resp": {"time": 1621617396952, "text": "Thank you for sharing your thoughts with our team. Due to the nature of your review, we feel it would be best if we spoke with you directly. Please give our office a call at your earliest convenience."}, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "115513680711154103615", "name": "King David", "time": 1622585201924, "rating": 2.0, "text": "Update 2021 Review\n\nI lived here for about 3 years.\n\nOverall for 5.2 out of 10. With most apartment complexes like this your experience is based on which unit you are in.\n\nOverall decent place, most of the neighbors are nice. But with the nickel and diming people when they leave to the massive increases in rent you could definitely get more bang for your buck and be in a complex that offers more for the same price. Not bad, just not worth the price of admission.\n\nIf you move here get an updated apartment, that will make your stay and time here much better and don't move toward the wooded area or you'll have to deal with critters.\n\nMore detailed review below:\n\nFirst starting with the cons\n\nLots of break ins that have increased over the years even with a Police Officer moving in like a year ago.\n\nParking has its ups and downs. There may be months where there’s plenty of parking and a day later it seems like 100 people moved in and there’s no parking after 6 p.m.\n\nThere are some updated apartments, go with these. The low end apartments are just that, overpriced and low end.\n\n*Original inspection. Pay attention to your original inspection and do not accept anything less than perfect because if you don’t list an item on your list like carpet or something else they will charge you for it when you leave. When I moved in the carpet was horrible. I talked with the front office and have many emails of our exchanges of how bad the carpet was but because I overlooked writing it on my inspection list because we were having the conversation I was charged for it when I left. Mark everything wrong that you see and get them to fix it before you move in and before you sign a lease.\n\nEven in dealing with the carpet costs, I showed Anji from the front office emails I had with her, and other members of staff before I moved in and for 3 years after about how bad the carpet was and I was still billed $80.\n\nIf someone is smoking inside and you live under them, you may smell it coming through the vents.\n\nRent is going to go up yearly that’s just automatic. The price increase can be drastic. It can go as high as 100+\n\nDuring the summer depending on which unit you are in there are tons of bugs because some of the units are by wooded areas. Avoid these if you do not like bugs because the apartments are poorly insulated and bugs will get in a lot. Sometimes roaches but also centipedes and really any creatures small enough to squeeze through cracks.\n\nFridge and stoves are low end and outdated, expect nothing special here.\n\nPros\n\nFront office usually responds really fast to emails and requests\n\nWorkout room but it locks after I think 7 p.m. Other apartment workout rooms that stay open 24-7 and just provide a code.\n\nPool mostly stays clean", "pics": null, "resp": {"time": 1622652621607, "text": "Thank you for taking the time to write this thorough review of your experience. While we appreciate your positive feedback on our customer service and community amenities, we’re disappointed that certain aspects of your time here have not been stellar. We assure you that our team wants nothing more than to provide a positive experience for all of our residents. Unfortunately, crime can happen anywhere at any time. We encourage any residents who are experiencing issues with pests to notify our office immediately so that we may treat their homes. At your earliest convenience, please give our office a call to discuss your review in greater detail."}, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "108200769570002577353", "name": "CHARITY ROGERS", "time": 1615065864213, "rating": 1.0, "text": "Very disappointed with this company.\nI received my lease renewal letter and seen that they raised the rent up $165 just renew. I asked why so much and the leasing officer couldn’t give me a clear answer. I told them I couldn’t afford an additional $165 on top of what I already pay. She said they could ask their district manager if they could do something for me and they came back with $100.\nI think this is unfair to raise rent $100–$165 during a pandemic. Folks are just trying to survive right now and it’s not like I’m paying additional money to get updated fixtures and appliances.\nThis is just another way for the rich to get richer.\nJust sad.", "pics": null, "resp": {"time": 1615230891236, "text": "Charity, thank you for sharing your thoughts with us. While we understand that rent increases can be frustrating, we can assure you that our rates remain an accurate reflection of the current local market. Feel free to contact our office once again if you would like to discuss this further."}, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "108492607633937841475", "name": "Sara W", "time": 1602344690223, "rating": 5.0, "text": "My dad has lived in this community for almost 5 years. The neighborhood is very safe and his neighbors are always friendly with us. Considering the location it is very quiet and he has never been bothered by any noise. The office staff are always extremely helpful when it comes to maintenance requests and they are constantly updating and improving the property. I'm so glad we found this neighborhood for him!", "pics": null, "resp": {"time": 1602540632564, "text": "Sara, thank you for sharing this with our team. We’re glad that your father has enjoyed his time at Verandas at Rocky Ridge. If there is anything that we can do to enhance his experience, please let us know!"}, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "117463349269861570829", "name": "M M", "time": 1608598565042, "rating": 4.0, "text": "Great apartment, great area, great staff, great neighbors. Try it, I'm sure you'll like it.", "pics": null, "resp": {"time": 1608660091241, "text": "Thanks, M M! We're thrilled that we've been able to provide you with a great place to call home. We hope you continue to enjoy your time at Verandas at Rocky Ridge."}, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "116647483550827887433", "name": "Zoe Willis", "time": 1595799250081, "rating": 5.0, "text": "My partner and I have lived here for almost a month and have loved our time so far. The office staff have been so helpful the entire time and especially mindful of social distancing during the pandemic. Charity especially was so helpful from the first time I talked to her on the phone throughout our move-in. Anji has also been helpful and friendly. Our A/C stopped working on a Sunday and, within two hours of me calling the emergency maintenance line and then getting home from an outing, it was fixed. Rent is reasonable and it is a quiet location if you don't mind the relatively quiet noise from the freeway a mile or two away.", "pics": null, "resp": {"time": 1595874890615, "text": "Zoe, it really makes our day to receive this stellar review of Verandas at Rocky Ridge. We strive to provide our residents with excellent customer service, so we’re happy that we hit the mark with you. We take pride in the effort that our maintenance team puts into their work, and we’re glad they addressed your concerns promptly. Please keep in touch and let us know if there’s anything additional we can do to further enhance your experience!"}, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "103778340880190749597", "name": "Breonna Redd", "time": 1583678314828, "rating": 5.0, "text": "I wanted to come leave a review because I remember that there was a 1 star rating at the time I moved in 3 years ago and that couldn’t be further from the truth. I love it here! The units are nice and affordable, management when I first moved in was great and they are now as well. Although I will be honest and say there was about 6-9 months with one office manager that was a little unprofessional but that person no longer works in the office. It’s located in a great area, any service I request is fixed promptly, and we really don’t have many problems. I love it so much I’m looking for a larger space and hopeful to stay at the Verandas!", "pics": null, "resp": {"time": 1583792855405, "text": "Breonna, words can hardly express how happy your wonderful review makes us feel. It’s our goal to provide our residents with a wonderful place to call home and excellent customer service, so we’re thrilled to see that reflected in your review. Please keep in touch and let us know if there’s anything additional we can do to further enhance your stay!"}, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "104034370384537283568", "name": "Oshaun Lilly", "time": 1621909761222, "rating": 5.0, "text": "I recently moved here in 2020 with my family and I can say so far so good.", "pics": null, "resp": {"time": 1614192480660, "text": "Oshaun, thank you so much for this positive review of Verandas at Rocky Ridge! We’re glad that you and your family are enjoying your time here. As always, if there is anything that we can do for you, please let us know."}, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "116448233890101787477", "name": "April Ray", "time": 1582436373839, "rating": 5.0, "text": "Mike's husband and I live there when we got married. That was in 2002 and then we left and built our first house. We were in apartment 1210 I will never forget it I drove up in there last night after looking at another complex and I remembered where I always parked and where he always parked and the vehicles that we had and how hard it was for our helpers to take our furniture up and down those narrow staircases going upstairs to the second floor. Still no light in the ceiling in the living room you have to have lamps. I thought there were fireplaces but maybe they were renovated out or it could have been the apartment before that had one. I remember the exact same kitchen and where how much I rent was $535 for that exact same two bedroom two bathroom apartment in 2002 and now it is so much more. They've been renovated based on the pictures and the outside. I guess they got rid of the hot tub because there's a picture where the concrete looks different where the hot tub was and there's just like a table and chairs randomly sitting there. I can't tell you how many nights we sat and talked to people and some of the guys had some drinks and just hung out and before we bought our first washer and dryer me walking laundry down the hill to the same laundry but now there are so many more than there was before. The mailboxes I don't remember being in the same place but the trash still the same. Everything is so much different yet still the same. I can still see every stitch of furniture that we had arranged in that living room bedroom and the second bedroom and the bathrooms and it was good memories even though I hate him. Divorce is never good. Glad it's over. Wish I could afford to live there again. Makes me sad. It was so secluded and that's what I love now about it but at the time nobody could ever find out where we lived because then it was colonial village Rocky Ridge and they didn't have a sign at the foot of the hill like they do now. We always had to give very detailed instructions because there was no Google maps. Back then it was MapQuest and it might take you through a different city and bring you back to where you should have been in the first place. Comment if you remember that. I'm 39 lol", "pics": null, "resp": {"time": 1583263294665, "text": "Thank you, April, for sharing your thoughts with our team. We’re glad that you enjoyed your time in our community. If you have any additional feedback, please give us a call."}, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "113247159620969556041", "name": "Christian Fritz", "time": 1503433288094, "rating": 5.0, "text": "I lived at the Verandas at Rocky Ridge (apartments) for a year, then moved away for four months and now have been living at the townhouses for approximately 5 months. Overall, I have loved living at The Verandas. The apartments and townhouse are very well kept and is a very safe area. I definitely appreciate having at least one police officer living at the complex and the staff has great customer service. The apartments and townhouses also seem to be in great condition. However, I do only have two issues that I hope to be resolved. When I call, my messages are only returned maybe half of the time and the parking at the townhouses is VERY limited. Other than those two issues, I highly recommend the residence to anyone.", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "111598213871079826902", "name": "Lakesha Thomason", "time": 1570813094674, "rating": 1.0, "text": "I had a great experience with Yolanda who rented me my townhome!  Zack is very nice and has been helpful as well. But, I’ve had a rough time with the Manager, Anji.  She’s not truthful at all.  She called me in regards to a pet.  She asked me to come to the leasing office to sign an addendum.  Before I could get there she added $360 to my October rent without me confirming that I had a pet or to sign the addendum she asked to me sign.  She even stated that IF I had a pet that she would break up the $350 pet fee into 3 payments.  She didn’t do that, which is in black and white-Via email.  When I actually moved here my townhome was not complete and she informed me that my rent would not be due until September.  When I arrived home on 9/10/19, I had a notice on my door.  When I called the office to speak with her about it, she blatantly told me that she didn’t confirm my 1st rent due date.  This is so discouraging In so many ways.  Other issues but I’ll just write corporate to give them all of the details.", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "106843366707959916782", "name": "Samantha Thomas", "time": 1468942396693, "rating": 4.0, "text": "When I moved in I was hesitant because of all the bad reviews, however The Verandas have been nothing but wonderful to me!! Move in was easy, maintenance was never an issue, if something was broken they were there the same day to fix it. My apartment was super clean when I moved in and there was never a bug problem. It was always a super quiet, and everyone on the staff is nice as can be. I love this place and if I ever move back to Birmingham this will be the first place I come to.", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "110413361360353002613", "name": "Sam", "time": 1545925819888, "rating": 4.0, "text": "Excited to live here. I love the floorplan . Thank you Dany for helping us find our new home. So far it's a 5 star experience for me.\nUpdate been here 6 months still waiting on the 24/7 gym they said it would be changed to the month we were supposed to move in. Having problems with getting the pest control we pay for every month. The person that we are familiar with in the office isn't there anymore. Other than that it's still got some charm. I'm just super bummed about the gym. PLEASE MAKE THE GYM 24/7!!", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "114021700748759545816", "name": "Erica Davis", "time": 1524137663275, "rating": 1.0, "text": "Not happy at all!!!! When I moved in the apartment was infested with fleas! I rented their washer and dryer not being told that it would permanently be included in my rent and i cant give them back to replace them with a set of my own not mention all the crazy fees they just add out of nowhere! I pay damn near $200 more than the price i was told. Appliances keep breaking. And now i have mice! I'm out!!!! ✌", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "117343697733274548875", "name": "Sarita Colvin", "time": 1508155800244, "rating": 4.0, "text": "I chose this location after moving from Missouri. The staff are friendly, the rent is comparable to unit size, and I have quick access to the highway. My only complaints are the fitness room is only available during office hours and the bugs & spiders. I'm told it's normal for Alabama.", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "114616615027763617158", "name": "NIckSellsCars Bham", "time": 1412872319467, "rating": 5.0, "text": "Moved here a few months ago until I get married and couldn't be happier. Rent is fair and amenities are great. Super quiet complex and the management is super!", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "102696875231197539154", "name": "Erin Belz", "time": 1419257982644, "rating": 1.0, "text": "Nasty times infinity!!! Bugs galore...i.e. ROACHES, ROACHES, AND MORE ROACHES!!!!! took over 2 weeks for them to replace my a/c unit. Management doesn't seem to give a crap about their tenants. When my husband and I moved in, it looked like they hadn't even bothered to clean the apartment. Nastiness from the previous tenants. Didn't seem to care that my neighbors across the hall had a guy harassing them quite often morning, noon, and night. I'm sorry, but I wish I had done more research on this property prior to moving in.", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "107106938791664126810", "name": "Robert posey", "time": 1440200593634, "rating": 1.0, "text": "Don't move in this apartment. You would be better off in section 8 housing. The office managers don't do their job and and good luck finding them when you need them. I've had roof leaks that has not been addressed in the years time I've been here. The apartment wasn't cleaned before we moved in. Carpets were stained and holes in the wall looked like they put duck tape over them and painted over the tape. Nasty place stay away. Motel 6 is better than this dump", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "113817276995577168280", "name": "Surendra Jnawali", "time": 1492925268003, "rating": 5.0, "text": "I stayed here sometime with my family friend. Found really good place and awesome apartment and timely maintenance...", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "106276419178544243474", "name": "Chris Taylor", "time": 1497579591885, "rating": 1.0, "text": "Awful place to live. The traffic noise from 459 is constant and comes right through the walls all the time, with random bursts of trucks engine braking and cars racing each other. Management (3rd management change in 2 years) lied to my face and said they would rent my apartment as soon as I vacated, then reneged once they had the keys, costing me 2 months' rent more than it should have. Garbage is strewn everywhere all the time from people too lazy to walk to the compactor, they place the bag on their car to drive it to the compactor, and then let it fall into the street and break. Inconsiderate loud neighbors, parking fills completely up at night (hard to find a spot anywhere near my building). Ants and flies absolutely everywhere. So glad to get out of here, even with the unnecessary cost they charged.", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "116502171723304627621", "name": "Holiday Inn Express Pelham", "time": 1422724941215, "rating": 1.0, "text": "This complex is horrible! They do not care about anything other then their money, both my front and back doors were broken and would not open with out extreme force, I called the office 3+ times to complain about this FIRE hazard and they did nothing to repair the doors.\nThere were roaches everywhere and the ants were so bad that they infested our hot water tank.\nThe backyard had damage done to it long before we moved in that was never repaired, the tub, master bedroom, spare rooms all had damage done to them from the carpet to the ceiling to the electric.\n\nI had mail and packaged stolen from my box and door step, told the office about it and they did not seem to care at all!\n\nThis place is horrible, I do not recommend renting here at all, they are way over priced for the condition and and treatment you get here.\n\nRENT AT YOUR OWN RISK", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "100499721328462502049", "name": "MikaMiksTable", "time": 1366146181577, "rating": 2.0, "text": "THESE APTS. ARE TRASH. Period!!! The management is rude and their behavior is deplorable. They will fool you with the model apartment as the actual property looks NOTHING like the model. Lived there for many years and moved because of the lack of concern for the property and its residents. They tried to paint the place, but the spray painted doors aren't even done right. PLEASE RUN FROM THIS PLACE!!!!!!!!! THE RENT IS TOO HIGH TO BE NEXT TO THE FREEWAY AS THE NOISE IS CONSTANT. THEY WILL INCREASE THE RENT TOO HIGH EVERY YEAR AND YOU WILL HAVE TO CALL MAINTENANCE SEVERAL TIMES IN ORDER FOR THEM TO COME TO YOUR APT. WHEN YOU MOVE TAKE PLENTY OF PICTURES AND HAVE THEM DO A WALK THROUGH OR ELSE THEY WILL SAY THAT YOU LEFT THE APT DIRTY EVEN IF YOU'VE CLEANED. ALSO, they ARE NOT ZONED FOR HOOVER CITY SCHOOLS!!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "103253031028509805653", "name": "Paris lol20", "time": 1470614043013, "rating": 5.0, "text": "They treat you like a real neighbor there maintenance always on time it's a great place to live and there housepitality is the best", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "111789565419497060679", "name": "Drew Long", "time": 1537630202777, "rating": 1.0, "text": "Couldn’t remember to leave the key in the apartment, twice, in order for stuff to be moved in. Later the night of the move in, sleep was interrupted by the ‘chirping’ of a low battery smoke alarm, which should have been changed or serviced upon it being rented out again. Can not wait to see what else about their job they can not do.", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "109954133878624592171", "name": "L Macon", "time": 1427996416049, "rating": 1.0, "text": "These people are terrible to try to rent from. We tried on several occasions to get them to show us a unit or the unit we'd  be renting; after already putting up the fees for application process, being approved, and paying the security deposit, only to be put off and given excuses each time. Then when we decided not to rent from them due to their uncooperation, THEY KEPT OUR MONEY AND REFUSED TO REFUND ANYTHING! NOT TO MENTION I DIDN'T SIGN ANYTHING STATING SUCH, BECAUSE I DIDN'T SIGN ANYTHING BUT THE APPLICATION!  DON'T TRY TO RENT HERE! FIND A LEGITAMATE PLACE  TO LIVE!", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "108431072440861330116", "name": "Simranpal Gora", "time": 1516241352802, "rating": 5.0, "text": "Quite and serene environment, got pool and tennis courts which is good.", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "110981794906867820300", "name": "Bear W", "time": 1452051881895, "rating": 4.0, "text": "Rent is ok for a 3-bedroom townhouse. Could use another maintenance person or two, but the office staff is friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "112294338396555025400", "name": "L.Mccall", "time": 1361839781622, "rating": 2.0, "text": "Nasty,Nasty,And NASTY!! I wonder how in the h@## people woud like to live here. Its a fraud beyond repair. I think Ashley the manager is not concerned about the complaints or problems here because she doesnt live on site. The roaches,car vandalisms'' repeat'' VANDALISMS,and loud music all time of night. The neighbors keep up so much noise I couldnt get my infant to stay asleep and the apartments air and heat go out constantly. If you want a non section 8 apartment that operates like it is a section 8 apt then go apply and be reaady to move as soon as you get there.", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "106682623560945493100", "name": "Stacey McGhee", "time": 1477587281914, "rating": 1.0, "text": "I AM NOT GIVING THESE PPL ANY STARS...DO NOT RENT FROM THEM...THEY CHARGE $175.00 APP FEE AND THEY DO NOT TELL YOU IT'S NON-REFUNDABLE!!!! HORRIBLE PROPERTY!!!", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "114560737934669459247", "name": "Jeremy Fisher", "time": 1549855676361, "rating": 5.0, "text": "Nice places", "pics": null, "resp": {"time": 1583263720374, "text": "Thank you for the five stars, Jeremy! We’re so happy to see you feel at home. Please feel free to reach out to the office if you have any additional questions or comments about your stay here at Verandas at Rocky Ridge!"}, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "102378507488617159384", "name": "Michael S.", "time": 1509280323221, "rating": 4.0, "text": "No comment. But, my big brother lives there.", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "115487722607497409404", "name": "Thomas Atchley", "time": 1583689148656, "rating": 5.0, "text": "Great staff", "pics": null, "resp": {"time": 1583792538700, "text": "It brightens our day to know that your time in our community has been great! We strive to provide our residents with great customer service, so we’re happy that we hit the mark with you. As always, don’t hesitate to reach out if we can help you with anything."}, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "101614673743065647238", "name": "Brittany Tillery", "time": 1539282478499, "rating": 1.0, "text": "Terrible place to live.", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "111268396989311499506", "name": "Pat Sturdivant", "time": 1557365487443, "rating": 5.0, "text": "Nice Place", "pics": null, "resp": {"time": 1583263633471, "text": "Thanks, Pat! We're ecstatic to hear you like it here at Verandas at Rocky Ridge. We're always looking for ways to improve and go above and beyond for our residents, so don't hesitate to get in touch if there's anything we can do to add value to your experience!"}, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "104226452353443287827", "name": "Stephanie Klinger", "time": 1544020876308, "rating": 5.0, "text": "Beautiful", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "111136586652384909657", "name": "Deaven Boglin", "time": 1504033464529, "rating": 5.0, "text": "its ight", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "100615270490770875841", "name": "David Julian", "time": 1479356618657, "rating": 5.0, "text": "Private", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "112138176029282123256", "name": "T. Beezy", "time": 1478872135589, "rating": 5.0, "text": "Nice apartment community", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
{"user_id": "103783917868974570411", "name": "Krystal Knox", "time": 1467505517530, "rating": 5.0, "text": "Like", "pics": null, "resp": null, "gmap_id": "0x888918786568f667:0xea382d4f99097b76"}
