{"user_id": "115279641406121397142", "name": "Anthony Downey", "time": 1617390081017, "rating": 5.0, "text": "Bought several trucks  an car's there good people  to do business  with", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "112954000610000290098", "name": "gary mckay", "time": 1624039697105, "rating": 1.0, "text": "If they are as inconsiderate in business as they are in their driving habits I would pass by and not stop.", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "102484882067631633664", "name": "BAMA AUTO SERVICE", "time": 1524625619849, "rating": 5.0, "text": "I’ve personally been doing business with Mr. Pierce and his family for a couple years and can honestly say they are some of if not the most honest and dependable people I’ve ever done business with in my life!! The Pierce’s have gone above and beyond to make sure our business deals have not only been fair but done in way that insures the customers satisfaction above their own!!! I’ve also had the privilege of seeing what they do with their time and money personally in giving back to the community and volunteering in ministry and other activities!! I encourage everyone to do business with them and I’ll go as far as to personally guarantee you’ll be treated fair and honest!!  I own a mechanic shop and have owned multiple businesses in my lifetime. I deal with several car lots and the Pierce’s are the finest people I’ve ever done business with!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "100869832580168957343", "name": "Kristin Ayers", "time": 1488287736531, "rating": 5.0, "text": "Love this place I just recently got my 3rd vehicle from them they are an amazing family. And will work with you as best as they can. I will never go anywhere else for my vehicle needs and it doesn't stop there they have boats fourwheelers tractors if you need anything just give them a call and they will help you out as much as possible.", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "103253876478577137667", "name": "Joe Goodman", "time": 1605566629071, "rating": 5.0, "text": "Good quality vehicles and great prices.", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "109780024167325708230", "name": "Caleb Dickey", "time": 1517956503340, "rating": 5.0, "text": "My wife and I both are very pleased with the service we received from Pierce Car and Truck Sales! Highly recommend them if you are searching for a vehicle! Already eyeing my next purchase to be a boat!", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "102380255689668878423", "name": "Doug Williams", "time": 1517409410687, "rating": 5.0, "text": "I bought a Truck and a boat from pierce auto and have been very pleased with the honesty and service with this company and will buy again in the near future 💚 and the prices were fair too I highly recommend them to all my friends.", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "108253420092419492897", "name": "Montgomery Waylon", "time": 1557436304664, "rating": 1.0, "text": "Brought a 2000 Camero from here on March the 1st which was a Friday. I brought the car back in on Monday the 4th and told them the service engine light came on and something under the car was rattling. I was told by the owners son that he didnt know anything about standard shift cars and they would not be responsible for anything wrong with it. Almost 3 weeks later the car starts running hot. When my husband got to me to check it out he opened up the radiator to find that it is full of J.B block seal he runs over 80 gallons of water through the radiator trying to clean it out to no avail. We replaced the thermostat that was so coroded with block seal it was rusted up. I called and left a message with Pierce auto sales telling them that the car was running hot and because someone was trying to cover up a cracked block or blown head gasket and there was so much block seal in the radiator and engine that I didn't know if the car was going to make it home and that I really needed someone to call me back because I had no way to get it home. I never recieved a call back.It cost me $60 to rent a car dolly to drag it home. Now the car came with an outside warranty but because \"whoever\" filled the motor up with block seal to hide a major problem until they could find an idiot \"me\" to take the car off of there hands the warranty will not cover the car. So now I have a blown up car sitting in my yard that I drove less then a month and repo men knocking on my door because they want there car back and still after all this time I have yet to recieve a call from anyone at Pierce Auto Sales.  I recieved more help and sympathy from the repo man in 10 minutes then I have from Pierce in 2 months. I paid $1500 down for a car that didn't even last until the first payment was due. I dont bash people or businesses but i have tried every other way to get them to talk to me. I just want my money back so I can get a car that runs and won't leave me on the side of the road less then a month after purchase.", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "117508337055885989503", "name": "Angie Lowery", "time": 1524629624083, "rating": 5.0, "text": "I highly recommend Pierce Auto if you are looking to purchase an  automobile or boat.", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "104013361159943014881", "name": "Carter Rhodes", "time": 1552005579022, "rating": 5.0, "text": "Great folks to do business with", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "114034583219877244188", "name": "Tim McCormick", "time": 1350605118989, "rating": 2.0, "text": "Dishonest business practices; avoid this place.", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "101646616559276891155", "name": "James Smith", "time": 1489698037102, "rating": 5.0, "text": "I'm buying my truck here", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "114118930463712931453", "name": "mark geralds", "time": 1428079981206, "rating": 1.0, "text": "(Translated by Google) thanks for the imfo\n\n(Original)\nthanks for the imfo", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "108193746655432847304", "name": "Kimiko Ware", "time": 1527813122439, "rating": 4.0, "text": "Went for an interview and was asked to do 2nd.", "pics": null, "resp": null, "gmap_id": "0x888a3b0d1e38bd37:0xa540000a8af14095"}
{"user_id": "111754172779418037629", "name": "Brandy Peterson", "time": 1490738418524, "rating": 5.0, "text": "These people were totally awesome.and they a family business. Could not have ask for better people to do business with. And if you need a car this is the place to go... Make sure you ask for Blake. He is there son and such a fine young gentleman. He even followed us to our car and open the doors. Very down to earth and respectful people!! I will definitely do more business with them and everyone else should also. I promise u will not be disappointed!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "100689284532834722684", "name": "Jimmy Johnson", "time": 1493128373440, "rating": 5.0, "text": "Awesome place, very friendly car salesman who aren't pushy, great deals on car. Owner is really willing to work with you and make sure the deal goes through. I got my car at a great price and it was a great car. Joel even helped me when I had issues. Will definitely shop there again.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "105473927122429368246", "name": "Anthony Parker", "time": 1490971589673, "rating": 5.0, "text": "These are the best people you'll ever meet. Very helpful and full of knowledge about the vehicle. But the thing I like most is the dedication to honesty. Don't find that much nowadays. Awesome crew. Especially LUKE PARKER.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "111313179137827274767", "name": "Luke Parker", "time": 1490969867457, "rating": 5.0, "text": "Good people. Haven't bought anything from here but I know people who have and my friend works there. I do know they offer warranties which is a plus to me, especially when buying a used car. I would recommend them if your looking for a used car.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "104880800848161606251", "name": "DodgeCummings 04", "time": 1490473831772, "rating": 5.0, "text": "I have done business with Joel Nuss, who is now the full owner of this dealership. It has been an excellent experience. I, being in the same business as he, know without a doubt he is striving to sell great vehicles and do a good business with people. He wants to make his customers happy. We have had behind the scene conversations about this. You can have full confidence in knowing this place will live up to their end of the deal. They tell what they know about the vehicles. They cannot predict the future of how a vehicle performs, but they try to sell good ones and make people happy.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "102400468350830193123", "name": "Toni Smith", "time": 1492003113409, "rating": 5.0, "text": "Couldn't be happier with our purchase. Always friendly staff and very helpful. Joel goes above and beyond to make sure he has 100% customer satisfaction. I would suggest buying from them for your next purchase!!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "100130714717303512675", "name": "James Wright", "time": 1492967771396, "rating": 5.0, "text": "I've had great experiences with these guys. They will always get my business.Salesman Blake Barrett helped me find the perfect truck for hauling and Hunting.I was about to leave the lot with my new truck and the owner Joel Nuss ran out to thank me and he filled my tank up and bought my family dinner for that night.Such a nice family atmosphere here.I will return and I will send my friends to these guys.Also,THANK YOU FOR SPONSORSHIP FOR THE GOOD HOPE HIGH SCHOOL FISHING TEAM.!!!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "107219674172251260483", "name": "Coins, Dreams & Crazy Things", "time": 1493903586708, "rating": 5.0, "text": "What an amazing team! As a female shopper I know we can sometimes feel intimidated, or even a bit uncomfortable while car shopping. This was not my experience at all at NAW. These gentlemen were informative, honest and most of all respectful. They worked with me for several days with several vehicles until I found the perfect one for my family and I. They are quick to respond to messages, and have truly gone above and beyond what a car dealership normally would. You can trust these guys to get a great vehicle at a fair price, and most of all customer service that doesn't even compare to others in this industry. Trust Joel, Diane, Luke, Blake , Junior and Tommy! It's amazing how I've been treated by these folks!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "112601665391342419903", "name": "Jason Clark", "time": 1513457392225, "rating": 2.0, "text": "I drove 4 hours there to go purchase a truck. I asked if anything was wrong with the truck and they assured me there was not a thing wrong with the truck and there’s no dents/scratches in truck. When I get there I see there are scratches and dents. The truck had various amounts of minor problems and head aches. The only reason I bought it was because I had already drove 4 hours. I would not consider this a trust worthy business. “Excellent vehicle all the way around” was the biggest lie I’ve heard..  Enjoying the truck so far because the variety of issues.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "113740256196550965880", "name": "Cody45551", "time": 1490964249242, "rating": 5.0, "text": "I have been dealing with these guys at North Alabama Wholesale autos for over 10 years now. I have to say they will do things that most car dealers wont. I have never had an issue with buying a vehicle from them. Just good people with big hearts!!! Thanks for all u have done!!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "107372548827379717017", "name": "Christian Simmons", "time": 1516117154452, "rating": 5.0, "text": "Thank you Guys for the great deal on my ram 3500.I called these guys last week and was coming from Atlanta to buy this truck.I sent in a deposit to hold it and when I finally got there the truck was Detailed full of fuel.Joel Nuss also took care of my motel room and dinner here because it was late and I had worked all day before coming up.Joel and Diane Nuss do a great job here and make you feel at home. Has to be the best experience I’ve ever had buying a truck.You guys go above and beyond.There son Blake took care of me as well.Thanks again guys and I will be sending ALL of my friends your way!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "101067677363211920622", "name": "Terry Reeves", "time": 1490917846605, "rating": 5.0, "text": "Just bought a 2004 GMC Sierra at a great price! The staff was very friendly and family oriented. I would definitely buy from them again I highly recommend North Alabama Wholesale.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "115636610838365738372", "name": "Stacy Clark", "time": 1482526738742, "rating": 2.0, "text": "Offered to buy truck and send nonrefundable deposit and got the runaround.\n\nI've bought multiple vehicles from out of state and a $500 deposit tends to get cooperation  from more reputable dealers.\n\nI then offered to have my bank wire the funds or overnight the check and they wouldn't go for that; keep in mind this was Dec 23rd so getting my credit union to fund same day without wiring instructions for an out of state transaction would not be possible.\n\nWas offered the truck if I could get there, 4 hours away, with full cash payment.\n\nLater that day they raised the price 10%, sounds like the owner messed up on his pricing and wanted to find any way to not honor the price he initially offered me.\n\nAfter reading these other reviews I think it was for the better.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "106833238883848161722", "name": "Julie Gay", "time": 1490927435720, "rating": 5.0, "text": "I recently purchased a Tahoe from North Alabama Wholesale. The salesman was very helpful and nice with the process. I would recommend my friends/family members to purchase a vehicle from them. Joel Nuss and his staff tries to make sure each customer leaves happy with their purchase..\n⭐️⭐️⭐️⭐️⭐️", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "112435816775059846875", "name": "J&M Custom Crafts", "time": 1497520014613, "rating": 5.0, "text": "They had a great selection of vehicles and I found the perfect truck! Excellent service, and no complaints at all! I would definitely go there again!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "115870560417892164464", "name": "Mike Ashbaugh", "time": 1492957324468, "rating": 5.0, "text": "Joel! Thanks for my deal! I really enjoy my new Mini Cooper! I got a good deal and it was seamlessly easy to do business with you! That's why I am a return customer!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "103977397086714607406", "name": "DANIEL LIGHT", "time": 1454373390016, "rating": 1.0, "text": "Purchased 3 different vehicles from them and all 3 had problems but I just fixed the problems..well I thought they would return the favor by helping me out by trying to get out of a truck payment that I purchased from another dealer (the truck was in excellent condition with very low miles BTW)I went in and the old man was sitting looking on his phone basically ignoring me while I was telling him my situation and he didn't even bother to come out and look at it,he just said if it wasn't 4x4 he wasn't interested.. What a jerk!!..and they really do sell junk 9 times out of 10", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "108959490608172503213", "name": "Tyler Letson", "time": 1492277463391, "rating": 5.0, "text": "Bought Durango as is no warranty and tore up down the road but give us loaner car until ours was fixed and later give us a different vehicle that they did not have to do. Anywhere else would not help as much as they did! Very nice and understanding staff.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "104549900366356318004", "name": "Daniel Perry", "time": 1510849831275, "rating": 5.0, "text": "Wanna say thanks to everyone at North Alabama Wholesale for helping me in every way possible I've bought 2 trucks in the last 4 months and they went above and beyond to work with me. Super nice people recommend anyone who is looking for a vehicle these are the folks you need to see!!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "102060756818019955163", "name": "Luke Costello", "time": 1476667413022, "rating": 1.0, "text": "I bought a truck from this dealership and got totally scammed. I bought it from another state and trusted the dealership to be honest and trustworthy and did not receive that. I specifically asked the salesman if there was any rust underneath because i know this years truck is prone to that and he told me no and that it was all clean. I had it shipped to me and when it got here it was COVERED with rust underneath and was even missing parts of the body due to being eaten up by rust. I did not even get the truck of the transport truck and told them to ship it back. I had to eat the shipping costs for going there and back. I have now contacted the dealership and told them I want my money returned. This dealership was a total lie and deceitful transaction.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "102628138310159010690", "name": "Patty Douthit", "time": 1491249439459, "rating": 5.0, "text": "Loving my Nissan Altima that I purchased from these guys. The family environment was top notch. Will definitely send my friends to buy there vehicles there. The owner Joel Nuss had my car filled up and threw in a warranty on the house!!  Customer service was fantastic", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "109315680711630137274", "name": "Reagan Short", "time": 1491325123625, "rating": 5.0, "text": "One of the workers there, Luke Parker, was extremely helpful to me! I highly recommend that anybody use North Alabama Wholesale. You will be very pleased!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "100801903029180949503", "name": "Clay Messer", "time": 1466706982102, "rating": 1.0, "text": "I only had about a five minute conversation with the sales guy/owner/worker.  I asked him to send me a few more pictures of the vehicle and he acted like it was too much trouble.  I live about 3 hours away from this dealership and just wanted to see a few more pictures before I drove three hours just to look under the hood of a truck.  I can certainly understand that he gets a lot of \"tire kickers\" in his business, but I run a small business as well.  I treat every customer with the same amount of respect whether they are purchasing from me or not.  If everything checked out okay, I would have given him cash for the full amount just as soon as I could get up there.  Now, I feel that he doesn't deserve any business whatsoever.  That's just my opinion.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "101186471685137840733", "name": "Jim Nix", "time": 1492916789903, "rating": 5.0, "text": "Joel and his Staff were the Friendliest and Curtious. Joel helped me get the right truck in my budget. Highly recommend these Fine people to anyone. Will do business again. Thanks", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "115917328972089468343", "name": "Brenda Shermon", "time": 1401912717597, "rating": 5.0, "text": "I've bought more than one vehicle from them. My daughter and I both bought our vehicles from Joel. He was nice and informative every step of the way. Their pricing compared to other dealerships is incomparable.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "100189761122844870150", "name": "Emily Vincent", "time": 1491071777667, "rating": 5.0, "text": "This is a great place to do business, the atmosphere is great, they are a great family to do business with! Their financing is top of the notch, they have a great selection of vehicles, and I highly recommend them if you are looking for a vehicle!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "116065377261571147673", "name": "Steve Patrick", "time": 1491319366600, "rating": 5.0, "text": "Great selection, friendly and honest sales people. The staff was very professional and helpful! Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "105149390509463481186", "name": "Amy Cleghorn", "time": 1491324249389, "rating": 5.0, "text": "These guys are awesome.   They have great salesman and very good vehicles and service.   We are working on our 10th one.   Come on down and check them out.   Ask for Blake.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "100768172030390155036", "name": "Devon Green", "time": 1513013521138, "rating": 5.0, "text": "Had a great experience dealing with these guys.They are no pressure and the atmosphere was great.They even filled my tank and gave me 6 months warranty.Will defiantly refer them to all of my friends.I got a finance rate of %2.69 for 60 months and ZERO down.Thanks again to Joel and Diane Nuss and there great staff", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "108979872608090606060", "name": "Anthony Harlan", "time": 1513693620318, "rating": 5.0, "text": "Had a great experience with these guys.Blake Barrett did an awesome job.We are very happy with our purchase and will be sending all my friends here.Diane did a great job getting us financed.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "113413298863060745111", "name": "Brandi Bradford", "time": 1490301255880, "rating": 5.0, "text": "Bought multiple vehicles from them and i loved them will never go anywhere else!! Smooth transactions and super nice!! thanks owner Joel Nuss for helping me find my vehicles!!!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "115365934919889578887", "name": "Haley Moore", "time": 1491772311494, "rating": 5.0, "text": "Wonderful place. Hard working, wonderful people. Would definitely recommend people to come here.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "113049701053691437644", "name": "Diane Nuss", "time": 1516042895787, "rating": 5.0, "text": "ABSOLUTLEY a great DEALERSHIP.Thank you for the fantastic deal on my Toyota Tundra!!! I will send ALL of my friends and family here.Highly recomended!!!! You guys made it very easy.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "107050358235183973122", "name": "Blake Barrett", "time": 1490412552641, "rating": 5.0, "text": "This place is not what people say it is!! I have bought two trucks and have not had a problem at all.. The staff is great and couldn't be more helpful in putting me in a good truck!!!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "106313444542503709351", "name": "Stone Cold_98", "time": 1512428275412, "rating": 5.0, "text": "Great people they are very friendly. Do everything in the power to help you great place", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "116514336807610748557", "name": "Johnny Jarrett", "time": 1496441456516, "rating": 5.0, "text": "I had an excellent experience with north Alabama wholesale! They have a great variety of cars, trucks, and suv's, and they were at good prices!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "104453247171140602820", "name": "James Garmon", "time": 1491694553022, "rating": 5.0, "text": "Wonderful service all employees were very upbeat happy helpful friendly made feel welcome. Have bout several vehicles over the years all were wonderful vehicles", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "100391941497493388764", "name": "Stephanie Morton", "time": 1490920626572, "rating": 5.0, "text": "Joel Nuss is a great business owner. Friendly, dependable and trustworthy. He wont do you wrong.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "110721971952697267754", "name": "Cj Mooney", "time": 1499363516502, "rating": 5.0, "text": "I've bought 10 trucks here over the last 20 years.These guys are great and have a fantastic business.Joel Diane Nuss and there  staff have done a great job.We will send customers there anytime we hear of them needing a car.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "105652148600434716025", "name": "Judy Moore", "time": 1492462880948, "rating": 5.0, "text": "Bought our truck from there. Great service and a wonderful family business. They really take the time to help you. I would highly suggest anyone to go here for a car, truck, or SUV.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "103814689374882086740", "name": "steven frost", "time": 1502310648227, "rating": 5.0, "text": "Very caring people made me feel like I was at my house would recommend anyone to come here for a car", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "116309382240523206912", "name": "Bobby Cleghorn", "time": 1495849794991, "rating": 5.0, "text": "Been a customer for several years.  We decided we needed more room. They didn't have the vehicle we were looking for. Told the salesman our needs, he said no problem I'll call you tomorrow.  They had the car we wanted the next day. Couldn't be happier with the service or staff.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "105701186090688797070", "name": "Victoria Mendoza", "time": 1495469547291, "rating": 5.0, "text": "Best dealers I have ever dealt with very honest and loyal people will never will but cars from anyone else....Great people love this place", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "113621530134893277067", "name": "Rebecca Cowan", "time": 1500745895054, "rating": 5.0, "text": "This is the second car that my husband end I have bought here and they have made it as easy and painless as car buying can be .", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "115864537325927074035", "name": "Daquari Bishop", "time": 1515867478282, "rating": 1.0, "text": "Absolutely a great dealership.Owner Carl Nuss and his staff are doing a great job.We love our Tahoe that we purchased.They made everything easy and fast.The customer service couldn't be better.We will send all of our friends and family there to see these guys.Thank y'all again!!! Updated. Done business there for over 20 years and they always kept their word. I don't know if it's a change in ownership or what but that has changed. A month ago there was a vehicle I was very interested in. A week went by and it was still there so I went in with my husband and talked to Joel about it. He said ownership was changing and his dad was going to be leaving and to give him a couple weeks and he would give us an awesome deal on it which was fine because we needed to sell our vehicle to purchase that one. After 2 weeks we had a buyer for ours and was told to call the following week and set up time to do the deal on the vehicle I wanted so bad. Well I called 2 days ago and left message for him and told them it was about the blazer, she said ok he will call you back. Never heard anything. My husband calls up there today and he isn't in so my husband asked if blazer was still there. Guy says no we sold it back last week.😡 Well good damn thing we told guy that was buying ours that we couldn't do deal until the day we was able to get other one. I understand someone could have came and offered more than we was buying it for but Atleast he could have had the decency to call and let us know.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "106657509257279965029", "name": "Daniel Brock", "time": 1491423226107, "rating": 5.0, "text": "Had a great experience at this dealership,thank you Tommy Jones for helping me.Loving my Dodge truck.I will definitely send my friends to see you.The hospitality is great", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "109317771153079384372", "name": "breanna couch", "time": 1515705801985, "rating": 1.0, "text": "BUYER BEWARE. AWFUL BUISNESS. Worst experience trying to buy a car I have EVER had. Had already been to the bank and gotten our loan, got on the phone with them to let them know we were getting the check later that day and coming to get the vehicle, because they told us once we let them know we were approved and coming to get it they would pull it off the lot, lock it up and pull the stickers off but they did nothing but hassle us and rush us and tell us they were running it through the auction that same day then right after let us know that \"someone just came in with cash in hand and sold it.\" DURING THE SAME PHONE CALL, how ironic. My fiancé is on second shift so we were trying to do it as soon as we were able and had time but that wasn't good enough for them. Awful customer service, awful business.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "112722478394610180981", "name": "Mansel Freeman", "time": 1491423480820, "rating": 5.0, "text": "I looked all over the south trying to find the Ford F450 that I needed for my farm.Had several dealerships tell me that they would call me when they located this truck.These guys are great and did exactly what they said they would do.Owner Joel Nuss went to work fast and located my truck for me,he also flew to Texas and picked it up for me and drove it back to Alabama.When it got to cullman he had it serviced and filled up with fuel.I appreciate the effort from him and his crew.Thank you so much.Love my truck", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "115549522104112857193", "name": "Taylor King", "time": 1491325425049, "rating": 5.0, "text": "The staff was very friendly and ready to help. Best experience that I have ever had in looking for a car.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "112732944585582490860", "name": "kewi wolf", "time": 1513693731617, "rating": 5.0, "text": "Love my Toyota!! Thank you Diane Joel And Blake for fitting exactly what i needed.Lookingforward to many years of dealing with you guys.Thank you", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "116312922420533948762", "name": "Alpha Nutrition", "time": 1490640179758, "rating": 5.0, "text": "Had a great experience with these guys.Joel Nuss and his staff do a great job.We love our vehicle and recommend anyone go there.Our family will continue to purchase our vehicles from this dealership!!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "112420373198094722010", "name": "Preston Griffin", "time": 1491504261020, "rating": 5.0, "text": "Went to buy a truck from lot and the one I looked at online was not what I wanted. Joel went out of his way to find one that I wanted. When I buy again I will for sure go back to see them.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "106431617364995187152", "name": "Mel Cowan", "time": 1501022035055, "rating": 5.0, "text": "Bought my last two luxury cars from NAWA. I could not be more please with the friendly manner that was given and also with the fair price they offered for the car I was buying and my trade in. I would definitely use them again!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "112945754030232104750", "name": "Preston Calvert", "time": 1504111522619, "rating": 5.0, "text": "Great place and great people. They have a great selection of vehicles as well and great prices.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "111428119285473347277", "name": "Hayden Smith", "time": 1490976894474, "rating": 5.0, "text": "It's a great place. They salesman was nice and helped me find a truck", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "108475804175639859247", "name": "Anna Marie", "time": 1466730079563, "rating": 1.0, "text": "I bought a boat they were selling for family.\n\nIt was a piece of crap. I feel what you sell reflects back on you!! I wouldn't buy anything from them.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "108209027772968860263", "name": "Dylan Jones", "time": 1491505469205, "rating": 5.0, "text": "I bought a truck from them 5 years ago and it's still going strong! They are good people!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "105137431647602414317", "name": "Nicholas Monfort", "time": 1490826345686, "rating": 5.0, "text": "We bought a 2005 ford Expedition from Joel Nuss. He gave us a great deal and the customer service was great.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "109021648925326872878", "name": "Stephanie Hill", "time": 1483403748934, "rating": 1.0, "text": "Horrible! Never buy anything from them. The Yukon we got was a piece of trash. The AC went out 2 days after we bought it and thats just one problem! They pretty much robbed us!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "112199754146945539230", "name": "Ethan Mullet", "time": 1492548312368, "rating": 5.0, "text": "Had a great experience buying my truck from these guys.They did not pressure me but helped me find exactly what i needed for pulling my trailer.Owner Joel Nuss went above and beyond to help me.Blake Barrett was my salesman and he filled up my truck with deisel fuel and washed it and dryed it for me.The family environment is great here.They treat you like family.I will be back again one day and will send my friends to see these guys.Thanks again.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "106391008640313366513", "name": "Nick Kelley", "time": 1427398780912, "rating": 1.0, "text": "Be very careful buying a used vehicle.\nBe even more careful and avoid these guys.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "111820569590421301939", "name": "kassi ingram", "time": 1493323156181, "rating": 5.0, "text": "Great service and nice friendly people even gave me a full tank of gas", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "113367256934818725481", "name": "Nerdy Fred", "time": 1490730242404, "rating": 5.0, "text": "Love our new tahoe.Thank you for all your help. We will always do our buisness here", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "116032111366916130443", "name": "Elton Jones", "time": 1492548741944, "rating": 5.0, "text": "Been looking for a good truck to hunt with and still be a nice truck for Sunday church.I called these guys and they showed me everything they had and also the trucks they had coming in.I really appreciate them taking time for me  and treated me like family.Im loving my truck.Thanks to the owner Joel Nuss and his staff.Diane Nuss got me a great interest rate on my financing with the credit union.Yall are great.Thanks again!! See you soon", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "102969377308831899415", "name": "Charles Harbison", "time": 1490495239932, "rating": 5.0, "text": "Had a wonderful experience purchasing my truck from these guys.They as always came thru for me.Owner JOEL NUSS had new tires put on my truck and also thru in a warranty.Havent had any issues with my truck and very happy.My family has been buying from this dealership for years and will continue", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "110947918741586474950", "name": "Tommy Jones", "time": 1490302089298, "rating": 5.0, "text": "We bought a Dodge Ram truck from North Alabama Wholesale Auto. Great salesman and easy to deal with.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "117680239016305752665", "name": "daniel ortega", "time": 1490725628926, "rating": 5.0, "text": "Great place to purchase with a great selection and variety of trucks and cars! No matter your financial situation Joel Nuss will do whatever he can to assist you in anyway possible!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "114175338243481256924", "name": "AXC “Mixed” MartialArts", "time": 1491680548079, "rating": 5.0, "text": "Awesome service and great vehicle to choose from. I would definitely recommend them to my friends and family to buy their vehicles.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "104465851031730286431", "name": "Alyssa Harlan", "time": 1507242036898, "rating": 5.0, "text": "Super duper nice lady that works as the office manager. Loved buying from these guys!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "104219936560336914199", "name": "Wayne Glover", "time": 1492429983587, "rating": 5.0, "text": "This place is such a great place to get your car or truck. They'll work with you to get one also to keep one.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "106561269573098985046", "name": "Kayla Alexander", "time": 1445016200808, "rating": 1.0, "text": "I traded in a vehicle 2 months ago and they still have not satisfied the lien on the vehicle I traded in. Now I have my financial instituiton calling me because I have another payment due. I am still trying to get this taken care of with them, and now they are saying there was a hiccupp!!! DO NOT DO BUSINESS WITH THESE PEOPLE!!!!!!!!!!!!!!!!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "101447864604638125223", "name": "Lisa Hale", "time": 1491426070398, "rating": 5.0, "text": "Awesome experience on the purchasing a F350 King Ranch! Thanks Joel!!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "115080715213040527506", "name": "B E", "time": 1467215765965, "rating": 1.0, "text": "Don't buy anything from this place! Run as fast as you can from them! They lie to you, and are very rude!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "103234936165371613466", "name": "rpgproto", "time": 1492810291465, "rating": 5.0, "text": "Great servicw and attitude from tommy", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "118211341617428822117", "name": "Perry Casey", "time": 1450446415339, "rating": 1.0, "text": "Wish they had a negative stars scale/grade. DO NOT BUY FROM THESE PEOPLE! SCAMMERS!!!!!!! CROOKS!!!!!!! LIARS!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "115641743269686846745", "name": "Latisha Buzbee", "time": 1490992134731, "rating": 5.0, "text": "This was an outstanding car lot!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "109451585343618593959", "name": "Ivy Kilcollins", "time": 1473555076336, "rating": 1.0, "text": "Terrible. Crooks. Sell you anything and take your money.", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "115969530905093206066", "name": "Jacob Beard", "time": 1513378851661, "rating": 5.0, "text": "They do anything they can to fit your needs", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "114961270791231628497", "name": "Melissa Markham", "time": 1529628632218, "rating": 1.0, "text": "Come to find out these guys are a joke we had our van a year an by time we got it home we had problems with the electrical system the car was screwed worst place to get a vehicle they wouldn't even help us an we had just got it!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "108352162645194707820", "name": "Kboozie", "time": 1491589824884, "rating": 5.0, "text": "Tommy was great", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "111273239735683444798", "name": "Tj Parker", "time": 1486753561892, "rating": 1.0, "text": "Wow the lowest rating in Cullman", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "107637552147825778767", "name": "Brenton Trice", "time": 1519513006152, "rating": 3.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "112662167223735640688", "name": "Alicia Alldredge", "time": 1468453399455, "rating": 1.0, "text": "RUN!!! RUN FAR AWAY!!!", "pics": null, "resp": null, "gmap_id": "0x8889cb90871781f1:0xae36f13b57250394"}
{"user_id": "105228605434659912628", "name": "Kai Calvert", "time": 1613838338102, "rating": 5.0, "text": "Fast service of my car. No outrageous charges. Comfortable waiting area.", "pics": null, "resp": null, "gmap_id": "0x88890ef686921a09:0xa9a45669594c0af5"}
{"user_id": "102775215842770306153", "name": "Jermaine Fikes", "time": 1614615479736, "rating": 5.0, "text": "It was great  until I got in my  car and drove off  and realized they forgot to put my new ones on", "pics": null, "resp": null, "gmap_id": "0x88890ef686921a09:0xa9a45669594c0af5"}
{"user_id": "105334109368771087891", "name": "Rebecca Richardson", "time": 1607285753696, "rating": 5.0, "text": "Went with a friend to have her car serviced, it was excellent service and quick on the oil change.", "pics": null, "resp": null, "gmap_id": "0x88890ef686921a09:0xa9a45669594c0af5"}
{"user_id": "116245298929858601328", "name": "rita freeman", "time": 1593546678404, "rating": 5.0, "text": "Great service, exceptional staff. After mediocre service (at best) at big Toyota service shops in B'ham, this one in Center point has my business. Chrystal was my service advisor and kept me up to date with a big smile under her mask, but I could hear it in her voice", "pics": null, "resp": null, "gmap_id": "0x88890ef686921a09:0xa9a45669594c0af5"}
{"user_id": "107994428336124706298", "name": "Jacquelyn Walker-Baker", "time": 1599659508824, "rating": 5.0, "text": "Love the energy of the guys in the Service Department at Serra Toyota.  I would like to thank them again.", "pics": null, "resp": null, "gmap_id": "0x88890ef686921a09:0xa9a45669594c0af5"}
{"user_id": "109184666577000318460", "name": "Kitty King", "time": 1617400921073, "rating": 5.0, "text": "Very good service", "pics": null, "resp": null, "gmap_id": "0x88890ef686921a09:0xa9a45669594c0af5"}
{"user_id": "104539059689260580160", "name": "Stormy Ighi Monday", "time": 1587743824872, "rating": 5.0, "text": "Simeon William's is a great salesman very informative and respectful. I got the car I really wanted without hassle and enjoyed my time there.", "pics": null, "resp": null, "gmap_id": "0x88890ef686921a09:0xa9a45669594c0af5"}
{"user_id": "100321326562838577646", "name": "Jessie Fails", "time": 1615663323298, "rating": 5.0, "text": "Nothing better.", "pics": null, "resp": null, "gmap_id": "0x88890ef686921a09:0xa9a45669594c0af5"}
{"user_id": "118300846426000718481", "name": "Lindsey Long", "time": 1588290595850, "rating": 5.0, "text": "Simeon Williams was something Denzel and Will Smith in one. Lol but really omg the service was great I swear and we will be back for all of our future vehicle needs.", "pics": null, "resp": null, "gmap_id": "0x88890ef686921a09:0xa9a45669594c0af5"}
{"user_id": "105893916329435879845", "name": "Hannah Tolbert", "time": 1589334383648, "rating": 5.0, "text": "Morgan Smith was great!! I love my new car!", "pics": null, "resp": null, "gmap_id": "0x88890ef686921a09:0xa9a45669594c0af5"}
{"user_id": "116551485794658701633", "name": "gallito rock", "time": 1618597220564, "rating": 5.0, "text": "Amazing service !!!", "pics": null, "resp": null, "gmap_id": "0x88890ef686921a09:0xa9a45669594c0af5"}
{"user_id": "107318915672795521686", "name": "Jeff king", "time": 1596119661585, "rating": 4.0, "text": "Very courteous and efficient", "pics": null, "resp": null, "gmap_id": "0x88890ef686921a09:0xa9a45669594c0af5"}
{"user_id": "113615170989571062539", "name": "Sandra White", "time": 1547528688119, "rating": 5.0, "text": "Josh my rep was wonderful,  kept me informed on what services my car needed and very  Polite.", "pics": null, "resp": null, "gmap_id": "0x88890ef686921a09:0xa9a45669594c0af5"}
{"user_id": "106277230459217340469", "name": "quisey sooloveable williams (barbie)", "time": 1584578424301, "rating": 5.0, "text": "☺️", "pics": null, "resp": null, "gmap_id": "0x88890ef686921a09:0xa9a45669594c0af5"}
{"user_id": "106786665098636865722", "name": "Tammy Jessen", "time": 1548124430408, "rating": 5.0, "text": "Awesome service today!", "pics": null, "resp": null, "gmap_id": "0x88890ef686921a09:0xa9a45669594c0af5"}
