{"user_id": "115279641406121397142", "name": "Anthony Downey", "time": 1617390081017, "rating": 5.0, "text": "Bought several trucks  an car's there good people  to do business  with", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "112954000610000290098", "name": "gary mckay", "time": 1624039697105, "rating": 1.0, "text": "If they are as inconsiderate in business as they are in their driving habits I would pass by and not stop.", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "102484882067631633664", "name": "BAMA AUTO SERVICE", "time": 1524625619849, "rating": 5.0, "text": "I’ve personally been doing business with Mr. Pierce and his family for a couple years and can honestly say they are some of if not the most honest and dependable people I’ve ever done business with in my life!! The Pierce’s have gone above and beyond to make sure our business deals have not only been fair but done in way that insures the customers satisfaction above their own!!! I’ve also had the privilege of seeing what they do with their time and money personally in giving back to the community and volunteering in ministry and other activities!! I encourage everyone to do business with them and I’ll go as far as to personally guarantee you’ll be treated fair and honest!!  I own a mechanic shop and have owned multiple businesses in my lifetime. I deal with several car lots and the Pierce’s are the finest people I’ve ever done business with!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "100869832580168957343", "name": "Kristin Ayers", "time": 1488287736531, "rating": 5.0, "text": "Love this place I just recently got my 3rd vehicle from them they are an amazing family. And will work with you as best as they can. I will never go anywhere else for my vehicle needs and it doesn't stop there they have boats fourwheelers tractors if you need anything just give them a call and they will help you out as much as possible.", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "103253876478577137667", "name": "Joe Goodman", "time": 1605566629071, "rating": 5.0, "text": "Good quality vehicles and great prices.", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "109780024167325708230", "name": "Caleb Dickey", "time": 1517956503340, "rating": 5.0, "text": "My wife and I both are very pleased with the service we received from Pierce Car and Truck Sales! Highly recommend them if you are searching for a vehicle! Already eyeing my next purchase to be a boat!", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "102380255689668878423", "name": "Doug Williams", "time": 1517409410687, "rating": 5.0, "text": "I bought a Truck and a boat from pierce auto and have been very pleased with the honesty and service with this company and will buy again in the near future 💚 and the prices were fair too I highly recommend them to all my friends.", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "108253420092419492897", "name": "Montgomery Waylon", "time": 1557436304664, "rating": 1.0, "text": "Brought a 2000 Camero from here on March the 1st which was a Friday. I brought the car back in on Monday the 4th and told them the service engine light came on and something under the car was rattling. I was told by the owners son that he didnt know anything about standard shift cars and they would not be responsible for anything wrong with it. Almost 3 weeks later the car starts running hot. When my husband got to me to check it out he opened up the radiator to find that it is full of J.B block seal he runs over 80 gallons of water through the radiator trying to clean it out to no avail. We replaced the thermostat that was so coroded with block seal it was rusted up. I called and left a message with Pierce auto sales telling them that the car was running hot and because someone was trying to cover up a cracked block or blown head gasket and there was so much block seal in the radiator and engine that I didn't know if the car was going to make it home and that I really needed someone to call me back because I had no way to get it home. I never recieved a call back.It cost me $60 to rent a car dolly to drag it home. Now the car came with an outside warranty but because \"whoever\" filled the motor up with block seal to hide a major problem until they could find an idiot \"me\" to take the car off of there hands the warranty will not cover the car. So now I have a blown up car sitting in my yard that I drove less then a month and repo men knocking on my door because they want there car back and still after all this time I have yet to recieve a call from anyone at Pierce Auto Sales.  I recieved more help and sympathy from the repo man in 10 minutes then I have from Pierce in 2 months. I paid $1500 down for a car that didn't even last until the first payment was due. I dont bash people or businesses but i have tried every other way to get them to talk to me. I just want my money back so I can get a car that runs and won't leave me on the side of the road less then a month after purchase.", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "117508337055885989503", "name": "Angie Lowery", "time": 1524629624083, "rating": 5.0, "text": "I highly recommend Pierce Auto if you are looking to purchase an  automobile or boat.", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "104013361159943014881", "name": "Carter Rhodes", "time": 1552005579022, "rating": 5.0, "text": "Great folks to do business with", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "114034583219877244188", "name": "Tim McCormick", "time": 1350605118989, "rating": 2.0, "text": "Dishonest business practices; avoid this place.", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "101646616559276891155", "name": "James Smith", "time": 1489698037102, "rating": 5.0, "text": "I'm buying my truck here", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "114118930463712931453", "name": "mark geralds", "time": 1428079981206, "rating": 1.0, "text": "(Translated by Google) thanks for the imfo\n\n(Original)\nthanks for the imfo", "pics": null, "resp": null, "gmap_id": "0x889a56497104639d:0x842e60c3c94517bb"}
{"user_id": "117419694943891908596", "name": "caveman wv", "time": 1627870656862, "rating": 5.0, "text": "Me my uncle and father came in to look at tractors just to look and ended up buying a 1626 shuttle shift Mr. Ray and Mr. Billy showed great customer service and was very helpful on the details of the tractor definitely recommend if your in the market for one go see them definitely will be back to buy more implements from these guys", "pics": null, "resp": null, "gmap_id": "0x888eb881b5c55b1f:0x126501551570d55f"}
{"user_id": "115154216774775878153", "name": "Blake Freeman", "time": 1617277207697, "rating": 1.0, "text": "HORRIBLE! I wish their was a 0 star rating. I bought my tractor from them brand new and had it for 16 months. Out of them 16 months it was in the shop 9 different times for numerous things. The shop was awful to work with since it seems they are an automotive shop and no one knows how to work on tractors. I ended up having to take my tractor to Coblentz in Montgomery and after they went through the tractor they found several things that this shop didn't catch. I didn't have any more issues after taking it to Coblentz.I would advise to shop elsewhere.", "pics": null, "resp": {"time": 1617284466981, "text": "Hey Blake, David here. I wanted to personally apologize for your poor experience with our shop. I know that it can be incredibly frustrating to have to continuously have a machine worked on my own experience. I wanted to inform you that we are working to construct a new specialized facility here at our sales lot so we may better oversee the service work on our tractors. I wish you all the best,\n\n--David"}, "gmap_id": "0x888eb881b5c55b1f:0x126501551570d55f"}
{"user_id": "105806641400551701557", "name": "Greg Hicks", "time": 1626608419614, "rating": 5.0, "text": "It was a delightful experience.", "pics": null, "resp": {"time": 1626702076191, "text": "Thanks so much for your kind words! We are glad that we could provide you with the best possible experience!"}, "gmap_id": "0x888eb881b5c55b1f:0x126501551570d55f"}
{"user_id": "107089357452297681510", "name": "Tayjh K", "time": 1579075447548, "rating": 5.0, "text": "I stopped at this automotive after my car seized and had to be towed. I was fortunate enough to be able to meet Jimbo, who helped me out a lot. All of the staff members that night stayed two hours late to work on my car, understanding that I was far from home and where I needed to be. I’d like to thank Jimbo again for the great service, and for really looking out for me and just being a genuine good person in general. It’s hard to find good people like that nowadays. Overall I had a good experience with everyone, and would recommend this shop to others.", "pics": null, "resp": {"time": 1626702148785, "text": "Thank you so much for your kind words! We are glad that you were able to get what you needed."}, "gmap_id": "0x888eb881b5c55b1f:0x126501551570d55f"}
{"user_id": "116424084435681984602", "name": "Tammy Cloer", "time": 1619093969329, "rating": 5.0, "text": "Very friendly and helpful", "pics": null, "resp": {"time": 1619097845118, "text": "Thank you so much for your kind words!"}, "gmap_id": "0x888eb881b5c55b1f:0x126501551570d55f"}
{"user_id": "102297607064245138475", "name": "J", "time": 1573443738148, "rating": 5.0, "text": "Great group of people! Originally contacted them through their website about a zero turn and got back with me the next day. Gave me a great price quote, went and picked it up the following day, in and out in 30 minutes.", "pics": null, "resp": {"time": 1626702396966, "text": "We are glad that we were able to get you the equipment you needed! Thank you for your business and kind words!"}, "gmap_id": "0x888eb881b5c55b1f:0x126501551570d55f"}
{"user_id": "111829309237204052414", "name": "ty h", "time": 1587663347156, "rating": 1.0, "text": "Poor Customer service  dont call customer back.Had my mower for almost month first time.A few weeks  later back  in there for almost month again too slow. Every  time I call the  person I dealing not working there anymore.I try to understand but bad customer.Wish I could give lesser  score.", "pics": null, "resp": {"time": 1611871367624, "text": "Hi Ty, David here, I wanted to personally apologize to you for your poor experience with our shop, and I wanted to inform you that we are working to ensure proper procedures are being followed, as well as better correspondence is being maintained between ourselves and our customers. Thank you sincerely for leaving a review."}, "gmap_id": "0x888eb881b5c55b1f:0x126501551570d55f"}
{"user_id": "116810324746467477465", "name": "Carolyn Daviss", "time": 1571261956052, "rating": 1.0, "text": "We took our tractor to the repair shop of this company and it was there for 5.5 months with the only thing being figured out was low compression issues. We had to call to find anything out and often times were told they had not gotten to it.... or they were waiting on a tool( that took weeks to get?) so we designed to just go pick up our broken tractor. Called them on Monday to tell them I am coming to get it Wednesday at lunch and show up to get it and have to help find one of our side panels that they were even checking the dumpster for!\nThey did kindly load our broken still pulled apart ( which we did tell them not to put it back together) tractor for us.\nHowever we paid way too much for our tractor to have been sitting in there shop for 5.5 months and all we get is low compression in two cylinders.\nWould highly recommend taking your tractor elsewhere for repairs if you want it done anytime this year!", "pics": null, "resp": {"time": 1626702487854, "text": "We are sorry to hear that you had such a poor experience at our shop. We are working to put better procedures in place to better serve our customers. Thank you for your candor."}, "gmap_id": "0x888eb881b5c55b1f:0x126501551570d55f"}
{"user_id": "109807433450623579481", "name": "Buford Strength", "time": 1553632273677, "rating": 3.0, "text": "I'll find another Mahindra dealer next tractor.", "pics": null, "resp": {"time": 1626702608364, "text": "We are sorry to hear that you won't be back."}, "gmap_id": "0x888eb881b5c55b1f:0x126501551570d55f"}
{"user_id": "103790590323419236258", "name": "Clint Grantham", "time": 1500764514271, "rating": 3.0, "text": "Decent folks with fair prices.", "pics": null, "resp": null, "gmap_id": "0x888eb881b5c55b1f:0x126501551570d55f"}
{"user_id": "105051590442711208673", "name": "John Terry", "time": 1529360618788, "rating": 1.0, "text": "Hours listed are not correct. Claimed to be open till 6, I pulled up at 10 minutes past 5 and gate is locked. Left me in a real bind. I'll take my business elsewhere.", "pics": null, "resp": null, "gmap_id": "0x888eb881b5c55b1f:0x126501551570d55f"}
{"user_id": "111975186537273212126", "name": "Dianna Velez", "time": 1500596353521, "rating": 4.0, "text": "Staff was great and helpful!", "pics": null, "resp": null, "gmap_id": "0x888eb881b5c55b1f:0x126501551570d55f"}
{"user_id": "101832210256808273894", "name": "Jody Hill", "time": 1493259003415, "rating": 5.0, "text": "Honest people", "pics": null, "resp": null, "gmap_id": "0x888eb881b5c55b1f:0x126501551570d55f"}
{"user_id": "108728548310068637484", "name": "Patrick Lanier", "time": 1525737511543, "rating": 2.0, "text": "Weak.", "pics": null, "resp": null, "gmap_id": "0x888eb881b5c55b1f:0x126501551570d55f"}
{"user_id": "108035707405516560734", "name": "Dianne Hardy", "time": 1566940288027, "rating": 3.0, "text": "Friendly", "pics": null, "resp": {"time": 1626702518880, "text": "Thank you for your kind word!"}, "gmap_id": "0x888eb881b5c55b1f:0x126501551570d55f"}
{"user_id": "100084080026268691662", "name": "Kyle Ellison", "time": 1567700576970, "rating": 5.0, "text": "\"BIRD!!!!\"", "pics": null, "resp": {"time": 1626702506147, "text": "The bird is the word."}, "gmap_id": "0x888eb881b5c55b1f:0x126501551570d55f"}
{"user_id": "113361429477949102137", "name": "Grace Ryals", "time": 1621900023688, "rating": 5.0, "text": "Rich Ryals is the best Lift truck salesman out there!!", "pics": null, "resp": {"time": 1621946480486, "text": "Grace, thanks for the 5 star review!"}, "gmap_id": "0x888c2dca0b5b5917:0x888c65d791eec22b"}
{"user_id": "102496918133182548119", "name": "Shane Ivey", "time": 1619728800376, "rating": 5.0, "text": "Thompson Tractor has a great team from leadership to the soul of the company , the TECHS.", "pics": null, "resp": {"time": 1619744541150, "text": "Shane, thanks for the review! We love our techs and think they are the best as well!"}, "gmap_id": "0x888c2dca0b5b5917:0x888c65d791eec22b"}
{"user_id": "109073558696190940276", "name": "J M", "time": 1547762640294, "rating": 5.0, "text": "Great service.... transportation to get all parts needed for same day turn around....I would recommend for service anytime!!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOXMcbNXwTUKtfdTeSoDE4vDaq_IdAGMKgZMFgY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMbkNS7DmX_PtPJLHx_snHjjZ82StGg-camTS4r=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2dca0b5b5917:0x888c65d791eec22b"}
{"user_id": "113537016797391255807", "name": "James Brennan", "time": 1606317369139, "rating": 5.0, "text": "Terry was very friendly and professional it was a pleasure. Thank you for the help", "pics": null, "resp": {"time": 1606315738037, "text": "Thanks for the 5 star review!"}, "gmap_id": "0x888c2dca0b5b5917:0x888c65d791eec22b"}
{"user_id": "105579928871643007194", "name": "Ruthie Perry", "time": 1595000374244, "rating": 5.0, "text": "The employee who assisted me was very professional and helpful.  Again Thanks!!", "pics": null, "resp": {"time": 1603117670408, "text": "Ruthie, we are so glad you had a great experience. Please don't hesitate to call if you need anything in the future."}, "gmap_id": "0x888c2dca0b5b5917:0x888c65d791eec22b"}
{"user_id": "107128932743602878684", "name": "reginald farrish", "time": 1548783215537, "rating": 5.0, "text": "I am the superintendent for the city of Montgomery and my experience with Thompson has been great I feel that they are honest and perform quality work. I will continue to use them to perform repairs for the City Of Montgomery", "pics": null, "resp": null, "gmap_id": "0x888c2dca0b5b5917:0x888c65d791eec22b"}
{"user_id": "107395024215590179696", "name": "Ira Robinson", "time": 1550588011461, "rating": 5.0, "text": "I made on phone call and they told me to come in the same day and they're running the overhead and diagnosing other issues I'm having.", "pics": null, "resp": null, "gmap_id": "0x888c2dca0b5b5917:0x888c65d791eec22b"}
{"user_id": "114354156502593027986", "name": "Will Guy", "time": 1535646387965, "rating": 5.0, "text": "Able to get trucks in and out quickly.", "pics": null, "resp": null, "gmap_id": "0x888c2dca0b5b5917:0x888c65d791eec22b"}
{"user_id": "113326287782459764451", "name": "Vээzÿ Not", "time": 1493303731760, "rating": 5.0, "text": "Quick unload.", "pics": null, "resp": null, "gmap_id": "0x888c2dca0b5b5917:0x888c65d791eec22b"}
{"user_id": "109593806222852495641", "name": "patrick lanier", "time": 1548456900651, "rating": 5.0, "text": "Excellent.", "pics": null, "resp": null, "gmap_id": "0x888c2dca0b5b5917:0x888c65d791eec22b"}
{"user_id": "106971885118941010943", "name": "Greg Vawter", "time": 1593030747747, "rating": 5.0, "text": "This business is fantastic!! They offer friendly service and a very helpful staff!  Whenever I am in the market for a new tractor, I will come here!!!", "pics": null, "resp": null, "gmap_id": "0x88628907bd1e864d:0x2400584081ccc859"}
{"user_id": "105581362528451960781", "name": "Scott Suttle", "time": 1553902079317, "rating": 5.0, "text": "Knowledgeable staff", "pics": null, "resp": null, "gmap_id": "0x888a24a074e089dd:0xa75745ebc88e1247"}
{"user_id": "107628791068783931066", "name": "David Waid", "time": 1628635002653, "rating": 5.0, "text": "I just want to say that if you’re looking for a great price and friendly people then  Columbiana Tractor is that place. I called and talked with Jacob and he sold me a Scag liberty. He delivered it to me which is 45 minute  drive one way . So my first cut with the mower I had a belt problem. I called Jacob and he and Terri took care of me within a hour and half. Jacob return to my house with another man and replaced the belt that day. It’s running great now. I can’t say enough about they’re customer service and Jacob and Terri . Thank all of y’all, I couldn’t be happier!!!", "pics": null, "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "110646912266554421276", "name": "Jeff Thomas", "time": 1628053236874, "rating": 5.0, "text": "Just purchased a Branson 2505h tractor from Columbiana  tractors.  Jacob, Robert, and Mike helped the process go smoothly and they were very friendly. Would recommend them to anyone needing a tractor or other equipment. Any questions don't hesitate to give them a call.", "pics": null, "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "106749390756647154040", "name": "Danny Barton", "time": 1600550870693, "rating": 5.0, "text": "Bought their smallest compact tractor last Friday... they delivered it to me on Monday... and i finally got to play on it today... I am very satisfied with its overall performance. It does everything that I was wanting it to do... except pick up the backend of a full sized van... but i think I was asking a little too much of it hahaha... i ran over brush and small trees several inches thick and the bush hog just ate them up... I looked at several different brands of tractor and finally decided to go with Branson... because they were all basically the same thing... and i got mine 7k cheaper than the big name brands...", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNhBZPdpmJ6LxaOseV2pAx0lj2C0tUMLcHhNmtb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPMrDl1U-rVlpgi_rFtjVl6i3pmDaF_0LISXGmr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNA0t_TKF_uwb-4QwBJ2QbM168fvmXd9LtIO7Qo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMfxY8y7Gr7FdimZ1DrgoreMiXTLROE_EhqbjZv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOmKng03d101LQrPTC3fNDHLPsF44emHsfIj0iD=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "109792085403747498011", "name": "John Henry", "time": 1619055825374, "rating": 5.0, "text": "100% satisfied with my Branson 2515 H tractor! Jacob up was more than helpful with me and any questions that I had! Being 20 years old buying one they didn’t turn me away or act like I wasn’t important buying on or looking around the lot. The tractor is a absolute beast for 25hp couldn’t be happier!", "pics": null, "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "102167134174720935596", "name": "Michael Greene", "time": 1623712056115, "rating": 5.0, "text": "I recently ordered a SCAG Vride 2 mower from Columbiana Tractor and had to wait a while due to Covid related shortages. During that time Terri was patient with my persistent questions and kept me up to date on my delivery day. I finally got my mower a few days ago and couldn't be happier with it. When I swing by the shop Chris always steps out to say hi and the whole crew has been a pleasure to work with. I look forward to future business with them.", "pics": null, "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "103801088739857343221", "name": "Dwayne Bradley", "time": 1609300586658, "rating": 5.0, "text": "I purchased a LS tractor, Loader, backhoe cutter and grapple from Columbiana tractor.  Jacob took care of me. Fair price and easy financing.  Great place to do business with.  The staff made sure I was completely satisfied with the purchase before they would let me leave.  They got me loaded securely.  Highly recommended!!!!!", "pics": null, "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "104870008363431334610", "name": "W Stein", "time": 1615051172312, "rating": 5.0, "text": "I bought a Branson 2505 package from them, Great buying experience with Columbiana tractor. Jacob was more than helpful and pretty the much reason I bought a tractor package from them. Drove 6 hours total to pick it up. He was very knowledgeable and educated on the tractors and implements.\nThis dealer still has respect for the customers and treats them as such, can’t say enough great things about them and my experience. Will buy all my tractor and zero turn needs from them!", "pics": null, "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "100923731928502582520", "name": "Chad Beasley", "time": 1588102831589, "rating": 5.0, "text": "I am loving my new SCAG Freedom Z mower I bought from Columbiana Tractor. I've never had so much fun cutting grass. They were great to work with! Very knowledgable, no pressure, easy transaction. Terri communicated with me throughout the process and Jacob delivered and demonstrated my new toy. And this mower is an absolute beast! Such a clean, even cut. Check them out if you're anywhere near Shelby County, AL!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO4mNSDYgYAZKH8kHShIWNDd1EzqDNhFNJ-heU2=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "107285981046059629192", "name": "Jason Bryant", "time": 1611715469182, "rating": 5.0, "text": "These guys were great to deal with.  Got the tractor i wanted for a great price.  Branson 2515h", "pics": null, "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "106847526464424244082", "name": "Randy Dalton", "time": 1600369905527, "rating": 5.0, "text": "Just a complete pleasure to deal with! Chris, Jeff, Robert, and Jacob were very honest with all my questions and very helpful with all I needed! I bought a new Scag Tiger Cat II, new trailer, and New Cushman 4 seater golf cart!!! I’m so pleased from start to finish with this team and now Family!!!", "pics": null, "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "115209436447066608656", "name": "Todd Oden", "time": 1601922097843, "rating": 5.0, "text": "Bought two pieces of equipment for our Dealership MTO Motors today from my friend Chris Mundy.   Great dealership and great folks!  5 Star service and a smooth transaction.  I highly recommend these guys.", "pics": null, "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "100450213276003799516", "name": "Chad Jackson", "time": 1602722912970, "rating": 5.0, "text": "No pressure sales staff. Small town feel. Best prices in Alabama.", "pics": null, "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "118352913871770988188", "name": "taylor ellis", "time": 1595538048926, "rating": 4.0, "text": "I purchased a 25+5 goose neck trailer in November of 2019. The buying process was easy and my sales person Justin was very helpful and friendly. I did have an issue with the title paper work being sent in by Terri but Chris (who I am guessing is the owner) reached out to me to resolve the situation.", "pics": null, "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "100700301752215907070", "name": "Mike Raita", "time": 1584582105804, "rating": 5.0, "text": "I've been to the \"biggies\" to have my Kubota tractor and zero turn serviced but I'm thrilled to have found the best service I've ever had just down the road at Columbiana Tractor. Friendly, thorough, conscientious, and precise - they don't push stuff you don't need. Jacob picked up and delivered when he said he would and Terri kept me informed of needs and cost throughout the process. I highly recommend my new favorite neighbors for all your mower and tractor service needs!", "pics": null, "resp": {"time": 1584616621450, "text": "We truly appreciate your business Mr.Raita. Thank you!"}, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "101589357292012579151", "name": "Janet Williams", "time": 1584294368578, "rating": 5.0, "text": "Columbiana tractor is amazing! They helped out my boyfriend and his family that was in dire need of a lawn mower! They walked in to friendly people that greeted them with a smile, offered them some water and a free hat which my boyfriend couldn’t pass up!! Thank you Columbiana tractor for being awesome and being fast and friendly!! Highly recommend this place!!", "pics": null, "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "117555431314068186490", "name": "Christopher Chapman", "time": 1597191556320, "rating": 5.0, "text": "I had great service from the salesman Jacob he was very honest and  he made sure I got what I wanted and kept me updated on the process along the way ,also delivered my new  Branson tractor to my house and let me know the exact time he would arrive!", "pics": null, "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "116042067864979277954", "name": "william mcleod", "time": 1590183022516, "rating": 5.0, "text": "I looked at other brands but I have always liked the Branson tractors. Jacob in the sales department is a great guy easy to deal with. He answered all my questions and he met me half way to deliver the tractor because I live a 120 miles away. Mike in the finance dept. is great to deal with got me finance at the rate and time frame I wanted. This a five star  group of people to deal with very knowledgeable and helpful.I love my Branson 2505 H. Thank You for your help.", "pics": null, "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "106012207595098336415", "name": "Brian Smith", "time": 1585615850192, "rating": 5.0, "text": "Great customer service with a knowledge staff. If your in the market for a new tractor or mower they carry top notch equipment that will NOT disappoint! Customer service is second to none.", "pics": null, "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "105068071346305111514", "name": "Phillip Gray", "time": 1592527520429, "rating": 4.0, "text": "Did a lot of research on tractors before I bought my LS  from Columbiana Tractor.\nGot hooked up with Jacob and he was very responsive with emails and text. Finally got the deal worked out even got up'd from a 45HP to a 50HP for almost nothing because they sold the one we spoke about. But he came thru with still a STEAL of a DEAL. Got there met Mike, Terri and Jacob plus the owner Jeff who by the way is from my home town and about same age as me. We went to competing schools but recognized each other and had a lot of mutual friends. Jacob, Terri, Mike and Jeff were all there to congratulate me and my wife on our new purchase. Everyone was super polite! Got some great SWAG to! These folks are a pleasure to deal with have the all answers when it comes to the equipment they sell.  I gave a 4 because it will most likely go to 5 once I get the 50 hour service done then I can brag on them some more for that to. Go see my friends at Columbiana Tractor might be off the beaten path but the view getting there ain't bad! Thanks CT LLC! Oh and I am LOVING MY LS XR4150XR with TITAN 6' SLIP CLUTCH CUTTER AND DISC!!!!!", "pics": null, "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "107611494277153693012", "name": "Jerred Pruitt", "time": 1584587307597, "rating": 5.0, "text": "I bought a scag turf tiger 2 from Columbiana tractor went thru Jacob Davenport. He was very knowledgeable and very helpful with my purchase highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "117932022068222117589", "name": "Charles Hurst", "time": 1519835687920, "rating": 5.0, "text": "I bought an incredible LS XU6168 from Columbiana Tractor and the experience was outstanding!  Chris and Jeff were great to work with.  Very low pressure, fair and upfront with everything and the tractor is amazing!  Couldn't be happier with the whole experience or more strongly recommend them and the LS brand.  Great value all the way around!", "pics": null, "resp": {"time": 1549896342667, "text": "Thank you Charles for shopping with us and buying local!"}, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "115239496101491923671", "name": "John King", "time": 1585335692869, "rating": 5.0, "text": "Several of the reasons I recommend Columbiana Tractor. Their personality, products, prices and promotions.", "pics": null, "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "107078237964994135710", "name": "Chaz Phil", "time": 1556814275823, "rating": 5.0, "text": "Great place! On very short notice I needed a bushhog, they had what I needed and even delivered! Will definitely use again!", "pics": null, "resp": null, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "101488046626658770611", "name": "Jimmy Tolbert", "time": 1544582784335, "rating": 5.0, "text": "Great group of guy!! Really great experience!", "pics": null, "resp": {"time": 1549896282152, "text": "Thank you for your business Jimmy!"}, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "113585939777607919120", "name": "Trey Garrett", "time": 1519258592881, "rating": 5.0, "text": "I bought my tractor here and have been back for help with other items since then.  I shopped from Gardendale to Calera and back.  Nobody was as friendly and nobody gave me as much tractor for my dollar as these guys.  Stop by and just meet them if your thinking about a tractor or commercial lawn mowers.", "pics": null, "resp": {"time": 1549896444247, "text": "As always Trey, thank you for your business and kind words!"}, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "107237800259317331316", "name": "Norman Redo", "time": 1542553519224, "rating": 5.0, "text": "Great place to buy a tractor", "pics": null, "resp": {"time": 1549896378270, "text": "Thanks You Norman!"}, "gmap_id": "0x888937a54de755a1:0x2a96a6e6125b0fa5"}
{"user_id": "112804104758566652763", "name": "Kevin Clairmont", "time": 1621433228238, "rating": 5.0, "text": "I don’t even know where to begin. I was on the road with my gas powered 2019 Ford Transit. On my way to delivery, my brakes started to growl badly. I called around and of course, most places need a day or two to get my truck brakes looked at and since I am an expeditor and live in my truck, I didn’t have the luxury of waiting. Thompson readily made themselves available to at least look at the problem and see if it’s something they can fix. The shop was swamped with work but Tim got Ben to begin working on it. All 4 brakes got new pads and rotors and in one case, a new caliper because of the neglect of a past brake job from another shop. A day and a half later, my truck was ready and so was I! I was pleasantly surprised when I saw the bill! Thompson set the bar high when it comes to fair pricing. I was shocked and eagerly paid my bill because I was expecting to pay so much more!! If I am in the area and need work done, Thompson is where I would go! Thank y’all at Thompson for your work and hospitality! If you’re looking for a competent mechanics with a hometown feel...you can’t go wrong with Thompson Tractor...I tip my cap and thank you for everything!!", "pics": null, "resp": {"time": 1621524097000, "text": "Kevin, we are so glad that you had a wonderful experience with our Truck department. Tim and Ben will be receiving a SPIRIT Coin, this is a coin we give to employees for going above and beyond for a customer.  If you are traveling through Alabama or the panhandle of Florida please stop again for any parts or service needs!"}, "gmap_id": "0x888bb1324f0e5535:0xe7b28f526c445816"}
{"user_id": "112744292721834491674", "name": "David Carlson", "time": 1617396224317, "rating": 5.0, "text": "Had two fuel lines made ... Excellent place for part's... Great people working here...", "pics": null, "resp": {"time": 1617624524474, "text": "Thanks David, let us know if we can help in anyway in the future!"}, "gmap_id": "0x888bb1324f0e5535:0xe7b28f526c445816"}
{"user_id": "115523147859493804135", "name": "Glitt3r_goddess", "time": 1616073438172, "rating": 5.0, "text": "Rented a tracked trencher for a day. Took about 3 hours to complete 800 feet, mostly bc it was a soupy mess here. Rental process was seamless. Staff were AMAZING....like SO HELPFUL and FRIENDLY. Didn't treat me like an idiot bc I can't back a utility trailer, (even though I have a cdl lol) guys just came out and did everything for me. When I need another piece of equipment, there's no where else I will go. Can't say enough for these guys. Cost about$235 or so for a full day, should have just rented it for 1/2 but I'm inexperienced 😂 fair prices. Excellent running equipment, the only thing that took a few minutes to do was a full inspection on the equipment that I used because it had just come back from another customer. I really appreciated that. No complaints here, I don't mind waiting a few minutes to make sure I get good running equipment!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNZ9CYaLER9qpG0jwHiHViF8z2dLMIMNT0c0b2m=w150-h150-k-no-p"]}], "resp": {"time": 1616077282277, "text": "We are so glad to hear you had a great experience! No matter the skill level or experience we want to be here for all your equipment needs, even though it sounds like you know exactly what you are doing. Make sure to let us know if you have any rental needs in the future!"}, "gmap_id": "0x888bb1324f0e5535:0xe7b28f526c445816"}
{"user_id": "114917383615955266359", "name": "Jon Atchley", "time": 1612479564612, "rating": 5.0, "text": "Great people that will help you with all your equipment needs!", "pics": null, "resp": {"time": 1612534469998, "text": "Jon, thanks for the great review! We are so glad we could help with your equipment needs and let us know if we can ever help in the future!"}, "gmap_id": "0x888bb1324f0e5535:0xe7b28f526c445816"}
{"user_id": "106435362540123129872", "name": "RonnieandJanice Gulledge", "time": 1582078693671, "rating": 5.0, "text": "Great people and knowledgeable", "pics": null, "resp": null, "gmap_id": "0x888bb1324f0e5535:0xe7b28f526c445816"}
{"user_id": "106658895502407466792", "name": "rob dodd", "time": 1598563198179, "rating": 5.0, "text": "Great place to buy a John Deere. Wes took care of most of the work over the phone, and i just had to show up, sign the papers and pick up my new John Deere! Friendly people and great service!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNmy7czwBpb4ScCEF_gXT_8BuztVeDQjE3UsMua=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMZDoOIS3IhhvRAJwOpAHKx-ZSNSCOxMJ9O6390=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "117788886169226801433", "name": "Boyd Patterson", "time": 1623966274834, "rating": 5.0, "text": "Nice clean dealership, very friendly staff, always have my parts.", "pics": null, "resp": {"time": 1618928839480, "text": "Thank you!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "114634135914776111138", "name": "JAMES PHILLIPS", "time": 1617897238435, "rating": 5.0, "text": "Great people to do business with. About some parts there and they're very knowledgeable of the equipment I was working on.", "pics": null, "resp": {"time": 1618493312092, "text": "Thank you!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "114953465301330060203", "name": "Justin Pace", "time": 1617919737317, "rating": 5.0, "text": "IT was great an very nice people an great service", "pics": null, "resp": {"time": 1618493276371, "text": "Thank you!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "109682888774979049687", "name": "Johnny Tank", "time": 1624481489091, "rating": 5.0, "text": "Great people and place", "pics": null, "resp": {"time": 1624908823202, "text": "Thank you!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "100408840026583911980", "name": "Billy Robertson", "time": 1598988864027, "rating": 1.0, "text": "First, my lawnmower only had 26 hours of usage, when the head gasket began to leak. Of course, this was not under warranty and the cost for repair is $284. Labor cost is $102 per hour. I dropped off my lawnmower on a Wednesday.  After calling to check on the status after a week, I was informed a few days later Of the total cost. And then took an additional two weeks for the repairs to be completed. In closing, it took 19 days to do two hours worth of work.  I was never notified nor updated.  When I picked up my lawnmower the only greeting I was met with was your total was $284.80. Terrible customer service, terrible communication and obviously an inferior product.", "pics": null, "resp": {"time": 1599060101162, "text": "Hi Billy --  we are very sorry you had a negative experience with our Florence dealership. Customer service is very important to us at TriGreen Equipment and we are going to forward these comments to management. We hope you'll consider giving us another try, please contact us directly at 256-233-0339 so we can work to make this right for you."}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "110417803765544014807", "name": "Scott Roysden", "time": 1601170531167, "rating": 1.0, "text": "Terrible service team !\nI have a John Deere skid steer I took in with what seemed to be a hydraulic issue .\nI left my machine in what I assumed would be capable hands .\nAfter a few days I was told that it needed a pressure relief valve because the hydraulic pressure was low !!\nRemember that statement while I write the rest of this review because it will come back to that !\nThe part came in and they told me it was ready . I drove an hr to pick up machine got in it and had the same issue as when I dropped it off .\nNever got it on the trailer !!!\nI left machine with them for yet another wrong diagnosis of bad hydraulic pump !\nI got contacted that machine was ready so I picked it up . Still same issues but I needed it to continue with work . They had my machine for almost 2 weeks which is not a problem if I get back a fixed machine.\nThe repair cost was almost $4000 and machine was still the same as the day I took it .\nSo after a few weeks of trying the machine it never got better or worse so I knew I still had an issue !\nI took it to a repair shop that I was referred to and after 3 hrs I got a call your machine is ready !!!\nExciting news and it was only a issue with computer it was stuck in a precision mode !!\nCost me $164 and the machine works great !!!\nI called TRIGREEN and told them and they did absolutely nothing but tell me it needed the parts they installed! Remember the statement I referred to earlier ^ the next section tells you the answer !!\n\nNow here is the kicker precision mode decreases hydraulic flow which was my issue and is exactly what TRIGREEN said but failed to check the obvious because they want to throw parts at your problem and run your bill up ! The parts they replaced was not necessary because it was just stuck in the wrong mode .\nI have called corporate and they are sticking with the decision of the Florence store on not making this right .\nI’m writing this to warn you off of using this company they are not customer service friendly and incompetent of working on the product they sale .\nHope this helps the next customer with there decision on buying or using this store for anything!!!", "pics": null, "resp": {"time": 1601396965606, "text": "Hi Scott -- we are certainly very sorry to hear that your experience with TriGreen has left you feeling angry and frustrated. We understand that we are not the intended audience for your review, but we value your feedback, nonetheless. Providing exceptional customer service is very important to us, and when we miss the mark with even one customer, we like to take it as an opportunity to improve. We stand by the work performed by our service departments, but we will communicate your comments to management and work with them to ensure our technicians are being effective and efficient in diagnosing and repairing our customers' equipment. We are very sorry that we seem to have lost your business, but most importantly we are very happy to hear that your skid steer is back in operation. If ever you want to discuss this further, feel free to contact us directly at 256-233-0339."}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "108949051392227536753", "name": "Charles Hammond", "time": 1617846471115, "rating": 5.0, "text": "All the equipment you'll ever need.", "pics": null, "resp": {"time": 1617888255657, "text": "Thank you for your feedback!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "109548507996824632134", "name": "Jon Goggans", "time": 1591654998826, "rating": 5.0, "text": "Good folks there.  Young man named Will treated me right. But they are all good.  Friendly and competent!", "pics": null, "resp": {"time": 1593102521998, "text": "Thank you!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "107455499354957385239", "name": "Phillip Risner", "time": 1606612403546, "rating": 4.0, "text": "Friendly service very helpful!", "pics": null, "resp": {"time": 1607965752309, "text": "Thank you!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "118316762094261246353", "name": "Bobby Carr", "time": 1600550047184, "rating": 5.0, "text": "Sales team was helpful and knowledgeable,\nVery good experience", "pics": null, "resp": {"time": 1600695827882, "text": "Thank you!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "113353274242258266993", "name": "Jim Brewer", "time": 1618879419533, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1618928901905, "text": "Thank you Jim!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "101559557143321204031", "name": "River Lafloor", "time": 1593318227117, "rating": 4.0, "text": "Got to go green end of discussion. Great customer service and staff.", "pics": null, "resp": {"time": 1593437602816, "text": "Thank you!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "105397922078196351811", "name": "Shane Haddock", "time": 1577352563767, "rating": 5.0, "text": "Friendly service with a smile and have about what ever it is you need for your lawn and garden", "pics": null, "resp": {"time": 1578283868362, "text": "Thank you!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "116530727447060545957", "name": "Connie Gist", "time": 1597436249608, "rating": 5.0, "text": "Got the right lawnmower blades for my John Deere riding mower . Now we can mow the grass.", "pics": null, "resp": {"time": 1597756875218, "text": "Thank you!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "101981991349368526192", "name": "D Fre", "time": 1525718826844, "rating": 5.0, "text": "Friendly staff. They were short handed today but I was treated with respect and fairness. The salesman took the time to answer my questions and was knowledgeable about the product.", "pics": null, "resp": {"time": 1525720694130, "text": "Thank you!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "108336986082794805621", "name": "Heather Hall", "time": 1566516523230, "rating": 1.0, "text": "Don't buy the extra insurance. Doesn't cover anything. They have a $125 fee for cleaning their tools between jobs. $100 pick up/drop off fee they state when you call is actually $150 and they will hold your equipment till you pay it.", "pics": null, "resp": {"time": 1567183016416, "text": "Hi Heather - We're sorry to hear that you had a less than stellar experience at our dealership, and for that, we apologize.  Providing you with an exceptional visit is very important to us and we'd love to hear more about your time with us so we can make it right. Please call our Customer Service Manager at 256-233-0339 so we can continue to earn the right to your business."}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "115177116977332490210", "name": "Vince Barnett", "time": 1574315737752, "rating": 5.0, "text": "Knowledgeable and friendly and nothing runs like a Deere!!", "pics": null, "resp": {"time": 1575387342838, "text": "Thank you!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "111047229499109234424", "name": "Peggy Smith", "time": 1565048104966, "rating": 3.0, "text": "Called after 2 wks, not sure what to do, calling corporate to see if new deck was needed, called a wk later, sending it to Lowe's the next day, not there, call back almost a week later, still not there,  called TriGreen, oh they forgot to haul it back to Lowe's (grrr), come get it when we're open in two more days.  Not Happy!!  Hope it works now.", "pics": null, "resp": {"time": 1565211194048, "text": "Hi Peggy - we're so sorry to hear about your experience at our Florence dealership! Providing you with a great customer experience is extremely important to us and we are going to forward these comments to management. If you'd be willing, please call our Customer Service Manager at 256-233-0339 so we can learn more and continue to earn your business. Thanks!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "108231617813860857719", "name": "Ryan Wells", "time": 1588879982763, "rating": 1.0, "text": "This place is a joke. It’s hard to believe that people can be this slow. If you go in for a screw driver it will be 30 min minimum.", "pics": null, "resp": {"time": 1589203982123, "text": "Hi Ryan - providing an exceptional customer experience is very important to us, which means we care about your feedback. We hope you'll consider giving us another try, please contact our Customer Service Manager at 256-233-0339 so we can work to make this right for you."}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "108062893508860136211", "name": "Kim Kimbrough", "time": 1532129029781, "rating": 5.0, "text": "Great place to find all your John Deere needs", "pics": null, "resp": {"time": 1532555969054, "text": "Thank you Kim!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "112892626159756626448", "name": "Larry Littrell", "time": 1522714359113, "rating": 5.0, "text": "I was given fast service, they had the part on hand.", "pics": null, "resp": {"time": 1522718349612, "text": "Thank you!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "114275751548305851140", "name": "Mark Parker", "time": 1561515288544, "rating": 5.0, "text": "After a little bit of a slow start, the staff did a great job of making me welcome, and helping me with a purchase.  Will be back.", "pics": null, "resp": {"time": 1562345155160, "text": "Thank you for your feedback Mark!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "113043769496188393236", "name": "Terry Haddock", "time": 1524606393400, "rating": 5.0, "text": "The best place for parts for you tractor or mower", "pics": null, "resp": {"time": 1525191546520, "text": "Thank you!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "110994562787140976062", "name": "Kenneth McCormack", "time": 1582830128367, "rating": 1.0, "text": "New lawnmower tore up and they didn't make it right", "pics": null, "resp": {"time": 1583162045167, "text": "Hi Kenneth - providing an exceptional customer experience is very important to us, which means we care about your feedback. We hope you'll consider giving us another try, please contact our Customer Service Manager at 256-233-0339 so we can work to make this right for you."}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "114555530913436316375", "name": "Robert Pastuszka", "time": 1523762246262, "rating": 3.0, "text": "Staff wasn't very helpful and were quick to dismiss me, then they said I would hear back from them later this afternoon regarding the status of my mower, and nobody called.", "pics": null, "resp": {"time": 1523887927455, "text": "Robert,\nWe're so sorry for the delay on the status of your mower. We've followed up with our staff regarding your situation. You should hear from them today but if not, or if you'd like to discuss your experience further, please feel free to call us at 256-233-0339 . Thanks for your feedback as it helps us to continually improve not only our service but the overall experience we offer our customers."}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "116719812582411614982", "name": "Thrash Forge", "time": 1565058879083, "rating": 5.0, "text": "Always have what i need", "pics": null, "resp": {"time": 1565183877801, "text": "Thank you!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "106485506615578435438", "name": "John Lard", "time": 1554345296629, "rating": 5.0, "text": "Very helpful and friendly service", "pics": null, "resp": {"time": 1554908218446, "text": "Thank you!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "114975336553932696596", "name": "Gerald French", "time": 1557594010238, "rating": 5.0, "text": "Excellent Service as always", "pics": null, "resp": {"time": 1557756989639, "text": "Thanks Gerald!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "112275282736443240341", "name": "SWE Inc.", "time": 1556113431723, "rating": 5.0, "text": "Fast unloading", "pics": null, "resp": {"time": 1556551654344, "text": "Thank you for feedback!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "107413688411144225779", "name": "Larry Hyvonen", "time": 1591296492468, "rating": 5.0, "text": "Great", "pics": null, "resp": {"time": 1591631161069, "text": "Thank you Larry!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "107660969898227529741", "name": "Clay Harris", "time": 1533835600603, "rating": 4.0, "text": "Very expensive yet worth it", "pics": null, "resp": {"time": 1534961158221, "text": "Thank you for your review!"}, "gmap_id": "0x887d358abeaf82df:0x5f264e2051dc0f94"}
{"user_id": "110657086195902113169", "name": "Randy Cooley", "time": 1497312886821, "rating": 5.0, "text": "Great place. All the mechanics are very friendly and will show you what you need to know about the equipment. If you have attachments that are for another piece of equipment of same. They will configure something that will work and looks professionally done and not have wires running or hanging loose.", "pics": null, "resp": null, "gmap_id": "0x888604adbc98d64f:0x8ae3e52feac68170"}
{"user_id": "112874494057566698490", "name": "James Boyd", "time": 1564960086773, "rating": 5.0, "text": "Great staff and quality products", "pics": null, "resp": null, "gmap_id": "0x888604adbc98d64f:0x8ae3e52feac68170"}
{"user_id": "105839403101443204895", "name": "Montrell Miller", "time": 1498480959853, "rating": 3.0, "text": "Clean and organized store. Staff was cordial but not passionate about products.", "pics": null, "resp": null, "gmap_id": "0x888604adbc98d64f:0x8ae3e52feac68170"}
{"user_id": "109540515099483679358", "name": "Ollie Lee", "time": 1552504454015, "rating": 5.0, "text": "Always treat ALDOT good", "pics": null, "resp": null, "gmap_id": "0x888604adbc98d64f:0x8ae3e52feac68170"}
{"user_id": "115292453468172104700", "name": "Charles Barnes", "time": 1541505158732, "rating": 5.0, "text": "Great , people were nice and polite", "pics": null, "resp": null, "gmap_id": "0x888604adbc98d64f:0x8ae3e52feac68170"}
{"user_id": "116108041120345962489", "name": "Earnest Gann", "time": 1551138102289, "rating": 5.0, "text": "Great staff, quality products and service", "pics": null, "resp": null, "gmap_id": "0x888604adbc98d64f:0x8ae3e52feac68170"}
{"user_id": "111970626044150567433", "name": "Rodrick Cooper", "time": 1627392750508, "rating": 5.0, "text": "Great people, very helpful finding the right part. Shipped immediately. I received the right parts fast. I'm back up and running faster than I thought.", "pics": null, "resp": null, "gmap_id": "0x8862845325850541:0x65ab2bfec240714"}
{"user_id": "113371467584925860067", "name": "tammy hyde", "time": 1623938595845, "rating": 5.0, "text": "Great place to get tractor parts for all kind of tractors , And the people are very helpful", "pics": null, "resp": null, "gmap_id": "0x8862845325850541:0x65ab2bfec240714"}
{"user_id": "114435443309198851391", "name": "Adrian Sanders", "time": 1618932275273, "rating": 5.0, "text": "Nice set up inside and out. Great service", "pics": null, "resp": null, "gmap_id": "0x8862845325850541:0x65ab2bfec240714"}
{"user_id": "107284626173831665125", "name": "Ivan Westmoreland", "time": 1605815492476, "rating": 5.0, "text": "Good group of guys. Parts that I needed at a better than fair price.", "pics": null, "resp": null, "gmap_id": "0x8862845325850541:0x65ab2bfec240714"}
{"user_id": "110119135525129318733", "name": "David Puckett", "time": 1627421842088, "rating": 5.0, "text": "Very helpful.", "pics": null, "resp": null, "gmap_id": "0x8862845325850541:0x65ab2bfec240714"}
{"user_id": "114070906258133825481", "name": "Richard", "time": 1587831776068, "rating": 5.0, "text": "Needed a part that had been discontinued. Called all over the country and they had it for me. Shipping was fast and on time.", "pics": null, "resp": null, "gmap_id": "0x8862845325850541:0x65ab2bfec240714"}
{"user_id": "118003124914833991468", "name": "Eric Schell", "time": 1601677716085, "rating": 5.0, "text": "Super friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x8862845325850541:0x65ab2bfec240714"}
{"user_id": "114133984037059613722", "name": "William Rhodes", "time": 1626636412416, "rating": 5.0, "text": "very helpful", "pics": null, "resp": null, "gmap_id": "0x8862845325850541:0x65ab2bfec240714"}
{"user_id": "105712231263277548868", "name": "Jason Bryant", "time": 1581424628672, "rating": 5.0, "text": "Awesome junkyard!", "pics": null, "resp": null, "gmap_id": "0x8862845325850541:0x65ab2bfec240714"}
{"user_id": "109848582717781141753", "name": "keith davis", "time": 1562891217365, "rating": 5.0, "text": "My Traeger guys", "pics": null, "resp": null, "gmap_id": "0x8862845325850541:0x65ab2bfec240714"}
{"user_id": "100168105518770171101", "name": "Billy Smith", "time": 1570043639065, "rating": 5.0, "text": "Had what I needed!", "pics": null, "resp": null, "gmap_id": "0x8862845325850541:0x65ab2bfec240714"}
{"user_id": "107855717094345221015", "name": "jeremy davis", "time": 1559532228020, "rating": 5.0, "text": "Older tractor parts", "pics": null, "resp": null, "gmap_id": "0x8862845325850541:0x65ab2bfec240714"}
{"user_id": "107651428004618618640", "name": "Daniel Massud Nachef", "time": 1567213621835, "rating": 5.0, "text": "(Translated by Google) Excelent reception! Great variety of pieces !!\n\n(Original)\nAtendimento excelente! Grande variedade de peças!!", "pics": null, "resp": null, "gmap_id": "0x8862845325850541:0x65ab2bfec240714"}
{"user_id": "115235484974861426655", "name": "Seth Ashmore", "time": 1552014802103, "rating": 5.0, "text": "So glad I called these guys when I was looking for a new tractor. Bought a M7060. I shopped and shopped. Got an unbelievable deal. These guys know business and went out of their way to get my business. Will recommend to anybody looking for a new piece of equipment. 5stars without a doubt.", "pics": null, "resp": null, "gmap_id": "0x888a02c7803e7839:0xead23cabc77376df"}
{"user_id": "102646746336281238794", "name": "Nicholas Sapp", "time": 1537984121167, "rating": 2.0, "text": "I had them pick up my tractor to change all fluids and misc repairs. The tractor was delivered. I noticed later that there was about a quart of oil leaked out of the back of the tractor. I called to have this corrected. I was informed that they would not cover this and the cost to transport the tractor as well as repairs was my responsibility. After $1,300 in work done I would have expected better service. Needless to say I won't do anymore business with them. If I treated my clients this way I would be without a business.", "pics": null, "resp": null, "gmap_id": "0x888a02c7803e7839:0xead23cabc77376df"}
{"user_id": "105884211233558001977", "name": "James Spalla", "time": 1532228599944, "rating": 5.0, "text": "Great service for recently purchased auction mower.  I worked with Zack over the phone to get a mower I purchased on their lot through auction ready for the up coming season before I drove up to the location to pick it up.  He did a great job of getting the service taking care of for me before I got there and had the unit ready to load when I showed up.", "pics": null, "resp": null, "gmap_id": "0x888a02c7803e7839:0xead23cabc77376df"}
{"user_id": "107595990662087989131", "name": "Tony Bass", "time": 1550264566419, "rating": 2.0, "text": "I bought a tractor here a year ago because they are the closest Kubota dealer to where I live. I could have gotten a MUCH better deal from another dealer but I didn't want to drive over an hour if I needed parts. For this reason I was willing to overlook the salesman who had ZERO knowledge of tractors, had no idea what a flail mower was and couldn't tell me what features would justify the expense of one implement over the other. I was willing to ignore  the random mechanic who wandered onto the sales floor trying to talk me out of the machine I wanted even though he had no understanding of my needs. I also endured the pain of dealing with the rude and unwelcoming finance manager who had the personality of a shoe. All of this because of the promise of a good service department and the full coverage warranty through Kubota and KTAC which is supposed to cover EVERYTHING on the tractor. Fast forward a few months and it's time for a small part that broke. I went right to HMTC service dept only to find out that not only is the part not covered, but they don't even have the part in stock and will take a month to come in. Ok, chalk it up to bad luck. Another month or so later I head to HMTC again for simple parts and they have none in stock. This happened a total of 4 times and I finally give up. The management here is out of touch with the market and their customers. They refuse to hire competent, qualified employees. Even the lady and the front door acts like you're interrupting her day when you walk through the door. Never again will I do business with or recommend anyone to HMTC. I honestly hope they get bought out soon by someone who knows how to run a business and serve their customers.", "pics": null, "resp": null, "gmap_id": "0x888a02c7803e7839:0xead23cabc77376df"}
{"user_id": "105516641528133519346", "name": "Michael Bowman", "time": 1513178968122, "rating": 1.0, "text": "Never a salesman there and their prices are high for the knock off tractors.", "pics": null, "resp": null, "gmap_id": "0x888a02c7803e7839:0xead23cabc77376df"}
{"user_id": "100287196210147268728", "name": "Michael McCullough", "time": 1550704424236, "rating": 1.0, "text": "Horrible place to do business with. Me and my grandma. Ordered 3 mowers and some echo stuff for the lawn business. They messed the order up. Lied about what would be thrown in. Changed the prices. Then one of the mowers being a demo was told had under 25hrs and looks new. Arrived with 48hrs. And looks like had 2000hrs on it. Major Scratches from top to bottom. Worn out discolored levers, dry rotted arm rest. Not surprised if they rolled back hrs. They refuse to replace with what we agreed to. Stay away from this place at all cost. Especially Richard and Jeffrey.", "pics": null, "resp": null, "gmap_id": "0x888a02c7803e7839:0xead23cabc77376df"}
{"user_id": "104367230592140537819", "name": "Ryan Maples", "time": 1554497966803, "rating": 5.0, "text": "Very friendly, great staff", "pics": null, "resp": null, "gmap_id": "0x888a02c7803e7839:0xead23cabc77376df"}
{"user_id": "109239186597112394990", "name": "Jason Gray", "time": 1498823634782, "rating": 5.0, "text": "Great selection of tractors and lawnmowers", "pics": null, "resp": null, "gmap_id": "0x888a02c7803e7839:0xead23cabc77376df"}
{"user_id": "106231482479434915322", "name": "Mary Phillips", "time": 1515284106940, "rating": 5.0, "text": "Had the parts on hand", "pics": null, "resp": null, "gmap_id": "0x888a02c7803e7839:0xead23cabc77376df"}
{"user_id": "104983133928925669245", "name": "RANDY HUGHES", "time": 1503175093100, "rating": 1.0, "text": "Poor service", "pics": null, "resp": null, "gmap_id": "0x888a02c7803e7839:0xead23cabc77376df"}
{"user_id": "101543671867786355485", "name": "Justin Kelley", "time": 1627601274881, "rating": 5.0, "text": "Great hardware store. Support your local small business.", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "115090697893009109586", "name": "Alan Farwell", "time": 1613086178472, "rating": 5.0, "text": "Johnny and sUzanne are quite helpful.  Country style friendly.  Great deals", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "107729610541493885496", "name": "marvin ball", "time": 1613788410909, "rating": 5.0, "text": "Great people been doing business with them for years", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "109902004116747536078", "name": "M. Alan Free", "time": 1599229117628, "rating": 5.0, "text": "Great service and knowledgeable staff. Top notch warrantee services.", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "104369638727880502000", "name": "Cullman Customer", "time": 1594922147050, "rating": 1.0, "text": "This place was really good until Philip stole the company away from H.C. He is a crook and has tried to steal my money. I brought an item in for warranty work and decided upon himself to do non-warranty work with out calling me first. Went to pick un my item and had this huge bill. Johnny has always been honest with me and I feel bad for him and the other employees there. I will never go back. Too bad I can not leave zero stars.", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "109381101361330174878", "name": "Bobbie Wilson", "time": 1566821639300, "rating": 5.0, "text": "I am glad I did not read reviews first. I purchased a new cub cadet in spring of this year. I asked Johnny a lot of questions, he answered them all and correctly.I had already done my homework on what I wanted. I left to go look elsewhere hoping for a lower price instead I went straight to the bank. I came back and purchased from 157 hardware. I was treated with respect and not like a dumb female. I love these guys and will be going back.", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "103118321384386335138", "name": "Joseph Murphy", "time": 1594220014972, "rating": 1.0, "text": "The worst customer service ive ever had to deal with in my life.  I was treated in a rude manner and the old heavy set guy is the worst.", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "115540609876133829865", "name": "J Kincer", "time": 1587838371097, "rating": 2.0, "text": "I purchased several items there for 3 years☝️I needed a $40 drive belt for my Cub cadet lawnmower which they didn’t have in stock 😒and instead of just ordering it for me I had to make a 35 minute roundtrip drive there and pay for it first 😐 need to trust faithful customers. Bad business!", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "112638448390811487434", "name": "Richard Martin", "time": 1555613946275, "rating": 1.0, "text": "Lazy people, especially the one they call Bear, good eater, lousy for helping get the parts you need. Expects customer to provide part numbers, he cannot look them up on system. STAY AWAY.", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "105488659539113102885", "name": "John Converse", "time": 1525338598003, "rating": 5.0, "text": "Friendly & courteous service.  I was pointed in the exact right direction to get the items I needed.  I will definitely go back again.", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "114301055229850271638", "name": "Bob Schlink", "time": 1533661932554, "rating": 1.0, "text": "Use to be a good place but the mower repair person is one of the rudest people I have ran into in awhile. I reckon the hardware store is alright as you can help yourself but if you are looking for lawn equipment I would suggest going somewhere else because you sure won't get it serviced here.", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "110790632021433739320", "name": "James Goeller", "time": 1592442434143, "rating": 5.0, "text": "Nice people very helpful", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "102082274711014300665", "name": "Cyrus H. Bearden", "time": 1549146925954, "rating": 1.0, "text": "Bad business practices... instead of doing what the customer asks for,  they will go far beyond the agreed scope of work and replace many items you didn't ask for causing an outrageous and unexpected bill to pay.... they don't call the customer for approval,  they just replace items without consulting with you first....\nBuyer beware", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "105569079467890717604", "name": "Paul cox", "time": 1588113994275, "rating": 1.0, "text": "Came in trying to find an ignition switch for my zero turn and the tech was so lazy he wouldnt even compare it to their inventory to see if he could match it.", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "115126454311064318221", "name": "Steve Townsend", "time": 1564794872481, "rating": 2.0, "text": "The older gentleman, I think he was the owner was rude and unhelpful. The young lady at the counter that help me was excellent.", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "104634402209611673187", "name": "John Farr", "time": 1560379188937, "rating": 5.0, "text": "Great selection of bolts, both American and metric.", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "105769749097653129110", "name": "Eddleman Stump Grinding", "time": 1521592949342, "rating": 5.0, "text": "The best...,friendly ....,helpful,...local hardware business.", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "111781237525903221663", "name": "Larry Wood", "time": 1539434993229, "rating": 1.0, "text": "Not very pleased at all. When we dripped the lawnmower off, told them not to put a lot of money into it, the mechanic promised he wouldn't spend a lot on it. 2 weeks later went to pick it up and found out that they had bought a whole lawnmower just to put a new front end on ours. 700 dollars to fix a 50 dollar lawnmower. Never a call to us to approve that kind of fix. We could have bought a brand new one for that price.\nSeems as though they take advantage of elderly people.\nWish I could choose negative stars.", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "115378423023136308585", "name": "Jim Glimpse", "time": 1452629009154, "rating": 5.0, "text": "Very helpful and knowledgeable. Family and locally owned.", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "102960417082490839197", "name": "Randy Nelson", "time": 1533054966424, "rating": 5.0, "text": "Great place friendly fokes everything to fix household projects!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "116613698869536202825", "name": "Tim Black", "time": 1582576447922, "rating": 4.0, "text": "Place to find parts nobody else has", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "108894636380705831027", "name": "Robby Culver", "time": 1526489298300, "rating": 5.0, "text": "Great family atmosphere and Hardware that you need", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "100511981924739657675", "name": "Jerry Urick", "time": 1556839180537, "rating": 1.0, "text": "Show me some one by sixes they didn't even have in stock", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "111906656693409348634", "name": "David Oleary", "time": 1563206460156, "rating": 1.0, "text": "Cusses like a sailor and not very helpful or friendly", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "110179533323449079274", "name": "Stephen Hutson", "time": 1528227796679, "rating": 5.0, "text": "Very helpful folks", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "103977027476721946197", "name": "alam rosas", "time": 1519773332147, "rating": 1.0, "text": "Really rude people, go at your own risk", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "106278240923333125425", "name": "Mike Bell", "time": 1501378756808, "rating": 1.0, "text": "Father in law bought lawn mower poor service & met with rude attitude.", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "103066698901848518909", "name": "Dylan Bell", "time": 1501379062120, "rating": 1.0, "text": "Very rude people do not buy from them.", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "109892541570419774634", "name": "Perry Raines", "time": 1544507558033, "rating": 4.0, "text": "Good place", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "109023016065128863661", "name": "Paul Chaney", "time": 1501864642648, "rating": 5.0, "text": "Always helpfull", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "117934712355963490879", "name": "Cindy Stroud", "time": 1504135681228, "rating": 3.0, "text": "Helped me not to energetic to help", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "112306847528148001769", "name": "Anthony Blevins", "time": 1479495543075, "rating": 1.0, "text": "Poorest customer service ever!", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "115676129612369153073", "name": "Fulgencio Lopez", "time": 1625271502219, "rating": 5.0, "text": "(Translated by Google) Very good tools. Greetings..\n\n(Original)\nMuy buenas herramientas. Saludos..", "pics": null, "resp": null, "gmap_id": "0x8889cc74b57c9bff:0x23ee36c7ae744756"}
{"user_id": "113874878646673000071", "name": "Lynn Wigginton", "time": 1623522066552, "rating": 5.0, "text": "If your needing farm equipment I would definitely check prices here. Mr. Bates quoted me the best price anywhere around on what I needed. Seemed  like good people to do business with.", "pics": null, "resp": null, "gmap_id": "0x8889cb4004432e3d:0x5422af0bf817db81"}
{"user_id": "104934554328701237190", "name": "melinda klemetson", "time": 1621737551894, "rating": 5.0, "text": "very knowledgeable and worth the wait.   helpful staff", "pics": null, "resp": null, "gmap_id": "0x8889cb4004432e3d:0x5422af0bf817db81"}
{"user_id": "108470747153296088353", "name": "Starla Wilson", "time": 1619396557114, "rating": 5.0, "text": "Had most of what I needed. Going back next week for the rest.", "pics": null, "resp": null, "gmap_id": "0x8889cb4004432e3d:0x5422af0bf817db81"}
{"user_id": "117850217710321591541", "name": "r.l. mcsherdon", "time": 1615596000786, "rating": 3.0, "text": "I went with  another person looking at a log splitter", "pics": null, "resp": null, "gmap_id": "0x8889cb4004432e3d:0x5422af0bf817db81"}
{"user_id": "102337900716819039335", "name": "connie petty", "time": 1552573627852, "rating": 5.0, "text": "Awesome place. They have a Very Large inventory that covers almost Any and/or Everything you could possibly want. “If they don’t have it , they CAN get it.”", "pics": null, "resp": null, "gmap_id": "0x8889cb4004432e3d:0x5422af0bf817db81"}
{"user_id": "111732875385218351387", "name": "Dean Mangum", "time": 1527713207421, "rating": 5.0, "text": "Great place to buy farm equipment.", "pics": null, "resp": null, "gmap_id": "0x8889cb4004432e3d:0x5422af0bf817db81"}
{"user_id": "111785132462421781535", "name": "jason rollins", "time": 1547253513059, "rating": 5.0, "text": "mr. Bates is pretty cool", "pics": null, "resp": null, "gmap_id": "0x8889cb4004432e3d:0x5422af0bf817db81"}
{"user_id": "105711766517297472914", "name": "Margie May", "time": 1517787809045, "rating": 5.0, "text": "Awesome the people that work there are awesome", "pics": null, "resp": null, "gmap_id": "0x8889cb4004432e3d:0x5422af0bf817db81"}
{"user_id": "116635412402379129596", "name": "steven k", "time": 1434027427706, "rating": 5.0, "text": "Best tractor parts dealer in the area.  Has shop services too but I haven't used them.  Just cantankerous enough to make you appreciate the way parts businesses used to be run.  If he doesn't have what you need he can get it in a few days.  Very knowledgeable about both old and new machinery.", "pics": null, "resp": null, "gmap_id": "0x887d3683a379c671:0xc093b068c070cf9b"}
{"user_id": "108921224650059195277", "name": "Penny McGarity", "time": 1498786991842, "rating": 5.0, "text": "Great. They had everything and then some to fix our old tractor.. I wouldn't want a new tractor when our old tractor can be fixed.. And everyone there are so nice..", "pics": null, "resp": null, "gmap_id": "0x887d3683a379c671:0xc093b068c070cf9b"}
{"user_id": "109262273562681362880", "name": "Josh Harris", "time": 1562207895359, "rating": 5.0, "text": "Great place to find knowledge and parts for older tractors.", "pics": null, "resp": null, "gmap_id": "0x887d3683a379c671:0xc093b068c070cf9b"}
{"user_id": "117752753832083719804", "name": "John Doe", "time": 1510857135279, "rating": 5.0, "text": "the friendliest place I have ever shopped at, I wish tall shops was as friendly as this one I will definitely go back! I am so glad to bring old tractors back to life rather than having to buy a new one!", "pics": null, "resp": null, "gmap_id": "0x887d3683a379c671:0xc093b068c070cf9b"}
{"user_id": "109326137768144957972", "name": "Brad “Doughboy” Copeland", "time": 1550712382075, "rating": 5.0, "text": "Donald at Jayne's knows alot about tractors", "pics": null, "resp": null, "gmap_id": "0x887d3683a379c671:0xc093b068c070cf9b"}
{"user_id": "108382270087337163146", "name": "Wade Hendrix", "time": 1462229240246, "rating": 1.0, "text": "I bought over a thousand dollars in parts from them & decided to call back awhile later with a couple of questions.The guy got mad & told me.\"I gotta go\" & hung up on me.Not the kind of thing you'd expect from a reputable dealer.Oh well.I searched online & found the parts I needed.", "pics": null, "resp": null, "gmap_id": "0x887d3683a379c671:0xc093b068c070cf9b"}
{"user_id": "105365481305560091238", "name": "Wayne Thompson", "time": 1569540591880, "rating": 5.0, "text": "Donald is the best", "pics": null, "resp": null, "gmap_id": "0x887d3683a379c671:0xc093b068c070cf9b"}
{"user_id": "117298707398079727790", "name": "Shaun Dalton", "time": 1542313059370, "rating": 5.0, "text": "My \"go to\" for my tractor parts!", "pics": null, "resp": null, "gmap_id": "0x887d3683a379c671:0xc093b068c070cf9b"}
{"user_id": "105024984458689927168", "name": "Alvie Rodgers", "time": 1596579900293, "rating": 5.0, "text": "They have pretty much everything I go there for. Wish they were open longer on Saturday", "pics": null, "resp": {"time": 1597070034404, "text": "Thank you Alvie!"}, "gmap_id": "0x8889c95293fb90a3:0xffa34a20e83c2346"}
{"user_id": "112356973833227714412", "name": "Glenn Byrum", "time": 1600358198020, "rating": 5.0, "text": "Great store to shop at.", "pics": null, "resp": {"time": 1600696024730, "text": "Thank you Glenn!"}, "gmap_id": "0x8889c95293fb90a3:0xffa34a20e83c2346"}
{"user_id": "118322760361581370776", "name": "Tammy Ingrum", "time": 1501977157125, "rating": 1.0, "text": "I bought a lawn mower from the Columbia store and I carried it back because I found out it had never been serviced before I bought it. It was used I paid $6500 for it. Told them the oil had not been changed and the blades were dull and it does not cut right. There are two ridges when you cut it. Went to pick it up they charged me $129.00 to sharpen my blades. Got it home oil still black and the ridges are worse. I feel.So ripped off. Never again will I buy anymore of their junk. I will be taking pictures and posting on Facebook.", "pics": null, "resp": {"time": 1502030712837, "text": "Hello, Tammy. We understand your frustration and anger. Please accept our apologies. If you'd like, you may call our corporate office at 256-233-0339 to speak with a corporate manager."}, "gmap_id": "0x8889c95293fb90a3:0xffa34a20e83c2346"}
{"user_id": "107948087143935062272", "name": "Tim Waeyaert", "time": 1575398694188, "rating": 5.0, "text": "They provide excellent support to TriGreen", "pics": null, "resp": {"time": 1576017396994, "text": "Thank you!"}, "gmap_id": "0x8889c95293fb90a3:0xffa34a20e83c2346"}
{"user_id": "105982997880577818179", "name": "Ha Ha", "time": 1551992708128, "rating": 5.0, "text": "The only place to shop for green!", "pics": null, "resp": {"time": 1552658871223, "text": "Thank you!"}, "gmap_id": "0x8889c95293fb90a3:0xffa34a20e83c2346"}
{"user_id": "104209856606227356358", "name": "Matt Remson", "time": 1620732947174, "rating": 5.0, "text": "I bought a new zero turn mower, well 2 actually but I will not go into the details. This business is a refreshingly fun place to visit. Nathan was awesome in what he did for me. The whole staff is very friendly and knowledgeable and will be honest with you and not simply tell you what you want to hear. My mowers were delivered in a very timely manner. Very loose (relaxed) not pushy  professional group of guys. Thanks to Nathan and the rest of the team at Ag Pro in Guntersville.\n\nMatt", "pics": null, "resp": {"time": 1620741169679, "text": "Matt, we appreciate your kind words and great review. Thank You Very Much!"}, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "110372806860056825988", "name": "Alan Mange", "time": 1614827229973, "rating": 5.0, "text": "Kawasaki mule Pro FXT Ranch priced over $2000 better than closest competitor. Paperwork was ready when I got there and the transaction was seamless. Not just my salesman, but everyone there was friendly. Worth the drive.", "pics": null, "resp": {"time": 1614873287770, "text": "Alan, we appreciate your kind review. Thank You Very Much!"}, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "103658354482385670593", "name": "Jeremy Gamble", "time": 1620775992633, "rating": 5.0, "text": "Very professional sales group and employees were very courteous to make for a quick and painless transaction", "pics": null, "resp": {"time": 1620834646536, "text": "Jeremy, we appreciate your kind words and great review. Thank You"}, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "111716481573276358370", "name": "J. Golden", "time": 1607184115637, "rating": 5.0, "text": "These guys are great...!!  Worked with Kevin on a new loader for my tractor and Brent to handle the install.  Good communication, price, and install.  Enjoyed working with them.  Will do business again.  Highly recommend.", "pics": null, "resp": {"time": 1607345172220, "text": "J, we appreciate your kind review. We will pass this on to guys at Guntersville. Thank You"}, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "116890761167814408466", "name": "larry day", "time": 1623573144804, "rating": 3.0, "text": "Drove all the way from Boaz to be told they did not have a part I was told they had over the phone before driving all the way out there . Not cool.", "pics": null, "resp": {"time": 1623675983391, "text": "Larry, we are sorry for this mistake on our part. We hope you will give is an opportunity to earn your business back. Please email us at codum@agproco.com and let us know how we can do that. Thank You"}, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "107829954316495151059", "name": "Eric Campbell", "time": 1621898516624, "rating": 4.0, "text": "Great bunch of folks. Very helpful.", "pics": null, "resp": {"time": 1622056835158, "text": "Eric, we appreciate your kind words and great review. Thank You"}, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "107803066774942181245", "name": "John Hoenge", "time": 1616301173406, "rating": 5.0, "text": "Nathan was very helpful and knowledgeable we are going back to buy a tractor when we move to Alabama in May.", "pics": null, "resp": {"time": 1616525552824, "text": "John, we appreciate your kind words and your great review. Thank You"}, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "110317083864350674955", "name": "Charles Kirkland", "time": 1625263191945, "rating": 5.0, "text": "Had all the parts I needed for my 645Z\nmower deck.", "pics": null, "resp": {"time": 1625767159423, "text": "Charles, we appreciate your great review. Thank You"}, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "107427318925055987951", "name": "Kade Harris", "time": 1607459588679, "rating": 1.0, "text": "2020 teryx 16k dollar machine 30 hours garage kept cutting out when driving. Took it in to be fixed under warranty! No can do 380 dollar bill later I got the machine back! So much for 3 year warranty.", "pics": null, "resp": {"time": 1607460388642, "text": "Kade we are very sorry for this situation. Please email us with more details of your situation so we can look into it. Email us at codum@agproco.com. Thanks"}, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "107847892220683022679", "name": "Tana Broadbent", "time": 1527284225418, "rating": 5.0, "text": "Ag-Pro repaired and serviced my mower last fall, and I only got one good mowing in before the winter.  Tomorrow was to be my first spring mowing, and I got out my battery charger to set it on overnight.  Didn't need it!  It started right up.  Not bad for a 20 year old John Deere.  My mower will live with me but will only \"vacation\" at Ag-Pro!  Thanks, guys!", "pics": null, "resp": null, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "117739677476580190234", "name": "JDandGinger Evans", "time": 1591800858739, "rating": 5.0, "text": "Everyone was polite and informative.", "pics": null, "resp": {"time": 1591814059330, "text": "JD and Ginger , We appreciate your great review. Thank you very much!"}, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "105885908920375792360", "name": "Mandy Duvall (K&G Metals)", "time": 1519240304027, "rating": 5.0, "text": "I was so pleased with Ag-Pro They knew exactly what I needed and the staff was very professional and friendly! I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "105716266549259072856", "name": "J Crow", "time": 1551899551107, "rating": 5.0, "text": "Very helpful with finding the part we needed", "pics": null, "resp": {"time": 1551970406049, "text": "We are so happy to hear you had a good experience at our parts counter. Thanks for choosing Ag-Pro and thanks for the review!"}, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "101268361536092002629", "name": "Moses Reyez", "time": 1533780254792, "rating": 5.0, "text": "Really good people good business help full and understanding", "pics": null, "resp": null, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "114106968846531269125", "name": "K&S Kearns", "time": 1563305235983, "rating": 5.0, "text": "The parts girl went I of her way to help me.", "pics": null, "resp": {"time": 1563306647699, "text": "Happy to hear. Thanks for the review!"}, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "105712231263277548868", "name": "Jason Bryant", "time": 1578584468352, "rating": 5.0, "text": "Great store!", "pics": null, "resp": {"time": 1578574822644, "text": "Jason, thanks for the great review!"}, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "110753901749551012219", "name": "Doug Eby", "time": 1562770945424, "rating": 5.0, "text": "Helpful and quick service", "pics": null, "resp": {"time": 1562772908971, "text": "Doug, thanks for the review!"}, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "106338023141251610160", "name": "Tim Olsen", "time": 1604887465824, "rating": 1.0, "text": "Bought a New John Deere 350X last December, the seat cracked and they refuse to warranty it with less then 29hrs, and garage kept. John Deere warranty is not worth the paper written on.", "pics": null, "resp": {"time": 1604927060503, "text": "Tim, we are sorry for your poor experience. Please email us at codum@agproco.com and let us know how we can rectify the situation."}, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "101853962772387163415", "name": "Cheryl Yancey", "time": 1566598863118, "rating": 5.0, "text": "We bought a Mule.", "pics": null, "resp": {"time": 1566825025205, "text": "Cheryl, we hope that y’all enjoy your new gator and we can’t wait to see y’all again. Thanks for the review!"}, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "105231885594996485413", "name": "Jason Jackson", "time": 1548265811151, "rating": 5.0, "text": "Great to work with", "pics": null, "resp": null, "gmap_id": "0x8889f9239edfdde7:0xef78b7f1b040fbb8"}
{"user_id": "105482056986265930304", "name": "Lanorah Whisenhunt", "time": 1575377126961, "rating": 5.0, "text": "Service was great!! We love our tractor! Thanks so much!!", "pics": null, "resp": null, "gmap_id": "0x889a84282752800b:0x6f4767d0fe0249f5"}
{"user_id": "107121296574391847801", "name": "Ronald Sanks", "time": 1518652928058, "rating": 5.0, "text": "I wouldn't shop for farm equipment anywhere else. Nice guy , works hard has built a top notch business. A trust worthy guy.", "pics": null, "resp": null, "gmap_id": "0x889a84282752800b:0x6f4767d0fe0249f5"}
{"user_id": "101865787781171566142", "name": "Rotimi Onaghise", "time": 1592698783840, "rating": 1.0, "text": "Worst service company I’ve had to deal with in my life.\nNo good customer service.\nTook my tractor out there for repairs and the job was not done correctly. After 2 weeks of picking tractor and without any use it would not start up again. Jumped tractor and took it back to them to fix again. Fixed for the second time and they billed me for the second time. I complained and they got mad but I took my equipment away but equipment has not worked correctly since I took it away.", "pics": null, "resp": null, "gmap_id": "0x888dec74d6292ccf:0x5bf480382221a89d"}
{"user_id": "107178296872588083002", "name": "Melissa Greeson (SHUNSHINE)", "time": 1612313137536, "rating": 5.0, "text": "Lots to be Questioned ?", "pics": null, "resp": null, "gmap_id": "0x888dec74d6292ccf:0x5bf480382221a89d"}
{"user_id": "104609855760161229780", "name": "Donald Ferguson", "time": 1547983714066, "rating": 5.0, "text": "Got to be the most helpful tractor and lawn mower business in the state. They really try to pLease.", "pics": null, "resp": null, "gmap_id": "0x888dec74d6292ccf:0x5bf480382221a89d"}
{"user_id": "112808917868690186596", "name": "Melissa Greeson", "time": 1533750581425, "rating": 5.0, "text": "Well I think those mechanics are the BEST ALL ROUND  !", "pics": null, "resp": null, "gmap_id": "0x888dec74d6292ccf:0x5bf480382221a89d"}
{"user_id": "108299024953160290456", "name": "Sharon Holmes", "time": 1537474991239, "rating": 5.0, "text": "We bought tractor parts and have been doing business with them for 13 years.\nThey are always prompt to help you.", "pics": null, "resp": null, "gmap_id": "0x888dec74d6292ccf:0x5bf480382221a89d"}
{"user_id": "110200612847528290694", "name": "James Little", "time": 1529026603218, "rating": 5.0, "text": "good courteous helpful, people customer satisfaction number 1", "pics": null, "resp": null, "gmap_id": "0x888dec74d6292ccf:0x5bf480382221a89d"}
{"user_id": "110452552388204268865", "name": "Theddrea Jackson", "time": 1581257183058, "rating": 5.0, "text": "Awesome  the staff is outstanding", "pics": null, "resp": null, "gmap_id": "0x888dec74d6292ccf:0x5bf480382221a89d"}
{"user_id": "113744110094190913202", "name": "Lisa Greeson", "time": 1502829943094, "rating": 5.0, "text": "Repaired my tractor back to running like new", "pics": null, "resp": null, "gmap_id": "0x888dec74d6292ccf:0x5bf480382221a89d"}
{"user_id": "109661122110733179868", "name": "Ann Billings", "time": 1513628800677, "rating": 5.0, "text": "Very happy with their service.", "pics": null, "resp": null, "gmap_id": "0x888dec74d6292ccf:0x5bf480382221a89d"}
{"user_id": "108527878219451472432", "name": "chayris folmar", "time": 1549470706796, "rating": 5.0, "text": "You can find just about everything you need and friendly people", "pics": null, "resp": null, "gmap_id": "0x888dec74d6292ccf:0x5bf480382221a89d"}
{"user_id": "110670755539274814933", "name": "Wesley Mccafferty", "time": 1621989281309, "rating": 2.0, "text": "This place is no longer the location for Warrior Tractor Company.", "pics": null, "resp": null, "gmap_id": "0x88628ba4a9442dcd:0xe1ef71c61a8d407b"}
{"user_id": "107417237407074755060", "name": "Bradley Carwile", "time": 1594305837234, "rating": 5.0, "text": "New Grayson Carter and Son Contracting location", "pics": null, "resp": null, "gmap_id": "0x88628ba4a9442dcd:0xe1ef71c61a8d407b"}
{"user_id": "104547137208826963769", "name": "Jay Bolton", "time": 1554023712126, "rating": 4.0, "text": "Nice friendly helpful service.", "pics": null, "resp": null, "gmap_id": "0x88628ba4a9442dcd:0xe1ef71c61a8d407b"}
{"user_id": "108062893508860136211", "name": "Kim Kimbrough", "time": 1540406652206, "rating": 5.0, "text": "Great people", "pics": null, "resp": null, "gmap_id": "0x88628ba4a9442dcd:0xe1ef71c61a8d407b"}
{"user_id": "117473254734011158611", "name": "Tami Lou", "time": 1619720819052, "rating": 1.0, "text": "Took lawn mower in for repair. I told them what was wrong but while they had it just look it over. I was told it needed a lot of work which I knew. So I went to get mower of course it started raining. So the first girl I dealt with was nice the second wasn't. Really no one up there was helpfully. When they finally brought my lawn mower it washy even put back together. I couldn't believe it. I was even planning on buying a mower. But they was just so ugly. I had to come home and put lawn mower back together. Don't recommend them at all from my experience.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "115623797327140997722", "name": "Brittany Nan", "time": 1619710739903, "rating": 1.0, "text": "Went to have my lawn mower fixed they said it was pretty much unfixable so told me to come pick it up. Get there and they did not have my lawn mower put back together all the way. Two things needed to be bolted back on. Then when I called to complain about them. The front desk girl got mad and said there is nothing I can do and she hung up on me. I was set to buy a lawn mower from them so glad they showed their true colors before I did.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "104386341314402442505", "name": "Christy Cook", "time": 1619408874009, "rating": 5.0, "text": "Very Nice Place,  very sweet workers! Definitely go back and recommend to others", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "114136098961671959682", "name": "Dylan Daring", "time": 1617324239505, "rating": 5.0, "text": "Fantastic prices and service. Professional, great place to buy", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "108010648996613059729", "name": "Bob Edwards", "time": 1602698821171, "rating": 4.0, "text": "Two thumbs up! I recently purchased a New Solis tractor from these guys and the service was amazing, the tractor and equipment was delivered ASAP and when I called back a few weeks later the  sales team was helpful and reassuring that they were only a phone call or a short 2 hour drive away in need be to rectify any problems I might have. P.S. I will put the Solis tractor up against any brand I tested and at a much better price.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "117654253449947994574", "name": "Jonathan Jones", "time": 1606265753252, "rating": 5.0, "text": "Purchased 2 dirt bikes! Very very easy people to deal with. They have some of the best pricing around!", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "109619879871181020695", "name": "Heather E", "time": 1600457572962, "rating": 5.0, "text": "These guys were AWESOME! I just moved here and not only did they hook me up with a lawnmower, but they also pointed me in the right direction for numerous other contractors for things I needed done. Super friendly and helpful!!!", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "101549652033093565300", "name": "Joe Haydock", "time": 1600968800407, "rating": 5.0, "text": "Awesome experience.. they hello you work the experience of finding a vehicle for the need.\n\nThese guys are awesome and work with everyone I watched come through the door!!!!", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "109953984770856381022", "name": "Donald Reding", "time": 1611862333890, "rating": 4.0, "text": "Great place to do business.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "114897459368240836191", "name": "Jay Shipp", "time": 1609437459081, "rating": 5.0, "text": "It was amazing they are good 👍", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "102261478708804137419", "name": "Marilyn Collier", "time": 1591811796372, "rating": 5.0, "text": "Awesome Folks,got a Great Deal on a Cub Cadet zero turn. Super Friendly and very helpful people!!! 😀😀😀😀", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "109613999584235336334", "name": "Gun Wench", "time": 1584496076906, "rating": 1.0, "text": "I'd give them no stars. I called and asked if they could look at and fix my ATV. The guy on the phone said bring it in he'd fix it up for me. When I got there I was told they only work on stuff they've sold.  They wouldn't even look at it because I didn't buy it from them.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "108402375250696105679", "name": "Anthony Hyatt", "time": 1588705169729, "rating": 1.0, "text": "One star means negative one (-1). Stagnant Waters sold me a NEW Toro mower with a torn seat last year. I showed them the tear when they delivered it. They said they would replace it with a new one but they never did! The owner won't even return my calls! If you're looking for a place that won't service what they sell and will lie to you, Stagnant Waters is the PLACE!", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "109623157812364990776", "name": "Michael Coley", "time": 1550366192633, "rating": 2.0, "text": "I bought a utility trailer from them. The trailer I bought was their top of the line fully tubed model. The trailer itself is great and is really sturdy. The problem that I have is with the paint job. They don’t use primer and I doubt they do any prep before they spray it. I have a 3 month old trailer with rust all over it. So now I will have to sand and paint all the rust as long as I own it. It just sucks having to do that when you pay $1300 for a 12 foot trailer and get this result.", "pics": null, "resp": {"time": 1550522497131, "text": "Mr. Coley, Muddy Waters is a dealer of Native Trailers LLC, we have sent your info over to the manufacture they are the ones that would supply the warranty on the trailer. We are sorry for the inconvenience . If you do not hear from them please give us a call."}, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "117204046498058032475", "name": "Timothy sides", "time": 1570575866338, "rating": 5.0, "text": "It is a good place to buy used autos and mowers, and small tractors and trailers. The people are very nice.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "102009651810929288238", "name": "Levi Ogle", "time": 1565999571566, "rating": 2.0, "text": "Buying a trailer from this company was easy. Getting what you paid for what like pulling teeth. The advertisement of gate folds flat is not true, it does not. The welding job is absolutely terrible. The available options they have should not be offered cause they do a half job adding them. The \"conduit\" used is just PVC. My wiring connect looked like it came off a 10 year old trailer. When i went to pick it up, the gate latches only engaged on one side. Had to leave it there to be fixed.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "114175283282030905323", "name": "Roger Hill", "time": 1617049101142, "rating": 4.0, "text": "Good people", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "111222949521552927576", "name": "Raymond Key", "time": 1598550257808, "rating": 1.0, "text": "I recently purchased a building from Muddy Waters at $213 down on the day of purchase I asked the sales representative to send out someone to see if they could bring the building up my drive and set the building up the sales rep Said no that they had a machine they could put the building anywhere on day of delivery they could not deliver and set up building , when I asked for a refund they said no and referred me to the manufacturer in return they manufacture said no to a refund and also told me you had to have a 14 foot wide path and fairly level ground to set the building up which is something Muddy Waters didn't tell me, and it will also cost for  another delivery I get a monthly government disability check and don't have money to burn an lose and screwed out of 213 dollars", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "112047006297574103153", "name": "Michael Hurlburt", "time": 1580256293808, "rating": 5.0, "text": "Fantastic people they bend over backwards to make sure you get the best deal", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "100961420421915828871", "name": "Tommy Harris", "time": 1553040303287, "rating": 5.0, "text": "Had a great experience.. Great price.. friendly  and professional service. Would highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "104978924891409544965", "name": "DANIEL Terry", "time": 1569422150806, "rating": 1.0, "text": "Took my older bass boat up there for a tune up , ran rough before I took it but did run .over 300 bucks later with new battery and plugs it won't start at all . Battery that was installed is way to small for one and on top of that now I have a boat I sunk $300+ in won't start at all and the battery is junk. NEVER AGAIN. THATS JUST THE MARINE SERVICE SIDE ! Everyone was really good on pleasing me up till I got home and tryed cranking the boat and it turns over maybe 8 times and dies so I just called it a loss I guess😒guess most of the positive reviews are family and friends. Talk to real customers if you know any. They will let you know to do business elsewhere. CROOKS BY THE BOOKS", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "111067138095657120089", "name": "Rob Richardson", "time": 1588376201273, "rating": 5.0, "text": "Very friendly people, and great quality equipment.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "110678064507898834455", "name": "Troy Potts", "time": 1569694704518, "rating": 5.0, "text": "Great place to get tire work done and very friendly people", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "112833404476856746306", "name": "Dale Frederick", "time": 1552086068001, "rating": 5.0, "text": "Super wonderful people very helpful knowledgeable prices are extremely good  highly recommend them", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "105503163131721582122", "name": "Wesley Crunk", "time": 1529968051107, "rating": 5.0, "text": "Great people, great deals! This is a local business worth supporting for your outdoor needs or a good used car!", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "112998364180912878335", "name": "Anthony", "time": 1536447604608, "rating": 5.0, "text": "Great place to get your outdoor needs. Good people, friendly an great service.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "101685026933365854656", "name": "Gavin Foster", "time": 1535244722199, "rating": 5.0, "text": "Best purchase of a used vehicle I've had. Great employees and great service", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "112327901503403682457", "name": "Kristin Watson", "time": 1462201469868, "rating": 1.0, "text": "My husband and I bought not just one but two little four wheelers for our kids,   I had been shopping g around d we got a fair price for them.  The reason for my one star, NO CUSTOMER SERVICE!  My kids wore down the brakes, I don't think they were hard on them, or our brake light is working.  We called while they were under warranty.  It took two weeks to get back about parts.  At that point the parts were out of warranty.  So we paid for them and shipping.  We got the wrong parts.  I even took picture the second time.  We got parts that look similar but size was wrong, would not work.  So Mailed them back along w one of the brake pads off the 4 wheeler and tracked them..  I found out that the package was delivered Thursday 4/28 .  I called and was told spouse was sick bit she sent picture to manufacture.  No call that we got them, they are working on it,, nothing.  This has been the way we have been treated.  You have to chase them down to get answers.  I asked to be called by the end of the week, with answers and a solution!  I haven't been able to ride our 4 wheelers since early March!  It's May 2nd!  It's not like we got these for free and didn't pay for replacement parts or shipping!", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "106851997751050804875", "name": "Martin Hall", "time": 1502244941472, "rating": 5.0, "text": "I bought a Utility Trailer from Muddy Waters today and it's the best built trailer I've ever seen. Instead of using angle iron, like everybody else, the use all tubing to built their trailers. Then on top of that, they were hundreds of dollars cheaper than anyone else. They also sell ATVs and tractors", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "101716964388592533349", "name": "heath Johnson", "time": 1558111970094, "rating": 5.0, "text": "ItThey was very friendly and put dirtbike tire on an my son still riding", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "101893151314903170009", "name": "Bethany Phillips", "time": 1558647037863, "rating": 5.0, "text": "Super Friendly Knowledgeable Folks  Highly recommend", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "115946072538472959038", "name": "Jamie Young", "time": 1551743823551, "rating": 5.0, "text": "Great customer service and affordable prices", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "109848582717781141753", "name": "keith davis", "time": 1538503266204, "rating": 5.0, "text": "Awesome selection and service. If you need lawn equipment of any kind this is THE PLACE!!", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "114257068215379972069", "name": "Barron Latta", "time": 1533506278358, "rating": 5.0, "text": "Bought a trailer there. Great little trailer.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "114545053332452484331", "name": "Thomas Flint", "time": 1522190097513, "rating": 5.0, "text": "Friendly, helpful service...would definitely recommend to others", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "114324110790693778957", "name": "dustin terry", "time": 1535573192861, "rating": 1.0, "text": "Tires was reasonably priced but lock for my lug nut came up missing", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "112134100719766047707", "name": "Vernon Legg", "time": 1527095640534, "rating": 5.0, "text": "Great people great products very nice people", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "109587033123628032888", "name": "Jp 396", "time": 1523533849861, "rating": 5.0, "text": "Great place too by tiers and  other products", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "113752572701075996446", "name": "Jeff Willingham", "time": 1559052745423, "rating": 1.0, "text": "Bought 4 wheeler that was rebuilt and it started smoking and blowing oil out exhaust", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "103492681013837805172", "name": "Dan Booth", "time": 1449690373401, "rating": 5.0, "text": "Well built trailers, best price around, hands down. Will be buying more from them.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "112261636685818343808", "name": "Nicole Priebe Strickland", "time": 1523648260734, "rating": 5.0, "text": "Great place. !!nice people.!! good deals.!!", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "116614552175015155663", "name": "Mitch Montgomery", "time": 1516234291011, "rating": 3.0, "text": "Did not buy anything", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "100236834385411215823", "name": "Robin Bell", "time": 1479561374965, "rating": 5.0, "text": "Friendly service", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "113535859318216791044", "name": "Crickett Lynne Turrentine", "time": 1456520229274, "rating": 3.0, "text": "Used car dealer, makes things right on vehicle sold", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "102385151143528441975", "name": "Joshua Goodwin", "time": 1616765395649, "rating": 1.0, "text": "The guys at the parts counter were dismissive and seemed uninterested in helping me find a solution for my problem. Would not listen to my explanation of what I needed before saying they don't have what I need. Wanting a simple pto driveshaft that I knew I would need to cut down and they just acted as though there was no way they could help. This place is good for nothing except talking down to new customers and making people feel like they are not needed for sales.. would give zero stars if I could.", "pics": null, "resp": {"time": 1616766054403, "text": "Hi Joshua -- we are very sorry to hear about your experience at our Leighton location. Customer service is very important to us and we are going to forward these comments to management, but we'd like to hear more about your experience so we can make it right. Please contact our Customer Service Manager directly at 256-233-0339."}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "113480974701173586906", "name": "Monica Petoskey", "time": 1594826688360, "rating": 5.0, "text": "The parts people are super nice. Helpful to a lady. 😁 Just a good ol' country place! My husband was impressed with their service department... fast and reasonably priced.", "pics": null, "resp": {"time": 1595251921303, "text": "Thank you!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "108021835553663551572", "name": "tim tanner", "time": 1605388382494, "rating": 5.0, "text": "Great selection & very knowledgeable staff!\nI highly recommend!", "pics": null, "resp": {"time": 1605823244397, "text": "Thank you!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "111208250454679739244", "name": "B wd", "time": 1594989666912, "rating": 2.0, "text": "Sales and parts are great to work with. I would recommend anyone looking for a Deere to visit this store. Service......not so great. Not my business, but if it was I think I'd prioritize a little better and treat everyone the same no matter how large of an operation they run or their family name. If someone brings equipment to be worked on, there's most likely a problem. They could at least check and try to show a customer why they don't think there's a problem instead of blaming the customer or claiming misuse or talking behind the customer's back. I'm disappointed with what has been my dealer for 10 + years.", "pics": null, "resp": {"time": 1595252010300, "text": "Hi B wd - thanks for taking the time to leave us a review, your feedback is important to us. It appears our service department missed the mark on your last visit and we'd love to learn more. If willing, please call our Customer Service Manager at 256-233-0339 so we understand how to make it right and continue to earn your business. We look forward to hearing from you."}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "104337527500515295262", "name": "Julie Nguyen Orlando", "time": 1592674592041, "rating": 5.0, "text": "Just got a great deal on a 1023E from Patrick! Everyone was friendly and went out of their way to help us! Great buying experience, I highly recommend them!", "pics": null, "resp": {"time": 1593102196120, "text": "Thank you for sharing your experience!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "109953984770856381022", "name": "Donald Reding", "time": 1611862371819, "rating": 4.0, "text": "Great place to do business", "pics": null, "resp": {"time": 1583162061047, "text": "Thank you!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "114998345499363054832", "name": "Gary Bolton", "time": 1618974963168, "rating": 4.0, "text": "Friendly service", "pics": null, "resp": {"time": 1620053878732, "text": "Thank you!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "106744669936750849237", "name": "Larry Nix", "time": 1617930844981, "rating": 5.0, "text": "Always helpful", "pics": null, "resp": {"time": 1618493268892, "text": "Thank you!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "106290327482514126232", "name": "Benito Garcia", "time": 1552505601414, "rating": 5.0, "text": "Fast and courteous. Quick to unload John Deere attachments.. Trucker approved 💯!!!", "pics": null, "resp": {"time": 1552656196648, "text": "Thank you!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "106264323323600846027", "name": "John Collum", "time": 1554553758438, "rating": 1.0, "text": "It was close to closing time I understand that,but your salesman actually referred another company.", "pics": null, "resp": {"time": 1554731248756, "text": "Hi John -- thank you for taking the time to leave a review. Providing an exceptional customer experience is very important to us, which means we care about your feedback.\nWe are going to forward these comments to management but would love to learn a little more about your experience so we can work to make this right for you and continue to improve our customer service for existing and future customers. If you'd be willing, please contact our Customer Service Manager at 256-233-0339. We look forward to hearing from you. Thanks again."}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "105982997880577818179", "name": "Ha Ha", "time": 1522114668543, "rating": 5.0, "text": "Great place to shop for a Deere! Always busy and competitive. Can't go wrong!", "pics": null, "resp": {"time": 1522117043860, "text": "Thank you!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "110768769870752584089", "name": "Tommy", "time": 1530218964227, "rating": 5.0, "text": "Very nice place. Very friendly folks. Clean indoors. Lots of JD tractors ro choose from, lawnmowers and lawn and garden tractors also. Answered my questions with a friendly smile..", "pics": null, "resp": {"time": 1530557993221, "text": "Thank you for the compliments, we appreciate your business!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "109483225873114135367", "name": "Jimmie Hall", "time": 1538682760568, "rating": 5.0, "text": "Took my riding lawn mower in, they came out, looked, unloaded it and very polite and efficient.", "pics": null, "resp": {"time": 1539377658786, "text": "Thank you."}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "109026018380003564877", "name": "Don Marquart", "time": 1547507222929, "rating": 5.0, "text": "Always great service,only place that I buy my farm equipment at,plus service and parts.", "pics": null, "resp": {"time": 1547575596400, "text": "Thank you!!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "108146941391298321868", "name": "James Copeland", "time": 1564177645356, "rating": 5.0, "text": "Awesome service, good prices!", "pics": null, "resp": {"time": 1564418938049, "text": "Thank you!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "115148049247146750811", "name": "Mary Ellen Wells", "time": 1533961489980, "rating": 5.0, "text": "Love this place.\nThey always have what I need for my lawnmower which is a lot and very often.", "pics": null, "resp": {"time": 1534961133180, "text": "Thank you!!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "106379386698288157291", "name": "Connie Perlander", "time": 1611031912129, "rating": 5.0, "text": "Helpful", "pics": null, "resp": {"time": 1611346293304, "text": "Thank you!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "113339570374256471232", "name": "Steve Shelton", "time": 1524613103848, "rating": 5.0, "text": "Very helpful,  great place to purchase John deer parts., very friendly", "pics": null, "resp": {"time": 1525191972227, "text": "Thank you!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "116575492715539637199", "name": "Sam Jarrell", "time": 1537041859326, "rating": 5.0, "text": "Very helpful and nice people there A++", "pics": null, "resp": {"time": 1537306829805, "text": "Thank you!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "100069090106958151486", "name": "Ashley Loosier", "time": 1559320823228, "rating": 5.0, "text": "It was nice Mike is the man!", "pics": null, "resp": {"time": 1560613150314, "text": "Thank you!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "107379579284701324185", "name": "J.R.", "time": 1542412393586, "rating": 5.0, "text": "Easy to deal with friendly people", "pics": null, "resp": {"time": 1542588101382, "text": "Thank you!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "112961467497419552259", "name": "StaR Jai Yt", "time": 1564140192427, "rating": 5.0, "text": "Was great as always", "pics": null, "resp": {"time": 1564418949554, "text": "Thank you!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "104064282007656109895", "name": "Albert Pullen", "time": 1563534396362, "rating": 5.0, "text": "Nice friendly  place", "pics": null, "resp": {"time": 1564418960516, "text": "Thank you!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "109326137768144957972", "name": "Brad “Doughboy” Copeland", "time": 1537364042905, "rating": 5.0, "text": "I had to go get some parts for the boss so we can fix our pickers so we can get boss's soybeans out of the fields and Tri-Green had what we needed without having to order it and we being down for another two or three days or even a week", "pics": null, "resp": {"time": 1537370773661, "text": "Thank you Brad for your feedback!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "104547137208826963769", "name": "Jay Bolton", "time": 1533061377679, "rating": 4.0, "text": "Getting tractor worked on again for the umpteenth time for it to only have 300 hours.", "pics": null, "resp": {"time": 1533073231292, "text": "Thank you for your review!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "104138980538650105087", "name": "Brenda Abernathy", "time": 1595693323927, "rating": 2.0, "text": "No Service", "pics": null, "resp": {"time": 1595947727935, "text": "Hi Brenda - we are very sorry you had a negative experience with us. Customer service is very important to us. Please contact us directly at 256-233-0339 so we can work to make this right for you. We hope you'll consider giving us another try."}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "110908628530648032400", "name": "Thomas Burden", "time": 1528862113684, "rating": 5.0, "text": "Great people !!! Well satisfied !!!", "pics": null, "resp": {"time": 1529764797855, "text": "Thank you!"}, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "106447474549987301598", "name": "Kevin Taylor", "time": 1541005918752, "rating": 2.0, "text": "Overpriced for sure", "pics": null, "resp": null, "gmap_id": "0x887d4d19600bd6c9:0x5653be223dc66300"}
{"user_id": "104017794118878473808", "name": "Anthony Cornelius", "time": 1607203935865, "rating": 3.0, "text": "Always cool to check out all this big equipment.", "pics": null, "resp": null, "gmap_id": "0x88892f6d5440a2d3:0x6ba65114ef61fc2c"}
{"user_id": "117966561249855504285", "name": "Vincent T", "time": 1594242147778, "rating": 5.0, "text": "We stopped without a appointment when our RV displayed a check engine light. Looked into our problem almost immediately and assured us we could proceed to Pa without a issue. A hugh thank you for being so nice to us", "pics": null, "resp": {"time": 1603117799883, "text": "Vincent, thanks for the kind review. If you are ever passing through again please don't hesitate to call if you need any other service!"}, "gmap_id": "0x88892f6d5440a2d3:0x6ba65114ef61fc2c"}
{"user_id": "104278338519735115629", "name": "Leon Blanchard", "time": 1536155629843, "rating": 5.0, "text": "I Run Hot Shots From Atlanta To Alabaster Never Had A Problem..Good People.", "pics": null, "resp": null, "gmap_id": "0x88892f6d5440a2d3:0x6ba65114ef61fc2c"}
{"user_id": "108799249362336968446", "name": "Brad McCann", "time": 1509074866765, "rating": 5.0, "text": "Awesome group of people and the service is second to none.", "pics": null, "resp": null, "gmap_id": "0x88892f6d5440a2d3:0x6ba65114ef61fc2c"}
{"user_id": "104027359461985410877", "name": "Travis “TechJunkie” Martin", "time": 1471579932116, "rating": 5.0, "text": "Convenient location, friendly snf helpful staff.", "pics": null, "resp": null, "gmap_id": "0x88892f6d5440a2d3:0x6ba65114ef61fc2c"}
{"user_id": "117660045694818768995", "name": "Charles Minor", "time": 1553121751345, "rating": 5.0, "text": "It was great", "pics": null, "resp": null, "gmap_id": "0x88892f6d5440a2d3:0x6ba65114ef61fc2c"}
{"user_id": "108038741025410521932", "name": "David Shiflett", "time": 1539999953178, "rating": 4.0, "text": "Parts department is improving.", "pics": null, "resp": null, "gmap_id": "0x88892f6d5440a2d3:0x6ba65114ef61fc2c"}
{"user_id": "116105279314062472762", "name": "Kimberly Henderson", "time": 1534513726806, "rating": 4.0, "text": "Loved it", "pics": null, "resp": null, "gmap_id": "0x88892f6d5440a2d3:0x6ba65114ef61fc2c"}
{"user_id": "117712979422040706248", "name": "Mitch Jean", "time": 1616705042401, "rating": 5.0, "text": "Just bought a tractor from them. Great experience.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "101256107868308076790", "name": "Sam Donnell", "time": 1613662343846, "rating": 5.0, "text": "Fantastic experience. The staff from top to bottom was helpful, informative and patient with me. Highly recommend for all your Kubota needs.", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "111340493526643399249", "name": "George Scott", "time": 1615904258676, "rating": 5.0, "text": "Professional and Nice Sales guy. Not pushed to purchase, listened to what I was looking for and gave thorough suggestestions", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "104154767307120618012", "name": "Steven Eddy", "time": 1618540744275, "rating": 5.0, "text": "Got vicon mower parts, very good parts people.", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "112253808339159363800", "name": "Adam Lamar", "time": 1591470874390, "rating": 5.0, "text": "I took my nasty, filthy tractor in for repair. I was embarrassed a little of its condition. Maybe it was due to the repair or just what they do but my tractor got a bath and a repair! I would highly recommend Dixie Tractor. They know the definition of customer service. Very impressed with my experience there.", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "109071675366350955664", "name": "Michael Burgess", "time": 1598557047464, "rating": 5.0, "text": "Very friendly helpful and informative.", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "113793729702708009514", "name": "Raydonna Sims", "time": 1587054089985, "rating": 5.0, "text": "Fair prices, good service, and honest people.", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "110208654792426831925", "name": "Gerald Dodd", "time": 1530307412212, "rating": 5.0, "text": "Very nice courteous people, VERY knowlegable.  Helped us find the correct belt for our mower.  Great stock of hard to find parts", "pics": null, "resp": {"time": 1531399988340, "text": "Thanks for the feedback Gerald. Glad we could help."}, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "105184846847131232693", "name": "Ed Thomas", "time": 1560563805206, "rating": 5.0, "text": "Very friendly and helpfull,parts man knowes his job.", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "108172607802367429423", "name": "Craig Dodson", "time": 1462535381611, "rating": 5.0, "text": "Great place to buy from! The whole staff of people are awesome to deal with. Rocky runs a fine establishment and I wouldn't buy from any other dealership!", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "106511213160234917707", "name": "Ashley Brown", "time": 1569265746504, "rating": 5.0, "text": "I call asking for parts for a skid steer but they didnt sell them. After getting off the phone they called back with information on who could possibly have the part I needed. They went above and beyond customer service.", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "108769263297311807030", "name": "Dee Bellam", "time": 1543246938787, "rating": 5.0, "text": "Gary at the parts desk was extremely helpful and knowledgable. We'll continue buying our parts and supplies from Dixie tractor!", "pics": null, "resp": {"time": 1543267453819, "text": "Good Seeing y'all again! Thanks for your business!"}, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "108894636380705831027", "name": "Robby Culver", "time": 1522801746704, "rating": 5.0, "text": "A great place for zero turn mowers farm equipment and tractor of all sizes", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "114584218979850242983", "name": "Joe Allmon", "time": 1581121184329, "rating": 5.0, "text": "Very informative & helpful.", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "105482756761817422819", "name": "Robert Mashburn", "time": 1534706167086, "rating": 4.0, "text": "Had the part I needed in stock, great service and prices", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "108855357433176447566", "name": "Paul Scarberry", "time": 1520397364570, "rating": 5.0, "text": "Great service from sales to service dep. And parts . Coffee not bad ether.", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "117542877037314467623", "name": "Terry Willcutt", "time": 1520453641367, "rating": 5.0, "text": "Great Place Fantastic Employee's.", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "112181625453044693818", "name": "Donald Towers", "time": 1524257077372, "rating": 5.0, "text": "best place  to buy a TRACTOR or implemts", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "111906656693409348634", "name": "David Oleary", "time": 1570017349481, "rating": 2.0, "text": "Mechanics are more like shade tree mechanics", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "111732875385218351387", "name": "Dean Mangum", "time": 1527713152780, "rating": 5.0, "text": "Good and honest folks.", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "101719776765772808046", "name": "Ronald Stevens", "time": 1550641365948, "rating": 4.0, "text": "Never bought a tractor here", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "104005581658081247372", "name": "Keith West", "time": 1562883261240, "rating": 5.0, "text": "Always helpful", "pics": null, "resp": {"time": 1562885999919, "text": "Thanks Keith!"}, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "103254658915349363165", "name": "Leonard Tatro", "time": 1575688822915, "rating": 5.0, "text": "The salesman a very friendly", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "115777590324114005793", "name": "Kelly Hunter", "time": 1566650461896, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x8889cf05be305aa3:0x7e988b512af4a4a7"}
{"user_id": "107181335927389809058", "name": "James Morgan", "time": 1624662209532, "rating": 5.0, "text": "Good people friendly atmosphere and if something goes wrong with anything they stand behind their warranty with no trouble", "pics": null, "resp": null, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "111377362605536935100", "name": "Nathaniel White", "time": 1583179699446, "rating": 5.0, "text": "Great place. Good people.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMFYwiubuv9m50_b0IOxUCzeLKDoMv8a-HOj_aW=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "101107896441176315277", "name": "Terry M. Slaton", "time": 1617400376965, "rating": 5.0, "text": "I purchased my Bad Boy Mower from them in 2011 and got a really good deal.  They are friendly and helpful and I have sent two friends to their store who wanted a Bad Boy.  My deck lift actuator failed and I bought a replacement part from them today. The service was great and they provide help in answering my questions about installation of the part.  Hood place to do business.", "pics": null, "resp": null, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "115827050484664045080", "name": "Steve Roemer", "time": 1622316050105, "rating": 1.0, "text": "KRUSTER that works under the stair case needs to retire as door greeter he is horrible at sitting on his can telling a potential boat buyer its a \"\"sellers market and we ANIT GOT no Boats\"\" like never buy a boat here they don't need buiness.", "pics": null, "resp": null, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "113893567637594100627", "name": "James Sanders", "time": 1602725495020, "rating": 5.0, "text": "I ordered a starter for YM1700 on Wednesday afternoon. They shipped a new one to me and by noon the next morning it was on my tractor. Great service and unbeatable price and shipping.                  I ended up getting a complete overhaul to my YM1700. Brandon, the shop manager scheduled me a time to be there. The shop took me in and Jessie and Barry did a complete overhaul this morning and I was gone by noon. The tractor runs like a new one and looks a lot better too. All these guys are pros with a down home personality. It is great  to do business with a shop that cares about their customers. This tractor may outlast me and I may not get to see these guys much but you can be assured if I do need tractor work, this will be the place I turn to and I will recommend them to all my friends in need of their services.", "pics": null, "resp": {"time": 1602008920532, "text": "Thank you for the kind words, James!"}, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "118055280642073917404", "name": "Mike Wallace", "time": 1591135561705, "rating": 5.0, "text": "Bought a new Mahindra 4540 from them Saturday. They delivered today. Buying experience was flawless and pleasant. Dan the Tractor Man is one fine fella. If I have any nit to pick at all, is that it wasn't delivered with a full tank of fuel.\nI will be back, I have more implements to buy once I figure out what I can't live without.", "pics": null, "resp": {"time": 1591201525525, "text": "Thank you for the kind words, Mike! It was great working with you!"}, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "103941623211586658709", "name": "Tommy Harkins", "time": 1595017811822, "rating": 5.0, "text": "I had a great experience with Rob and all the guys at the Hartselle, Alabama location. They had all the parts I needed to get my Yanmar YM 1700 tractor. The Tractor is up and running like a well oil machine. Thanks guys for all your help.", "pics": null, "resp": null, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "101314589536467618861", "name": "Russell Townsend", "time": 1597430975601, "rating": 5.0, "text": "Is there a 30-minute excellent service and very courteous", "pics": null, "resp": null, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "112413281789029476218", "name": "Kim Bryant", "time": 1558353204430, "rating": 5.0, "text": "These guys and gals are great. The top notch customer service starts when you call about whatever you need. They will go above and beyond to help make your experience with them the best it can be.\nI have a Bad Boy mower that I purchased at a chain store. When I needed blades for said mower, I had just watched their commercial. I called to see if they had what I needed in stock. They were getting a shipment at that exact time.\nNormally a business will get the product on the shelf before they consider it in stock. These guys sent someone to get on the truck and find as many options for me as possible. They had every blade I could use. This was the first set of blades I had ever purchased. Instead of trying to \"sell up\", they taught me what each set was for. They wanted to make sure I was well informed on my blades. I asked them why and they said \"Knowledge about your purchase will make you a better owner, and you will take better care of it because you now have skin in the game or so they say.\"\nIf you want the full  old timey correct customer experience, Fredricks is your place. If you just want to run in and run out, they are still your place. Because next time you go in, you will remember how they helped you to have a speedy checkout.\nYou will NOT be dissatisfied. This place is built for the experience.", "pics": null, "resp": {"time": 1558361151951, "text": "Wow, Kim. Thank you very much for your kind words! We'll always do what we can to serve our customers. It's a pleasure doing business with you!"}, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "104074544799322948893", "name": "Nathan Whitfield", "time": 1573854849443, "rating": 5.0, "text": "Great service and good little yanmar tractors", "pics": null, "resp": {"time": 1574096245847, "text": "Thank you, Nathan!"}, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "106957398111817535649", "name": "yahi garcia", "time": 1565636638686, "rating": 1.0, "text": "Rude people I called and asked to speak to someone in spanish there response was this is not mexico Obviosly not A simple we dont have anyone that speaks spanish would of been perfectly fine I am not one to write anything bad on reviews but just because of how rude this person was i decided to share it never will i order from these people again", "pics": null, "resp": {"time": 1565646802389, "text": "Hi Heidy,\n\nI'm very sorry for the employee's response. It was totally uncalled for and it's completely inexcusable. We don't condone this type of behavior at all.\n\nIf I can be of any assistance at all, please feel free to reach out to me at admin@fredricksequipment.com. I would be happy to personally handle your parts requests, if you'd like."}, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "110461610340285910068", "name": "barbara malone", "time": 1554708433280, "rating": 4.0, "text": "Very helpful staff! Makes you feel welcomed.", "pics": null, "resp": {"time": 1554814552608, "text": "Thank you for the kind words, Barbara!"}, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "116422110666260974251", "name": "Clinton Russell", "time": 1578659480916, "rating": 5.0, "text": "They got all the parts you ever need for\nYanmar tractors", "pics": null, "resp": {"time": 1578671104812, "text": "Thank you, Clinton!"}, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "115434124428723322208", "name": "Cody Depew", "time": 1552857198013, "rating": 5.0, "text": "Got my tractor from there and have great conserts", "pics": null, "resp": {"time": 1553000386762, "text": "Thank you for the rating, Cody!"}, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "111960556796907948907", "name": "Garey Shedd", "time": 1556918251392, "rating": 5.0, "text": "Nice people they treat u wright", "pics": null, "resp": {"time": 1557154844332, "text": "Thanks Gary!"}, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "113106397663093351383", "name": "kbharrell gm", "time": 1593652694541, "rating": 5.0, "text": "Great food,fast", "pics": null, "resp": null, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "113350671704514039538", "name": "rodney vanalstine", "time": 1527485760548, "rating": 5.0, "text": "They are always ready and willing and able to help do what needs doing.", "pics": null, "resp": {"time": 1554814567960, "text": "Thank you for the kind words, Rodney!"}, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "108304843962252533712", "name": "Gerald Crofutt", "time": 1533582497752, "rating": 3.0, "text": "I went to their maintenance side thinking the sold John Deere parts as that's where Google said on my search.  They asked the maintenance dept. and they said no.  So I accomplished nothing, but not their fault.", "pics": null, "resp": {"time": 1533587428310, "text": "Hi Gerald,\n\nThanks for your feedback. Unfortunately, we cannot provide parts for many John Deere products due to OEM blocks placed on those parts. However, we do offer parts for many John Deere tractors with Yanmar engines, such as the John Deere 750, 850, 950, and 1050. We appreciate your visit and hope we can serve you in the future!"}, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "103994723945035795209", "name": "Kay Farley", "time": 1533434769489, "rating": 5.0, "text": "Had exactly what we needed and affordable", "pics": null, "resp": {"time": 1533587448774, "text": "Thank you Kay."}, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "111276568480660336148", "name": "J Carter", "time": 1531157236867, "rating": 5.0, "text": "Firsr Class the best PERIOD. Thanks 4 all", "pics": null, "resp": {"time": 1553000411533, "text": "Thank you!"}, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "113909132152242798330", "name": "tim N michele Davis", "time": 1525519925558, "rating": 5.0, "text": "Good people to deal with", "pics": null, "resp": null, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "101719776765772808046", "name": "Ronald Stevens", "time": 1576269684208, "rating": 5.0, "text": "A lot of tractors", "pics": null, "resp": null, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "112356973833227714412", "name": "Glenn Byrum", "time": 1508717132100, "rating": 5.0, "text": "Awesome place for fun.", "pics": null, "resp": null, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "110837922708648505560", "name": "Nancy Barnett", "time": 1546464487810, "rating": 4.0, "text": "Has alot of choice", "pics": null, "resp": {"time": 1553000399437, "text": "Thank you Nancy!"}, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "104660193972100495136", "name": "James Owen", "time": 1546824011988, "rating": 1.0, "text": "Ripoff", "pics": null, "resp": {"time": 1537478139724, "text": "Hi Mr. Owen,\n\nWe're always looking for feedback. Please feel free to contact me at admin@fredricksequipment.com to let me know what we did, or didn't do, to earn your rating. I look forward to your reply."}, "gmap_id": "0x88627fffca80af61:0x1bd8553e787b022f"}
{"user_id": "117149794453900585681", "name": "Mandy Brown", "time": 1619889772887, "rating": 5.0, "text": "Always friendly, helpful and willing to go the extra mile to leave their customers happy.", "pics": null, "resp": null, "gmap_id": "0x889a681ec83610ff:0x9bf2587357ffd049"}
{"user_id": "107085331793529624250", "name": "Vladimir Ouvarov", "time": 1602024582124, "rating": 5.0, "text": "Nice, polite.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPbQXvL7TUiQXmd2pkzw31VbecLE8W52Lq0Bv_B=w150-h150-k-no-p"]}], "resp": {"time": 1603113620900, "text": "Thank you!"}, "gmap_id": "0x889a681ec83610ff:0x9bf2587357ffd049"}
{"user_id": "104823080354961699231", "name": "Ray Blackwell", "time": 1611796212119, "rating": 5.0, "text": "Best place for any kinda of equipment that you need to complete any job with.\nBest yellow iron made in my opinion.", "pics": null, "resp": {"time": 1611840551748, "text": "Hey Ray, thanks for the great review! 💪"}, "gmap_id": "0x889a681ec83610ff:0x9bf2587357ffd049"}
{"user_id": "109083717459292195400", "name": "Thomas Lawrence", "time": 1609551291138, "rating": 5.0, "text": "Have been here several times and everyone is always helpful and knowledgeable! Highly recommended. T. Law", "pics": null, "resp": {"time": 1609771848631, "text": "Thank you for your kind words! We look forward to serving you again in the future!"}, "gmap_id": "0x889a681ec83610ff:0x9bf2587357ffd049"}
{"user_id": "118162148206786564250", "name": "Vanessa", "time": 1486241647479, "rating": 4.0, "text": "Competitive pricing on rentals and friendly staff. I'm glad we have a local Caterpillar location nearby.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPwZ-o8eJlcDaR2IJXcKuUov8N9B6stJD54E6MQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOTfDIgVbnvBjknki12cXgOtTRheY63_XFUgjIZ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a681ec83610ff:0x9bf2587357ffd049"}
{"user_id": "110924236981351568400", "name": "Robert Jackson", "time": 1596132375122, "rating": 5.0, "text": "Technician Jamie Haynes is very helpful he has been doing our generator work for years!", "pics": null, "resp": {"time": 1603113606733, "text": "Thank you for your review, we will pass along your kind words to Jamie!"}, "gmap_id": "0x889a681ec83610ff:0x9bf2587357ffd049"}
{"user_id": "103949278389123008441", "name": "Kenneth Johnson", "time": 1621540869373, "rating": 5.0, "text": "Great service and", "pics": null, "resp": {"time": 1621604438207, "text": "Thanks for the 5 stars!"}, "gmap_id": "0x889a681ec83610ff:0x9bf2587357ffd049"}
{"user_id": "115572762839480795657", "name": "Jeff Sylvester", "time": 1590631142750, "rating": 5.0, "text": "Good people, great service .", "pics": null, "resp": null, "gmap_id": "0x889a681ec83610ff:0x9bf2587357ffd049"}
{"user_id": "115353082130504028494", "name": "Kraig Wolters", "time": 1551308029337, "rating": 5.0, "text": "It's a great place to do business.", "pics": null, "resp": null, "gmap_id": "0x889a681ec83610ff:0x9bf2587357ffd049"}
{"user_id": "101225473457451230993", "name": "james McCall", "time": 1532357762990, "rating": 1.0, "text": "Went in for oil leak and told me turbo went out. After 2wk wait. Truck was fixed they said with no leaks. The next morning truck was still leaking and took to freightliner and there telling me turbo is out again and truck is leaking in 4 spots.", "pics": null, "resp": null, "gmap_id": "0x889a681ec83610ff:0x9bf2587357ffd049"}
{"user_id": "106904778607650862576", "name": "Ernest Bentley", "time": 1497823492076, "rating": 5.0, "text": "Best place for CAT/ Mitsubishi parts/repair.", "pics": null, "resp": null, "gmap_id": "0x889a681ec83610ff:0x9bf2587357ffd049"}
{"user_id": "107250903337800284446", "name": "Ethan Buckalew", "time": 1555100966105, "rating": 5.0, "text": "Amazing place very nice people", "pics": null, "resp": null, "gmap_id": "0x889a681ec83610ff:0x9bf2587357ffd049"}
{"user_id": "110610543379558848939", "name": "Alan Rester", "time": 1519084303446, "rating": 5.0, "text": "Parts  department  very knowledgeable", "pics": null, "resp": null, "gmap_id": "0x889a681ec83610ff:0x9bf2587357ffd049"}
{"user_id": "116678181041368015031", "name": "Laura C", "time": 1545133442628, "rating": 5.0, "text": "Good  service", "pics": null, "resp": null, "gmap_id": "0x889a681ec83610ff:0x9bf2587357ffd049"}
{"user_id": "109430935868785156680", "name": "Daryl Coleman", "time": 1619218086416, "rating": 1.0, "text": "To start off I’m a paraplegic so I asked the salesman to come outside to show me some of the lawnmowers since mine died today. It started off ok then I guess I was asking too many questions. He was very inattentive and came off as quite rude. Needless to say...I will never do business with them ever!", "pics": null, "resp": null, "gmap_id": "0x888991b117fbbb65:0x8e338ef4c72419fb"}
{"user_id": "107339846946560119475", "name": "RONALD LEVERETT", "time": 1591991892720, "rating": 5.0, "text": "It is an awesome place to do business. Everyone I came in contact with was very nice and made my purchase a pleasant experience. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888991b117fbbb65:0x8e338ef4c72419fb"}
{"user_id": "112144355024779264148", "name": "Annie Herod", "time": 1568753343467, "rating": 2.0, "text": "Have to search out someone for any service. The least helpful I’ve ever experienced. We will haul to Albertville next time.", "pics": null, "resp": null, "gmap_id": "0x888991b117fbbb65:0x8e338ef4c72419fb"}
{"user_id": "105013421010640776749", "name": "Aubrey Scruggs", "time": 1594413133543, "rating": 5.0, "text": "Great place and very easy to deal with", "pics": null, "resp": null, "gmap_id": "0x888991b117fbbb65:0x8e338ef4c72419fb"}
{"user_id": "103880526258341476889", "name": "Rainey DownSouth", "time": 1521076550405, "rating": 5.0, "text": "Friendly and helpful staff. I have bought three tractors here and have always had great service.", "pics": null, "resp": null, "gmap_id": "0x888991b117fbbb65:0x8e338ef4c72419fb"}
{"user_id": "116932230839172833498", "name": "Chris Mahan", "time": 1496447486488, "rating": 4.0, "text": "Great place for all your farming and yard work needs.", "pics": null, "resp": null, "gmap_id": "0x888991b117fbbb65:0x8e338ef4c72419fb"}
{"user_id": "110062832143053314789", "name": "Charles Woodsman", "time": 1619814932753, "rating": 5.0, "text": "The real deal price was good fixed and gone by next day looked on web of parts prices almost same great people oil cooler and pre cooler replaced could have bin same day gone but had to wait for pre cooler to be shipped in there is a post on here says that they were sitting around if so was because there fast and great at what they do no bs like other places I have bin labor was spot on no wasted time I’ll go there any time hard to find honest people any more and took me to hotel and return for free again bill was less than expected office ladies were very nice too😊 keep up the good work god be with you and yours !! 👍", "pics": null, "resp": null, "gmap_id": "0x888603865c16cdd3:0x42b6bd2ff890ee05"}
{"user_id": "105664235142914807624", "name": "Terrance Maxwell", "time": 1622804173729, "rating": 5.0, "text": "I made the call on Tuesday and, Ray told me to bring it in first thing Wednesday morning.I really didn't know what was going onwith the truck other than the leak that was coming from the chunk on front axle on the drives.i found out after they ran a diagnosis on it they said that the engine was running to cool so they did an overhead on it and it had a bad injector and thermostat on.I was out of the shop around 3pm Thursday.", "pics": null, "resp": {"time": 1622823251964, "text": "Hey Terrance, we are so glad you had a great experience and we could help you get back on the road. Please let us know if we can ever help in the future!"}, "gmap_id": "0x888603865c16cdd3:0x42b6bd2ff890ee05"}
{"user_id": "101476054726662885849", "name": "Barbara Champion", "time": 1560876714275, "rating": 4.0, "text": "Fast on service call. Friendly, well mannered polite employees. Big & busy truck repair shop. All of their service call trucks were busy out on calls so they sent someone from their shop to help get us back on the road since we broke down on the exit to their shop (EX-68)Just 3 miles off of I-20 Very satisfied with their work🙂", "pics": null, "resp": null, "gmap_id": "0x888603865c16cdd3:0x42b6bd2ff890ee05"}
{"user_id": "107425193742624997161", "name": "Aaron Bell", "time": 1564456327212, "rating": 3.0, "text": "It was crowded with equipment that needed to have work done to them, also I saw a group of mechanicas sitting around when they should've been working especially when the company is charging a$100and more an hour.", "pics": null, "resp": null, "gmap_id": "0x888603865c16cdd3:0x42b6bd2ff890ee05"}
{"user_id": "100137636866782187786", "name": "Amelia Hiott", "time": 1481333175903, "rating": 1.0, "text": "i work with my husband and we had to go in that shop for repairs..all i can say is DON'T take ur deisel there if u value ur truck!! i have never wrote a review b4..never!! but i had to tell people about our experience there..both times there they let kids work on our deisel..they do not know what they are doing!! plus a 2 r 3 hour job takes all day for them so they can justify a huge bill. the work we got done we ended up havn to go to another shop to repair what work they did..i have been on the truck with my hubby for 5 yrs now and we have had major to minor work done all over the u.s. but this place beat all i have ever seen..those workers goofed off and took more breaks than actually working..and they were all young!!! my husband had to tell that kid workn on our truck what to do bcause he didnt know what he was doing..Lord help that place!!", "pics": null, "resp": null, "gmap_id": "0x888603865c16cdd3:0x42b6bd2ff890ee05"}
{"user_id": "111393536847146957341", "name": "John LaGrone", "time": 1548337966130, "rating": 4.0, "text": "Affordable Decks hi there Great", "pics": null, "resp": null, "gmap_id": "0x888603865c16cdd3:0x42b6bd2ff890ee05"}
{"user_id": "103696411596572281378", "name": "clifton dawson", "time": 1551374200180, "rating": 5.0, "text": "Excellent", "pics": null, "resp": null, "gmap_id": "0x888603865c16cdd3:0x42b6bd2ff890ee05"}
{"user_id": "116108041120345962489", "name": "Earnest Gann", "time": 1546539075355, "rating": 4.0, "text": "Friendly and helpful", "pics": null, "resp": null, "gmap_id": "0x888603865c16cdd3:0x42b6bd2ff890ee05"}
{"user_id": "102350696594774876275", "name": "70velle2", "time": 1620770558718, "rating": 5.0, "text": "Nice selection, even during covid times.  People were as nice as they could be.  Bush hog bh216 was about 500 cheaper than anywhere else I could find it.  Thank you!", "pics": null, "resp": null, "gmap_id": "0x88895d4d5ef2556b:0x6e7c1bca4a7a6e54"}
{"user_id": "107746498919822446275", "name": "Bob Bob", "time": 1599238653080, "rating": 5.0, "text": "Best place in state, was in and out...sold me what I wanted and did not pressure.john and team were professional and I couldn't be happier...thanks again irby...love my new l3301", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPwrS7t9lxsdDPWX-kufin19APRiU9f62WjPxyU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMCciCaqGse_oPjGzgmklUZX2XRb8-iySdOEaXJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOeWIx_InxNa6vff4dJYDOsurv-ikQU6__nspMa=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88895d4d5ef2556b:0x6e7c1bca4a7a6e54"}
{"user_id": "105712231263277548868", "name": "Jason Bryant", "time": 1613619467512, "rating": 5.0, "text": "Great selection of tractors, and implements. Friendly owner, and reasonable prices!", "pics": null, "resp": null, "gmap_id": "0x88895d4d5ef2556b:0x6e7c1bca4a7a6e54"}
{"user_id": "106291224540413628091", "name": "Billy Lynam", "time": 1596584966006, "rating": 5.0, "text": "John and his wife are great folks. I was looking for a smaller tractor and he had what I needed. Had an issue with the clutch on it right after I got it, John personally came to my home and got it, took it to the Kubota dealer and is having it fixed. He apologized and didn't hesitate to take ownership and take care of it. If you need a good used tractor, Irby is the place.", "pics": null, "resp": null, "gmap_id": "0x88895d4d5ef2556b:0x6e7c1bca4a7a6e54"}
{"user_id": "117720295253033491919", "name": "Jason Garrett", "time": 1612301785161, "rating": 5.0, "text": "Friendly people. Great service!", "pics": null, "resp": null, "gmap_id": "0x88895d4d5ef2556b:0x6e7c1bca4a7a6e54"}
{"user_id": "106744644030547805437", "name": "Daniel Bryant", "time": 1593202105958, "rating": 5.0, "text": "Some of the best service we have had! Very friendly and really good customer service. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x88895d4d5ef2556b:0x6e7c1bca4a7a6e54"}
{"user_id": "114535137234983554975", "name": "Kenneth Kendrick", "time": 1607644185722, "rating": 5.0, "text": "very friendly and courteous great prices on equipment and very knowledgeable have all different  attachments bush hog brand and and great stock a d selection would choose them over a tone else when I need another tractor or implement", "pics": null, "resp": null, "gmap_id": "0x88895d4d5ef2556b:0x6e7c1bca4a7a6e54"}
{"user_id": "116303718551791161950", "name": "Pat Mason", "time": 1596975759577, "rating": 5.0, "text": "Nice company to deal with.", "pics": null, "resp": null, "gmap_id": "0x88895d4d5ef2556b:0x6e7c1bca4a7a6e54"}
{"user_id": "115343084610118786066", "name": "Andy Byers", "time": 1517148807862, "rating": 5.0, "text": "Awesome people to work with.  Best used tractors I've seen.  Top notch!!", "pics": null, "resp": null, "gmap_id": "0x88895d4d5ef2556b:0x6e7c1bca4a7a6e54"}
{"user_id": "113418995309988217398", "name": "Thomas Hayden", "time": 1544648971007, "rating": 5.0, "text": "Helpful, professional,courteous, pleasure to visit in my search for new tractor. We may be making a deal on a John Deere soon.", "pics": null, "resp": null, "gmap_id": "0x88895d4d5ef2556b:0x6e7c1bca4a7a6e54"}
{"user_id": "103576538282196067509", "name": "Joe Prinzinger", "time": 1539384994557, "rating": 5.0, "text": "Great place, nice people and fair prices", "pics": null, "resp": null, "gmap_id": "0x88895d4d5ef2556b:0x6e7c1bca4a7a6e54"}
{"user_id": "111156820468147722885", "name": "Kevin Frangopoolos", "time": 1516326823656, "rating": 5.0, "text": "Great customer service.", "pics": null, "resp": null, "gmap_id": "0x88895d4d5ef2556b:0x6e7c1bca4a7a6e54"}
{"user_id": "100454557151502170651", "name": "Shana Smith", "time": 1507777397358, "rating": 5.0, "text": "Very friendly,  easy to work with.", "pics": null, "resp": null, "gmap_id": "0x88895d4d5ef2556b:0x6e7c1bca4a7a6e54"}
{"user_id": "113200211252845864420", "name": "ERIC BARNES", "time": 1618425936608, "rating": 1.0, "text": "I understand that people need to make a living, and that businesses have overhead insurance and so forth.  That is why when I purchased my tractor last year I did research for several months before purchasing my Massey Ferguson.  I looked at their longevity, handling, safety, reliability, company name, ability to get parts and the service department in case I was not able to repair the problem.  After checking Foothills, Banisters, Ag-Pro and Snead,  I finally settled on Haney tractor and equipment, Athens, Alabama.  I  drove 2 hours in each direction just to test drive my model and put a down payment. After, my model came in with my 20 foot trailer & 3 implements, I again, drove back to Athens, Alabama to complete the transaction and bring my new package home.  I was very disappointed with Foothills.  Even though I an less than 10 miles away, the purchase did not seem right (comfortable).\nToday, a year later, the same still holds true.  I decided to give Foothills another chance at my business. I am looking to purchase a rotary cutter.  Of course I checked prices on the internet in my area.  Everything from $1,000, $1,100, $1,200 for the 1204 Titan 2021 year model.  When I called,  the salesman would not identify himself.  I had to ask him his name, Daniel, and I introduced, myself.   I informed him what I was looking to purchase and was informed that he had new ones.  After checking his price in his book he told me the price was $1,400 plus tax.  I informed him that, that was a little costly, since others had the item listed at a different price.  He told me to go buy it from them.  Seeing that we were not going to make a sale, we both hung up.  I try to give as much business as possible to local and small business.  People do not always agree, however, there is no need to be disrespectfully.  I do not need a response or reply.  Good Luck in in your endeavors.", "pics": null, "resp": {"time": 1618428597307, "text": "We’re so very sorry you feel your recent experience with us was anything less than ideal, but do seriously appreciate your feedback. I assure you this is not the level of service we strive to provide here at Foothills Tractor and will take considerable measures to ensure it doesn’t happen again.\n\nIn Foothills defense, all of our old prices implements were restored long ago, with increase in supply demand we have seen as much as a 15% increase in materials and steel. This leading to higher priced units. We could have sold you a 4’ cutter in January for $1000, unfortunately we cannot do that currently as we would be selling for less than our cost and losing money. We cannot afford to stay in business by losing revenue.\n\nAs the General Manager, David Seals, I would love to speak to you directly and see if we can provide you a 5-star level of service from now forward. Please contact me directly at 256-927-4487 ext 108"}, "gmap_id": "0x888a4a51836a6435:0x290c82e6effb61fb"}
{"user_id": "104372564833752747494", "name": "Lennie Roland", "time": 1610047609425, "rating": 5.0, "text": "Great place to buy your next tractor.  Very friendly and professional personnel.  Found perfect tractor for our needs at great price.  Highly recommend.", "pics": null, "resp": {"time": 1611448095858, "text": "Thank you Lennie! We appreciate you and thank you for allowing us the opportunity to earn your business!!"}, "gmap_id": "0x888a4a51836a6435:0x290c82e6effb61fb"}
{"user_id": "105239112977458014984", "name": "Tommy Smith", "time": 1611431617633, "rating": 5.0, "text": "We are well pleased with our tractor and our brand new Sparten lawn mower. Also, the salesmen was very friendly and are willing to help in any way they can. Thank you all at Foothills Tractor in Alexandria, Al.", "pics": null, "resp": {"time": 1611448055572, "text": "Thank you for trusting in us and allowing us to earn your business!!"}, "gmap_id": "0x888a4a51836a6435:0x290c82e6effb61fb"}
{"user_id": "117878441480967696390", "name": "Vinny DeGrado", "time": 1614663003760, "rating": 5.0, "text": "Great people to deal with. Very knowledgeable about the machines that they sell.", "pics": null, "resp": null, "gmap_id": "0x888a4a51836a6435:0x290c82e6effb61fb"}
{"user_id": "104642928538063832849", "name": "Dena Good", "time": 1612364303923, "rating": 5.0, "text": "Such sweet and understanding people  .thank u all for all that you do for all of us  and all of the hard work you do to get our equipment  back to us", "pics": null, "resp": null, "gmap_id": "0x888a4a51836a6435:0x290c82e6effb61fb"}
{"user_id": "116360763903501209036", "name": "Willie Kitchens", "time": 1623530960536, "rating": 5.0, "text": "Nice people to do business with.", "pics": null, "resp": null, "gmap_id": "0x888a4a51836a6435:0x290c82e6effb61fb"}
{"user_id": "110286112723755238500", "name": "William Morgan", "time": 1592263186638, "rating": 5.0, "text": "Always helpful and friendly staff try their best to get the parts that I need for my dad's lawn mower", "pics": null, "resp": null, "gmap_id": "0x888a4a51836a6435:0x290c82e6effb61fb"}
{"user_id": "106572489690176409716", "name": "David Batson", "time": 1596668892323, "rating": 5.0, "text": "Well, my nephew and I looked long and hard for a small tracker with front loader and backhoe, and these folks came to the rescue with an  Emax 20s HST. It works for all of my work around my house and then some. Thx guys.", "pics": null, "resp": {"time": 1596674452564, "text": "Thank you for trusting us with your business!"}, "gmap_id": "0x888a4a51836a6435:0x290c82e6effb61fb"}
{"user_id": "116849203862272705977", "name": "steven hanvey", "time": 1588716269120, "rating": 5.0, "text": "Great people who understand and help any way they can.", "pics": null, "resp": {"time": 1588720010293, "text": "Thank you Steven! We appreciate your business!"}, "gmap_id": "0x888a4a51836a6435:0x290c82e6effb61fb"}
{"user_id": "105586847806185956918", "name": "Blake Tippett", "time": 1554467716665, "rating": 5.0, "text": "A HUGE thanks to Adam and the Foothills staff. I called at opening,  talked over financing option,  gave some information and within an hour I had a callback, was approved and able to pick my mower up the same day! Adam was awesome, very knowledgeable and professional!", "pics": null, "resp": null, "gmap_id": "0x888a4a51836a6435:0x290c82e6effb61fb"}
{"user_id": "109160445640265152711", "name": "Russ Moore", "time": 1557831416713, "rating": 4.0, "text": "They have a wide selection of farm tractors and equipment. One of the best brands available. They are a little pricey but Mahindra is better equipment than most.", "pics": null, "resp": null, "gmap_id": "0x888a4a51836a6435:0x290c82e6effb61fb"}
{"user_id": "115296904119141653158", "name": "Justin Wade", "time": 1564248013843, "rating": 5.0, "text": "A++ EXCELLENT CUSTOMER SERVICE!!! I purchased an Ariens lawnmower from Home Depot one year ago, that needed warranty work. After talking to ariens.  I called around looking for an authorized ariens servicer. After talking to two other locations and reading reviews,  I chose Foothills tractor.  WOW! Im so glad that I did! Hunter was very helpful, providing excellent customer service and a quick turn around on the repair! We will definitely be back!", "pics": null, "resp": null, "gmap_id": "0x888a4a51836a6435:0x290c82e6effb61fb"}
{"user_id": "103448859073354425211", "name": "Maggie Hardin", "time": 1525368053453, "rating": 5.0, "text": "Adam is so knowledgeable and helpful. He makes doing business easy.", "pics": null, "resp": null, "gmap_id": "0x888a4a51836a6435:0x290c82e6effb61fb"}
{"user_id": "103205644238796609270", "name": "Leon Johnston", "time": 1526174629740, "rating": 5.0, "text": "Honest, good people. Zeff is awesome. Such a good man.", "pics": null, "resp": null, "gmap_id": "0x888a4a51836a6435:0x290c82e6effb61fb"}
{"user_id": "115717726085209213696", "name": "Joseph Albright", "time": 1527336151566, "rating": 5.0, "text": "Good selection of equipment and knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x888a4a51836a6435:0x290c82e6effb61fb"}
{"user_id": "116189121165792198807", "name": "Jonathon Steele", "time": 1553388239184, "rating": 5.0, "text": "Excellent experience.", "pics": null, "resp": null, "gmap_id": "0x888a4a51836a6435:0x290c82e6effb61fb"}
{"user_id": "106251511293341970899", "name": "beardenjim", "time": 1575516921574, "rating": 5.0, "text": "Nice people", "pics": null, "resp": null, "gmap_id": "0x888a4a51836a6435:0x290c82e6effb61fb"}
{"user_id": "117270898998660651793", "name": "Christopher Fletcher", "time": 1623215012689, "rating": 5.0, "text": "(Translated by Google) Great fkn fkn\n\n(Original)\nGreat fkn fkn", "pics": null, "resp": null, "gmap_id": "0x888a4a51836a6435:0x290c82e6effb61fb"}
{"user_id": "104896544685462931526", "name": "Jason Smith", "time": 1622267312031, "rating": 5.0, "text": "Went needing parts for a old but still great mower. Parts wasnt in computer but the guy pulled books and cross references and truly went above and beyond what he had to just to help dont remember his name but was a young very polite and very knowledgeable guy. Very good visit", "pics": null, "resp": {"time": 1622643304200, "text": "Jason, we appreciate your kind words and great review. Thank You"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "101549453748890582400", "name": "Walter Williams", "time": 1614214809479, "rating": 5.0, "text": "Had the pleasure of buying a blower from Tyler today. Commensurate professional who was able to secure me a spectacular deal on a Stihl BR800 CE. His knowledge and expertise of equipment was unmatched. Would seek to do business with Tyler and the team at Ag-Pro Gadsden again! Customer service far surpasses the competition!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNmdf_Wu6GlL8a1SrA7U27tMcje4eCfD9an3q2u=w150-h150-k-no-p"]}], "resp": {"time": 1617196360850, "text": "Thanks for the great review and for choosing Ag-Pro, Walter!"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "107920230325609673226", "name": "Oneal Gilliland", "time": 1622224550220, "rating": 5.0, "text": "John deere what can I say. Love green and yellow.", "pics": null, "resp": {"time": 1622643430327, "text": "Oneal, we appreciate your kind words and great review. Thank You"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "105966136003585481671", "name": "David Spratling", "time": 1599965232544, "rating": 3.0, "text": "People upfront real friendly service department chainsaws been in there over three weeks never received a call called several times on hold forever chainsaw still not fixed so they had to get in touch with steel that was Tuesday the third took it in on 5 August", "pics": null, "resp": {"time": 1600095955178, "text": "David, we are very sorry!  We will have the store contact you ASAP. We appreciate you letting us know."}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "100768161663221507003", "name": "lee varner", "time": 1607050550155, "rating": 5.0, "text": "Great people to deal with courteous and knowledgeable", "pics": null, "resp": {"time": 1607086263569, "text": "Lee, we appreciate your kind words and great review. Thank You"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "118440905672722964270", "name": "57chevybeast", "time": 1598304547177, "rating": 5.0, "text": "Great service department nice guys fixed my mower last minute for me", "pics": null, "resp": {"time": 1598359507663, "text": "We appreciate your kind review. Thank You Very Much!"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "110072794463095824455", "name": "colt gregory", "time": 1587398954537, "rating": 5.0, "text": "The only place to purchase your Sthil and Deere as well as parts. The Guys at the parts desk will always find what you need to get back going.\nThe only downside is service department but it seems to be improving.\nKeep up the Great work!!", "pics": null, "resp": {"time": 1587409672521, "text": "Thanks for the great review, Colt!"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "105571162520539637488", "name": "Grim Blackfire", "time": 1599948222899, "rating": 3.0, "text": "It's a pretty good place for quality tools and stuff", "pics": null, "resp": {"time": 1600096005386, "text": "Aaron, we appreciate your review. Please email us at codum@agproco.com and let us know how we can improve."}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "108719190317290916054", "name": "sinbadicus", "time": 1599347129220, "rating": 5.0, "text": "Awesome people very helpful", "pics": null, "resp": {"time": 1599516515644, "text": "Thank You Very Much"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "105133517194704017954", "name": "Brian Snell", "time": 1527891256446, "rating": 5.0, "text": "I took my X350 by to ask about mowing deck alignment and these guys were AWESOME! Not only did they adjust my deck, but they showed me about the detachable hose attachment and greased the front axles. All with a smile. They really have the RIGHT ATTITUDE when it comes to customer service. Thanks!", "pics": null, "resp": null, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "117151626004923320787", "name": "Sabrina Parker", "time": 1566056501174, "rating": 5.0, "text": "The.guy in the parts dept knows what you need and is always friendly!", "pics": null, "resp": {"time": 1566221609893, "text": "Sabrina, thanks for the review!"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "103947141873404263936", "name": "Kenneth Hudson", "time": 1560816272615, "rating": 4.0, "text": "Nice helpful people, good product at a fair price. I do wish they would work on their greeting skills..", "pics": null, "resp": {"time": 1560863365297, "text": "Thanks for the review, Kenneth. We will work on that!"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "101949983056301052223", "name": "Michael Finley", "time": 1567744643082, "rating": 1.0, "text": "I took my weed eater in for service, they said it'd be ready in a couple days. Three weeks later I went to get it fixed or not. It was fixed with a new carborator to the tune of 103$ then I bring it home and it's idle is way too high, seems it wasn't tested.", "pics": null, "resp": {"time": 1567779764292, "text": "Michael, we have notified the GM and he will be reaching out to solve this idle problem. Please let us know if we can do anything else for you!"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "103547838486709365564", "name": "Danny Clark", "time": 1605757112045, "rating": 5.0, "text": "The best", "pics": null, "resp": {"time": 1605815405167, "text": "Danny, we appreciate your great review. Thank You"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "107694216665476071043", "name": "Shelton Morrow", "time": 1587407660494, "rating": 1.0, "text": "Stood around 16 minutes and left after no one would wait on me", "pics": null, "resp": {"time": 1587409647156, "text": "Shelton, we are very sorry you had a negative experience with us. We'd love to be able to help you. Please email leoff@agproco.com with information regarding your needs. Thank you!"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "108538124060306963007", "name": "Connie Kimble", "time": 1574712838138, "rating": 5.0, "text": "Good prices.outstanding service", "pics": null, "resp": {"time": 1574783503585, "text": "Connie, thanks for the great review!"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "117266939268571069101", "name": "Rick Hester", "time": 1558482809150, "rating": 5.0, "text": "Had the part I needed in stock for fair price.", "pics": null, "resp": {"time": 1558529177047, "text": "Thanks for the review, Rick!"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "115635132325404518946", "name": "Fred Brow", "time": 1535895245860, "rating": 5.0, "text": "Purchased a 2016 Used Gravely 252 Proturn mower. Was worth the 8 hr round trip .  Sales Rep Megan Green is Awesome. Verry customer service driven. Thanks for the Wow experience!", "pics": null, "resp": {"time": 1536766685072, "text": "We are glad you had a great experience with us, Fred. Thank you for allowing us to serve you!"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "105712231263277548868", "name": "Jason Bryant", "time": 1591035345850, "rating": 5.0, "text": "Great location, friendly staff", "pics": null, "resp": {"time": 1591195988053, "text": "Jason , Thank you for great review."}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "113883074667735342978", "name": "Danny Hancock", "time": 1562168152377, "rating": 5.0, "text": "Always eager to give advice,and answer questions.Great team!!!!😎😎😎😎 need more like them!!!", "pics": null, "resp": {"time": 1562169017527, "text": "Thanks for the free review, Danny!"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "114212404705325896002", "name": "matthew roddenberry", "time": 1600637709152, "rating": 1.0, "text": "Some employees need training!!!", "pics": null, "resp": {"time": 1600691598902, "text": "Matthew, We are sorry for your bad experience. Would you email us at codum@agproco.com and tell us more about your experience? Thank You"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "103565405550668491598", "name": "Jonathan Rickard", "time": 1536019680696, "rating": 5.0, "text": "Great place to go for steel products or parts and also John Deere and alot cheaper than working man rental", "pics": null, "resp": {"time": 1536766642412, "text": "We appreciate you and your review, John-- thank you!"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "106557981959566411249", "name": "C Taylor", "time": 1505597503538, "rating": 5.0, "text": "We bought our Zeroturn from Agpro 6 months ago. Good and honest people.  Mower is performing as expected. No complaints with the service department either. They go  above and beyond. We will be back when it's time for tractor.", "pics": null, "resp": null, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "117815554808719814099", "name": "Patricia Pinkston", "time": 1528059220996, "rating": 1.0, "text": "Used lawn mower 2 times. Making noice in mowing deck  mechanic said nothing wrong  manager said pulley bad from manufacturers  said ordered part  and should be ready Tuesday. Mechanic said today nobody told him anything wrong. Still sitting right where it was.   3 weeks now and grass knee high at our house.   Needless to say I do not recommend Ag Pro in Gadsden  bad service 10,000.00 dollar lawn mower still can't mow grass.. Ok so today. Still no mower. \"In shop\"  now can be 3 different things wrong. Checking all 3. What happened to bad pulley and part already ordered?? Okay. Still have our mower and no word on how long it will be  they did bring a loaner so we could now grass  maybe since they are keeping it so long they will make the payments??  7 weeks and counting.....", "pics": null, "resp": null, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "110194608254608679468", "name": "Keith Marbut", "time": 1585502408779, "rating": 5.0, "text": "All parts and service for John Deere mowers and tractors.", "pics": null, "resp": {"time": 1588344581477, "text": "Thanks for the great review, Keith!"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "114106968846531269125", "name": "K&S Kearns", "time": 1557857557309, "rating": 5.0, "text": "Friendly staff and great service department.", "pics": null, "resp": {"time": 1557858495499, "text": "Thanks for the review!"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "103360054213608306609", "name": "Robert Amberson", "time": 1536709372517, "rating": 5.0, "text": "Great people there to help you with what you need and a great place to go", "pics": null, "resp": {"time": 1536766541283, "text": "Thank you, Robert! We appreciate your five star review."}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "109214926063852070592", "name": "Dj Head Rattle", "time": 1507670560951, "rating": 5.0, "text": "Good service. Down to earth people. They know there product!", "pics": null, "resp": null, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "113141920140897445838", "name": "Wayne Martin", "time": 1539047851660, "rating": 4.0, "text": "Saints be real good place good products just a little expensive", "pics": null, "resp": null, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "105440833931194515524", "name": "Blake chappell", "time": 1530042336683, "rating": 5.0, "text": "Great place to get all your John Deere needs.", "pics": null, "resp": null, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "109892177910399451835", "name": "Tommy Jackson", "time": 1534446770294, "rating": 5.0, "text": "A great place to shop for John Deere products.", "pics": null, "resp": null, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "108972301114602777502", "name": "BroBledsoe", "time": 1552756012282, "rating": 5.0, "text": "Always great help and service, way to go me", "pics": null, "resp": {"time": 1552916530341, "text": "BroBledsoe, thanks for the review"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "116901424023740854178", "name": "Henry Mcfarland", "time": 1528566696894, "rating": 5.0, "text": "the staff was very helpful and we got what we needed thanks", "pics": null, "resp": null, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "110222008105909824803", "name": "Jerri Whitcomb", "time": 1536706429488, "rating": 5.0, "text": "They did a fantastic job on my yard", "pics": null, "resp": {"time": 1536766585137, "text": "We appreciate you and your five star review, Jerri. Thank you!"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "113649257246786003055", "name": "Chris B", "time": 1555541498496, "rating": 1.0, "text": "Not a single person would acknowledge my existence.", "pics": null, "resp": {"time": 1555504489274, "text": "Chris, we are sorry this happened. Will you please email info@agproco.com and provide us more information about your experience?"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "110815465289741062669", "name": "Bobby Hooks", "time": 1532629342067, "rating": 4.0, "text": "The guy was nice at the counter.", "pics": null, "resp": null, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "116894724969231494295", "name": "Drew Harcrow", "time": 1553104969254, "rating": 4.0, "text": "Helpful and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "109020580308557529343", "name": "Cassie Morgan", "time": 1508598664519, "rating": 5.0, "text": "Awesome place with awesome people and prices!", "pics": null, "resp": null, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "103267918890608179063", "name": "Hal Scoggins", "time": 1547699730214, "rating": 4.0, "text": "They are the john Deere  dealer for the Gadsden area", "pics": null, "resp": {"time": 1547650899687, "text": "Hal, thanks for choosing Ag-Pro and thanks for the review!"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "109551599104831292882", "name": "Stallion 33", "time": 1558839925429, "rating": 4.0, "text": "Get your john der here!", "pics": null, "resp": {"time": 1558962865382, "text": "Stallion 33, thanks for the review!"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "109020580308557529343", "name": "Cassie Morgan", "time": 1508598664519, "rating": 5.0, "text": "Awesome place with awesome people and prices!", "pics": null, "resp": null, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "108211985684814337795", "name": "Glen Morton", "time": 1531953218080, "rating": 5.0, "text": "Nice and friendly service", "pics": null, "resp": null, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "107358002313911599602", "name": "allen Henry", "time": 1522242411879, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "101331256480287322355", "name": "Rickey Armstrong", "time": 1583249745786, "rating": 5.0, "text": "Great!", "pics": null, "resp": {"time": 1583336815579, "text": "Rickey, thanks for the great review!"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "111529254924347242404", "name": "Mc Roddenberry", "time": 1539450669044, "rating": 4.0, "text": "Good people", "pics": null, "resp": null, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "109160445640265152711", "name": "Russ Moore", "time": 1530707945136, "rating": 5.0, "text": "Great bunch of guys", "pics": null, "resp": null, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "111902399550273882520", "name": "Tommy Hollaway", "time": 1521903173530, "rating": 4.0, "text": "They friendly and don't pressure you into buying anything", "pics": null, "resp": null, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "113862057544561039855", "name": "Daniel Duke", "time": 1524511012286, "rating": 5.0, "text": "Fast friendly service", "pics": null, "resp": null, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "104708551943592885331", "name": "Jorge A Sandoval", "time": 1555231024756, "rating": 5.0, "text": "(Translated by Google) Very good\n\n(Original)\nMuy bueno", "pics": null, "resp": {"time": 1555335479769, "text": "Jorge, thanks for choosing Ag-Pro and thanks for the review!"}, "gmap_id": "0x888a3c3d7ea6a029:0xbd24871fcadcfebc"}
{"user_id": "101495852196603336873", "name": "Robbie Tidwell", "time": 1559239616594, "rating": 5.0, "text": "My tractor went in the middle of cutting hay the Friday before Memorial Day.  Norman and the Management went beyond the call of duty to provide parts and service to get me going.  What Norman did will not be forgotten, great man and great service.  Thankful we still have people like Norman.", "pics": null, "resp": {"time": 1574349743245, "text": "I relayed this message to Norman and it made his day!  Thanks for sharing this review and we hope to see you soon!"}, "gmap_id": "0x887d5870e99a6599:0x3b31ece75f6bf91a"}
{"user_id": "115203190069168073842", "name": "H Wayne Orr", "time": 1587688157089, "rating": 5.0, "text": "Selling Kubota parts for less and very helpful.", "pics": null, "resp": {"time": 1587737441546, "text": "Thank you, we appreciate your business and your kind words."}, "gmap_id": "0x887d5870e99a6599:0x3b31ece75f6bf91a"}
{"user_id": "108199169982075784671", "name": "MO Mules", "time": 1581293749636, "rating": 1.0, "text": "Not very nice.  Expect to pay in full for anything they order in. Lack of trust that you will buy it.  Expect to be out of pocket when they put something together wrong and it needs new parts when its brand new.", "pics": null, "resp": {"time": 1581345272757, "text": "I'm sorry you had a issue, wish we could have spoke about it in person. We ask people to pay for items we order, because we have to pay for them. If you have an issue I would love to discuss it, call me at 256-332-0356 and maybe we can fix your issue.\n\nBryan Scott"}, "gmap_id": "0x887d5870e99a6599:0x3b31ece75f6bf91a"}
{"user_id": "114660395188774028353", "name": "Jack Brooks", "time": 1614614210847, "rating": 5.0, "text": "i like tracors", "pics": null, "resp": {"time": 1614615565256, "text": "Thank you, Jack.  We like tractors too and it is great to have you as a customer!"}, "gmap_id": "0x887d5870e99a6599:0x3b31ece75f6bf91a"}
{"user_id": "100072936280794459095", "name": "Randy Knight", "time": 1530582904921, "rating": 5.0, "text": "Excellent customer service!  Norman in parts took the time to ensure he ordered the correct part and went the extra mile to get my part to me when it arrived. Strongly recommend!", "pics": null, "resp": null, "gmap_id": "0x887d5870e99a6599:0x3b31ece75f6bf91a"}
{"user_id": "109493391634335397208", "name": "Joel Stephenson", "time": 1537097744677, "rating": 5.0, "text": "These are great folks to do business with!  Thank you for the great service after the sale!", "pics": null, "resp": null, "gmap_id": "0x887d5870e99a6599:0x3b31ece75f6bf91a"}
{"user_id": "112120942361091165203", "name": "William McMullan", "time": 1532227566348, "rating": 4.0, "text": "Good service on our Kabota ATV's.", "pics": null, "resp": null, "gmap_id": "0x887d5870e99a6599:0x3b31ece75f6bf91a"}
{"user_id": "107955128821841506605", "name": "Timothy Campbell", "time": 1567022138050, "rating": 4.0, "text": "Nice friendly people", "pics": null, "resp": null, "gmap_id": "0x887d5870e99a6599:0x3b31ece75f6bf91a"}
{"user_id": "113922843512374293156", "name": "Danny Terrell", "time": 1534800302551, "rating": 5.0, "text": "Nice and friendly service", "pics": null, "resp": null, "gmap_id": "0x887d5870e99a6599:0x3b31ece75f6bf91a"}
{"user_id": "116211390993188574339", "name": "James Rice", "time": 1493453397941, "rating": 5.0, "text": "The service you get is great", "pics": null, "resp": null, "gmap_id": "0x887d5870e99a6599:0x3b31ece75f6bf91a"}
{"user_id": "102624028386765526897", "name": "Shawn Albert", "time": 1612232493733, "rating": 5.0, "text": "Had a great customer service experience here. Staff went out of their way to help out. To top it off, I got a good price on a new tractor.", "pics": null, "resp": {"time": 1612995354120, "text": "Shawn, we had such an incredible time working with you to get a new tractor. It means the world to us to see this amazing review! Looking forward to seeing you again soon. -Mike M., General Manager"}, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "107759646172214415371", "name": "Tammie Cooley", "time": 1483640925937, "rating": 5.0, "text": "Great selection of tractors, lawn mowers, stihl products, Kubota products, walker mowers - they have great sales team and financing with zero down if  needed! Always willing to help find the perfect equipment you need", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN9iCBxsqxpkJDM5K1kXQlg6LiLDRTK1cqwvj9H=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP3GFip-ZxVFm0w-S5-Pkzly5Gp5MweZU_qpYn-=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "114174306382026415022", "name": "David A", "time": 1606117965216, "rating": 2.0, "text": "Helpful staff as always, but it was hard to Maintain 6'  and look for a leaf blower. Only got a two  of 5 stars because no employees were wearing a mask. Bought my Leaf blower at Ace Hardware because all their employees were wearing masks. We all have a choice on where and how to shop, I just did not get a comfortable feeling there during this pandemic. Respectfully, David ( I love my new Stihl leaf blower )", "pics": null, "resp": {"time": 1607220444824, "text": "David, we're upset to hear you didn't stick around to grab a leaf blower from us. We understand your concern with the current pandemic, and our crew is doing everything they can to adjust to state mandates and guidelines. However, this shouldn't stop us from showing you our well-known standards of great service. We hope you can return soon to chat with us about anything else you need. We'd love for a second chance. Thanks! -Mike M., General Manager"}, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "100475255317184959006", "name": "Tyler Atkisson", "time": 1619145855072, "rating": 5.0, "text": "Knowledgeable staff, quick repairs and loads of inventory", "pics": null, "resp": {"time": 1619471649098, "text": "Tyler, thank you for your kind thoughts and your review rating. Sometimes we  fall short in some ways, but we keep trying to improve as a dealership. Mike McGlothlin, General Manager."}, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "114006532238114101302", "name": "Tom Parker", "time": 1605363548674, "rating": 5.0, "text": "Great people. Service Dept is excellent. Highly recommend as a go to dealer for Kubota equipment and service.", "pics": null, "resp": {"time": 1605930235056, "text": "Tom, happy you could stop by! Looking forward to the next time you make it our way. Mike M., General Manager"}, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "114535137234983554975", "name": "Kenneth Kendrick", "time": 1620330371414, "rating": 3.0, "text": "not very friendly service.", "pics": null, "resp": {"time": 1620832569071, "text": "Kenneth, it's truly upsetting to hear about your recent visit as we always work hard to make sure you feel welcome here. If you would care to explain which department and time and circumstances of your visit it may help in our team's development moving forward . We'd love to work with you again to make things right. -Mike M., General Manager"}, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "109478213525095859516", "name": "Stephen Newell", "time": 1597672422404, "rating": 5.0, "text": "Service department was outstanding and very respectful.  Waiting to see how the repairs go and what the bill is going to be. They were going to get to work within a couple days.", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "113931121606029779880", "name": "blessed7fold", "time": 1615642851798, "rating": 1.0, "text": "Beware: These guys will jerk you around on price.", "pics": null, "resp": {"time": 1615660171431, "text": "Sorry that you feel that way. If you would like, you can contact me(Steve) and we can work to resolve the issue."}, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "113639741214648860002", "name": "jimmy smith", "time": 1599273646347, "rating": 5.0, "text": "Frendly, very helpful people at the counter.", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "117825636466499933224", "name": "wayne bigbee", "time": 1594068545904, "rating": 1.0, "text": "RUDE!!! I CALLED WITH QUESTION AND FELT SORT OF LIKE I WAS TAKING SOMEONES TIME THAT HAD BETTER ZHINGS TO DO.", "pics": null, "resp": {"time": 1594072645791, "text": "Sorry you feel that way but if its a service Question feel free to call and ask for Billy. I would be glad to help you sir."}, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "113641101222490959808", "name": "emmanuelwillis", "time": 1579219201276, "rating": 5.0, "text": "I purchased a loader from Talladega Tractor a couple months back and what can I say other than these guys are great! My salesman (John Parks) was very friendly and helpful with the loader purchasing process. The staff were very friendly as well and knowledgeable about the product. I will most certainly be driving two hours past my local Kubota dealer to Talladega Tractor for my next big Kubota purchase!", "pics": null, "resp": {"time": 1592329015981, "text": "Thank you for your business!!"}, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "107653198434141008711", "name": "Beverly Hughes", "time": 1610985719930, "rating": 5.0, "text": "Nice people!", "pics": null, "resp": {"time": 1611155769453, "text": "We're grateful for you taking a moment to show your support, Beverly! We'd love to welcome you back our way again soon. -Mike M., General Manager"}, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "112080440940868041072", "name": "redhot recycling", "time": 1566609702854, "rating": 5.0, "text": "Great experience on a used Kubota. Were also very fair on a trade. Highly recommend.", "pics": null, "resp": {"time": 1592329044639, "text": "Thank you for your business!!"}, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "110508780836587585994", "name": "Buddy Parker", "time": 1590323550618, "rating": 5.0, "text": "The Service Department provided the requested services in a fair, friendly and prompt manner.", "pics": null, "resp": {"time": 1590591486039, "text": "Thank you for using Talladega Tractor"}, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "111279273060409912923", "name": "Marcus Tillman", "time": 1597848179404, "rating": 4.0, "text": "Good people.", "pics": null, "resp": {"time": 1599259703507, "text": "Thank you for leaving this review, Marcus! Hoping we'll see you again. -Mike M., General Manager"}, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "111512667830850968382", "name": "Stacy Brand", "time": 1553398348172, "rating": 5.0, "text": "Great guys to buy from if you need a tractor, lawn mower, or chainsaw.", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "112118006702685126227", "name": "Brian Mosley", "time": 1517512188712, "rating": 5.0, "text": "Great place, amazing customer service. This crew goes above and beyond the call of duty. My Uncle and I made our first visit last year just to look around and browse the inventory, not sure if he was going to buy anything or not, really to just have something to do. From that very moment on it's like visiting family...... The good kind. Lol. Shelley, Mike, Steve, and everyone else, I thank you for your time and kindness. No matter how busy they are, they will make sure you're happy and all questions are answered.", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "103719422549390883461", "name": "Ronnie Denney", "time": 1558516070270, "rating": 4.0, "text": "Great people.  Friendly,  very helpful.", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "112118006702685126227", "name": "Brian Mosley", "time": 1517512188712, "rating": 5.0, "text": "Great place, amazing customer service. This crew goes above and beyond the call of duty. My Uncle and I made our first visit last year just to look around and browse the inventory, not sure if he was going to buy anything or not, really to just have something to do. From that very moment on it's like visiting family...... The good kind. Lol. Shelley, Mike, Steve, and everyone else, I thank you for your time and kindness. No matter how busy they are, they will make sure you're happy and all questions are answered.", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "107384402340660307253", "name": "Bobby Tidwell", "time": 1540862728497, "rating": 1.0, "text": "Not friendly act like they don't care help with your needs", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "104072589808373335119", "name": "Jerry Walton", "time": 1584237290690, "rating": 4.0, "text": "good trip.", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "112231212360950626676", "name": "Derrick Huey", "time": 1564448818755, "rating": 5.0, "text": "Good selection on Kubota tractors", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "112018964672513199062", "name": "Michael Willis", "time": 1550101631117, "rating": 5.0, "text": "They ordered the part I needed as well as loaded me a brand new tiller for my tractor.   If you are in the need for a tractor, I'd suggest you go see the guys down at Talladega tractor.", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "117566134856216050416", "name": "John Spears", "time": 1543946473693, "rating": 5.0, "text": "Can't comment on the sales crew but the service dept is outstanding! They are very knowledgeable and helpful!", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "100745682906458159599", "name": "Tommy Ivey", "time": 1509442560161, "rating": 1.0, "text": "Took cub cadet in to have plastic fan on right transmission repaired. Decided to get tune up since it would be there. Was told a week for repair and tune up. 15 days later got it back. Service manager said all work was on sale at 10% off. Tune up was $160 .  Replaced 2 spark plugs,oil,fuel  and air filter plus oil. Rediculous charge. Fan was $30 and labor for complete job wad $260.80. Once again rediculous. Car dealers are not this exspensive. On top of that first time i cut grass the left mower spindle is bad. Had no issues with it before. Big time rip off. Never go there again. Kept it 15 days for 3.26 hrs of work. No im sorry or anything. Done with them. They charge $80 an hr. to work on a lawn mower.", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "100902521484396845286", "name": "Chris East", "time": 1522816222815, "rating": 1.0, "text": "Don't think because your a loyal customer they will treat you better I learned the hard way last Thursday 3-29-18 I've bought a exmark quest zero turn mower , stihl 391 chain saw and a stihl fs 91 weed eater I was looking to buy a new exmark zero turn mower the raduis was what I was looking at first off they wouldn't budge on the price then lied and said exmark only offered 42 month financing well I know for a fact that's a lie cause I went to another place and bought one and got 48 months financing they get a bigger kick back off of 42 months sure I know I've not spent a $100,000 on a tractor but when I needed something I never hesitated to go to them and buy that will not happen again\nB&R tractor in Linville gave me a great deal on a mower and they are not the only people who sell stihl products they don't care about the person just how much money they can squeeze out of you shop around before you buy", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "111270330653642349404", "name": "Darryl Pairodocs", "time": 1378744032325, "rating": 5.0, "text": "I purchased Kubota and Case tractors from them over the last couple of years and I am very happy with the products and services offered by them. I consider myself hard to please.", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "115187010962119786495", "name": "Chastity Bonner", "time": 1554233306380, "rating": 5.0, "text": "Was awesome !!!!   Friendly staff, and very knowledgable of product !!!!", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "108226136631708981863", "name": "Larry Smith", "time": 1533260692277, "rating": 5.0, "text": "Really nice folks to deal with.", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "100696405463305074193", "name": "Chris Mauldin", "time": 1532738022449, "rating": 5.0, "text": "Great group of guys and gals.", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "115325257625228220662", "name": "Leigh Sims", "time": 1549799387818, "rating": 4.0, "text": "Got different stuff to look at when you go there every time", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "102616258699534116846", "name": "Geoff Smith", "time": 1533035436124, "rating": 5.0, "text": "Good service and parts in stock!", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "102161866352223676228", "name": "Pat Stephens", "time": 1561826676766, "rating": 1.0, "text": "Terrible, people.sitting around talking and no one offered to help. Will take business to Oxford", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "104345831425380326578", "name": "Louis Carson", "time": 1559948819128, "rating": 3.0, "text": "If you don’t buy there really do not want to help.", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "113721003845799072752", "name": "Randy Buck", "time": 1563846066935, "rating": 5.0, "text": "Right parts. First time", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "105873960536034112216", "name": "Stephanie Fugatt", "time": 1564428363435, "rating": 1.0, "text": "One word.....RUDE!!!", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "113358584866991727334", "name": "Jason Haney", "time": 1545856226857, "rating": 5.0, "text": "Friendly staff. Walked with me and answered my questions about the Tractors and equipment on their lot.", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "113594460723401628859", "name": "Edward TURNER", "time": 1562043621944, "rating": 5.0, "text": "Very good", "pics": null, "resp": {"time": 1592329032449, "text": "Thank you!!"}, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "100358193122021343715", "name": "Jerry Johnson Johnson", "time": 1537388403616, "rating": 5.0, "text": "Good equipment and service", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "105750610370651700493", "name": "Silas", "time": 1548084000533, "rating": 3.0, "text": "Costly", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "106251511293341970899", "name": "beardenjim", "time": 1533879357907, "rating": 2.0, "text": "Service department is getting to be quite rude to work with", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "116020250926826675985", "name": "Langdon Horn", "time": 1489904748854, "rating": 5.0, "text": "Service here rocks.", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "115443261071123097911", "name": "John Taktlkos", "time": 1589317800901, "rating": 5.0, "text": "(Translated by Google) What can I say Sthil Sthil and Sthil\n\n(Original)\nWhat can I say Sthil Sthil and Sthil", "pics": null, "resp": null, "gmap_id": "0x888bc376e650c165:0xae61b353eb0133b8"}
{"user_id": "105538769766890769743", "name": "Greg Pepper", "time": 1602294694277, "rating": 5.0, "text": "I bought 421Kubota zero turn lawnmower. Luke was outstanding in closing the deal deliver it with full tank gas and Kubota ball cap. Really enjoy the lawnmower and ball cap to. Give them 5 star for their service.", "pics": null, "resp": {"time": 1602509430656, "text": "Thank you for your review! We are glad you are happy. Please let us know if you need anything else!"}, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "103285216845939240066", "name": "allen tilley", "time": 1597517939955, "rating": 5.0, "text": "The people are very friendly and always very helpful.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPDUGH-zMHnkOczKqIDQfTqFEJjkOUVZIbip9Sj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOPLMG2yp8JuRFza_ZKeBaBt97Q4efjX9H_moU6=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "103635219137441008505", "name": "Ryne Gay", "time": 1611693788278, "rating": 5.0, "text": "Good to do Business with. No problems.", "pics": null, "resp": {"time": 1611694728687, "text": "Ryne, thank you for your review! We appreciate your business and are glad you're happy. Please let us know if you need anything else."}, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "107353421330233550138", "name": "David Cooley", "time": 1605745461039, "rating": 5.0, "text": "Nice Crew Quick unloading.", "pics": null, "resp": {"time": 1605905671623, "text": "Thank you for your review! Please let us know if you ever need anything."}, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "114819759648963953965", "name": "Nick Freeman", "time": 1601301006683, "rating": 5.0, "text": "I appreciate y'alls service.", "pics": null, "resp": {"time": 1601300315918, "text": "Thank you for your review! If you need anything else please let us know."}, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "107246623730912729858", "name": "David Hart", "time": 1565203738883, "rating": 5.0, "text": "Driver came to pick up our yard machine for service (we were not at home).\nIt was in the driveway covered with tarp and tied with a rope\nCame home to a neatly folded tarp and coiled  rope. Outstanding customer service!", "pics": null, "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "113336381746070238137", "name": "David Goodrow", "time": 1601391089759, "rating": 5.0, "text": "If you are looking for a tractor or just parts to repair yours, this is the place to go.", "pics": null, "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "112951116813822844328", "name": "Benito Albarran", "time": 1559083125402, "rating": 5.0, "text": "You get your   Parts quick in-and-out very professional people there I like it", "pics": null, "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "115050475612973215501", "name": "Jared Toone", "time": 1485371917775, "rating": 5.0, "text": "I recently bought a chainsaw here. They were helpful, explained everything well, got me an extended warranty for buying a six pack of Stihl oil, and the price was great. Also they were the only Stihl dealer open when I needed them. Good store.", "pics": null, "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "106392347288949616014", "name": "Matt Tibbs", "time": 1534881893403, "rating": 3.0, "text": "Good helpful people just a little pricey", "pics": null, "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "109179369158882021924", "name": "Nick Strickland", "time": 1582638007335, "rating": 5.0, "text": "Love doing business with these people", "pics": null, "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "113021628285221340211", "name": "pako Silva", "time": 1523035549653, "rating": 5.0, "text": "Best place for Chase and Kubota tractors and parts in North Alabama they also carry a full line of Stihl products and exmark mowers", "pics": null, "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "111914289390390431250", "name": "David Phillips", "time": 1527882601306, "rating": 5.0, "text": "Very friendly and knowledgeable team. Easy to work with.", "pics": null, "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "100237320718869814117", "name": "B Little", "time": 1528939462152, "rating": 5.0, "text": "Very nice friendly staff here,knowledgeable and affordable by any standard.", "pics": null, "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "109788811960180643065", "name": "REDNECK2589 REDNECK", "time": 1575050918593, "rating": 5.0, "text": "Grat place to deal with", "pics": null, "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "115797069401758963660", "name": "Trey Edwards", "time": 1556113700937, "rating": 5.0, "text": "Great folks, equkpmenr and accessories.", "pics": null, "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "112120942361091165203", "name": "William McMullan", "time": 1527984829194, "rating": 5.0, "text": "Impressed, had tractor repaired, I was expecting an expensive repair but they said it didn't need repaired and an adjustment took care of it. Saved me a ton of cash!!", "pics": null, "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "115334689089732842590", "name": "James Myrick", "time": 1527775726638, "rating": 5.0, "text": "Great sale staff, very knowledgeable and friendly. Completely satisfied", "pics": null, "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "103126893039756467027", "name": "Tim Gee", "time": 1526780216814, "rating": 5.0, "text": "Great friendly staff... Kubota mower is working perfect for me", "pics": null, "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "114131205573802801189", "name": "Mark Dennis", "time": 1519754892669, "rating": 5.0, "text": "Great service good people's.", "pics": null, "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "101707846859719270022", "name": "Matthew Pflieger", "time": 1528212109664, "rating": 5.0, "text": "Great people who work hard for the customer", "pics": null, "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "102461626746214568852", "name": "Terry L Elmore", "time": 1558053576661, "rating": 5.0, "text": "Great parts department", "pics": null, "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "118128614522659862973", "name": "Doug Deakin", "time": 1528248367323, "rating": 5.0, "text": "Excellent service.", "pics": null, "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "114882823357393334900", "name": "Michael Gabe", "time": 1526140349170, "rating": 4.0, "text": "Good people to do business with", "pics": null, "resp": null, "gmap_id": "0x886288f2d4f648df:0xf91353ff667c621f"}
{"user_id": "116808770302609833273", "name": "kim szczepanski", "time": 1622086718217, "rating": 5.0, "text": "Highly recommend Dixie horse and mule! They have great customer service! We bought a trailer from them 5 years ago,  unfortunately that one recently got totaled and we needed a new one. So we ended up buying from them again! Great service both times and very good people.", "pics": null, "resp": null, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "114300432556561808212", "name": "Cody Lane", "time": 1621200201388, "rating": 5.0, "text": "Love this store the friendliest folks and the best customer service you'll ever recieve. Don't matter if your buying a tractor or some gear oil you will be treated as thier most valuable customer. Will definitely be buying from here for all my tractor needs.", "pics": null, "resp": {"time": 1621201313218, "text": "Thanks Cody!!  We really appreciate you!!  Thx Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "109350081006556187307", "name": "Tracy Boykin", "time": 1616203076594, "rating": 5.0, "text": "Great customer service!! The whole process went smooth, service guys made sure everything was good and did minors repairs to fix a few things as we inspected trailer. Highly recommend if you're looking for a horse trailer!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPDEnGYNSrr9wX7EMNmxk_hqMgjz1mxzC8Kb_N1=w150-h150-k-no-p"]}], "resp": {"time": 1617148608760, "text": "Thanks Tracey!!  Really appreciate you!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "116138898068428398546", "name": "Josh Warnken", "time": 1621899303722, "rating": 5.0, "text": "The best place in the country to buy a trailer from, drove from Texas to pick one up from there just because their customer service, from owner to finance, and even service managers and techs. I will drive there no matter where I live to buy from there. Thanks Dixie Horse and Mule Co.", "pics": null, "resp": null, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "113997326769671152402", "name": "Jessica Lias", "time": 1618707470634, "rating": 5.0, "text": "Amazing Customer Service!!\nWent over everything. Highly recommend and we'll.worth the 15 Hour Drive to purchase from!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM4gfC0scv2cf0Ohjawy7NiwyYKpIxgTkbEmLGH=w150-h150-k-no-p"]}], "resp": {"time": 1619656964599, "text": "Thank you Jessica!  Really appreciate you!  Thx Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "108468674143566104838", "name": "Alexander Baker", "time": 1619655948679, "rating": 5.0, "text": "They did an awesome job getting me financed and delivering my tractor. Whole process less than a week thanks Don and staff.", "pics": null, "resp": {"time": 1619656902678, "text": "Thank you Mr Baker!  We really appreciate you folks!!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "116797248513542808210", "name": "P Carlyle", "time": 1596382277657, "rating": 5.0, "text": "Dixie Horse & Mule Company is the best!   It’s a very well managed dealership that doesn’t make excuses and they have built a great business on integrity and reputation.  We were delighted with this easy up-trade. They gave us full wholesale value for our trade-in and gave us great deal on a larger trailer.  Promises made, promises kept!   It’s not about the money, it’s about the kind of people you do business with.", "pics": null, "resp": {"time": 1596452787875, "text": "Mr Carlyle, thank you so much!  We really appreciate you folks!!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "103481755289886916916", "name": "Allison Morgan", "time": 1604251554431, "rating": 5.0, "text": "Great to work with...that means everyone...from Mike in sales to Cynthia in the office to all the guys in the shop. I've bought a lot of horse trailers from a lot of different dealers over the years, and this was my best experience ever. Great job, y'all...keep up the good work!", "pics": null, "resp": {"time": 1617148692166, "text": "Thanks Allison!  Really appreciate you!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "118046770741479489393", "name": "Kayla Blan", "time": 1585146988269, "rating": 5.0, "text": "The Dixie Horse and Mule Company are the best.  We have purchased a couple trailers from them and will only buy from them.  Their sales team, customer service and repair shop are fantastic!  They go far and beyond what you expect.\nMichael is absolutely the best.  We have worked with him on several occasions and he exceeds our expectations!\nIf you are looking for a horse trailer, you have to check these folks out.  You will be very satisfied!\nJr and Rhonda Dale", "pics": null, "resp": {"time": 1594139584139, "text": "Thanks Kayla!  Really appreciate you!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "108396363606797342145", "name": "Sophia Cork", "time": 1594855162093, "rating": 5.0, "text": "After driving 3 hours, we were very pleased with how things went today! The rain did not stop TJ from showing us all the trailers we were interested in. I was very impressed with how honest they run their business. I’m happy to know that when we hit the road our trailer has been fully inspected! Thank you DH&MC👍🏼", "pics": null, "resp": {"time": 1594861616547, "text": "Thanks Sophia!!  We really appreciate you folks!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "101166407484800113665", "name": "jenna griggs", "time": 1598121898734, "rating": 5.0, "text": "We had a great experience with your company. Dan was our salesman. He was super friendly, and he answered all the questions that we had. We bought a smc living quarters and a bee 2 horse pull behind. Service Manager and Service Techs were very detailed and knowledgeable. We highly recommend!\n-Marty and Jenna Griggs", "pics": null, "resp": {"time": 1598132060264, "text": "Hi folks!  Thanks for the very nice review, and thank you for your business!  We really appreciate you folks!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "113567608303257184068", "name": "Daniel Jacobs", "time": 1559601781755, "rating": 5.0, "text": "Bought my Lakota living quarters horse trailer here awhile back and have enjoyed our immensely. Wt had a bad experience on the phone prior to purchase but once we showed up and Dan got involved to help us out, everything went smoothly and very fast. I've been back for service now twice and the team in the back is great. The only negative i could offer is they don't do appointments so you're going to need to drop off your trailer for a week or three.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPIHgUBQ0_c7cQSxjbeas3SEuZ9MUGcd9y2K8IK=w150-h150-k-no-p"]}], "resp": {"time": 1559656709784, "text": "Thanks Daniel!  We really appreciate you folks!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "108509162025893846211", "name": "Nathan Wilson", "time": 1576541997019, "rating": 5.0, "text": "THANK YOU!  Dixie Horse & Mule Co. is simply the \"best-in-the-business.\"  From the moment we walked onto you lot (3-years ago) looking to purchase a new trailer, all the way to our recent service/repair job, your team consistently exceeds expectations.  In particular, we like to say a special THANK YOU to Michael and his service team.  Recently, we found ourselves in the unfortunate position of needing \"repairs-2-repairs.\"  While we attempted to get satisfaction from the original service location, after a week of frustration & negotiation ... we just picked-up the phone and told Michael we were having the trailer transferred to him.  Michael simply said, \"we'll take care of it.\"  And boy did they!  Michael's team went through our trailer like they were prepping for a military-style white glove inspection.  When they found something not right ... they fixed it!!!  Best of all, they got us \"back on the road\" 14-days ahead of schedule.  Simply Put:  Unbelievable Customer Service and Craftsmanship on all fronts!", "pics": null, "resp": {"time": 1579739710766, "text": "Nathan, thank you so much!  We really appreciate you folks!  I will pass this on to Michael and crew!!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "105060545836115758427", "name": "Brad Howard", "time": 1512596664791, "rating": 5.0, "text": "Updated review...Mike, Dan, and Mrs. Cynthia were great. After showing up last week on my way home from out of town, the folks here really showed what customer service looks like. Once again they proved why they have the great reputation they've earned. Even though I lost out on a good deal for the first trailer I wanted, they more than made up for it with helping me find a trailer that suited our needs and within our budget. It was one of the easiest transaction I've ever done. The drive was worth it.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPA6ALDst4cUPZe_nmLGUHYRlT7tx24hY0FE5ut=w150-h150-k-no-p"]}], "resp": {"time": 1512138211795, "text": "Brad, I am very sorry you missed out on the trailer, and I'm sorry we missed your business.  You had not bought the trailer.  Dan, your salesman, called you once, and text you twice over a two day period advising you were approved and tried to close the deal.  You were busy and did not advise him you actually wanted the trailer until late yesterday.  In the interim we sold the trailer.  That is how business operates.  If you do not commit to buy, its always for sale to a customer that will.  Again, I'm very sorry you missed it but every trailer here is for sale to the first customer that commits.  THX  DON SMITH, OWNER, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "112655385755598915550", "name": "Andrew Allen III", "time": 1592851326635, "rating": 5.0, "text": "Only contacted them by email, but sales rep JT been very responsive and helpful.  We are still researching the options. Maybe we will make a trip to Alabama soon.  The negative reviews don’t bother me. I read them. Any company that has as many customers are always going to have few that can’t be be made happy. I can tell this is a good company.", "pics": null, "resp": {"time": 1592876531801, "text": "Thanks Andrew!  Really appreciate that!  We are ready to earn your business!  Thx Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "114737850816706719824", "name": "Luke Thurman", "time": 1622935004902, "rating": 5.0, "text": "Great people who work there", "pics": null, "resp": null, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "115950300370676201735", "name": "Tyler Reed", "time": 1610658097988, "rating": 1.0, "text": "False information. For anyone wanting to know go to Facebook page.", "pics": null, "resp": {"time": 1610654925597, "text": "Tyler, can you be specific please?  Thx Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "112578653179841028220", "name": "Ashley Brishke", "time": 1593190341478, "rating": 5.0, "text": "Purchased a new tractor from Dixie today and couldn’t be more satisfied in the customer service and how easy and fast Don and his team made the transaction happen! We will recommend Dixie Horse and Mule to everyone for tractor and trailer needs! Thanks again guys!", "pics": null, "resp": {"time": 1593194463327, "text": "Thank you Ms Ashley!  We really appreciate you folks!!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "117007075863222068803", "name": "Evan Smith", "time": 1597702792860, "rating": 5.0, "text": "Drove from Michigan to get a trailer made 100 miles away in Indiana. Hmmm. Still saved about $6000. Mike and Dan were very helpful so was the \"Big Man\" who walked down the Bison Trail Boss trailer with us (sorry never got his name). Great place todo business  with.", "pics": null, "resp": {"time": 1617148758554, "text": "Thank you Evan!!  Appreciate you!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "100807167007877559763", "name": "Mark Doyle", "time": 1596307610329, "rating": 4.0, "text": "The purchase was great! They did a fantastic job, and offers great service after the sale! Definitely Recommend!", "pics": null, "resp": {"time": 1596322550701, "text": "Thanks Mark!  Really appreciate you!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "106229190062688577858", "name": "Mule Skinner", "time": 1519166618153, "rating": 5.0, "text": "Great hassle free trailer purchase. Really liked the services they provide.  Can't wait to hit the trails again 😁🐴", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO3i6Q65ufnc8kzgbasM_UmWB7ya8fI7jM76A-z=w150-h150-k-no-p"]}], "resp": {"time": 1519170045208, "text": "Thanks Mr Mule Skinner!!  We really appreciate you and will be here if needed!  Don Smith Owner DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "115894799621159826644", "name": "Heather Harvey", "time": 1558379091363, "rating": 5.0, "text": "I would highly recommend this place to anyone!! Did the whole credit app and negotiating over the phone and had paperwork sent to me via email that way when we got there we saved a lot of time. Was highly impressed with how thorough they were with walking you through the trailer and making sure everything worked (even replaced a light bulb on the spot while were were there cause it blew when turned on). really liked the fact that they gave me plenty of cards for points of contact if we ever had any questions. (even had a question on Saturday night at about 7 o'clock and the service manager answered and was very helpful).. over all an AMAZING experience and would most definitely do business here again.", "pics": null, "resp": {"time": 1558447280159, "text": "Thanks Heather!!  We really appreciate you folks!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "111960173800698440478", "name": "Abby Lehman", "time": 1575392463672, "rating": 5.0, "text": "I have not been there. I am not a customer.  This is an edit to my previous review. I remarked on an incorrect ad feature which has been corrected in regard to Big Foot Levelers. My thanks to Don, the owner, who responded so quickly and kindly in resolving this issue.", "pics": null, "resp": {"time": 1575395816319, "text": "Thanks Abby!  Really appreciate it!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "102719359111825795484", "name": "James Dannelly", "time": 1582754872613, "rating": 5.0, "text": "Outstanding people to do business with.  Top notch attention to detail and service is at the top of their priority list", "pics": null, "resp": {"time": 1582812916899, "text": "Thank you James!!  We really appreciate you folks!!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "104392607463305478796", "name": "Ginny Craver", "time": 1563905480831, "rating": 5.0, "text": "I live in NC.  I drove to AL to pick up my trailer almost two years ago. I have not been sorry of that choice.  I love my trailer, bought really sight unseen, pictures only.   I have had very few issues, all easy to fix, simple adjustments.  A year later I asked if they had a blanket rack and a halter/bridle rack that would work in my trailer that my local trailer shop could install.  They got both right out to me.  My shop was not sure how they were to be installed so they called Michael, in service, and he walked them through the process.  I arrived at the National Barrel Horse Association world champion races Friday, July 10, 2019.  My blade valve for my grey water will not open.  I take it apart hoping I could fix it, nope.  I could do a temp fix but I would need the part.  I call Michael first thing Saturday.  He asks me to get him an address where he can send the part and he will get it right out.  By the time I got my answer it was after hours.  I sent Michael an email with all the information he needed.  I got the part early Tuesday morning.  Talk about great service!!!  I just wish they were closer so they were doing the service on my trailer. Thank you Michael and the whole team at Dixie.  They know what customer service is.", "pics": null, "resp": {"time": 1563914220644, "text": "Ginny, thank you so much!!  We really appreciate you, and will be here if needed!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "116079684670178568797", "name": "Blake Smith", "time": 1554556466479, "rating": 5.0, "text": "I picked up my trailer yesterday and I can say without a doubt that it was the most pleasant experience that I've ever had buying a vehicle or piece of equipment. I bought a used 2 horse \"as is\" over the phone without having seen it. When I got there to pick it up they had put 5 brand new tires on it and a new jack because they didn't like the way the tires looked and the jack was hard to crank. They didn't have to do that. Anyway everyone there from Dan the salesman to the guys in the shop who fixed me up when I didn't have the right plug on my truck went out of their way to make the experience pleasant. To top it off I left there with a sack full of goodies, caps, tshirts, pens, fans etc. I guarantee you that the next time I'm in the market for a horse trailer Dixie Horse And Mule will be my first stop.", "pics": null, "resp": {"time": 1554727978928, "text": "Thanks Blake!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "102407347196439918619", "name": "Robyn Johnson", "time": 1541780936333, "rating": 5.0, "text": "Ordered a new trailer to our specifications. Best price I could find after months of shopping all Southeastern trailer lots and private owners. Knowledge able staff. Easy to work with. Gave us a complete walk through before we left with trailer.", "pics": null, "resp": {"time": 1541863736842, "text": "Thanks Robyn!  We really appreciate you folks!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "105363673525447858030", "name": "Danna McFarland", "time": 1601580016122, "rating": 5.0, "text": "Cindy is more than great to work with.", "pics": null, "resp": {"time": 1617148720886, "text": "Donna, thank you!  You were too!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "105446439091513613300", "name": "Nate Montgomery", "time": 1594137301968, "rating": 1.0, "text": "Trailer was a trailer.    Don who owns the place though is nobody to be associated with.    Hateful man.", "pics": null, "resp": {"time": 1594139398133, "text": "Typical antifa tactics. Do as I say or you are a racist!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "116816047588862670158", "name": "Kevin Shelton", "time": 1542730333770, "rating": 5.0, "text": "The whole staff was very helpful. The whole process was very easy and no pressure!  Love our new trailer! Keaton was pleasant, Mike's crew explained everything on delivery, and the ladies in the office are awesome. Thank you again!", "pics": null, "resp": {"time": 1542833827872, "text": "Thanks Kevin!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "104473188683446021196", "name": "Amy B", "time": 1524845480913, "rating": 1.0, "text": "We were very disappointed. The salesman seemed willing to work with us, but the big boss only offered $50 off of a used trailer, when the salesman had already offered lower than that. We have great credit and were willing to buy today. Dan was very nice, but we will keep looking. Thank you. If they had even honored the price that the salesman offered, we would have bought it. The price was never an issue and we wound up spending $3,000 more at another dealer for exactly what I truly wanted, but the attitude of the owner and way they renigged on the original offer they made us while trying to make it sound like we \"turned down\" the offer--no thanks! Making an offer or saying \"would you take $200 less\" is not turning down anything. I will never recommend this dealer, especially with so many other great places around.  I am glad I was able to see the owners attitude up front and was able to find a truly fantastic dealer I am happy to send friends to.", "pics": null, "resp": {"time": 1518895104107, "text": "Amy, I’m sorry I could not reduce the trailer price to suit you. I promise I will not be mad with you because you would not pay what I am asking for it. I do appreciate the opportunity, and I wish you the very best in finding the right one for you!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "105187337705970655991", "name": "Jen Spencer", "time": 1585764564550, "rating": 1.0, "text": "The owner of this business is an unapologetic racist. Avoid buying here if you have a shred of dignity.", "pics": null, "resp": {"time": 1592695671532, "text": "Typical antifa tactic. “Do as I say or you are a racist”."}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "116338352764648799277", "name": "Bill Cook", "time": 1541288208718, "rating": 5.0, "text": "If you need a horse trailer, this is definitely the place to come. Their prices seem to be very good and they have a wonderful selection. I will probably end up buying a trailer from them in the near future.", "pics": null, "resp": {"time": 1541375930760, "text": "Thanks Bill!  We really appreciate the opportunity!  DON SMITH, OWNER, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "104207715189738326956", "name": "suzanne Craig", "time": 1556599056997, "rating": 5.0, "text": "We had a great buying experience with Dixie Horse and Mule Co.! We will purchase another horse trailer from them! And will recommend them to my friends! Salesman, JT and delivery driver, Carolyn was very nice, helpful and knowledgeable! Service Mgr, Mike was very, very helpful in educating us on our first LQ trailer and handling a few issues on the trailer! Thank you for making it a pleasant buying experience!", "pics": null, "resp": {"time": 1556628111008, "text": "Thanks Suzanne!!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "105958285479105296868", "name": "Timothy Hazard", "time": 1551569305361, "rating": 5.0, "text": "Everyone is always professional & knowledgeable.  They listen & customize your experience.  You will be thankful to have done business with them.", "pics": null, "resp": {"time": 1551707885262, "text": "Thanks Timothy!!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "101814263002963049761", "name": "amy parr", "time": 1498911925479, "rating": 5.0, "text": "I thoroughly enjoyed my experience working with Keaton at Dixie horse and mule. As someone who can find big purchases a stressful process, I found there staff very knowledgeable, helpful, and willing to please. Keaton was very easy to work with and did everything that was asked of him in a polite manner. I had to consider several trailers to find what was best for me and he just rolled with the punches. My experience with other places don't compare to the quality of service Dixie horse and mule provided me. I will definitely be a repeat customer in the future and was well worth the 6 hour drive. Thanks again!", "pics": null, "resp": {"time": 1509368027110, "text": "Thanks Amy!!  We really appreciate you folks!  DON SMITH, OWNER, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "101352154023683174167", "name": "Jeff Dillard", "time": 1562878327391, "rating": 5.0, "text": "This is the company that you want to buy from. I initially purchased a Branson 4815 Tractor with a 3rd valve function and a Grapple. I then went back and purchased a 62\" finish mower. I have had my tractor serviced as well. I have a Branson dealer 4 miles from my house but opted to drive 30 miles due to the excellence in customer service and price. I met the owner (Don) personally upon arrival, and Rodney who handles the Branson side of the business. This company and the employees genuinely care about their customers, which you do not see much these days. I cannot say enough great things about them. Drive the extra miles and be confident you are getting a great deal from someone who stands behind their products!! Thank You, and I wish you continued success!", "pics": null, "resp": {"time": 1562937134187, "text": "Thanks Jeff!  We really appreciate you, and we appreciate your service to our great country!!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "107629915213468237875", "name": "Freakinthestix", "time": 1594138803702, "rating": 1.0, "text": "Garbage human being.. spend your money elsewhere.", "pics": null, "resp": {"time": 1594208998045, "text": "Typical antifa tactic. Do as I say or you are a racist!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "107629915213468237875", "name": "Freakinthestix", "time": 1594138803702, "rating": 1.0, "text": "Garbage human being.. spend your money elsewhere.", "pics": null, "resp": {"time": 1594208998045, "text": "Typical antifa tactic. Do as I say or you are a racist!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "106847015544563563326", "name": "Pattie Bozeman", "time": 1605298506297, "rating": 5.0, "text": "Awesome place.", "pics": null, "resp": {"time": 1617148652287, "text": "Thanks Pattie!  Really appreciate you!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "116309060516266500284", "name": "Alicia Wills", "time": 1518647273572, "rating": 5.0, "text": "Staff is very friendly and knowledgeable. Got an awesome trailer at a great price. Highly recommend!!", "pics": null, "resp": {"time": 1575395891181, "text": "Thanks Alicia!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "110920918205965330091", "name": "Sue Holland", "time": 1555169058062, "rating": 5.0, "text": "Very pleasant place to deal with. We'll be back when we want a new one. Thank you for your help", "pics": null, "resp": {"time": 1555334287992, "text": "Thanks Sue!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "102110884401898509743", "name": "Scott Willis", "time": 1436379565196, "rating": 5.0, "text": "These folks have kept customer service a priority!  Both Sean and Don went out of their way to make certain that we purchased the right trailer.  We had many questions, and thought we needed something completely different from what we ended up getting.  We are so happy, they answered every question we asked with a solid answer, then backed it up with evidence.  The customer service here was impressive, the prices were fantastic, there is no other place you'll ever need to shop to find the right hauler!!!  These guys are the largest in the Country for obvious reasons!!!", "pics": null, "resp": {"time": 1436668274470, "text": "Scott, thank you for your kind words!  We hope you enjoy your new trailer for years to come!  We look forward to earning your business again in the future!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "109583487086388505788", "name": "Cicada Rose", "time": 1594134245293, "rating": 1.0, "text": "Don Smith uses racial slurs on his website and when he was asked about this, he was nasty, explosive and unprofessional.", "pics": null, "resp": {"time": 1594139265186, "text": "Typical antifa tactics!  Do as I say or you are a racist!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "103250680034094547301", "name": "Amber Wilson", "time": 1532970182613, "rating": 1.0, "text": "I will looking for a stock trailer.  I found one here we could afford.  I tried to get financing and  I already did my application last week. I got a email today saying they had more questions so I called them up and instead of answering any questions they may have I get informed they sold the trailer I was trying to get. I wouldn't recommend anyone here", "pics": null, "resp": {"time": 1533042723024, "text": "Amber, I am so sorry you missed the trailer.  All trailers are for sale until we actually have an approved application in hand or unless we have a non refundable deposit in hand.  Your application was declined by the bank, than a note was sent to you asking if you possibly had a co signer.  Before you responded back, another customer came in with cash and bought the trailer.  At any one time, we have around 10 or 12 credit applications pending on different trailers.  At times we have more than one application on the same trailer.  Again, I'm sorry you missed it, and we really appreciate the opportunity!  Thanks DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "102215841457255248404", "name": "Barbara Vizzi", "time": 1530375860554, "rating": 1.0, "text": "Owner, Don, is unprofessional and hung up on me. when I spoke to another employee, he tried to intimidate me, then he hung up on me as well. If you want to be treated with respect and curtousy as a customer, don't go to this place! I was shocked!\nUPDATE: I edited this review after reading the owner's totally untrue response. I never asked that my trailer be repaired to \"perfect\" condition, as he says. Also, it took over two weeks JUST to get a response from him about my repairs. I had to call to even get him to respond to my first email. Also, NOTHING in his response explained why he and another employee so rudely hung up on me. I guess you can read all his other responses and see for yourself that he takes zero responsibility for his own actions and blames the customer when they have a terrible experience.", "pics": null, "resp": {"time": 1530374753012, "text": "Ms Barbara, I'm sorry you feel this way.  After many days here with my service manager trying to help you out with your repairs, and having made many calls on your behalf, and agreeing to work your trailer in to do the repairs, it became evident to us, through our communications with you via email, that we were not going to be able to meet your demands as to restoring your trailer to perfect condition, nor are we able to keep your trailer under shelter while in our possession, so I decided it would be best if we did not do the repairs.  I politely advised you of this today, and recommended you locate a shop that could do these things for you.  There are times and circumstances in which it's best not to do business.  This is one of those times.  I certainly hold no animosity toward you, but it's evident you do toward us, and are seeking a pound of flesh.  There is no call for rudeness on your part, and there certainly won't be any on mine.  You are free to do business with whom you choose, as am I.  DON SMITH, OWNER, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "114590875337935361607", "name": "Lisa Wishon", "time": 1556823094781, "rating": 5.0, "text": "Great place to shop for horse trailers and great people working there", "pics": null, "resp": {"time": 1556887612277, "text": "Thanks Lisa!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "107868032458166266652", "name": "Doug Smith", "time": 1552071220446, "rating": 5.0, "text": "Great folks to deal with. Large inventory to select your new trailer from.", "pics": null, "resp": {"time": 1552145797899, "text": "Thanks Doug!!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "118083373087478245770", "name": "Kyle Nichols", "time": 1556375495713, "rating": 5.0, "text": "Nice people an trailers very happy with our interaction here", "pics": null, "resp": {"time": 1556547114562, "text": "Thanks Kyle!!  We really appreciate you!!   DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "107868032458166266652", "name": "Doug Smith", "time": 1552071220446, "rating": 5.0, "text": "Great folks to deal with. Large inventory to select your new trailer from.", "pics": null, "resp": {"time": 1552145797899, "text": "Thanks Doug!!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "109138011948017701786", "name": "Daniel Rodriguez", "time": 1598364201343, "rating": 5.0, "text": "Easy going folks", "pics": null, "resp": {"time": 1598371899666, "text": "Thanks Daniel!  We really appreciate you!  Don"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "107653669994842677342", "name": "Anthony", "time": 1479710546876, "rating": 5.0, "text": "My family has watched the company grow over the years.  The folks at Dixie have a great reputation of treating people right.  Great selection.", "pics": null, "resp": {"time": 1479751939809, "text": "Thank you, Anthony!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "101446461187286099467", "name": "Natalie Cox", "time": 1546869247573, "rating": 5.0, "text": "We purchased a new SMC LQ from DH&M and we couldn’t be happier with the entire experience! Literally every single person we dealt with from sales to finance to service was extremely helpful and kind!\nI would 1,000% recommend Dixe Horse & Mule Co to anyone looking to purchase a trailer! I was dealing with another large company in Ocala, FL who also sells the SMCs and the customer service was night and day difference!! The Ocala salesmanship was hard to get ahold of, and 24-48 hours later when he did get back with me he wouldn’t have the answers he was supposed to be getting me. Asked him for his best deal and the price didn’t go down but rather UP due to added freight charges.\nThe service I received from DH&M made our decision on who to go with extremely easy!\nThank you everyone for such a pleasant experience, I am absolutely in love with our new trailer!", "pics": null, "resp": {"time": 1546966921271, "text": "Natalie!  Thank you so much!  What a wonderful review!  We really appreciate you folks.  THX  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "110674710442962998214", "name": "Linda Ballard", "time": 1535119819701, "rating": 5.0, "text": "DHMCO made the scary process of buying a horse trailer online into a great experience.  JT answered all my questions, guided me through the process, and made sure I got the best trailer for my budget and needs.  Cindy and Cynthia made the remote purchase transaction as simple as possible.  The service department made sure everything was working and clean before it rolled off their lot, and the delivery team walked me through the trailer and made sure I was okay with it before leaving.  I’m impressed with the professionalism at DHMCO.  I will recommend y’all to anyone looking for a horse trailer.", "pics": null, "resp": {"time": 1535120899890, "text": "Linda, we really appreciate you as well as your kind words!  If you need anything in the future please let us know we will be here to assists!   Thank you again!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "102075294516515177703", "name": "Teresa Batson", "time": 1505663413233, "rating": 5.0, "text": "Another highly satisfied customer.  We drove from Granbury Tx with a trade , got there yesterday.  New trailer is everything described .  They were fast & efficient.  a special thanks to Priscilla & Dan.  We should be home late afternoon!", "pics": null, "resp": {"time": 1509367924132, "text": "Thanks Teresa!!  We really appreciate you folks!  DON SMITH, OWNER, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "117593217149113148107", "name": "Alyssa Buchthal", "time": 1585768257907, "rating": 1.0, "text": "Run by racists. Beware.", "pics": null, "resp": {"time": 1592695796515, "text": "Typical antifa tactic. “Do as I say or you are a racist”."}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "109467950599980471209", "name": "Regina short", "time": 1548935362466, "rating": 5.0, "text": "Great services,  everyone In the service department was fantastic", "pics": null, "resp": {"time": 1548943371551, "text": "Thanks Regina!!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "106640878269640204697", "name": "Mary C", "time": 1525835467289, "rating": 5.0, "text": "The service department is so helpful! These guys are great!!", "pics": null, "resp": {"time": 1525874459545, "text": "Mary, thank you so much!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "101742044537197344919", "name": "Bryce Davis", "time": 1505574798291, "rating": 5.0, "text": "Quick and easy", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP0ZxHmrFfGBWGQT--CMwgSs1xhsn8uf5g_NsiM=w150-h150-k-no-p"]}], "resp": {"time": 1509367949590, "text": "Bryce, thanks for the visit! We really appreciate it and will do all possible to earn your business! DON SMITH, OWNER, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "104711566484059271102", "name": "Ty Woods", "time": 1519157341834, "rating": 1.0, "text": "I believe there is a little bait and switch that goes on here!!!!  Advertised priced trailer was sold... and I get that that can happen however really tried to up sell me once we got there and trailer was gone.  Not sure trailer was ever there at the discount price but have no proof. Buyers beware I wasted a trip to Alabama", "pics": null, "resp": {"time": 1519158471489, "text": "Ty, you are absolutely out of line by accusing us of this.  WE'd never do this, and I resent you casting this aspersion on me, my outfit, and my employees.  If it was advertised it was here.  \"No proof\" you say, yet you slander us?  Shame on you.  If you'll give me the details I will sure look into it and publish on here.  Don Smith, owner, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "106399251755563917368", "name": "Amanda Schwendt", "time": 1515521395153, "rating": 5.0, "text": "Very helpful staff. Deal fell through but overall very nice experience.", "pics": null, "resp": {"time": 1575395923287, "text": "Thanks Amanda!  We really appreciate the opportunity!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "103219216832167289320", "name": "Michael Edquist", "time": 1552689466257, "rating": 5.0, "text": "Best selection new and used in the south", "pics": null, "resp": {"time": 1552742721997, "text": "Thanks Michael!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "102103496088017552071", "name": "Jerry Bellemare", "time": 1439491599364, "rating": 5.0, "text": "i bought a trailer from them in 2008. and 7 years later no problems with the trailer at all . they are as courteous today as they were 7 years ago great service and just good company all the way around i highly recommend  them to anyone", "pics": null, "resp": {"time": 1439556528539, "text": "Jerry- Thank you for the kind review!  We hope you are enjoying your Bison horse trailer and look forward to seeing you again in the future!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "112790926468671101305", "name": "Andrea Barstow", "time": 1519654961261, "rating": 5.0, "text": "Great experience dealing with these folks.", "pics": null, "resp": {"time": 1519654739304, "text": "Thank you Andrea!!  We really appreciate you folks!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "105714340869298678165", "name": "Fli Mi", "time": 1491598527707, "rating": 1.0, "text": "Lowball your trade in and inflate theirs! Would not waste my time with them again", "pics": null, "resp": {"time": 1491657050730, "text": "Fly Y, I'm sorry we could not give you what you expected for your trailer.  Due to its age (1994) and type of construction (Fiberglass Reinforced Plywood), it just has little value when competing with the other trailers on our yard, and would be a very hard sell for us.  We did advise you of this before you travelled.  It has to be a good deal for both of us or its just not worth doing. I do wish you the very best in finding someone that you can trade with.  I really appreciate the opportunity!  Thanks Don Smith, owner, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "108263720677849551039", "name": "Kevin Sullivan", "time": 1553295651394, "rating": 5.0, "text": "Great people & service.", "pics": null, "resp": {"time": 1553347029543, "text": "Thanks Kevin!  Really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "107543394613470604599", "name": "Tim Bigham", "time": 1530215145041, "rating": 5.0, "text": "Great people and great service!", "pics": null, "resp": {"time": 1530279602747, "text": "Tim, thank you so much!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "117177366249397549129", "name": "Dallas Mathis", "time": 1535133121773, "rating": 5.0, "text": "Friendly staff ( no pressure ) and LARGE selection of LQ trailers", "pics": null, "resp": {"time": 1575395860161, "text": "Thanks Dallas!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "105076483640335881579", "name": "brad doughtie", "time": 1550613519746, "rating": 5.0, "text": "Very nice 👌", "pics": null, "resp": {"time": 1550616477802, "text": "Thanks Brad!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "117177366249397549129", "name": "Dallas Mathis", "time": 1535133121773, "rating": 5.0, "text": "Friendly staff ( no pressure ) and LARGE selection of LQ trailers", "pics": null, "resp": {"time": 1575395860161, "text": "Thanks Dallas!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "113399399281158913698", "name": "Elena Ramos", "time": 1542157140874, "rating": 5.0, "text": "Excelent", "pics": null, "resp": {"time": 1542208966179, "text": "Thanks Elena!  We really appreciate you folks!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "109082154427388358596", "name": "Beverly Hamilton", "time": 1528468118163, "rating": 1.0, "text": "Horrible!! Do NOT even go! Waist of time! Contact me and i will tell you my EXPERIENCE!!", "pics": null, "resp": {"time": 1528470294687, "text": "Beverly\n\nI do not appreciate this post.  Myself and our finance department worked very hard to get y'all approved.  We cannot help that the bank turned down the application.  There is no need for you to call us unprofessional.  We really appreciate y'all giving us the opportunity to earn your business!  I wish it would have turned out differently.  When you do tell your friends, I suggest you mention the reason the deal did not work was due to credit, not the dealership that went above and beyond to get y'all approved.  Thanks again!  KEATON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "112223013964123073823", "name": "keith scott", "time": 1487716626123, "rating": 1.0, "text": "Traveled from Michigan to purchase a trailer never inquired about financing but the girl (Cindy ) took it upon herself to run a credit check for whatever reason!", "pics": null, "resp": {"time": 1487863517578, "text": "Keith, it would be impossible for us run your credit without you, or someone very close to you, having given us your personal info.  Your statement is false.  Your application came in to us at 719PM on 6FEB17.  The application was signed.  We have the IP address it came from if you'd like it.  If you did not send it in, someone in your family did.  You were in our store, and yall picked up the trailer, on Sat the 18th of Feb.  You posted this negative review on the following Monday, the 21st of Feb, after you picked up the trailer.  I'd appreciate it if you'd correct this rating.  Your dishonesty in posting it is showing, and it could hurt our business even though its completely false.  Thanks DON SMITH, OWNER, DIXIE HORSE & MULE CO."}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "104265428809223000941", "name": "Jennine Badenhorst", "time": 1545166361734, "rating": 5.0, "text": "Best service ever!", "pics": null, "resp": {"time": 1545248678490, "text": "Thank you Ms Jennine!  We really appreciate you folks and are praying for the very best for yall!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "103118682676161994699", "name": "Marcie Gay", "time": 1529764471184, "rating": 1.0, "text": "Horrible no help what so ever!", "pics": null, "resp": {"time": 1529931163247, "text": "Ms Gay, I am sorry you folks feel this way.  One of my salesmen, JT, asked yall on 3 different occasions, while you were here, if you needed help, and you did not.  He did direct you to the trailers you were looking for.  We were extremely busy, and short staffed, but we do not use that as a reason for poor service.  Had we known you did decide you needed help, we would have gotten to you just as soon as possible, consistent with helping those who were here before yall were.  Again, I apologize.  It is never our intent to fail to help anyone.  THX  DON SMITH, OWNER, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "114796167009110459211", "name": "denise cole", "time": 1527443429117, "rating": 5.0, "text": "Best price and quality around", "pics": null, "resp": {"time": 1527598471974, "text": "Thank you Denise!!  We really appreciate that!!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "114296993281398919525", "name": "Kay Osborne", "time": 1523298944141, "rating": 5.0, "text": "Very helpful and polite", "pics": null, "resp": {"time": 1523722841990, "text": "Thanks Kay!!  Really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "107676437804154174636", "name": "Donna Faulkner", "time": 1494023436411, "rating": 5.0, "text": "Bought my Lakota horse trailer there.", "pics": null, "resp": {"time": 1494076729103, "text": "Thanks Donna!  We really appreciate you folks!!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "117968821250749074726", "name": "Kevin Farthing", "time": 1461208336291, "rating": 4.0, "text": "Good inventory!", "pics": null, "resp": {"time": 1467113383550, "text": "Thanks Kevin!!  Really appreciate you!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "111340020648492165958", "name": "J", "time": 1461069990403, "rating": 1.0, "text": "its funny you turned me down on trading trailers last week credit score was toooo low but i came back to Decatur bought a brand new 2016 f-350 at 2.9 interest rate", "pics": null, "resp": {"time": 1461073810628, "text": "Bob, it was the bank that turned you down, not us. They have different criteria for hirse trailers as opposed to vehicles. Much easier to qualify for a truck. I'm sure sorry we missed your business. If we did the approvals you would have been approved!  We do appreciate the opportunity!  Don Smith, owner, DHMCO"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "116308428910534495257", "name": "Delores Black", "time": 1453850855920, "rating": 5.0, "text": "Thanks to all for making this purchase a pleasure", "pics": null, "resp": {"time": 1454004285582, "text": "THX DELORES!! We really appreciate yall!"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "102221634857410247798", "name": "Hannah Rain", "time": 1435416197592, "rating": 4.0, "text": "Best Trailer Dealer Around", "pics": null, "resp": {"time": 1435449048958, "text": "THXHANNAH!!  We really appreciate you!  DON"}, "gmap_id": "0x88892476c99172e5:0x28ba5d0147ec530f"}
{"user_id": "113141920140897445838", "name": "Wayne Martin", "time": 1616810555839, "rating": 5.0, "text": "Truly really good experience, all the people  are very nice, all the way down to the puppy dog. If you want a lawn mower be a good place to start. Jes equipment Solutions.", "pics": null, "resp": null, "gmap_id": "0x8888595f57e9dfb9:0x25abf1755b56cfba"}
{"user_id": "103262428936279907309", "name": "Allen Colvert", "time": 1581740323211, "rating": 5.0, "text": "Great company  friendly and knoloagable, prices for service and equipment can't be beat", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO_c7EIT0OJmEFbKVwBrOnSauR6TH18N1JFbC9v=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNL4eghFph7Gm7J7g_7gFOYd3s_Hl7upgE6UtVB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOkbS998ppysWoZoUvqxiBzSaUUgpoACLesNuwR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPUkc_Wf9aw3rJXXSf5Uxe5M1oCCOtIjNO7mY1H=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOCe5pylrCZVX4pkrp90_m9_H9vA-aiEVcMWM4X=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPqljidE24X8i-1a9ssp8cqIy0VOOUk28IxbAWs=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888595f57e9dfb9:0x25abf1755b56cfba"}
{"user_id": "107485133752155829529", "name": "Brandon James", "time": 1612911053012, "rating": 5.0, "text": "Very knowledgeable and helpful with very competitive pricing.\nVery happy to be doing buisness with these fine folks.", "pics": null, "resp": null, "gmap_id": "0x8888595f57e9dfb9:0x25abf1755b56cfba"}
{"user_id": "109936510383086291133", "name": "Carl Shelton", "time": 1613849785857, "rating": 5.0, "text": "Really liked the people here, set up for some parts and service on the bad boy mower. They explained details of the job, pricing for me. Showed me their shop and products they sell. They are set up for lawnmower to heavy equipment repair.", "pics": null, "resp": null, "gmap_id": "0x8888595f57e9dfb9:0x25abf1755b56cfba"}
{"user_id": "102650428948421916818", "name": "Danny Niblett", "time": 1604716238059, "rating": 5.0, "text": "I highly recommend this company. They looked over a mower I purchased fro another individual and determined it needed a motor. The didn't charge me for the information and I was very pleased with their help.", "pics": null, "resp": null, "gmap_id": "0x8888595f57e9dfb9:0x25abf1755b56cfba"}
{"user_id": "117073981497960177686", "name": "Marcus McC", "time": 1590118323139, "rating": 5.0, "text": "Family business and just a great group of people who really know their stuff! Looking forward to doing more business with them in the future.", "pics": null, "resp": null, "gmap_id": "0x8888595f57e9dfb9:0x25abf1755b56cfba"}
{"user_id": "114657743509922543072", "name": "Steven Davis", "time": 1589598234975, "rating": 5.0, "text": "Very friendly and knowledgeable staff at JES. Did my first business with them today and will definitely do business with them again.", "pics": null, "resp": null, "gmap_id": "0x8888595f57e9dfb9:0x25abf1755b56cfba"}
{"user_id": "106749390756647154040", "name": "Danny Barton", "time": 1599693421987, "rating": 5.0, "text": "Nice little tractor and lawnmower store", "pics": null, "resp": null, "gmap_id": "0x8888595f57e9dfb9:0x25abf1755b56cfba"}
{"user_id": "102650428948421916818", "name": "Danny Niblett", "time": 1619703992873, "rating": 5.0, "text": "They were very helpful and very competent.", "pics": null, "resp": null, "gmap_id": "0x8888614ce93fc3e7:0xfa7b18b708ff4de2"}
{"user_id": "108267538826175888412", "name": "Robert Cowens", "time": 1589652374977, "rating": 5.0, "text": "Helpful, friendly staff. Was our first time there.", "pics": null, "resp": null, "gmap_id": "0x8888614ce93fc3e7:0xfa7b18b708ff4de2"}
{"user_id": "112609443011613048064", "name": "James Godsey", "time": 1592931990606, "rating": 1.0, "text": "Took too    Months to get my BX2360 back got home cut grass 2 times  laken hydraulically same thing I won't be back", "pics": null, "resp": null, "gmap_id": "0x8888614ce93fc3e7:0xfa7b18b708ff4de2"}
{"user_id": "100447812961711997560", "name": "Don Busby", "time": 1502421579742, "rating": 4.0, "text": "They are down to earth coke .I found to be honest in business .Helpful in equipment repair and parts", "pics": null, "resp": null, "gmap_id": "0x8888614ce93fc3e7:0xfa7b18b708ff4de2"}
{"user_id": "106265212129673723202", "name": "Josh Mortensen", "time": 1489601142513, "rating": 1.0, "text": "Takes forever to get service work done. Very un organized. I'll take my business to Dixie Tractor in cullman.", "pics": null, "resp": null, "gmap_id": "0x8888614ce93fc3e7:0xfa7b18b708ff4de2"}
{"user_id": "106609028629580605700", "name": "Nick Gunter", "time": 1557103041119, "rating": 5.0, "text": "Great prices great people!", "pics": null, "resp": null, "gmap_id": "0x8888614ce93fc3e7:0xfa7b18b708ff4de2"}
{"user_id": "111842496393047315404", "name": "Rickey Harris", "time": 1428512845355, "rating": 5.0, "text": "Good deal on tractors....good service", "pics": null, "resp": null, "gmap_id": "0x8888614ce93fc3e7:0xfa7b18b708ff4de2"}
{"user_id": "115092668826526171814", "name": "Michael Ligon", "time": 1506617282218, "rating": 5.0, "text": "Very professional, and very helpful!", "pics": null, "resp": null, "gmap_id": "0x8888614ce93fc3e7:0xfa7b18b708ff4de2"}
{"user_id": "116306104233762798134", "name": "Leslie Solomon Heartsill", "time": 1619905950109, "rating": 5.0, "text": "This is a business that handles business when it needs to be handled and there staff is friendly and very educated on doing work on tractors and any other work mechanically that you may need them to do! Over all this garage is the best all around garage to use for any mechanic work you may need done!!", "pics": null, "resp": null, "gmap_id": "0x888e07825364bbff:0x270b28721391aaa6"}
{"user_id": "111684799985086321566", "name": "J H", "time": 1617062381808, "rating": 5.0, "text": "Top of the line equipment and customer service. Courtney and Keith were great. I would recommend them for all of your landscaping and agricultural equipment needs.", "pics": null, "resp": null, "gmap_id": "0x888e07825364bbff:0x270b28721391aaa6"}
{"user_id": "104401477404564704963", "name": "David Ross", "time": 1614962701073, "rating": 5.0, "text": "Great people. Quality service.", "pics": null, "resp": null, "gmap_id": "0x888e07825364bbff:0x270b28721391aaa6"}
{"user_id": "113804122514293666519", "name": "kelley Mitchell", "time": 1618605772373, "rating": 3.0, "text": "Lady at desk didn't know what she was talking about 😂 but I was charged right in the end", "pics": null, "resp": null, "gmap_id": "0x888e07825364bbff:0x270b28721391aaa6"}
{"user_id": "111288911936952552024", "name": "Robert Mcdonough", "time": 1595598911128, "rating": 5.0, "text": "I bought a classic truck from a previous owner in Florida and moved into the neighborhood of Stephen's garage. Once day I decided to take my truck into Stephen's for a new set of ball joints. Later that day they called me to inform me the previous owner had welded my ball joints to my LCA. That call just probably saved my life and someone else on the road.  Good job guys", "pics": null, "resp": null, "gmap_id": "0x888e07825364bbff:0x270b28721391aaa6"}
{"user_id": "102825511274801224786", "name": "Tonya Kidd", "time": 1617216374936, "rating": 5.0, "text": "In and out on a timely manner", "pics": null, "resp": null, "gmap_id": "0x888e07825364bbff:0x270b28721391aaa6"}
{"user_id": "117597485719786715818", "name": "Matty Puppy", "time": 1579838221272, "rating": 4.0, "text": "Helpful, promptly fixing my things, even rushing to finish a belt replacement before closing time as I needed the vehicle the next morning.\n\nI came in recently with a small issue. They pulled the bad part, found they hadn't a replacement or one in stock nearby, and gave it to me.\n\nThey offered to order one, but advised that ordering it myself would cost less, as it would circumvent their own overhead charges. They charged me nothing for the hour of work it took them to get to the part.\n\nOverall honest and helpful across my 3 visits, with more coming.", "pics": null, "resp": null, "gmap_id": "0x888e07825364bbff:0x270b28721391aaa6"}
{"user_id": "112414508620506046258", "name": "jkgame club upshaw", "time": 1613651277673, "rating": 5.0, "text": "Great customer service.", "pics": null, "resp": null, "gmap_id": "0x888e07825364bbff:0x270b28721391aaa6"}
{"user_id": "105837010085431700454", "name": "Michelle Williams", "time": 1592317571613, "rating": 5.0, "text": "Fast friendly service 👌👍", "pics": null, "resp": null, "gmap_id": "0x888e07825364bbff:0x270b28721391aaa6"}
{"user_id": "116193697747159592737", "name": "Pattie Mitchell", "time": 1565891209455, "rating": 3.0, "text": "Some employees are very helpful and others are just plain rude.", "pics": null, "resp": null, "gmap_id": "0x888e07825364bbff:0x270b28721391aaa6"}
{"user_id": "110949029959628701128", "name": "Connie Lillich", "time": 1561564153730, "rating": 4.0, "text": "Very decent prices and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x888e07825364bbff:0x270b28721391aaa6"}
{"user_id": "103386364080363003116", "name": "Ria Henderson", "time": 1529689090612, "rating": 5.0, "text": "I went to have a leak looked and even though I didn't get my car serviced I was treated with respect and given honest results to my issue.", "pics": null, "resp": null, "gmap_id": "0x888e07825364bbff:0x270b28721391aaa6"}
{"user_id": "106081588410601817568", "name": "Benny King", "time": 1548013614900, "rating": 5.0, "text": "Great service and at a fair price.", "pics": null, "resp": null, "gmap_id": "0x888e07825364bbff:0x270b28721391aaa6"}
{"user_id": "105106678399437985684", "name": "Daniel Hawkins", "time": 1465002652583, "rating": 5.0, "text": "Absolutely incredible service! My 06 Tacoma broke down in Luverne as I was driving back home to Florida from Tennessee (on a Friday afternoon!). The U joints in the drive shaft all had to be replaced, the front one had completely failed and the front part of the shaft was completely detached. My truck was towed to their shop at 1pm and I was back on the road by 2:40pm! Just outstanding service and fair rates. If you're anywhere near Luverne takes your vehicle to Stephen's Garage! They'll definitely take care of you!", "pics": null, "resp": null, "gmap_id": "0x888e07825364bbff:0x270b28721391aaa6"}
{"user_id": "113780114697706106238", "name": "Melissa Williamson", "time": 1488861691164, "rating": 5.0, "text": "Great service and the mechanics do good work. Fair priced and that's always a blessing.", "pics": null, "resp": null, "gmap_id": "0x888e07825364bbff:0x270b28721391aaa6"}
{"user_id": "109623165420083904794", "name": "Tiffany Kidd", "time": 1575656864302, "rating": 5.0, "text": "They are friendly and helpful", "pics": null, "resp": null, "gmap_id": "0x888e07825364bbff:0x270b28721391aaa6"}
{"user_id": "102635338841794438587", "name": "B.J Killings", "time": 1582173014319, "rating": 3.0, "text": "The people are nice", "pics": null, "resp": null, "gmap_id": "0x888e07825364bbff:0x270b28721391aaa6"}
{"user_id": "102505841330594074681", "name": "Heather Simmons", "time": 1546043327950, "rating": 5.0, "text": "Today my car was making a terrible sound to the point I was scared to drive it. I called this service and they came to me and helped me fix the problem! Very friendly people.", "pics": null, "resp": null, "gmap_id": "0x888e07825364bbff:0x270b28721391aaa6"}
{"user_id": "106931467876512317165", "name": "Robert Webb", "time": 1570701157441, "rating": 1.0, "text": "Poor service.", "pics": null, "resp": null, "gmap_id": "0x888e07825364bbff:0x270b28721391aaa6"}
{"user_id": "111464899394186012861", "name": "Mandy Beeson", "time": 1621094786920, "rating": 5.0, "text": "My first time doing business at this location, and I will now be a repeat customer! Excellent customer service - they took the time to help me find what I needed when what I was looking for wasn’t in stock!", "pics": null, "resp": {"time": 1621340341256, "text": "We're happy you had an amazing experience with our store! Thanks for your trust, we're thankful for amazing customers like you. We hope to see you again soon!"}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "106502828382886722542", "name": "Micheal Cumbee", "time": 1557763447703, "rating": 5.0, "text": "Awesome dealership to unload at,good people got me unloaded fast....", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMZV0dNUoJXMITXuXpJOqPZQrkEioA7pIPo3se4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOUmpG5ZOCepgNLIl2Z3oFDcumO3TVUT0Z_LijB=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "113632222530148239800", "name": "Barry Cobb", "time": 1619050720526, "rating": 5.0, "text": "Got my first zero turn here, and I really like it. That's probably because Rick took the time to match my yard to the right piece of equipment.  I like this location very much, the folks are kind.", "pics": null, "resp": {"time": 1619096458329, "text": "We're happy you had an amazing experience with our store! Thanks for your trust, we're thankful for amazing customers like you. We hope to see you again soon!"}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "105830744257333803930", "name": "David Tanner", "time": 1610592302457, "rating": 5.0, "text": "If u are in the lawn mowing business u want to have reliable professianal maintenance on your equipment.   Mark provided quick diagnosis of my John Deere 115 so i could prepare for the coming season.  OUTSTANDING JOB!!", "pics": null, "resp": {"time": 1610637521155, "text": "Thank you for the wonderful review and for taking the time to share your feedback with SunSouth.  Our priority is customer service and we are ecstatic that we met that mark! Kind folks like you make our job a pleasure."}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "106563100599541960206", "name": "2lovin thejourney", "time": 1616499873904, "rating": 5.0, "text": "Came in looking for metal toy tractors. Had a great display so we were pleased...and so was our three year old grandson!", "pics": null, "resp": {"time": 1616507444242, "text": "Thank you for your kind review! We are happy to hear our customers, of all age, can find something to love in our stores."}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "117771673561170456711", "name": "Donnie Rogers", "time": 1620770738654, "rating": 5.0, "text": "Very helpful knew what needed .thank you", "pics": null, "resp": {"time": 1620825411132, "text": "Thank you for taking time out of your day to leave some feedback. We appreciate your business."}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "118202142817697752528", "name": "Shelia Hammonds", "time": 1614625211353, "rating": 5.0, "text": "Great folks. Will attempt service on tiller that they don't sell", "pics": null, "resp": {"time": 1615470572625, "text": "We are happy to hear you had a positive experience with SunSouth! We appreciate your business."}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "114930001174394162036", "name": "david barberi", "time": 1595868675517, "rating": 2.0, "text": "I called this morning to see if they had a part, said they were busy they took my number and said they'd call me back. I called back after an hour and 10 minutes later, still busy said they would call me back. It's been over two hours now and never have I gotten a phone call back. I guess they didn't want my business.", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "117841738994240929631", "name": "Chuck Trolley", "time": 1604513060549, "rating": 4.0, "text": "Great place to do business", "pics": null, "resp": {"time": 1604515552942, "text": "We're happy you had an amazing experience with our store! Thanks for your trust, we're thankful for amazing customers like you. We hope to see you again soon!"}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "114089173776095966757", "name": "Matthew Hawkins", "time": 1582250779010, "rating": 5.0, "text": "Helpful staff, they were able to help with my Honda mower and got it up and running again without issue.", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "111201129493626860807", "name": "April Daily", "time": 1576601703841, "rating": 5.0, "text": "Awesome Customer Service!!!@ would recommend that anyone go for all your John Deere needs.", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "100986302852750671947", "name": "Jim Luckie", "time": 1567105315484, "rating": 5.0, "text": "They treat you like family. Really good people.", "pics": null, "resp": {"time": 1570829361362, "text": "Jim  thank you so much for your feedback. We appreciate your business."}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "114482786068221143520", "name": "Steven Jenkins", "time": 1568388682234, "rating": 5.0, "text": "Great friendly service, reasonably priced, equipment ready ahead of schedule. Will definitely purchase my equipment from SunSouth!", "pics": null, "resp": {"time": 1570829841358, "text": "Steven  thank you so much for your feedback. We appreciate your business."}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "113746492296408945762", "name": "Tony Studdard", "time": 1565273207365, "rating": 5.0, "text": "The sales staff are excellent along with the service department. Would recommend to everyone.", "pics": null, "resp": {"time": 1565708658543, "text": "Tony  thank you so much for your feedback. We appreciate your business."}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "108918148553599121472", "name": "Clark Johnson", "time": 1570738477416, "rating": 5.0, "text": "Parts department does a great job getting you what you need", "pics": null, "resp": {"time": 1570830561367, "text": "Clark  thank you so much for your feedback. We appreciate your business."}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "109045707312596471166", "name": "C Ray Marilu S Beasley", "time": 1589320776573, "rating": 4.0, "text": "Usually order the correct parts", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "113085650658390781647", "name": "G M", "time": 1528856023484, "rating": 1.0, "text": "Horrible Service Department!\nAfter numerous attempts to get the service department on the phone, I finally got through and unfortunately decided to drop off my mower for repair.  A week and a couple follow-up calls later, they still don't know what is wrong with my mower.  A couple days later, I'm told it's the auto choke in the carb although there is a choke on the handle.  A few days later, they are still waiting on the Honda parts rep to call them back.  Next day, I'm promised an estimate; I hear nothing.  I call the next business day (Monday) when I'm told i will have an estimate by the end of the day, but I told them if I didn't hear back that afternoon (2+ weeks later), I was picking my mower and not paying the diagnostic fee.  Do you think I got a call?  Nope.  At least they're consistent. I picked up the broken mower the next day without paying.  I would avoid this place, for service, like the plague.\n\nAlso of note, they do not use computers to document your equipment's problem, part number, or your contact info; they use a small notebook.  While I'll appreciate simplicity, I expect a business to be organized--not this service department!\n\nIf I could give zero stars or even negative, since my mower carburetor gasket was ripped during diagnostics, I would.", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "100654097349147176102", "name": "Jackie H.", "time": 1551555158819, "rating": 5.0, "text": "Great like always. Everyone is very pleasant and friendly.", "pics": null, "resp": {"time": 1552080977609, "text": "Jackie  thank you so much for your feedback. We appreciate your business."}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "108075537322508810289", "name": "Josh Henderson", "time": 1584022815423, "rating": 1.0, "text": "Called for parts and was put on hold for 27 minutes and then told everyone in parts was tied up and they will have to return your call.", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "104964005971000799473", "name": "D Estill", "time": 1562712815280, "rating": 5.0, "text": "Awesome place..great folks", "pics": null, "resp": {"time": 1565707758681, "text": "D  thank you so much for your feedback. We appreciate your business."}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "105926641120708247179", "name": "eddie brown", "time": 1549578831261, "rating": 5.0, "text": "Excellent service ... great experience at the service parts counter", "pics": null, "resp": {"time": 1550593523716, "text": "eddie , thank you so much for your review. We are happy to hear you were well taken care of at our store. Thank you for being a loyal SunSouth John Deere customer. We hope you will be joining us for our Open House at each location on March 2nd from 10-1. We will be giving away a John Deere Gator as well as other prizes. Thanks again!"}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "117161291275126945518", "name": "Rick Molden", "time": 1536261705256, "rating": 5.0, "text": "Friendly and helpful. Well stocked with parts and accessories.", "pics": null, "resp": {"time": 1536588068816, "text": "Rick  thank you so much for your feedback. We appreciate your business."}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "100749716079278707165", "name": "A. Peaden", "time": 1521007623264, "rating": 5.0, "text": "Enjoyed making a machinery  delivery there staff was exceedingly helpful and willing to go the extra mile to keep me moving", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "114405740431455427524", "name": "adam weber", "time": 1538688482441, "rating": 1.0, "text": "So on 11 Aug 18 I bought a JD riding mower (E100) from Lowes. Prior to this I physically visited SunSouth to purchase a mower but was told that I would need to go to a place like Lowes or Home Depot. I used my mower 3 times and noticed that the engine was leaking oil. On 29 Sep (when I noticed the leak), I called Lowes since I also purchased an extended warranty. They said that they would have someone come out to pick it up and that they would call the day before they were supposed to pick it up (scheduled for today 4 Oct) and give me a time. They were also supposed to call the day of pick up to let me know they were on the way.\n\nStill haven't received a phone call and it it currently 4:21 pm. They close at 5 pm. My wife called Lowes back today at about 3:40 pm and they said they would contact them again and if we didn't hear from them that Lowes would call someone else.\n\nNeedless to say, I am NOT happy at all. I don't know about all of the other experiences, but so far mine is terrible. I will update if I get a call. Hopefully they can redeem themselves and get more than one star. I would give 0 stars if that were an option right now.", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "101436442804266499092", "name": "Brad Lee", "time": 1536695213034, "rating": 4.0, "text": "They picked up my John Deere lawn tractor for servicing and brought it back to me when they finished. They did a good job on the repairs.", "pics": null, "resp": {"time": 1538749797326, "text": "Brad  thank you so much for your feedback. We appreciate your business."}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "105793802741709915239", "name": "Glen Struchtemeyer", "time": 1519837847760, "rating": 4.0, "text": "I have always found the parts department staff very helpful", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "112068651097815798478", "name": "Susan Forks", "time": 1580593340831, "rating": 1.0, "text": "Little dirty and unorganized.", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "112408796556617400080", "name": "Mike Henderson", "time": 1577659062290, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "108645330892937812341", "name": "Gary Whiteside", "time": 1564842426835, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": {"time": 1565708598560, "text": "Gary  thank you so much for your feedback. We appreciate your business."}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "113157905349094461153", "name": "Sponge bob (darkstars)", "time": 1532689219970, "rating": 5.0, "text": "Very good service and good people are great service", "pics": null, "resp": {"time": 1532975807523, "text": "Don  thank you so much for your feedback. We appreciate your business."}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "111730638251025882777", "name": "Dale Hurst", "time": 1523149537661, "rating": 5.0, "text": "Dean at Montgomery Sunsouth was a real life saver on a part that I needed for my 5400. THANK YOU. Would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "112227177417134590141", "name": "silas bonner", "time": 1521549798497, "rating": 5.0, "text": "People there or extremely knowledgeable and helpful", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "113243278112954553108", "name": "Denorris Walker", "time": 1560118541807, "rating": 5.0, "text": "Great work for me", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "106860308004527833404", "name": "Vernon Hunter", "time": 1559920148688, "rating": 5.0, "text": "It's our local John Deere dealership.", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "107013053090850750961", "name": "Keith Oates", "time": 1572082619578, "rating": 4.0, "text": "Helpful people", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "118051830061796961119", "name": "William Wheat", "time": 1569101708865, "rating": 3.0, "text": "Gave me the wrong parts", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "110028426532301012271", "name": "Kalila Sankey", "time": 1552870258690, "rating": 5.0, "text": "Great rental", "pics": null, "resp": {"time": 1554481374454, "text": "Kalila  thank you so much for your feedback. We appreciate your business."}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "102341259405021591759", "name": "Greg Morgan", "time": 1559065422029, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "112669946370943844787", "name": "Ray Worley", "time": 1532983368076, "rating": 5.0, "text": "you need parts for your tractor they got it", "pics": null, "resp": {"time": 1533064605217, "text": "Ray  thank you so much for your feedback. We appreciate your business."}, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "112578078485551528849", "name": "Sean Lett", "time": 1535726579545, "rating": 5.0, "text": "Very knowledgeable staff", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
{"user_id": "108734538320657852290", "name": "Derek Mayes", "time": 1528198313556, "rating": 2.0, "text": "Customer service was terrible", "pics": null, "resp": null, "gmap_id": "0x888e824ab6ad50c9:0xfd65132a4056919f"}
