{"user_id": "117415127070050010807", "name": "Mitch Marucha", "time": 1626410975940, "rating": 5.0, "text": "Just moved to area. When walking in owner greeted us and made us feel at home. If you need any gaming materials they will be happy to help.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "115891825336225924966", "name": "braden watkins", "time": 1619913258830, "rating": 5.0, "text": "Amazing selection of d&d minis. The lady behind the counter was sweet as can be. And the broad range of games was amazing. If they ever move, it will be hard to find another shop with the level of knowledge and community as this one.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "108752709051219571861", "name": "Matthew Leu", "time": 1616248425568, "rating": 5.0, "text": "The owner is great. My son is just getting into Pokémon for collecting and we made our first purchase yesterday. Nathan was more than helpful at recommending what we needed and how to get started. Has to be one of the biggest and best collections in the south. Definitely my go-to place now for everything Pokémon related. Can’t wait to go back. Thanks for all your help guys and gals! You have a loyal customer for life now.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "106739085411240037675", "name": "Freeman Presson", "time": 1614555687003, "rating": 5.0, "text": "New Mom&Pop gaming store NE of Birmingham. Has a bit of everything. Cozy playing space. Nice old house. Kind of a quest to get there from Roebuck. Nice people. Owner has a dice problem, like so many TTRPG players.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "105331501006931428173", "name": "Jamie Pugh", "time": 1622760953301, "rating": 5.0, "text": "This was our 1st time here and this my daughters wheelhouse for sure!!! She is in love!", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "106662005277028506330", "name": "Breanna Tucker", "time": 1598737558741, "rating": 5.0, "text": "Knowledgeable, helpful, and so very friendly! They've got something for almost everyone!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMfylT70CpcrVrR3hn0w1IfY_2M9I4e9wFc8Qh-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNF-NA6VbBZX1deD81QYtOL9SH46920o7J3ipfW=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "108361600114441991605", "name": "DrayPullz", "time": 1612557704850, "rating": 2.0, "text": "This place is way too expensive. Try going to any other card shop and they will actually sell you things at a proper price. A slight markup is fine, but this shop is insanely priced on everything. I promise anything you find in that shop you can find on eBay for a minimum of $10-$20 cheaper. Just spend the money you would waste here driving to big box stores  and hunting for product yourself. You are better off.", "pics": null, "resp": {"time": 1614885637681, "text": "Most of our prices on Magic the Gathering and Yu-Gi-Oh are actually cheaper than Walmart and Target. We have sealed Pokemon product up to 25 years old which is MUCH more than it's retail price. With the huge demand for Pokemon, pricing is increasing daily. Also, while a $200 card in the store might be $180-$190 on eBay, you have to determine whether the $10-$20 difference is worth waiting a week or taking a chance of getting a counterfeit. You have to also remember that eBay is an auction site where you are buying from people selling out of their basement with no overhead. I think you'll find if you look at online card vendors such as Amazon and Tcgplayer, you'll find that even our $7,500 Pokemon booster boxes are priced at the same point as most other dealers. There's only one Pokemon item in the store I know we're high on. Hidden fates elite trainer boxes. I have them priced to make a $3 profit but we are much higher than others due to the recent reprints."}, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "102119845141821018687", "name": "Alex E", "time": 1609869120193, "rating": 5.0, "text": "Great store with lots of products. I’m new getting into Pokémon again after almost 20 years and the folks here pointed me in the right direction. Fair prices and a clean store.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "117498231643615266509", "name": "Corey", "time": 1600200342045, "rating": 3.0, "text": "The prices are marked up and trade in offers are always incredibly low which is unfortunate given the amazing inventory the store offers! However, The customer service is pretty amazing and always very nice and sparks conversation! My literal only complaint is the prices and the incredibly low trade in offers.", "pics": null, "resp": {"time": 1600195455223, "text": "Your last trade in attempt I recall there was a major discrepancy between what your app said tcgmid was and what it was on their website on a couple of cards. I've also explained to you directly that our pricing is a lower percentage for Pokemon than for Magic since the turnover is much lower than Magic. I realize you play both games and you're welcome to trade in Magic or Pokemon for store credit for anything, not just trading Pokemon for Pokemon. Our singles inventory should be right at Tcgplayer mid prices other than the cards under $1. Our base price for mtg rares and Mythics is $1 and commons is .25. Our Pokemon base price is .25 no matter rarity.  Our sealed products are generally based on Tcgplayer pricing as well. Our main card game is Magic the Gathering and we generally have approximately 100,000 mtg cards traded in per month. We continue to allow trade ins even though we are paying storage fees on somewhere between 2.5 and 3 million cards in the to be processed areas right now. I'm sorry you're disappointed in the service or offers you have received. We always give the customer the pricing and the choice to keep or sell their items. I know that this is not the case exactly with you, but you would be amazed if you knew how many people think if a card is $200 online that they can bring it and sell it to me for $200 cash. I work very hard to offer a fair trade in policy and all individual trade in pricing is based on the percentage given for the particular game and the quality of the card alone. Bulk collections have their own pricing schedules and I ask the players to sort out the expensive cards from the bulk to make sure they get the most money for their trade ins."}, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "115893095381456156519", "name": "Johanna Wilkes", "time": 1611461449924, "rating": 5.0, "text": "Great little store!  We will definately be going back!", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "108619625366530006375", "name": "Brittany Freeman", "time": 1598833223280, "rating": 5.0, "text": "This store is amazing! Very friendly owners that are knowledgeable about all products! I highly recommend this place.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "103702638677376593975", "name": "Danny Bradford", "time": 1623965545985, "rating": 5.0, "text": "Awesome stuff.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "109235889235142187176", "name": "Nicholas Toth", "time": 1612928839680, "rating": 3.0, "text": "Little expensive, but good people own this shop. Would recommend for good conversation. I had left a four star review before but afterwards I was called out publicly in a reply to this review.", "pics": null, "resp": {"time": 1600268063246, "text": "Sorry we have not gone into liquidation mode on Modern Horizons boxes yet like some other stores. The Titan deck box you picked up the other day was $10 less than it is on eBay and $15 less than on Amazon."}, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "112187154876758105450", "name": "Lonnie Coleman", "time": 1610234797652, "rating": 5.0, "text": "Great place, great selection, great staff, and a Pokemon Go stop.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "109201798636646999952", "name": "Colton Armstrong", "time": 1618108640700, "rating": 5.0, "text": "Fantastic staff awesome selection", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "108912198605218137054", "name": "Megan Jacobson", "time": 1598406612789, "rating": 5.0, "text": "Great Selection for any geek gaming fandom! Staff was friendly and the shop was clean.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "106858986028806870566", "name": "cwalt Derz", "time": 1615945245515, "rating": 1.0, "text": "Contributing to the problem of scalpers. Pokémon cards sold here yes, but at 4x market value. No daily collector should have to pay that", "pics": null, "resp": {"time": 1615946645014, "text": "We update our prices twice per week and pricing is based on current market pricing and is due to supply and demand. We generally check both Amazon and Tcgplayer. Right now most Pokemon is selling for more than normal. We are having to pay more than retail for most products just to keep it in stock so people can have a place to purchase it. Our first run of Pokemon that comes direct is priced less than you can get the items direct from Pokemon for. The wholesale companies are charging more as well. We also limit quantities on most Pokemon items so everyone gets a chance to purchase. We keep Pokemon in stock that hasn't been in most retail stores for ten years. Out of print collectibles almost always sell for more than retail. We always have multiple Pokemon items at regular retail price. I also make sure to point those items out to customers when they come in. This is an issue with the limited printing from Pokemon. That's why it's sold out everywhere locally. We've also been cut on available quantities from the distributors. Out of 200 elite trainer boxes of Shining Fates ordered, we received only two and we sold them for $49.99 each release day. Checking with Walmart.com today 3-17-21, MOST products we have in stock are actually less than buying online from them. Example, Shining Fates ETBs are $130 on Walmart.com, they are $99.99 at our store. Evolutions booster packs are $31.99 each at Walmart.com, while ours are $17.99. Vivid Voltage booster boxes are $299.99, ours are $199.99. Crimson Invasion ETBs are $135.24 at Walmart while ours are $84.95. Champion's Path ETBS are $109.99, ours are $99.99. In looking up over 20 in stock products, the ONLY Pokemon item I  found less at Walmart.com was the Dubwool box which is $34.95 while ours is $34.99. Several products I found we are over 50% less than Walmart.com. Market value (also known as OMV, or \"open market valuation\") is the price an asset would fetch in the marketplace, or the value that the investment community gives to a particular equity or business. I think you were referring to MSRP (Manufacturer Suggested Retail Price) or LIST price. MSRP will not generally apply for out of print or high demand collectibles in ANY industry. Same thing happened with the VW TDI a few years back when they were selling for $20,000 over MSRP and you had to put in your order three months in advance."}, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "105312123091634172670", "name": "Jay Jordan", "time": 1564782455482, "rating": 5.0, "text": "I have spent large amounts of time here, especially when I was younger. I had just gotten into magic the gathering and was immediately welcomed by everyone in the store. I was given a deck and taught how to play. I absolutely love this place and will always return here to buy my cards and accessories. Good rules and good crowd. Love this store.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "104650027031979069890", "name": "Josh Martin", "time": 1580836601255, "rating": 5.0, "text": "Great place to go for RPG and Card game enthusiasts. I paint miniatures as a hobby and they have an awesome selection and great prices. The staff is always friendly and it's a very welcoming environment. Definitely worth a visit.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "118339299729312096138", "name": "Michael Kuhlman", "time": 1595437454309, "rating": 5.0, "text": "I always have a good time there. Great selection, good people.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "111030022256650810543", "name": "Mr. w4ttz", "time": 1594755381814, "rating": 5.0, "text": "Wonderful selections, great owner, and enforces hygiene. 5 stars 👍", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "115407734733198305028", "name": "Nick Nolan", "time": 1564782217900, "rating": 5.0, "text": "I always feel very welcome coming here. Everyone is always nice and helpful. The place is clean, organized, and it's hard not to smile when you see all the board games you have to choose from.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "117918128737810388226", "name": "Daniel Heard", "time": 1566079594004, "rating": 5.0, "text": "Great prices and selection. Helpful and kind folks behind the counter. Pretty nice patrons as well. What more can you ask for?", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "115181721264397399081", "name": "Ben Hepburn", "time": 1548219059992, "rating": 5.0, "text": "Mythic Cards & Games has to be one of the best shops I've ever encountered. You're provided with a large array of gaming products from general items to very rare collectables. The atmosphere is layer out in order to provide a comfortable space for gamers of multiple types to assimilate and relax or compete. Game ethic and sportsmanship etiquette is posted and encouraged properly. My favorite part by far is the staff. You have an owner who shows runs the shop most of the time and a group of the most dedicated and friendly staff in the world. If they promise they will host an event, these guys will come through for the players come plague or ice. If there was an independently owned and operated business to support for gaming, it's this one.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "107155234244999675233", "name": "Thirty 850", "time": 1560632412214, "rating": 5.0, "text": "Came in for the first time and I was blown away with the shop and the owner. Great board game selection! Plenty of magic the gathering and accessories to look through.  Thanks again for the conversation! I look forward to bringing my family back for Friday night magic and release events!", "pics": null, "resp": {"time": 1560637635886, "text": "Thanks Christopher, it was nice to meet y'all yesterday."}, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "112681243278075723175", "name": "Brian Thompson", "time": 1549487608075, "rating": 5.0, "text": "My father's store, so I will try not to sugarcoat it to much. My dad is crazy hard working at his store. Whether he is is helping customers learn a new game, playing with people, or welcoming new people to his store, he always has a smile on his face. He tries to learn everyone by name, and has a special bond with all of his customers which makes him stand out from any other store in America. Rather than an owner of a gamestore, overtime you get to learn him as a friend. Mythic Cards and Games also gives the best prices compared to other game stores. Mythic Cards and Games makes it easy to find new friends and form long-lasting relationships with people. Make sure to check out the store!", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "116678427529346452567", "name": "Patrick McCormick", "time": 1600552698688, "rating": 5.0, "text": "Helpful staff,  friendly place to play.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "103391958312772987352", "name": "Faizon Pruitt", "time": 1576460550857, "rating": 4.0, "text": "If your into cards games like Magic the Gathering, and you like Dungeons and dragons, then this is your kind of place", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "102233310486369669513", "name": "Mark Coleman (Thrache)", "time": 1578012235609, "rating": 5.0, "text": "Great family friendly game store with a very knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "110826549704461701325", "name": "Aiden Smithey", "time": 1622124938252, "rating": 5.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "115168556354172725467", "name": "Jonathan Self", "time": 1496599401763, "rating": 5.0, "text": "The owner of this place is really nice and very helpful. He has great, honest pricing in his store/online, and maintains a really well-done website listing his in-store stock that is really accurate and up-to-date. In my honest opinion the owner seems to be a very genuine guy who really has a passion for having a quality game store. He has an entire back room area dedicated to having people compete with one another and has prerelease parties all the time. Every time I go there with my son Graham we see tons of kids there having a good time and him interacting with them, which I think is great!", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "106913486271716636570", "name": "Dawn33 kitty", "time": 1556941067006, "rating": 5.0, "text": "Best place ever and they are ok with me bringing my kids in to play games too. I love it there. I love you guys y'all are awesome!!!!!", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "104203654236464381665", "name": "James Burton", "time": 1547909016933, "rating": 5.0, "text": "This is my \"local game shop\". Great ownership, great players, just a bit cramped atm. Hopefully that will get better when they move to the new location soon. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "107662351937125856411", "name": "SkyeSlays", "time": 1581638988952, "rating": 5.0, "text": "Great store, great deals, great clientele. Clean, and friendly people ready to sit down and teach people to play games", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "107904723552279632853", "name": "Branden Moore", "time": 1490788774486, "rating": 5.0, "text": "Really enjoyable experience traveling to Mythic for Friday night magic. My buddy from Atlanta called ahead to ask about FNM, and the owner remembered the caller ID saying Atlanta, so when we arrived he called us out and welcomed us to the shop. He showed us around, introduced us to all the competitors for that night, and was just beyond friendly in helping us out. The shop is CLEAN. Which is huge for card game shops. He has some rules he posts around that included no profanity or smoking inside which really helps it feel welcoming and family friendly. HIGHLY recommended.", "pics": null, "resp": {"time": 1512373259630, "text": "Branden, thanks for coming out. Any time you're coming through town we'd be glad to have you back. Nathan"}, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "117390050780479569002", "name": "Adam Crocker", "time": 1554943496925, "rating": 5.0, "text": "This is an awesome family friendly environment! The store owner is a fabulous person! The clientele is so helpful and friendly!", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "107251261641850877030", "name": "Marty Mostella", "time": 1511148483990, "rating": 5.0, "text": "This is an exceptional card shop! The service is top notch. I am new to card gaming and they have been extremely supportive and helpful. They definitely have my business. If you are looking for trading cards or games, this is the place to go.", "pics": null, "resp": {"time": 1511149163857, "text": "Thanks a lot Marty, glad to have you and Chris any time!"}, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "112817908284319031554", "name": "Nathan Zarzaur", "time": 1534114437743, "rating": 5.0, "text": "Best place to go for great and friendly service. The owner really knows his stuff when it comes to both cards and board games, and gives great recommendations if you're looking for advice on what to get. Definitely recommend this spot for all your gaming needs.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "117519527299178816502", "name": "SpinDashMaster", "time": 1575750046023, "rating": 5.0, "text": "Did a friday night magic draft event and had a wonderful first time experience. I'll be coming back next week for another fun event!", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "111563585774646896806", "name": "Devon Musto", "time": 1556593368747, "rating": 5.0, "text": "Great atmosphere, ran by the nicest people.  Always have fun going to play Friday Night Magic and more!", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "104051149219988640650", "name": "Telo", "time": 1568132569129, "rating": 4.0, "text": "They have very little video games but there a card store but it's pretty big and clean they even do card leagues from what I understand idk about borderlands games but i know they have alot of the games and leaves like dnd and stuff like that.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "105420790912897187312", "name": "Syren Delphi", "time": 1553402462243, "rating": 5.0, "text": "The people there, employees and customers, are always nice and welcoming. Prices are great, and the atmosphere is just amazing.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "117467536101602952510", "name": "Isolated habit", "time": 1552271558252, "rating": 5.0, "text": "Really great place love the people and everybody's cool I'm a yugioh player and I've have nothing but good experiences here", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "102910080627340757660", "name": "Robert Williams", "time": 1565215324243, "rating": 5.0, "text": "They were kind, thoughtful and welcoming to new faces.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "110139195954817400733", "name": "Craig Norris", "time": 1560998000741, "rating": 5.0, "text": "Great place, warm inviting people, good selection, fair prices", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "101743579769808489719", "name": "Blackout2010", "time": 1564696947697, "rating": 5.0, "text": "Love the store and hope that it stays open indefinitely.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "116764324250020710343", "name": "Mj layton II", "time": 1561438372427, "rating": 5.0, "text": "Love going here to play yugioh.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "112711198766520508678", "name": "jared nicholas", "time": 1489939735142, "rating": 5.0, "text": "Grate place! Just started playing mtg again and everyone  here is friendly and helpful! The owner is very personable, he even remeber my name!", "pics": null, "resp": {"time": 1512373331615, "text": "Jared, thanks for spending so much time with us. Nathan"}, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "109626693098377538267", "name": "Shannon Sanders Ogles", "time": 1614748414559, "rating": 5.0, "text": "Loved it", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "115290119703828450294", "name": "Noah Morgan", "time": 1501112233002, "rating": 5.0, "text": "Super friendly and cool place to play magic and or other games\nOpen late and always a crowd\nA must visit for any comic or card enthusiast", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "100129384287631007044", "name": "Roux", "time": 1494781935050, "rating": 5.0, "text": "Nice location, conveniently by my house, great family friendly environment, and good hous. Definitely come here for any gaming :)", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "107515471244442089272", "name": "David Reeves", "time": 1524689384931, "rating": 5.0, "text": "Really enjoyed MTG Dominaria pre-release party! Really nice owners and players.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "109198299857746571897", "name": "Micheal Orr", "time": 1502605051299, "rating": 5.0, "text": "Great place to go if you're looking for board games or trading cards Great/Friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "111112002506301629457", "name": "John Hand", "time": 1500942136733, "rating": 4.0, "text": "Like most FLGS it caters mostly to Collectible Card game players like magic the gathering.  The owner does support board gamers and RPG players, but clearly is supported most by the card players.  His selection of board games has progressively gotten better.  He has a medium collection of games you can play for free.  He also supports some video gaming.   His play space is medium sized and usually active.  It can get loud, but you're sure to meet like minded friends.  Snacks can be purchased and there is a bathroom.  Prices are equal to or higher than other FLGSs.  I currently go there for board gaming Wednesdays from 630  until complete.", "pics": null, "resp": {"time": 1512373173016, "text": "Thanks John. I think you've noticed lately we've been carrying many more board games. I also think if you'd come in for our Black Friday sale you'd know we're also catering more towards board gamers.  I just did a physical count and we currently have 334 board games / expansions out on the floor (if I didn't miss any) and I put approximately 80 up in storage after the black Friday sale. As far as different titles go, there's a lot to choose from, however I cannot carry every title available. As always, I'm happy to order a title in for you any time."}, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "105236250013645070350", "name": "Kandice B", "time": 1485302213273, "rating": 5.0, "text": "I absolutely love it here! I don't have a lot of time to go, but every time I do I enjoy it! The staff is very friendly!", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "105418327356045839157", "name": "James Doty", "time": 1474504811832, "rating": 5.0, "text": "Went in there the other day. The owner is a very genuine, nice guy that I really enjoyed talking to.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "110010609228137721473", "name": "Donna Mitchell", "time": 1519346447485, "rating": 5.0, "text": "Great plac for teens to go n play cards", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "109166713516932993242", "name": "Derek Jman", "time": 1464117574326, "rating": 5.0, "text": "Clean, friendly, lots of inventory and probably the best shop around birmingham over all.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "110201681653393317498", "name": "Martin Crawford", "time": 1521595527382, "rating": 5.0, "text": "I come here for magic releases and there is always a good crowd here.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "113374046194547597982", "name": "Soren landfall", "time": 1518606977720, "rating": 5.0, "text": "Great place to hang out and play games!", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "112627741444778990899", "name": "Amelia Briggs", "time": 1545344784407, "rating": 5.0, "text": "They have so many options!! Great place!!", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "118124202645567483426", "name": "Danny Adkins", "time": 1515241224826, "rating": 5.0, "text": "Very friendly people, make you feel welcome and comfortable. Nobody pressuring you to buy, browse at your own leisure.", "pics": null, "resp": {"time": 1512372456074, "text": "Thanks Danny. You should come in more often. Feel free to join us on board game night each Wednesday."}, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "103317854498542848354", "name": "Maxcine Beach", "time": 1562949019900, "rating": 1.0, "text": "They were rude to my husband,a disabled vet, who visited with a group of players.", "pics": null, "resp": {"time": 1562965163513, "text": "We did tell your husband we would not buy his items after he violated the store rules and was warned of his rules violations multiple times. However, he was not treated rudely."}, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "106535502830176826089", "name": "Lori Goldberg", "time": 1515512209344, "rating": 5.0, "text": "Cute little spot, great customer service", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "108172431254489619058", "name": "Jason Hoang", "time": 1479189985516, "rating": 4.0, "text": "Nice location, a bit small but, is got character", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "104895006181900432876", "name": "ash gacha and more", "time": 1562813011791, "rating": 5.0, "text": "I go here all the time", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "110807236064575737082", "name": "Angela Gray", "time": 1533774389405, "rating": 5.0, "text": "Very friendly and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "117167591899817286123", "name": "Stark", "time": 1514501447425, "rating": 4.0, "text": "pretty nice lgs", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "112696812531471573799", "name": "Thomas manthei", "time": 1564789507845, "rating": 5.0, "text": "They sell cardboard and cardboard accessories", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "100211643859401884551", "name": "Dino Hughes", "time": 1533933330177, "rating": 5.0, "text": "Great and friendly place", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "108991385555024486215", "name": "Jason Chambers", "time": 1461438462386, "rating": 5.0, "text": "Lots of events including drafts, dnd, mtg tournaments, and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "107726952675373087396", "name": "Shadow", "time": 1518924529146, "rating": 5.0, "text": "Good for d&d", "pics": null, "resp": null, "gmap_id": "0x88890b09fcf5a675:0xce64eacf9912dcea"}
{"user_id": "101310756448659979179", "name": "John Moody", "time": 1623560722836, "rating": 5.0, "text": "Great place. Great people. Mark is top on my list of shop owners who really connect with people. All around Great", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "107133335214731195713", "name": "Jacob Burrell", "time": 1617215426619, "rating": 5.0, "text": "Very helpful staff. Friendly and knowledgeable! Will be using them again!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "105324516273711896320", "name": "Thomas Smith", "time": 1606629003384, "rating": 5.0, "text": "I love buds place. Great games,great friends. It's the one thing I do for myself every week", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "100934268910059679156", "name": "Courtney Campbell", "time": 1613889730960, "rating": 5.0, "text": "Always fun to go here every Saturday i really enjoy it", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "105191454872307993461", "name": "roger crossgrove", "time": 1614907490326, "rating": 1.0, "text": "Said open 3 times. Visited 5 hours before closing 3 times. Closed 3 times.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "113669550756749181710", "name": "Dustin Caston", "time": 1621591571076, "rating": 5.0, "text": "Great place for hobby supplies", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109929605203784838004", "name": "Ethan Forrest", "time": 1602891087026, "rating": 5.0, "text": "Great place, we went there to play games, had a wonderful time!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "116652009315478167368", "name": "Grillenheimer", "time": 1583643752332, "rating": 5.0, "text": "Small yet they have a ton of cards, games and accessories.  Super nice owner.  They even sell Transformers deck boxes!  But no boosters.  They even have the large top loaders for characters like Omega Supreme, Fort Max, Metroplex and Trypticon for only $1.  Rooms upstairs and multiple tables downstairs for game play.  Parking can be an issue but Leeds doesn't have that much traffic.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "106102417184669762480", "name": "Joshua French", "time": 1551901031775, "rating": 5.0, "text": "Bud's Place Games is the place for table top games in Leeds. They have events, free private rooms, and a great selection of games of all types to buy. If they don't have it they are more than willing to try and order it for you and it is almost always at least comparable to Amazon, sometimes it is even cheaper.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "110075713610063946169", "name": "SadMoonBeam", "time": 1548264850573, "rating": 5.0, "text": "I order cards online from them and pick up in store, super easy and convenient. Saves me time and waiting for cards from eBay. I highly recommend more people use this, so more cards can be put in the online store. Buds place is also a great place to play table top rpg games, with plenty of room to play.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "103051368144766635882", "name": "Rick Goudeau", "time": 1555698788472, "rating": 5.0, "text": "A great place for playing games and to get your games and cards. Nice selection of games to choose.  My FLGS with the emphasis on Friendly. Love having my weekly game night there.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109085189746461005328", "name": "Stephanie Newman", "time": 1574523088522, "rating": 5.0, "text": "We go to Bud's at least two times a month. Great place to game and the people are great.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "105762132944531395121", "name": "Chris McCormick", "time": 1551538625506, "rating": 5.0, "text": "Hands down the best place for gaming and your gaming needs. Owner is incredibly friendly and offers the best prices around coupled with the best gaming environment around! Love this place and wouldn’t go anywhere else!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "113019709584251410314", "name": "Andrew Thomas", "time": 1568136308929, "rating": 4.0, "text": "Good place. These guys are very accommodating to the table top gaming community.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "115877518597041300513", "name": "Mark", "time": 1572104073156, "rating": 4.0, "text": "Great game store - awesome range of boardgames and plenty of space.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "111083237564336965364", "name": "Seth Hiatt", "time": 1570824115258, "rating": 5.0, "text": "Great store!  Mark is a great guy and really knows his stuff!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109235889235142187176", "name": "Nicholas Toth", "time": 1559470092764, "rating": 5.0, "text": "Really great staff. They actually care and want to see people happy.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "108000167801958027226", "name": "Serendipity Awaits", "time": 1539260733255, "rating": 5.0, "text": "Big fan of Bud's place!! This was my 1st visit in 4 plus years.  They've made some awesome improvements!! The store seems more family friendly and they have tons and tons of tabletop games to encourage family time at home!!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "114150549155963493646", "name": "Lynn Culpepper", "time": 1353361547245, "rating": 5.0, "text": "An awesome place for gaming and socializing with your geeky friends.  It is the BEST place for buying or selling MAGIC singles.  They are fair and honest.  They have air conditioning, bathrooms, snacks and cold drinks, and A LOT of tables for whatever game you want to play!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "105259615434253707284", "name": "Adora Scruggs", "time": 1554160717508, "rating": 5.0, "text": "Very friendly and helpful staff and good selection of items. There are also nice rooms upstairs to have separate games going at the same time.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "117507005839139856136", "name": "Justin Moorer", "time": 1352994874269, "rating": 5.0, "text": "I have been coming to this store for the last 2 years. The owner is very helpful and seems upbeat.  I found this place through my best friend and have been coming here ever since.  The staff is wonderful and the game choices are really excellant.  Kudos to the owner and the staff for making this my place to hang out on lunch from work or just to go during the week and weekend.  Friday Night Magic is one of their busiest nights!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "108511844308611778486", "name": "Michael Streufert", "time": 1531631200745, "rating": 5.0, "text": "The guys here are amazing with my kids and very helpful.  They host assorted tournaments every week.  There are a lot of tables to play on and they have a loaner library of games you can try out.  I have known these guys for a long time and enjoy visiting.  Bud's Place is very prompt to reply to Facebook messeges.  I cannot say enough nice things about this place.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "118342818184107114104", "name": "John Sotiropoulos", "time": 1563568140002, "rating": 5.0, "text": "Awesome.  Pokeman, Magic the gathering, Yu-Gi-Oh are played frequently.  They buy cards.  Crowded every weekend.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "106721273788422653046", "name": "greatcornholio", "time": 1373067921975, "rating": 5.0, "text": "Its rare to find people who love what they do as much as the guys here seem to. They are honest and hard working and will do their best to get you the best deal. Its by far the best place I have found to get Magic the gathering singles even cheaper than you can find them on eBay. If you're ever in leeds and a gamer you should stop in and see what you've been missing out on.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "100768510409227105822", "name": "Jesse Sierke", "time": 1515333763157, "rating": 4.0, "text": "I had a great time here playing games with awesome people. The staff were supportive of my needs, and the selection of items for my game (D&D Adventurers League) was pretty good. I'd love to help them set up some display tables for wargaming, but I understand that space is a premium.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "116941289609668194524", "name": "Roland Garofalo", "time": 1526992392090, "rating": 5.0, "text": "I have not visited their physical location, but I must say their customer service is phenomenal. A few months back I ordered some MTG cards online that came through their store. Unfortunately, the cards never shipped due to a processing error, no big deal. I gave 'em a call, and they immediately put all their effort into fixing the error and sending me the cards. AND they also included some foil promos in the package that were worth way more than the cards I purchased originally. It's great to see a LGS that truly supports their customers. If you are in the area, I highly recommend checking them out.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "104099598367036383258", "name": "adam ledbetter", "time": 1563686042579, "rating": 5.0, "text": "Great store! Always a good experience when I go here.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "108807375376158388387", "name": "patrick tatum", "time": 1539811042124, "rating": 5.0, "text": "I’ve been a regular for years. Mark is one of the most kindest and caring store owners I’ve ever met. Matt Johnson the Gen. manager is a professional and keeps a tight ship as well as he works with customers.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "102988102716022634416", "name": "Aaron", "time": 1558746079697, "rating": 5.0, "text": "Have generally always had good experiences here.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "102816650738572407672", "name": "M M G", "time": 1540014914408, "rating": 5.0, "text": "Great selection of board games and card games. Drove 30 miles to check the store out, wasn't disappointed at all.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109624069832771882442", "name": "Brian Graves", "time": 1486559849916, "rating": 5.0, "text": "Best game store in town.  The owner genuinely cares about his customers and will stay open late just for the players to enjoy sometimes.   Very fair on pricing and the best selection of products around.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "108301385463687097775", "name": "Ian McPherson", "time": 1530543363317, "rating": 5.0, "text": "Nice small shop. Plenty of space for playing really anything. There are private rooms upstairs for dnd or boardgames.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "101187465808003844331", "name": "Morgan Pendley", "time": 1508104094990, "rating": 5.0, "text": "Absolutely wonderful shop, one of the best in the Birmingham area. Extremely friendly owner and staff, by far the best service around. Good selection of product, everything from MTG to board games.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "101956140575368842664", "name": "thomas hames", "time": 1577199536440, "rating": 5.0, "text": "Always a great place to game.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109641766410808790189", "name": "Captain England", "time": 1517781411551, "rating": 5.0, "text": "Best place I've ever been to for games. Great for Magic, Pokemon, and Vanguard card games. Nowhere else is as good for Board games, manager is extremely knowledgeable. Has multiple rooms/areas for board gaming, rpgs, or  anything the like.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "103437716099532124221", "name": "timothy dumas", "time": 1441406287903, "rating": 5.0, "text": "This store is pretty amazing. I've been going weekly for two years and the Owner Mark is exactly what you want for this type of store. He is upbeat, honest, hard working and willing to help you out if he can. their prices for mtg are going to be the lowest in the birmingham area because of his pricing system. he has all the standard cards in binders so you can flip through at your convenience,with a lap top connected to his store sitting right beside them so you can check his stock online just as fast as he can. he has two glass cases with his more expensive cards which are organized like they should be by color, white, blue, black, red, green and artifact followed by lands. and also by format, standard, modern, legacy, commander. If you never have been before it is worth your time if you're close to stop in and say hey and look around. Thanks for the great store Mark!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "108341074087600503589", "name": "Tanner Buckley", "time": 1429142507405, "rating": 5.0, "text": "This is a really good place with a lot of good cards. They have very good prices and knowledgeable. I wish that they got more attention then what they do!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "114917561558426515774", "name": "Louis Frohock", "time": 1508109615880, "rating": 5.0, "text": "An excellent shop, one of the best in the state. The friendliest owner and staff, the sweetest service around. Great selection of product, everything from card games to board games.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "104943155967530499750", "name": "Jacob Lee", "time": 1516514327405, "rating": 5.0, "text": "Matt and Alex are super awesome. The atmosphere is fantastic and they assist however they can. Will be back starting next week!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "113951051217584677920", "name": "Kevin Cassidy", "time": 1522463625908, "rating": 5.0, "text": "Decent little shop, very friendly service, and great prices and availability. Came in looking for some card sleeves, deck box, storage box, and possibly a few single Yu-Gi-Oh cards. He had all of the above, including a computer for ordering cards on their own website, then receiving them in only 15-20 minutes (their warehouse was right up the street). Place was very lively and busy with players too.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109332471925722082366", "name": "Rachel Kendrick", "time": 1579636139863, "rating": 5.0, "text": "It's fun, everyone is very friendly, and it's local.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109926422530972863291", "name": "Shawn Temple", "time": 1422398386329, "rating": 5.0, "text": "Best prices I've found in Alabama by far, below TCGplayer Mid price. Great selection, very organized, amazing owner. Parking isn't the best but I've been at worse places. If you're in the area check it out!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109030411516492577263", "name": "Vivian Downs", "time": 1455523553069, "rating": 5.0, "text": "Home sweet home!! My boyfriend and I were looking for a place to play Magic after Mad Doctor in Birmingham closed. We had tried another that really just didn't cut it, and then  friend of ours told us we should really come here. Instantly I felt at home. I made friends fast and the owner takes good care of his customers. He helps them with all of their needs and works with them when he needs to to give them the best experience he can. I just recently got into Heroclix, and Bud's has the friendliest heroclix community around!! I love this place, and support it as much as I can!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109391888876163709634", "name": "Sherri Anderson", "time": 1505256653652, "rating": 5.0, "text": "I had a lot of fun playing Dungeons and Dragons there. Also, they've got a nice selection of comics, games, and toys.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "114768054416520355513", "name": "aj goble", "time": 1523323638257, "rating": 5.0, "text": "the staff is very friendly and helpful and the selection is great. there are also always new events going on and something fun to do.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "112694592668379033074", "name": "Lane Miller", "time": 1542831854988, "rating": 5.0, "text": "Great staff, good environment, a little cramped during big events.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "105593193803210504572", "name": "Ryan Herrin", "time": 1531208459017, "rating": 5.0, "text": "Helpful and friendly staff with a great selection of games and cards with plenty of room for gaming.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "106809462392385631112", "name": "og LiquidDeath", "time": 1554593486049, "rating": 5.0, "text": "Great people great customer service always!!! I love this place!!!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "108860083180217699765", "name": "Brad Milburn", "time": 1522758700122, "rating": 5.0, "text": "Nice variety of games and variety of heroclix singles. Was there for Winter WKO, event was ran really well.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "114984570437187460636", "name": "Doug Schaefers", "time": 1539700590839, "rating": 5.0, "text": "Despite it's small size it does carry a large variety of games and gaming supplies. Plus, if they don't have it in stock they can order it and have it in store in no time.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "111626308153450153978", "name": "Keaton Abernathy", "time": 1546122421808, "rating": 5.0, "text": "Friendly staff, excellent events, and fun games. What more could you want from a game store?", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "111038856285474488886", "name": "94shadowolf", "time": 1531507012425, "rating": 5.0, "text": "Great place,amazing shop, super friendly staff, and an amazing selection of all tcgs.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "102320135344051806839", "name": "Sirens Final Gift", "time": 1528473556538, "rating": 5.0, "text": "Great place for everyone from hard core gamers to new people just starting", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "106742041114990529498", "name": "Alexander Nathan Bailey", "time": 1519569333309, "rating": 5.0, "text": "People were polite and helpful. Overall had a great time and experience.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "116796819872900985042", "name": "Novapierce 1", "time": 1500843708443, "rating": 4.0, "text": "Good service with a friendly atmosphere in a quaint little shop . A bit out of the way but definitely  one I'd recamend.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "110823527839120486469", "name": "Shai White", "time": 1513817662414, "rating": 5.0, "text": "Great place for gamers to hang out and meet more of the board and card gaming community!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "100833022368411705294", "name": "Rosemarie Stipati", "time": 1518092354979, "rating": 5.0, "text": "Great staff. Fun place to play D & D Adventures League.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "106100216121948603954", "name": "Mega Dic", "time": 1387266335988, "rating": 5.0, "text": "I was introduced to magic not long ago and fond this store not long after. Just the other day I walk in hoping to have my first magic match, but with my luck no one was even there playing magic. Luckily the owner, Mark, told me to go get my cards. He stomped me, but thought me so much about magic and I had a blast!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "113693676323240955902", "name": "Sherman Deal", "time": 1528602234025, "rating": 5.0, "text": "Friendly and safe place to go and you card or board games", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "102167859178545290828", "name": "Metal Dad1318", "time": 1535911682606, "rating": 5.0, "text": "Great place to game and meet new people.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "106963845491371669809", "name": "Rose Stipati", "time": 1497949879220, "rating": 5.0, "text": "Great selection of board games. Friendly & knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "117666082010320463897", "name": "Keith Wideman", "time": 1515617937172, "rating": 5.0, "text": "Awesome store.  Very helpful staff.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109663116005659638365", "name": "Patrick Isbell", "time": 1341125624268, "rating": 5.0, "text": "Great place for MTG, tournaments thurs fri and sat and easy to pick up commander games.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "103873168523776663231", "name": "Michael Berryhill", "time": 1413380844021, "rating": 5.0, "text": "Out of the many MTG locations I've been to in the past 7 years, this one takes the cake.  Friendly atmosphere, varied selection, and a great owner make this establishment truly top-notch.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "102799321743800274649", "name": "Ronald Brock", "time": 1498305924886, "rating": 5.0, "text": "Great store, the owner Mark is a great guy and will work with you", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "108370640039579065812", "name": "Fatsu Swagneel", "time": 1506228028079, "rating": 5.0, "text": "If you and 30 friends had OCD you could not organize better than Bud. get rekt noob.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "103277960227268048701", "name": "Paul Gleaton", "time": 1542497438557, "rating": 5.0, "text": "Great place to game, friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "102295040877077736466", "name": "Steve Uptain", "time": 1533354543071, "rating": 5.0, "text": "Great place for all types of games!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "104269742669627379292", "name": "FATE Destiny (FATE)", "time": 1460742881343, "rating": 5.0, "text": "The best of the best, with Friday night magic, DND, and lots more.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "111777164732979772696", "name": "Magic City Game Club", "time": 1443326214938, "rating": 5.0, "text": "Awesome owner and very accommodating. I definitely enjoyed my time and will be returning on a regular basis.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "117711447631154434340", "name": "Seraphina Croi", "time": 1518706105436, "rating": 5.0, "text": "Great place for all your gaming needs!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "112313894069043718267", "name": "Dylan Deaton", "time": 1552920270422, "rating": 5.0, "text": "Great for people of all ages", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "111225272255895477554", "name": "Emmerald Sado", "time": 1564244812585, "rating": 5.0, "text": "Really nice people", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "112874047899013754863", "name": "Mark Singleton", "time": 1556948287979, "rating": 5.0, "text": "Has everything you need for gaming", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "114316782055090361562", "name": "Rob Barnett", "time": 1542563096705, "rating": 5.0, "text": "Great Shop ... Great Service...", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "100566325966085729911", "name": "Mid9ight _", "time": 1540168719673, "rating": 5.0, "text": "Awesome place", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "107168347942316501622", "name": "Jen Barber", "time": 1547551977636, "rating": 5.0, "text": "Great in every way", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "116286244369039862251", "name": "Andrew Wakefield", "time": 1491067052457, "rating": 5.0, "text": "Great game and comic shop, friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "105547171466691532989", "name": "Shane DeRossett", "time": 1524240575979, "rating": 5.0, "text": "Nice shop, with friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "112784301598131514855", "name": "Tim Poe", "time": 1510803884108, "rating": 5.0, "text": "Shop is ran well and a lot of improvements being made recently", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "104065038829112086514", "name": "Joshua Brooks", "time": 1558423637343, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "112351998030703278133", "name": "Jill Hill", "time": 1529865933761, "rating": 5.0, "text": "Nice people", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "115394713828965717656", "name": "stella Conatser", "time": 1498772757126, "rating": 5.0, "text": "Great. Loved the people.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "100046088641603838345", "name": "Aguilar Santy", "time": 1465566582491, "rating": 5.0, "text": "it's awesome", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "107380005546060726191", "name": "Tom Bruno", "time": 1460758559951, "rating": 5.0, "text": "I LOVE THIS STORE!!!!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "101340908940420261485", "name": "Ron Stead", "time": 1623450474675, "rating": 5.0, "text": "You guys are super helpful and friendly. A great place to get your table top fix.", "pics": null, "resp": {"time": 1623606047524, "text": "Thanks!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "109728054338905054141", "name": "brantley hall", "time": 1615504520446, "rating": 5.0, "text": "Fantastic game store! Knowledgeable about a variety of different card and table top games and just good guys. Great stock and spacious gaming tables. Highly recommend this place as your go to for gaming and hobbies.", "pics": null, "resp": {"time": 1621879519192, "text": "Thanks for the great review!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "112556937432305065458", "name": "Christian Collins", "time": 1621803013776, "rating": 5.0, "text": "Fantastic place for hobby materials and places to play! Friendly community and even better hosts!", "pics": null, "resp": {"time": 1621879409003, "text": "Thanks so much!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "111918564626537684169", "name": "Nathaniel Kifer", "time": 1616186433952, "rating": 5.0, "text": "Good selection, reasonable prices, and a friendly staff. Lots of playing space with a couple of private rooms (you have to rent those, but the price is quite reasonable). Clean, open space.", "pics": null, "resp": {"time": 1621879487719, "text": "Thanks for the great review!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "105936501670536405212", "name": "Major Jouret", "time": 1577996882265, "rating": 5.0, "text": "Clean toilets, well lit, friendly staff, ample play space for all types of gaming, and a good amount of product. Tons of Warhammer 40k in stock, Star wars Legion, Magic the Gathering cards, full racks of army painter paints and full racks of games workshop paints as well. Super nice game store.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN9ysWPppwZiGza20X0Jw_V_uIMTgyRVUoF4PJy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN2mADROo0o5CcQ4WZf0VA0sfsYIuv-hv0ue2UQ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "103064640845571480351", "name": "Chad 395", "time": 1604943960166, "rating": 5.0, "text": "Quite possibly the best retail experience I've ever had. They have great stock of paints and supplies and are always willing to order whatever you ask. I had never been inside a game store of this type before this year and upon my first visit, I immediately felt welcomed and have learned a crazy amount from the staff there. All of the staff are willing to talk to you about most anything and give you tips on painting and game rules/tactics. It's my happy place!", "pics": null, "resp": {"time": 1604953828107, "text": "Thanks!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "117633937936093742862", "name": "Jason Bearden", "time": 1620757611883, "rating": 5.0, "text": "Nice and polite staff that caters to the needs of the gaming community.", "pics": null, "resp": {"time": 1621879436541, "text": "Thanks Jason!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "112950068044405126764", "name": "Armor Parsons", "time": 1609791128830, "rating": 5.0, "text": "I cannot say enough nice things about this place. Great place and awesome customer service. SUPER WELCOMING. They give me all the Pokemon.", "pics": null, "resp": {"time": 1621879627932, "text": "Thanks Armor!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "108191687861643716031", "name": "Jeremy Mason", "time": 1601071196519, "rating": 5.0, "text": "Want to find a new game? Need to find a pair to make your mini look that little bit extra? This is a great place to go. And if they don't have it, They'll order it.", "pics": null, "resp": {"time": 1604953893516, "text": "Thanks Jeremy!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "114485214979644744108", "name": "The Blue Gaming Troll", "time": 1615144965995, "rating": 5.0, "text": "Decent selection, plenty of gaming space, clean bathrooms, and friendly customer service.  Thanks!", "pics": null, "resp": {"time": 1621879534334, "text": "Thanks for the great review!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "116202491547861321445", "name": "Lee", "time": 1609219860115, "rating": 5.0, "text": "We Went in here during christmas. Kudos to the shopkeep, he is very knowledgeable about all of the latest games and accessories. They also have limited live events!", "pics": null, "resp": {"time": 1621879646095, "text": "Thanks for the great review!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "104942160021360284095", "name": "James Huggins", "time": 1606617325297, "rating": 5.0, "text": "Went in and immediately welcomed by staff and patrons. Shared stories and really felt welcome. I found my people!", "pics": null, "resp": {"time": 1621879664224, "text": "Thanks James!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "102621800002671587313", "name": "Richard Sanchez", "time": 1611808156609, "rating": 5.0, "text": "Great service. Good people.", "pics": null, "resp": {"time": 1621879575706, "text": "Thanks Richard!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "115598398800506957986", "name": "Flyaway Soul", "time": 1600213177446, "rating": 5.0, "text": "They have an excellent selection of miniatures. I was able to find the silver dragon I've been looking for and the new collectors edition D&D 5e books I was missing.", "pics": null, "resp": {"time": 1604953925797, "text": "Thanks! Glad we could help!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "105901130700583116430", "name": "Brandon Granger", "time": 1613881783826, "rating": 5.0, "text": "Friendly and helpful people. 10/10 will be back.", "pics": null, "resp": {"time": 1621879557498, "text": "Thanks for the great review!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "113291242122317250483", "name": "The Bard Of Bad Ballads", "time": 1592921322662, "rating": 5.0, "text": "friendly people. Owner helped me find an item (and ordered it) for me and the price was much lower than expected  good stock of minis., paints,brushes...\nMy wife doesn't allow me to go unsupervised in here now lol.\nLove this place.", "pics": null, "resp": {"time": 1622325895070, "text": "Thank you very much!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "113907143724191170639", "name": "Erich Wildgrube", "time": 1611249831146, "rating": 5.0, "text": "Best place for n town for minis.", "pics": null, "resp": {"time": 1621879605410, "text": "Thanks so much!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "106739085411240037675", "name": "Freeman Presson", "time": 1580361558717, "rating": 4.0, "text": "Great place, run by people who know what they are doing. Tables and rooms for all manner of games. Good selection of games and supplies. Modest section of snacks. One star off for having no room for books.\n\nVery convenient location on Highway 31, but beware of rush hour traffic.", "pics": null, "resp": null, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "104638100046507000860", "name": "Kitten Cookie", "time": 1603597022256, "rating": 5.0, "text": "They have a good stock of minis and paints, willing to order any game for you (as long as they are able) and as long as its in stock can most likely have it in a week or less(of course nothing is promised and shouldnt be). Nice staff very helpful when we had questions about things and when we asked about gameing made sure we knew where to go to help us find a gameing group and we can resurve tables and if we had more questions to feel free to contact them. All in all i expected this store to be like all the rest but, it really had a comfortable feel and for every introvert out there that's a nerd i would recommend it. (Yes masks are required at the time of the review)", "pics": null, "resp": {"time": 1604953871259, "text": "Thanks!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "102796629284309579796", "name": "Andrew Farrow", "time": 1593183799318, "rating": 5.0, "text": "Extremely friendly staff who are more than willing to be helpful and take a moment to chat with you about the various games and hobbies. They have several tables for gaming and is quite spacious while also having a very nice selection of merchandise for hobbies such as D&D, Warhammer 40k and Age of Sigmar, and a great selection of board games, including some hard to find options. Definitely a fantastic gaming and hobby store, worth a look at if you are in the area or looking for a place to hobby at.", "pics": null, "resp": {"time": 1622325877199, "text": "Thank you Andrew!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "104817489095414542978", "name": "corbygray528", "time": 1596907840712, "rating": 5.0, "text": "Pretty much anything you would need for some of the most popular tabletop RPGs. Very large selection of books and figures", "pics": null, "resp": {"time": 1622325791110, "text": "Thank you Corby!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "102119845141821018687", "name": "Alex E", "time": 1609868905785, "rating": 5.0, "text": "Great shop with friendly staff!", "pics": null, "resp": {"time": 1621879619163, "text": "Thanks Alex!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "113576052713139114629", "name": "Shoebox Poet", "time": 1595457786656, "rating": 5.0, "text": "Very nice place, it was first time I have been to someplace like that.", "pics": null, "resp": {"time": 1622325825565, "text": "Thank you very much!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "100411013870419427624", "name": "Johnathan Corrales", "time": 1584662562826, "rating": 5.0, "text": "I love how they already know my name and preferences even though I am not as frequent a visitor as others. Great crew they have, very supportive and always make us feel welcome and at home with them!", "pics": null, "resp": null, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "117339709241079571595", "name": "Kyle Nunn", "time": 1596311027909, "rating": 5.0, "text": "Fantastic store with a great staff and good selection. This is my favorite place in the area to buy games!", "pics": null, "resp": {"time": 1622325816041, "text": "Thanks so much Kyle!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "109093818397753152869", "name": "Brian Higgins", "time": 1597759181983, "rating": 5.0, "text": "Great staff and good selection of tabletop and boardgames!", "pics": null, "resp": {"time": 1622325743176, "text": "Thank you Blame!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "114481091531893131517", "name": "Darren Ice", "time": 1583777502507, "rating": 5.0, "text": "Great selection of D&D, Star Wars and WH40k figures. Card games, expansions and accessories galore. However the crown jewel is the gaming tables!", "pics": null, "resp": null, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "108422315405775654936", "name": "McCartney Newman", "time": 1581048228621, "rating": 5.0, "text": "The place is really nice and has a lot of room. It's really cool to go to, to do a board gaming group or DnD.", "pics": null, "resp": null, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "101287547694891296806", "name": "damytewok", "time": 1580313076929, "rating": 5.0, "text": "Amazing supply of paints and gaming accessories. Their prices are great and they sell models at MSRP where as other places would gouge the prices on certain hard to get models (beholder model in particular).", "pics": null, "resp": null, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "107902504814673289110", "name": "C Hill", "time": 1582129087943, "rating": 5.0, "text": "Regardless if you're an established tabletop gamer, or want to try something new, everyone here is super friendly and helpful!", "pics": null, "resp": null, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "110631865142312771711", "name": "Austin Russell", "time": 1602942901863, "rating": 5.0, "text": "Very helpful and friendly staff", "pics": null, "resp": {"time": 1604953906846, "text": "Thanks Austin!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "104728090449666522214", "name": "Kyle B", "time": 1575906954138, "rating": 5.0, "text": "Giving this place a preview review the sign is up and looks great and is a much needed variety cant wait for you to open and update my review formally", "pics": null, "resp": null, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "117940439501110342640", "name": "Robbie Martin", "time": 1598226042497, "rating": 5.0, "text": "Great place with great people.", "pics": null, "resp": {"time": 1604953942081, "text": "Thanks Robbie!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "105633208760652082170", "name": "Brian Wiggins", "time": 1597716627775, "rating": 5.0, "text": "Best gaming store in town!", "pics": null, "resp": {"time": 1622325757811, "text": "Thank you for the great review!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "113102719874528204053", "name": "jeff waters", "time": 1578176578981, "rating": 5.0, "text": "Amazing store. Tons of room for any kind of gaming.", "pics": null, "resp": null, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "115877518597041300513", "name": "Mark", "time": 1578522417049, "rating": 4.0, "text": "Very friendly staff that seem willing to help. Lots of events on the calendar covering magic, WH, boardgames, D&D ...etc", "pics": null, "resp": null, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "111272515717393399811", "name": "noah10cool1", "time": 1610048118090, "rating": 5.0, "text": "Great selection", "pics": null, "resp": {"time": 1621879610277, "text": "Thanks for the great rating!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "116531080386531697011", "name": "Nicholas Mills", "time": 1580132753858, "rating": 5.0, "text": "I'll be heading back here a lot for sure!", "pics": null, "resp": null, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
{"user_id": "108443538096166104258", "name": "DJ RaptorXS", "time": 1623643180581, "rating": 5.0, "text": "Glad to have an RPG gaming store locally.  I can't believe I didn't hear they were open sooner.  They have a good selection and are very friendly to people new to tabletop gaming.", "pics": null, "resp": {"time": 1623606013195, "text": "Thanks so much!"}, "gmap_id": "0x888919a2fdbb0309:0x87746e54ce1a0c47"}
