{"user_id": "104836060873305344750", "name": "valerie unrau", "time": 1560636370311, "rating": 5.0, "text": "Absolutely thrilled that Gary found a way..to make my dreams come true.. Bolle blood in Hawaii..my beautiful Geist...out of Nemeses and Vucan von Peroh..cared..trained and loved..by Cassie Daniels Jones.. Geist is now leaping up and picking all my oranges off the tree..soon will be out on her surf board. Geist fears nothing..Aloha..Valerie", "pics": null, "resp": null, "gmap_id": "0x888983718dededc5:0x534cc19001a2aaa2"}
{"user_id": "113160454282666930090", "name": "Daniel E. Perez Monti", "time": 1576034114809, "rating": 5.0, "text": "Love the place!!", "pics": null, "resp": null, "gmap_id": "0x888983718dededc5:0x534cc19001a2aaa2"}
{"user_id": "108530722004666041407", "name": "homesteader fifty w/ martha", "time": 1581212436512, "rating": 1.0, "text": "Rude!", "pics": null, "resp": null, "gmap_id": "0x888983718dededc5:0x534cc19001a2aaa2"}
{"user_id": "111915872039333337257", "name": "Patsy Topazi", "time": 1529446655787, "rating": 1.0, "text": "I have had a horrible experience dealing with John Hand, owner of this business. He promised my son he could take his test to get his CDL license (at a later date than originally planned) and he never allowed him to take the test or refunded him the money we paid for the class. After many failed attempts from my son trying to get in touch with John Hand, I then got involved. I called him and explained the situation to him with a promise he would get back in touch with me to make a plan of action for my son to take the test he never got to take. This was discussed back in April and I have yet to hear back from John Hand. I would not recommend this man or business to anyone.", "pics": null, "resp": null, "gmap_id": "0x888918a10b3cf8cb:0xe8f7bf8824a24250"}
{"user_id": "107783484300594982481", "name": "Austin", "time": 1533075397537, "rating": 1.0, "text": "This review was posted after 5 days of trying to contact this company. They never answer the phone, returns voicemails or text messages. I have called and texted several times over the past 5 days; the voicemail says to text but you never get a response back. I also got a auto-reply text back when I tried calling once that said \"Sorry, I can't talk right now; so someone does have the phone in their possession. Do not waste your time like I did hoping for something that will not happen.", "pics": null, "resp": null, "gmap_id": "0x888918a10b3cf8cb:0xe8f7bf8824a24250"}
{"user_id": "114475554609996141582", "name": "LJ 4334", "time": 1611036477661, "rating": 5.0, "text": "My experience was great at Warrior Met Coal Training.  Having training during my regular shift hours was very appreciated because I didn't have to finish my evening shift the night before and wake up with little hours of sleep to attend an a.m training course.  During training the new teaching structure with us moving around to different instructors every two hours was very rewarding.  It was rewarding because I felt a sense of understanding the materials better.\nThanks", "pics": null, "resp": null, "gmap_id": "0x8888bbd9caa001d7:0x17ceac87294e8258"}
{"user_id": "107142075463184031210", "name": "Chris Brubaker", "time": 1626350313170, "rating": 1.0, "text": "A couple employees are good people but as for the company they are not very worker friendly", "pics": null, "resp": null, "gmap_id": "0x8888bbd9caa001d7:0x17ceac87294e8258"}
{"user_id": "113948388403111599827", "name": "Shaun King", "time": 1625144602533, "rating": 2.0, "text": "👎", "pics": null, "resp": null, "gmap_id": "0x8888bbd9caa001d7:0x17ceac87294e8258"}
{"user_id": "107602358775656767981", "name": "Grace Thompson", "time": 1616098510616, "rating": 5.0, "text": "Amazing bunch of people!", "pics": null, "resp": null, "gmap_id": "0x8888bbd9caa001d7:0x17ceac87294e8258"}
{"user_id": "115469002783487843270", "name": "John Johnson", "time": 1607729214844, "rating": 4.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x8888bbd9caa001d7:0x17ceac87294e8258"}
{"user_id": "108691057662739811409", "name": "Brittany “BrittanyRoseThrifts” Rose", "time": 1605013649363, "rating": 5.0, "text": "Great workout and amazing trainers! Perfect way to start your day.\n\nPerfect for every level of fitness, each workout is explained and demonstrated before starting. As you go through the circuits, trainers help along the whole way. They offer a variety of weight options for you to choose from so you can go with what ever weight you're comfortable with!", "pics": null, "resp": null, "gmap_id": "0x888603936bab7165:0xbce9438c8b5606fd"}
{"user_id": "107162808896865978899", "name": "Demetria Cass", "time": 1607608515582, "rating": 5.0, "text": "Not for the faint at heart! The trainers were extremely motivating and uplifting. Give it a shot and don’t be too hard on yourself.", "pics": null, "resp": null, "gmap_id": "0x888603936bab7165:0xbce9438c8b5606fd"}
{"user_id": "106958358025434070649", "name": "2Face Joker", "time": 1608242117219, "rating": 5.0, "text": "All i got to say is wow! They have a well kept facility wow! And the animals are very beautiful!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMJf_9sQ_yNyXfAIRjExaUL00P4j9Uu1bne_5_u=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMv4Ldt9_bcdhSuDPa7HwsbP44t8VzD5HQDCgX3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO9-j7oNGysLykH7OVHGuoKTV-yW1nlMS1uYkXO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN3Pocvor9RxeK1p3LESALn2XN0WQ5L57ZIU9kS=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88890d80e2cfb57d:0x80c886e576bfa8a7"}
{"user_id": "113860385542748309498", "name": "Aaron Longobardi", "time": 1617822973143, "rating": 5.0, "text": "Quite possibly the easiest hello and definitely one of the hardest goodbyes when it comes to FXT. This place was my gym for 2 years while I was at flight school and I am so blessed to have found it. The community is so welcoming and friendly they ended up becoming family. The athletes are incredible, the programming is top notch, and the coaching is second to none. They are super military friendly and truly care about all their members. I will forever consider FXT my home gym and could not recommend this place enough. Check it out and I promise you’ll be glad you did it. Love my FXT family.", "pics": null, "resp": {"time": 1617824593818, "text": "You are family to us all at FXT. We will miss you & Lindsay and hope to see you on your next round at Rucker!! Write our name in the sand in Hawaii as we will be with you always ❤️Best wishes"}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "116559367471451282744", "name": "Des2BFit", "time": 1619639088004, "rating": 5.0, "text": "So, I had always wanted to get into CrossFit but was too nervous to try. I had known that CrossFit was a community of athletes and I seriously wanted to be apart of something GREAT. Well I decided to google CrossFit in my area and I landed on this location. I was nervous but I decided to give a GO, I called the number above and the reaction and engagement I got was fantastic. The professionalism of their staff had made me feel eager to get down there and begin training. First day I was amazed by the community, I was welcomed with smiles and assistance not just from the coaches but the members as well. I truly felt that I was apart of a Team. The amount of effort you put in you will get the same energy back ! I highly recommend for beginners and for those who are new to the area and want to feel apart of a community. Also for all the athletes you will definitely get a workout and a run for your money. The classes you can schedule at any time to your schedule. I had an phenomenal experience and would definitely recommend! Definitely military friendly! Hooooaaahh !", "pics": null, "resp": {"time": 1619720012972, "text": "thanks so much for the review, we are lucky to have the staff and the wonderful community! glad you are a part of it!!"}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "110813654960363670436", "name": "ESAm Alamri", "time": 1623367558805, "rating": 5.0, "text": "The best so far I have been in several gyms in US but the\nAtmosphere So great and so friendly", "pics": null, "resp": {"time": 1623369574785, "text": "Thank you Esam!! Glad to have you with us  at FXT while you are here in the US!!"}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "102686836648012394466", "name": "Brandon Miller", "time": 1594091978075, "rating": 5.0, "text": "Hands down the best gym to check out in the wire grass area! Get coach’s, lots of space and equipment!! I dropped in after 4 years of not being in town. That has to say something!!", "pics": null, "resp": null, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "116542141274661133817", "name": "Amanda Bolten", "time": 1579123980982, "rating": 5.0, "text": "CrossFit FXT is one of the best gyms that I have been a part of. They have an extremely knowledgeable staff and offer something for everyone. If you’re an elite competitor or someone who just wants to get in great shape, you’ll love it! FXT has a wonderful, supportive community and is always out in their community. 10/10 would recommend!", "pics": null, "resp": {"time": 1617824208202, "text": "Thanks Amanda!! Enjoying see Chris here. Miss y’all though"}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "106349565438851196584", "name": "Rumplestilskin Kumar", "time": 1590854542155, "rating": 5.0, "text": "Great work out! I'm so out of shape and was nervous. Jayme was awesome. Everyone was upbeat and uplifting. I have a long way for my health journey but I am going to go back for another crossfit class!", "pics": null, "resp": {"time": 1591021032888, "text": "Thank you! We are here to help you achieve your goals! Let us know how we can assist!"}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "107273545988486623964", "name": "Kacie Lee", "time": 1544320337232, "rating": 5.0, "text": "AWESOME gym!!!  Very professional and friendly from start to finish.  They quickly replied to my emails about dropping in.  When I arrived, I was warmly greeted by coaches and multiple gym-goers.  Tough workouts - coaches did a great job explaining everything and keeping everybody on track.  True sense of community in there - they were even doing a fundraiser for a local family when I went in.  Can't wait to go back when I get the chance.", "pics": null, "resp": {"time": 1544466797589, "text": "Thank you for the great review, Kacie! Can't wait to see you back again with us!"}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "105681607143043624677", "name": "Steven S", "time": 1590774778039, "rating": 5.0, "text": "Great workout. Keith understands capabilities of each individual.", "pics": null, "resp": null, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "110702314288008214699", "name": "Allen Crist", "time": 1541874250732, "rating": 5.0, "text": "Great atmosphere and plenty of workout space. Excellent programming and coaching! Multiple class times make it easy to get a workout in no matter what schedule you’re on. Fun community with plenty of friendly competition, highly recommend!", "pics": null, "resp": {"time": 1542591166859, "text": "Thanks Allen! Love having you, Heather & the kids in our FXT family!"}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "113169181745152201717", "name": "Jacob Mitchell", "time": 1545953770631, "rating": 5.0, "text": "The facilities, training, and atmosphere are top notch.  My wife and I dropped in for a visit and felt welcome, were challenged, and will certainly be back.  Coach Keith was excellent.  Thank you!", "pics": null, "resp": {"time": 1546083610207, "text": "Thank you so much for the great review. We really enjoyed hosting yall and hope to see you soon."}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "116656951542315085111", "name": "Sebastian Vasquez", "time": 1545016010199, "rating": 5.0, "text": "This was my first CrossFit gym ever and I gotta say it was the number one reason why I fell in love in with the sport. Felt more like a second home and family rather than a gym and gym-mates. Big thanks to Keith and all the coaches, best staff ever in the history of the world (Specially Brett Thomas, fittest man in Enterprise). FXT is one of the major reasons why I would love to come back to Alabama.", "pics": null, "resp": {"time": 1545046628970, "text": "Thanks for the awesome review Sebastian! FXT will miss you and your family! We hope to see you back one day!"}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "101990049921402480730", "name": "Peggy Chang", "time": 1547406284079, "rating": 5.0, "text": "While visiting my son in Daleville, Al, I called Keith and was told to come join them and have fun! I did for 5 days in a row! The coaches are friendly, knowledgeable and motivational! If you want to burn calories, build your muscles and have fun while doing it, come check out this awesome gym.", "pics": null, "resp": {"time": 1547486085295, "text": "So glad you had so much fun with us, Peggy! Come back and have fun with us again soon!"}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "100318942594345359058", "name": "Karissa Maradol", "time": 1543785626616, "rating": 5.0, "text": "Love FXT!!! People make or break a gym and these are the most lovely and supportive group I’ve ever found at a gym! Happy to be part of the FXT Family!", "pics": null, "resp": {"time": 1543867116586, "text": "Love starting our day with you!! So glad you're part of our family, Karissa! Thanks for the awesome review! See you at 5am;)"}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "112492015819243860809", "name": "Thomas Stinson", "time": 1599319073648, "rating": 5.0, "text": "Great staff, community and programming!", "pics": null, "resp": {"time": 1617824300618, "text": "Thanks Thomas!! Miss you but happy to see you pop in from time to time!"}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "112095448129433217915", "name": "Scott E", "time": 1530436951765, "rating": 5.0, "text": "Good atmosphere for x-fit or just getting a pump if needed.  There's a plethora of workout space.  Tucked away in downtown Enterprise.  There's a variety of workouts as well as a variety of people to share competition with.", "pics": null, "resp": {"time": 1542595891787, "text": "Thanks for the stars and loved having you @ FXT"}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "104219707236889576905", "name": "marianne eddy", "time": 1541854873211, "rating": 5.0, "text": "Amazing gym, amazing people! This is more than just a CROSSFIT gym, it’s a family. If you’re intimidated by traditional CROSSFIT, then check out the Unloaded class. It’s amazing! You can also have on-one-on instruction with a personal trainer or join the Barbell club to focus on specific goals. Or, if you’re muscles are wrecked from the week, there’s a mobility class. I have utilized most of the services and have never been disappointed. Hands down the best gym I’ve ever been a part of.", "pics": null, "resp": {"time": 1542591996094, "text": "So proud of all of your accomplishments and hard work you've put in! An inspiration to so many! Excited to be on this fitness journey with you."}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "112096384667913266643", "name": "Ross Nelson", "time": 1541860193094, "rating": 5.0, "text": "Awesome CrossFit box and family. Great coaching and programming,  fun community, and family. Love this place.", "pics": null, "resp": {"time": 1542591409140, "text": "Thanks Ross, and Jennifer for all the love and support you've given us all @ FXT"}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "100183844022595662516", "name": "Silvia Jakobsen", "time": 1541892797704, "rating": 5.0, "text": "Amazing place with great coaches! I love working out here😊", "pics": null, "resp": {"time": 1542591020271, "text": "Thanks Silvia! Love having you in our Unloaded Program @ FXT"}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "116570975298176000318", "name": "Haley Kirkland", "time": 1558727578500, "rating": 5.0, "text": "Awesome gym!!! Awesome people. Love everything about it!", "pics": null, "resp": {"time": 1560856498537, "text": "WE LOVE YOU HALEY!!! Thank you for years of support! You are and forever will be our family!"}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "117126932220915766435", "name": "BKMC03", "time": 1541857823756, "rating": 5.0, "text": "I Love my FXT Family.  You wouldn’t typically think of your gym as your “family”, but they definitely ARE! Our family has been through some devastating events in the last few months and our Fit-Fam has been there every step of the way!  They brought us food, helped with household needs, dogs, appointments and even our son at school!  IN ADDITION to all of that, FXT coaches truly care about my fitness goals. I have done group classes and barbell training within FXT. The coaches are knowledgeable (before FXT, I had never lifted in my life) and helpful, I have learned so much about how to safely engage in fitness.  I am meeting and beating my fitness goals and I love it! If you are looking for a very supportive and energized atmosphere to pursue your goals and with coaches who are knowledgeable and truly care, COME ON!!!  This is truly a one-of-a-kind place in so many ways. I’m very thankful to be a part of this Fit-Fam-Jam!💪🏼", "pics": null, "resp": {"time": 1542591792127, "text": "YOU are our WonderWoman! Thanks Kelly! Your family is our family and thats what friends, community do for one another. Thanks for your loyalty and for constantly crushing fitness goals with us."}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "104901456115019098842", "name": "Kevin Conley", "time": 1543412825220, "rating": 5.0, "text": "Had a blast dropping in during my travels, Horton was a hoot! (Pun intended)", "pics": null, "resp": {"time": 1543443706580, "text": "Kevin, thanks for the shout out and come back and visit any time! We will make sure your next visit is a “hoot” too!!"}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "110391988220988842011", "name": "Rich Puza", "time": 1493035569150, "rating": 5.0, "text": "Best place ever! People are great and the coaches rock!", "pics": null, "resp": {"time": 1542595632816, "text": "Thanks Rich! Love having you in our FXT family"}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "116753236129906272914", "name": "Nancy Garner", "time": 1515880590208, "rating": 5.0, "text": "Great owners and ever improving facility!", "pics": null, "resp": {"time": 1542596085913, "text": "Thanks Nancy for your loyalty and support for 9 years in Enterprise. You are our family, in and out of the gym."}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "103288176549493635273", "name": "Gabe Martin", "time": 1513733318372, "rating": 5.0, "text": "Great people and a great atmosphere!", "pics": null, "resp": {"time": 1542595802303, "text": "Thanks for you support Gabe! Love having you in our FXT family"}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "101363765753191725959", "name": "Sammy Echevarria", "time": 1533169549780, "rating": 5.0, "text": "Great environment to workout.", "pics": null, "resp": {"time": 1542592204009, "text": "Thanks Sammy ! Thanks for the stars! Love having you & family."}, "gmap_id": "0x88926c2227725759:0xc82b559e83a612e8"}
{"user_id": "115143085063701482358", "name": "Gregory Wilburn", "time": 1621392868991, "rating": 5.0, "text": "Excellent place to learn robotics, maintenance, welding and other skills.", "pics": null, "resp": null, "gmap_id": "0x8862888322ceff9b:0x5577695edcac5a73"}
{"user_id": "115233484240692755502", "name": "Kevin Frank", "time": 1622079686190, "rating": 5.0, "text": "Great place awesome training", "pics": null, "resp": null, "gmap_id": "0x8862888322ceff9b:0x5577695edcac5a73"}
{"user_id": "110550143148054694727", "name": "caleb wood", "time": 1594160108319, "rating": 5.0, "text": "This is a fantastic facility. The staff are extremely friendly yet professional. The grounds and buildings are immaculately maintained. Truly wonderful experience being there.", "pics": null, "resp": null, "gmap_id": "0x8862888322ceff9b:0x5577695edcac5a73"}
{"user_id": "113647078620422091334", "name": "Alan Hovexak", "time": 1610919005245, "rating": 5.0, "text": "Robots are great. Love robots", "pics": null, "resp": null, "gmap_id": "0x8862888322ceff9b:0x5577695edcac5a73"}
{"user_id": "105583234697722773722", "name": "John Payne", "time": 1605221174905, "rating": 5.0, "text": "Wish I could take all the classes they offer", "pics": null, "resp": null, "gmap_id": "0x8862888322ceff9b:0x5577695edcac5a73"}
{"user_id": "108755678098186991744", "name": "Todd Needle", "time": 1606862284759, "rating": 5.0, "text": "Facility was very nice and clean.", "pics": null, "resp": null, "gmap_id": "0x8862888322ceff9b:0x5577695edcac5a73"}
{"user_id": "117072212203406573473", "name": "Phil Iverson", "time": 1560195314439, "rating": 2.0, "text": "The two ladies administering the testing the day I was there were too busy texting and taking pictures and selfies and laughing to pay attention to what the students were doing and helping the students as needed. They were not practicing what they were preaching very disappointed", "pics": null, "resp": null, "gmap_id": "0x8862888322ceff9b:0x5577695edcac5a73"}
{"user_id": "104144378418079452571", "name": "Michael Hamilton", "time": 1479309360791, "rating": 5.0, "text": "Awesome set-up", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPlr5nQAT7oZ5P0Cnv7Qwd6G3ay89DNbVvHAyFL=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862888322ceff9b:0x5577695edcac5a73"}
{"user_id": "111595369194684178065", "name": "Toni Johnson", "time": 1626716674350, "rating": 5.0, "text": "John is an excellent instructor. The class is very informative. The material was presented in a way that kept my interest. I learned a lot of information that I did not know! I’ll be going back every 2 years for recertification.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "112981344300242443844", "name": "Tiannah Taylor", "time": 1624898036210, "rating": 5.0, "text": "It was a fun and effective class! The teacher interacted with everyone and made me feel comfortable. He made sure we were doing everything correctly and answered any questions we had. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "100621106798180731766", "name": "Megan McKown", "time": 1624155172859, "rating": 5.0, "text": "Class was efficient but thorough!  John was very professional, knowledgeable, and helpful- he specifically taught to different levels and skill sets in a small group setting while drawing from everyone’s prior experiences to enhance learning for everyone! Good handouts, clean equipment, and facility! If you are looking for a hands on experience or the ability to ask real time questions with skilled answers- this is your best option!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "111061120209058799000", "name": "ShakaylanKay", "time": 1626712053312, "rating": 5.0, "text": "This is the best training class to take. It is so informative & easy to follow.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "107416688608783036743", "name": "Angie Wilson", "time": 1626748095570, "rating": 5.0, "text": "Mr. John is the coolest man alive. I had to get my BLS certification for school and Mr. John made it so much fun and very informative. I especially enjoyed his telling of personal stories where BLS skills came incredibly handy, and just how easy it is to save a life when you have the right tools (AED, duh) and the right training (this course, duh). Thank you Mr. John. In addition to being better prepared for critical situations, I can also save my boyfriend’s life if he chokes on a hotdog!\nIf you need BLS certification or wish to acquire any type of medical skill, you’ve gotta see Mr. John :)", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "109911868871194452397", "name": "Bradley Gillespie", "time": 1624207223133, "rating": 5.0, "text": "This class was a great experience! John is an amazing instructor and the class was very organized and a lot of fun to be a part of! I would highly recommend this place for any of your certification needs!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "103270882277780659647", "name": "Chelsea Thompson", "time": 1624898574674, "rating": 5.0, "text": "Mr. John was very informative during my CPR class. It was the best class I’ve been to in my life. 10/10 would recommend :)", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "103829804361601026876", "name": "Malena Honeycutt", "time": 1625245624728, "rating": 5.0, "text": "The instructor was so easy to talk too and had a positive attitude! He teaches very hands on. Highly recommend his classes!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "108240081258766281932", "name": "macee dunagan", "time": 1625249532646, "rating": 5.0, "text": "a great atmosphere and communicative class that provided drinks, snacks, and a hands on learning experience. the teacher was very good at explaining things and had a very positive attitude!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "100156702173570355280", "name": "AJ Hollowell", "time": 1621772650867, "rating": 5.0, "text": "John at CEMS offers the most engaging and informational CPR BLS course I've ever taken. He really has a talent for educating anyone from the common lay person to the most seasoned providers. I've taken several CPR courses and have never left feeling as competent and enlightened as I did after leaving his class. He doesn't just teach CPR, he teaches you to save lives.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "117670644027823439752", "name": "Lauren Hyatt", "time": 1617291575851, "rating": 5.0, "text": "Not only was it a good paced class it was extremely easy to follow along, and the instructor was a literal ray of sunshine. It was a friendly environment, very welcoming - and the snacks and drinks provided were lovely as well! I’ll definitely be using this course for all of my renewals from here on out!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "114093108359406735988", "name": "Kimberlin Ready", "time": 1624898144685, "rating": 5.0, "text": "Highly recommend for BLS certification! John is very thorough in his training and goes beyond to teach you even more skills.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "113297240220197647870", "name": "Amber Green", "time": 1624208310353, "rating": 5.0, "text": "Mr. Cobbs was a great professor. He was very detailed and made sure we understood the importance of being BLS Provider. I feel confident that I can provide high-quality CPR to any infant/child and adult. Thank you!", "pics": null, "resp": {"time": 1624826939987, "text": "Thank you for the great review!  Learning the Basic Life Saving skills can make the difference in saving a life!  You did a great job in class."}, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "115956714206648511056", "name": "Ava Murphy", "time": 1621355894362, "rating": 5.0, "text": "John was an excellent instructor! The learning environment was comfortable, questions were welcome and more than adequately answered, and the information was related to realistic scenarios. Highly recommend for initial BLS or renewal!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "110287672328239251790", "name": "Kimberly Abney", "time": 1616949376235, "rating": 5.0, "text": "This is my second time attending this location, another great experience. The instructor is very knowledgeable, has a great teaching technique and makes the class interesting and fun. I would highly recommend this course to anyone requiring CPR certification!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "104810845140434188702", "name": "Kasara Rambo", "time": 1623254675106, "rating": 5.0, "text": "Great class! Very attentive to students! Easy to follow along, very informative, and not boring. Be back in 2 years!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "112734175234321877748", "name": "Dorlicia Martin", "time": 1624898413873, "rating": 5.0, "text": "Very hands on and informative! Instructor was amazing and made class enjoyable. Highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "109944906998504795465", "name": "Myaa Monroe", "time": 1624899146134, "rating": 5.0, "text": "Wonderful experience!! love ittt very detailed hands on class!! well worth it", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "114289280184897732210", "name": "Kellie Agalsoff", "time": 1620944226358, "rating": 5.0, "text": "This was by far the best experience I've ever had getting BLS certified! John was magnificent and friendly, and he made me so comfortable while I was saving that mannequin's life. I will continue to come here whenever I need to recertify and I would 10/10 recommend CEMS to everyone.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "110639569315228562263", "name": "NICOLE'S LAND", "time": 1616949496319, "rating": 5.0, "text": "Love the instructor he is straight to the point he gives you exactly the information you need. Any questions you may have he listens and answer to the best of his ability", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "111515945323160672178", "name": "Ashley McLeod", "time": 1616023924971, "rating": 5.0, "text": "ACLS class here was so helpful and engaging. I felt free to ask questions and much more confident in my ability with each simulation. Definitely one of my favorite classes I’ve taken!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "103849687944160994853", "name": "Dylan Davis", "time": 1618511201876, "rating": 5.0, "text": "Hilarious yet very informative. Absolutely the best CPR training course I have taken.", "pics": null, "resp": {"time": 1624827085389, "text": "CPR is one of the most important skills that a person can learn!  Class should not be stressful, why not have a little fun while saving a life!  Thank you for the review..."}, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "105580711971225624620", "name": "Rebecca Walker", "time": 1619392786815, "rating": 5.0, "text": "It is a pleasure to take a class at CEMS as John Cobb is a very informative and talented at  keeping your attention. This sounds crazy, as I also take ACLS and PALS, but I look forward to any of my classes with CEMS.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "104090643126300662060", "name": "Sherryl Chavarria", "time": 1610298546725, "rating": 5.0, "text": "I really found the BLS class with Mr, John Cobb to be very educational, well planned. I was taught the skills I would need to help save a life using basic life support. Also he was very kind and helpful. Thank you for your help.  Excellent class, highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "100146115419554813126", "name": "Mama D", "time": 1597197425155, "rating": 5.0, "text": "CEMS does an outstanding job of training and teaching CPR/First Aid.  My instructor John was thorough in his detail and in describing the subject matter.  With his Paramedic and military instructor, he has a wealth of information and of real life applications for teaching emergency medical skills.\n\nThe school is excellent too and the training set-up is ideal for teaching EMS skills.  I, also, very much appreciated the excellent customer service and flexibility in scheduling my training session.  Since I needed my certification very rapidly to start a new position in a matter of days, I was limited in trying to fit in the training.  John was more than accommodating and he found a way to fit me in.\n\nExcellent classes!  Excellent instruction!  Highly, highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "109189725384500231490", "name": "Kathrynne Caldwell", "time": 1606002662899, "rating": 5.0, "text": "John is thorough and extremely knowledgeable! He kept us engaged the entire time and it never felt like the day was dragging on. He explained things that I had heard for years and explained them in new ways that made old knowledge click! I will return to him for PALs and for renewals in the future without hesitation!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "117149492206689471883", "name": "Keshona Cade", "time": 1617291914051, "rating": 5.0, "text": "Very knowledgeable. Friendly. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "105670788555747695288", "name": "Janelle Lovin Mancha", "time": 1616952275642, "rating": 5.0, "text": "This BLS course was a recertification course for me.  John was very informative and the class ran at a good pace.  Great information!  I highly recommend CEMS.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "112159414056331335804", "name": "Morgan Solana", "time": 1607882686786, "rating": 5.0, "text": "Johns CPR class was great. It was offered on the weekend and very laid back. He is very informative and was able to answer every question with a knowledgeable answer. The class started and ended on time with well communicated instructions on claiming your BLS card. He walked us through the process step by step and even printed it out. I plan on using John for all of my BLS certification needs as well as bringing my family to certify. He provides water, coffee, and lights snacks. The building is located in a nice part of of town. The building was very clean and easily accessible.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "108866131759667633013", "name": "Amber Washington", "time": 1618417572182, "rating": 5.0, "text": "Great hands on training, awesome instructor and you get your card the same day!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "111193868110722519962", "name": "Lee Carpenter", "time": 1616024063455, "rating": 5.0, "text": "I took ACLS with John and the class was great and I learned a lot. I feel prepared to handle a cardiac event thanks to Johns teaching and would recommend his class to anyone working in healthcare.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "115251166524047333724", "name": "Benjamin Cockrell", "time": 1621355768404, "rating": 5.0, "text": "My BLS course was great and John Cobb is an excellent instructor!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "107030287329184385518", "name": "Jonny Chavers", "time": 1619195196761, "rating": 5.0, "text": "Excellent! Extremely knowledgeable instructor. class was clear and precise.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "104445918181139036662", "name": "Paola Fernandez", "time": 1610125394628, "rating": 5.0, "text": "This was a great class! It was very easy to follow along and it was a great learning environment. I would definitely recommend this to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "106187180262072742197", "name": "Shantira Bryars", "time": 1603040194070, "rating": 5.0, "text": "After being a Certified Nursing Assistant for 9 years this is my first CPR class that was very detailed and also a lot of fun and positive energy. Mr. John Cobb was a great instructor and I hope I get to renew with him again. HIGHLY RECOMMENDED!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "107826391394220083747", "name": "Nelda Thomas", "time": 1604169408498, "rating": 5.0, "text": "John was very knowledgeable and he made the learning experience fun. He breaks down the content to where it’s easily understood. I highly recommend him. You will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "113959317156938875884", "name": "Krissy Jefcoat", "time": 1611948761039, "rating": 5.0, "text": "Best ACLS class I have had in a long time. He is thorough but with real world experience.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "103456698113418140464", "name": "Morgan Brown", "time": 1601224329592, "rating": 5.0, "text": "I really enjoyed this class. My instructor Mr.Cobb made the lesson absolutely fun and not boring whatsoever. If I were to give CPR to an infant, child, or adult I am confident that I will complete the mission of saving that person’s life. Thank you Mr.Cobb I pray to see you in 2 more years!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "110943144984014928166", "name": "Brooke Cassady", "time": 1611952073415, "rating": 5.0, "text": "I highly recommend this place. The learning environment is great and the instructor, Mr. John Cobb, is very detailed. When you leave from here you can know that you have had some of the highest quality BLS CPR training available. I will definitely be returning here for my recertification. -Billy Cassady", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "102888531255688239086", "name": "Susie Tiu", "time": 1595114836476, "rating": 5.0, "text": "Have been renewing my CPR for healthcare providers certificate every 2 years for last 20 years, & by far the best experience ever. The facility was very clean & nicely set up. Class size was small and personable. John was knowledgeable and very friendly. & The snacks & coffee were a very nice touch of caring detail especially since class starts so early on a Saturday. Highly recommend this place. Truly a great experience.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "113298773257166650064", "name": "Tori Clement", "time": 1595456883920, "rating": 5.0, "text": "I would recommend this class to anyone! John is kind, knowledgeable, patient, and so willing to help! He truly is there to help you. You can tell he enjoys his job and it makes all the difference in the world. His lessons are by the book and the most updated evidence based practices. He made me comfortable and excited to learn! Plus, his space is clean and inviting! Try the fruit snacks!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "106718368834451429343", "name": "Giselle Borden", "time": 1610062975640, "rating": 5.0, "text": "I 100% recommend the ACLS class. It is so informative and Mr.John is an amazing instructor and makes the class fun while you are learning so much information.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "107822142927001082572", "name": "VANESSA PUGA", "time": 1623255205125, "rating": 5.0, "text": "Great class, very informative and nice teacher.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "110136969460914694463", "name": "Fiara Lucky", "time": 1599533554973, "rating": 5.0, "text": "I highly recommend CEMS! John Cobb was my instructor. He should definitely teach at a college. He was very informative. I left very confident with BLS knowledge. Now, I feel like I can save the world!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "106361022990199835542", "name": "Jeni Martin", "time": 1609346272948, "rating": 5.0, "text": "Hands down the best place to get BLS training. Do not go anywhere else if you want to get the actual knowledge and information needed to possibly save someone's life. I walked out completely confident", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "104744234813626786545", "name": "Stephenie Kling", "time": 1617210315630, "rating": 5.0, "text": "Super fun class! John made everything very interesting!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "114063651897420127138", "name": "Makayla Green", "time": 1611943385712, "rating": 5.0, "text": "Very professional\nI love the way he teaches\ngreat sense of humor\ncomfortable and clean environment", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "115276378424784016284", "name": "Kameshia Moore", "time": 1611943789761, "rating": 5.0, "text": "Class was awesome  very hands on. Definitely come back for more classes", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "116321718854542147077", "name": "Angelica Owens", "time": 1604971474167, "rating": 5.0, "text": "Needed this course for nursing school. John was very knowledgeable. Great instructor very hands on. Would recommend taking this course just to know how to do proper cpr skills.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "107305255324559420852", "name": "ShaKyra Robinson", "time": 1599928295332, "rating": 5.0, "text": "Mr. Cobb was a great and excellent instructor! He made sure that each one of us thoroughly understood the lesson that was being taught! He was very helpful in assisting us areas where we got stuck. He even provided coffee, water, and a variety of snacks for us! I’m greatly for this experience!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "111502567431465463872", "name": "Brandy Erwin", "time": 1609971433940, "rating": 5.0, "text": "This is a great placed to get certified, John is awesome in working with you on whatever best fits your schedule.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "109500342532903349960", "name": "DEF0006", "time": 1604088547924, "rating": 5.0, "text": "This was easily the best ACLS class I have ever been to! John made everyone feel very welcome and definitely made the class a lot of fun! I learned a lot and definitely refreshed the things I already knew! I would highly recommend him!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "108558313149090534370", "name": "Destiny Burley", "time": 1606237483619, "rating": 5.0, "text": "Awesome class and great instructor! I had John Cobb and he made the class fun and made sure we understand all the information, including the updated versions of correct CPR!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "116453055597692942204", "name": "Ki'Ana Nicole", "time": 1609346374691, "rating": 5.0, "text": "John was very nice , best CPR teacher I ever had ! I have learned so much information!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "101261985972498929587", "name": "Krista Owens", "time": 1606602087221, "rating": 5.0, "text": "Instructor was very knowledgeable about the algorithms presented. The class and facilities were conducive to learning and practicing skills.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "109102649328449634306", "name": "Finklea", "time": 1618857686362, "rating": 5.0, "text": "Great class. Very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "104520333041187191849", "name": "Katherine Taylor", "time": 1598651247045, "rating": 5.0, "text": "Mr. John is awesome and and very knowledgeable. He gives you tidbits of golden years of information that is current and up to date. Loved his class, will definitely take his class again.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "102150451306586265603", "name": "Tommy Truong", "time": 1590096711701, "rating": 5.0, "text": "John Cobb has been nothing but professional throughout the entire course. His materials were clear and concise. He makes you feel welcomed and prepared before leaving the building. The learning experience was interacting. I would recommend other friends to come here.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "107629083130057871968", "name": "Chelsey Sanford", "time": 1598649005361, "rating": 5.0, "text": "Excellent class and instructor. By far the best class for  BLS & ACLS renewal from a critical care nurse experience. Refreshments provided as well as ample resources to utilize for practice.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "104786945127276480403", "name": "Karissa Scott", "time": 1624207568438, "rating": 5.0, "text": "The class was so Great!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "105820790487525918375", "name": "Dakoa Kane", "time": 1606844627172, "rating": 5.0, "text": "Great BLS class for healthcare provider! The environment was relaxed and I learned a lot! Mr.Cobb is an excellent instructor with a great background and experience! I’d come back again to renew my certificate!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "115202192889724381629", "name": "Kelsey Ledkins", "time": 1602096737723, "rating": 5.0, "text": "The instructor laid out the information very well for us to understand. We learned a lot and had a lot of hands on activities that helped with our skills. I definitely recommend this place to everyone", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "106715380120919240389", "name": "Shabre Covington", "time": 1599927869914, "rating": 5.0, "text": "This is my second time with Mr John Cobb. He is an awesome instructor. He makes it easy to understand and is well educated. Definitely would recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "108639040402700947423", "name": "margaret nicholson", "time": 1597858593338, "rating": 5.0, "text": "Great instructor and class. Great atmosphere he takes his time. Makes  sure you are comfortable and understand before moving on. Snacks provided are a plus. Thank you Mr. John", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "115201826668582484213", "name": "Iesha Arso", "time": 1606001612107, "rating": 5.0, "text": "This is absolutely the most informative hands on ACLS known to mankind! Highly recommended", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "109188893355304752028", "name": "Bridget Robinson", "time": 1611943471959, "rating": 5.0, "text": "Excellent class. Very thorough and pleasant 😊", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "117852544967739800155", "name": "Lauren Singleton", "time": 1602033779793, "rating": 5.0, "text": "John was the best PALS instructor I have ever had!  His class was informative and to the point. He gave great explanations and kept the class entertained. He was very nice, funny, and professional. He answered all the questions I had. He even went above and beyond for me and helped show me how to intubate on a dummy and do an IO just for fun and because I wanted to learn. His place was nice, clean, and classes were small. I can't wait to take his ACLS class. I learned a lot from him and had a very enjoyable experience.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "106678159259092767898", "name": "Sarah Roberts", "time": 1597537799008, "rating": 5.0, "text": "John is an excellent teacher! Not only did I learn a ton, but I had fun learning some new skills along the way! An excellent atmosphere!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "102810052873981222530", "name": "Robert Yockey", "time": 1618180706657, "rating": 5.0, "text": "This place is the best to get training.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "103351270635608382538", "name": "Lakyn Kyle", "time": 1591719345334, "rating": 5.0, "text": "John was an awesome teacher who made sure each student fully understood the concepts. He monitored all students in the class and gave everyone a chance at individual instruction. With his constructive criticism and helpful tips I was able to fully understand/master all the skills that come with basic life support training.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "102288581921629064088", "name": "Kirstie Ruff", "time": 1595448721528, "rating": 5.0, "text": "The ACLS class was great! The class was small and very conductive for learning. The room was clean and professional. Even had coffee and some snacks! John Cobb was knowledgeable of the information and took extra time to let us ask questions to make sure we understood the information. I learned a lot and will be going back again for my PALS. Would highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "102381600635061356820", "name": "Jackson Haarala", "time": 1605720621029, "rating": 5.0, "text": "Instructor was very polite, but most importantly informative and professional. +rep", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "110955044465461086605", "name": "Christopher Choquette", "time": 1620249022676, "rating": 5.0, "text": "Great facility and knowledgeable instructor!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "110793488559277432607", "name": "Colby Robinson", "time": 1603831465593, "rating": 5.0, "text": "I was not looking forward to a 4-hour class, whose start time is 8 AM. However, John does an excellent job of being both informative and welcoming. Furthermore, he is very open about his impressive credentials and focuses on giving accurate healthcare information. He is passionate about healthcare knowledge, and his vigor learning is apparent in the classroom. I will certainly be using him as a reference for future BLS and healthcare knowledge.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "107014150573934368646", "name": "Kuniko Agnew", "time": 1609346266212, "rating": 5.0, "text": "Very Imformative. Great CPR class!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "115382382869745872918", "name": "Laura Eley", "time": 1623254509075, "rating": 5.0, "text": "Great classroom, great props, great instructor", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "100541431388759237320", "name": "jamye Sylvester", "time": 1587054725852, "rating": 5.0, "text": "Mr. Cobb was beyond amazing I'm going to be honest when I signed up for the class I was like ugh 4 hours of watching a video..... When I tell you I was wrong!!!!! Mr.Cobb made the class fun and exciting. He was the perfect candidate for this job. He was very thorough and I left the class feeling like I could really put my skills to use if I really needed to. I hope that he offers the course to recertify I will definitely be signing up!!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "113973213567130991584", "name": "Christine Conrad", "time": 1606237165734, "rating": 5.0, "text": "Excellent healthcare provider BLS class!! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "117866408960384691560", "name": "Breanna Clements", "time": 1602096759021, "rating": 5.0, "text": "John is a very thorough instructor with much expert knowledge on course materials! would recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "105881847397183477003", "name": "Latifahm Harrell", "time": 1606604281002, "rating": 5.0, "text": "Thoroughly enjoyed this class! Wish I could give 10 stars!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "101525536359618281232", "name": "Tiffany Williams", "time": 1610298968726, "rating": 5.0, "text": "Best CPR class , so professional and very helpful.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "100861956864650121632", "name": "Marcie Hickman", "time": 1570893710172, "rating": 5.0, "text": "The instructor was well prepared, extremely knowledgeable, open to discussion and/or questions and has a great sense of humor. The class size was just right, interactive with well working, clean equipment with both babies and adult mannequins. The coffee and snacks were a nice added touch and the bathroom was super clean. Highly recommend CEMS!  Best one I've experienced in over 20 years. Thank you John Cobb! : )", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "114079319891869813397", "name": "Kirsten Wooten", "time": 1601224886418, "rating": 5.0, "text": "I enjoyed a Sunday morning BLS class with Mr. John Cobb! Great class...great instructor!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "102545496544751270269", "name": "Delesia Brooks", "time": 1588950587867, "rating": 5.0, "text": "Great and awesome instructor. Takes his time and is patient with each individual. Instructor makes sure everyone understands and is fully confident before moving on. And most importantly, makes you feel comfortable in the class.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "103843515439887301296", "name": "Heather Easterling", "time": 1603039065837, "rating": 5.0, "text": "Great class and friendly environment! Plan on returning for other certification classes that is offered.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "113146727140301841589", "name": "Serena T", "time": 1590096608098, "rating": 5.0, "text": "A great class and a great instructor. Everything was clear and concise and I learned so much that I will be able to use in my practice. Very well accommodated with snacks and drinks. I enjoyed it very much!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "113920061955883110155", "name": "Kiana Harris", "time": 1599927997592, "rating": 5.0, "text": "John was very helpful, this was my second time coming and he always has snacks and makes the experience fun!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "113136577606897543491", "name": "Lauren Wheat", "time": 1604089010313, "rating": 5.0, "text": "Such a relaxed environment and a truly enjoyable experience for my ACLS renewal.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "110220032681342414012", "name": "Whitney Hudson", "time": 1588791617770, "rating": 5.0, "text": "So thankful for the opportunity to attend class at this facility! Our hospital has canceled all education and certification classes and John offered ACLS and PALS! The class was fun, informative and interactive. Seating was spaces and limited to respect current COVID-19 protocols and we each had our own work stations. Would 100% recommend and excited to go back for PALS!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "113684316463147666885", "name": "Willie Adams", "time": 1598208614409, "rating": 5.0, "text": "The instructor John is wonderful. I will definitely be back for my next certification.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "101489916548157209172", "name": "Charity Radford", "time": 1578236223873, "rating": 5.0, "text": "The instructor was great! Very knowledgeable and willing to teach. Kept us all engaged and shared some great stories throughout the course. I would highly recommend attending a class taught by John! Will be going back for my ACLS renewal.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "108462013863984499434", "name": "cybreena hansen", "time": 1603038887977, "rating": 5.0, "text": "Super easy class! Enjoyed it and very informative", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "100585959797183403334", "name": "Colbie Lewis", "time": 1606844811911, "rating": 5.0, "text": "Great class and instructor is very nice and explains clearly!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "118139140107495633477", "name": "Doctor Plagus", "time": 1586372483941, "rating": 5.0, "text": "Very good instruction and catered to student understanding.   I was unsure about my abilities before going into ACLS but John was amazing and helped me feel confident.   Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "111931093895674134443", "name": "April Pruitt", "time": 1574088593731, "rating": 5.0, "text": "This was the best CPR class I've taken. The instructor is very warm and welcoming. The class was very educational and he made it fun. It didn't even seem like the class lasted for four hours. I would highly recommend this instructor to anyone in need!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "116984372640586564600", "name": "Karen Boyer", "time": 1584273349508, "rating": 5.0, "text": "We had CEMS for our annual CPR training and I must say, it was the most informative, easy to remember presentation I have ever received. John was a ton of fun which made the training that much more enjoyable. We will definitely use them again and again!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "105562300155042700454", "name": "Benita Butler", "time": 1601224326145, "rating": 5.0, "text": "My Instructor JOHN  WAS VERY Interesting and educated i enjoy his class", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "101204706767079351954", "name": "Kierra Brown", "time": 1592221682668, "rating": 5.0, "text": "Instructors were very thorough. Great equipment. Highly recommended for skills training.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "100620446210928356649", "name": "Tatjana Barnes", "time": 1617467799401, "rating": 5.0, "text": "Mr. John is awesome ❤", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "106926821186545513326", "name": "Geoffrey Obia", "time": 1588802787326, "rating": 5.0, "text": "One of the best ACLS training I have ever taken. I chose CEMS because of the excellent reviews, and I was not disappointed. I highly recommend CEMS, and particularly Mr. Cobb. He is knowledgeable, proficient, and a remarkable instructor. He went out of his way to make sure I understood the mechanics of heart rhythms and gave me insight into upcoming 2020 AHA updates. I absolutely recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "104399158323304995936", "name": "Emma summerlin", "time": 1578530015729, "rating": 5.0, "text": "Really enjoyed the PALS class I took with this company! I enjoyed the smaller group and more one on one during the skills time! Would recommend this company for all of your certifications or recertifications!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "103405050631900556376", "name": "Brooke Koger", "time": 1566509522728, "rating": 5.0, "text": "Best certification class you will ever take! It was laid back, comfortable, and fun! John is THE GREATEST instructor! Plus, it’s cheaper than most other certification classes. The 4 hours flew by. AND he has snacks! I cannot say enough about John and CEMS! Overall amazing experience and I would recommend everyone to take there!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "102981876105827594736", "name": "Dominique Kimble", "time": 1553459421842, "rating": 5.0, "text": "Coastal Emergency Medical Skills is awesome! John is such a great teacher he has so many years of experience coupled with a dynamic personality. Coastal creates a comfortable learning environment your open to ask questions no many how silly you think it may be.\nScheduling my class was very easy and the price for the classes are very affordable. Guys this company is professional holds high integrity and most importantly the information is fun to learn!!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "100787669310157506430", "name": "Anna Hickman", "time": 1570832301200, "rating": 5.0, "text": "Best instructor (John Cobb) I’ve ever had for any CPR course! He’s funny and keeps your attention. The course may be 4 hours, but it went way faster cause we were having so much fun!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "107758599281192635666", "name": "Shaquita Campbell", "time": 1605722866199, "rating": 5.0, "text": "The instructor was knowledgeable and also patient.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "116761199343578130882", "name": "scott larson", "time": 1603198341365, "rating": 5.0, "text": "John was a great instructor, the class was very informative.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "117231704890816446193", "name": "Valarie McKinley", "time": 1498618251347, "rating": 5.0, "text": "John Cobb is an engaging, informative and motivating instructor. And he knows his stuff!  When he was suddenly presented with no way to play the DVD presentation, he was not put off at all. He launched into a full three hour presentation with hands on training for our group. He made learning FUN and left us feeling capable of handling a CPR emergency. Would highly recommend him. You can tell he truly wants to instill the knowledge to save lives into others. THANKS JOHN!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "103967600959169937403", "name": "just_aud", "time": 1561505418897, "rating": 5.0, "text": "Would highly recommend this training! John is an incredible and knowledgeable instructor who genuinely cares about the material he is teaching. I came to the session uncomfortable with heart rhythms and left feeling confident in my EKG interpretation skills. This is the place to go for your certs!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "105828745570069628129", "name": "Laura Wimmer", "time": 1578436959508, "rating": 5.0, "text": "Great class! John was very informative. I appreciate classes being offered on the weekends. I highly recommend CEMS.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "112782286371699975882", "name": "Ellen Davis", "time": 1581291663891, "rating": 5.0, "text": "John Cobb/CemsCpr Mobile, Al is the best ACLS class instructor and experience I have experienced in 35 years. You will leave the class understanding more and feel more confident. I highly recommend this instructor and class. Low stress with quality instruction.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "101930547775693339169", "name": "Amanda Hand", "time": 1617210080654, "rating": 5.0, "text": "Great & KNOWLEDGEABLE instructor 👍🏼👍🏼👍🏼", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "116381994277620501922", "name": "jordan knight", "time": 1574046507236, "rating": 5.0, "text": "I enjoyed the class! The instructor was great and he made the class interesting. Definitely recommend", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "110587479142843858665", "name": "Chidiya Ohiagu", "time": 1575744944443, "rating": 5.0, "text": "Highly recommend this class! Very professional, engaging and instructive. I am renewing for the 3rd or 4th time and this is my favorite experience yet.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "109547122017818825775", "name": "Bernadette Montgomery", "time": 1588024612550, "rating": 5.0, "text": "4-27-2020.\nI am writing this review for my husband, Kendall Montgomery, who has been in the healthcare field for 22 years.  CEMS (John Cobb-instructor), provided a most supportive, hands-on experience combined with current information and practice when Kendall re-certified for PALS.  He stated this was the best class he has ever had the privilege to participate in, and it was well worth it.  He plans to utilize CEMS for his BLS, ACLS, as well as his PALS recertifications in the future.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "105850048584179306729", "name": "Yasir Ahmed", "time": 1583710919929, "rating": 5.0, "text": "I had really good experience doing my ACLS refresher course, would highly recommend to others too.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "111588768099991897024", "name": "Thomisha Moore", "time": 1582567001872, "rating": 5.0, "text": "I Took The BLS Class And It’s A Very Great Experience And Hands On. You Actually Learn From It Step By Step. I Highly Recommend Going Through CEMS.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "110098901409284813159", "name": "Maryjane Randels", "time": 1566516404436, "rating": 5.0, "text": "John is very knowledgeable, has all the lastest gadgets, and has fascinating tidbits to enhance learning. Recommend him highly!\nMaryjane and Mark", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "108494766002869753473", "name": "Brittany Jones", "time": 1591719359024, "rating": 5.0, "text": "The class was great so was John. Definitely would recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "114746006492102657107", "name": "Heidi Dees", "time": 1560346449711, "rating": 5.0, "text": "Great experience and very professional! John was so accommodating with my schedule and allowed me to take an infant CPR class before work at 7am. Would absolutely recommend John and Coastal Emergency Medical Skills.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "117538257618477404888", "name": "Audrey Tallis", "time": 1539993658674, "rating": 5.0, "text": "I took an ACLS class from John at this location. The class was very informative. The structure of the class was great and had various types of learning methods including videos, hands on practice, information packets, etc. John was a great instructor who answered questions and clarified concepts thoroughly. If you’re trying to pick a place to get a certification, I highly recommend going here.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "116562191517592651893", "name": "Missy Long", "time": 1570390097073, "rating": 5.0, "text": "My first ACLS training experience was a great one thanks to John Cobb! Being a Dental Assistant, I was extremely nervous about all of it, but John went to great measures to make sure I was comfortable & not overwhelmed. The class itself was actually really enjoyable & I learned SO much! I feel so much more confident in my skills/knowledge in ACLS. I would highly recommend this instructor to anyone seeking further training/certifications! I’m actually looking forward my PALS training coming up!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "101681410904406705034", "name": "Emily Langlais", "time": 1565291771034, "rating": 5.0, "text": "John is such a good instructor and is really good at relating the in class simulations to real life situations.  Such a relaxed atmosphere and small class sizes so he can make sure that everyone gets the help they need.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "103805955145036402988", "name": "Tiare Graves", "time": 1458961310515, "rating": 5.0, "text": "Superior training center. Clean, comfortable classroom environment. Equipment and supplies were all in excellent repair and technically advanced. Instructor John Cobb was exceptional. All students remained engaged throughout the experience. Additionally, high code of ethics and quality assurance noted. 5 star in all categories. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "117790225693848559534", "name": "Vivian Tran", "time": 1552672115016, "rating": 5.0, "text": "Awesome instructor. I’ve had CPR certification through another instructor but John was a much better instructor and provided adequate CPR education. Thank you!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "105006516789988521070", "name": "Paul Hude", "time": 1573931133139, "rating": 5.0, "text": "Excellent instructor! Able to explain complex ideas in a simple, straightforward manner. Megacodes were informative, insightful and pressure free. The best way to renew ACLS and BLS.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "108786785145368688073", "name": "L L", "time": 1564999108633, "rating": 5.0, "text": "Great class, instructors, and facility! I will always renew my CPR and CEMS! Instructors were knowledgeable and provided real life examples of how the AED and high quality CPR saved lives in this local area.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "100350839518649735845", "name": "Brooklyn Dismukes", "time": 1554347162256, "rating": 5.0, "text": "I had the absolute best expierence hands down! Everything was so easy and efficient and I got my card the same day. Would recommend to anyone!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "104952241122167126038", "name": "Lacanda French", "time": 1513829897237, "rating": 5.0, "text": "This was by far the best BLS course I have ever taken. You can tell the instructor is knowledgeable and passionate about saving lives. The facility is very organized and clean. I have way more confidence in my CPR skills after today.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "111805323876987961728", "name": "Jonathan Holmes", "time": 1528834126935, "rating": 5.0, "text": "John Cobb is one of the most thorough and engaging CPR instructors I have come across in years.  His relaxed environment, cleanliness, punctuality, and professional experience make him an ideal instructor for any CPR class.  I took both ACLS and PALS and it was an excellent investment.  Thanks, John!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "118136069399665210404", "name": "Rachel Taylor", "time": 1588950703079, "rating": 5.0, "text": "Great learning experience! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "108278756075162981983", "name": "maureen graham", "time": 1558490276809, "rating": 5.0, "text": "I am so grateful for the opportunity to learn through experience in a great environment and with an excellent teacher.  I have already signed up for my next class!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "103261549522517769337", "name": "Learn and Play With Ethan", "time": 1540436681993, "rating": 5.0, "text": "Excellent experience. The instructor is knowledgeable and willing to answer any questions during class.  Great hands on. All equipment is in great condition.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "104768882337411278334", "name": "Kelsi Allman", "time": 1555817063502, "rating": 5.0, "text": "I took an ACLS course with John at CEMS and had the absolute best experience. So many opportunities for hands on learning. I definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "109493429537462253654", "name": "Carla Couret", "time": 1457292128132, "rating": 5.0, "text": "My experience with CEMS has been very informative and more in depth than other CPR Certification courses I have taken. Mr. John is very patient and delivers an informative class. He also manages to make the class interesting and comfortable. Mr. John also accommodates all students physical and learning weaknesses, while providing skill improvement and a great education.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "115154457239092004743", "name": "death Zone life", "time": 1428001161812, "rating": 5.0, "text": "It was a good hands on class, I like the part when I was having a little trouble with something he stopped and helped me until I got it right. the best part is you get your card the same day you don't have to wait before you leave you get your card , also he is a nice teacher. I would come back in two years to do it again. one more thing the works with your schedule nobody else does that.\nThe other great thing is that you get a book with the class and get to keep it!!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "117968167531152741493", "name": "Sheree Lumas", "time": 1558378327545, "rating": 5.0, "text": "Best BLS class I’ve taken!  Great equipment, the instructor kept our attention, and we even got snacks!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "117281972888670681013", "name": "Audrey Fowler", "time": 1511191121414, "rating": 5.0, "text": "Excellent experience. John is very knowledgeable and eager to help. I enjoyed his class and will continue to use him for my future certifications.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "117076332765718182001", "name": "Foster Veazey", "time": 1536592322063, "rating": 5.0, "text": "I took an ACLS class at this location, and it was an excellent experience. The instructor John tailored the class to all education levels and kept a good pace all while being engaging. The classroom, supplies, and skills training were extremely helpful as well. I have taken many of these courses, but this one was by far the best. I would recommend CEMS to any colleague.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "101694037054180122216", "name": "Emily Green", "time": 1558478922796, "rating": 5.0, "text": "I’ve taken both BLS and ACLS here and I love it. It’s a great environment to learn!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "113729600702212894561", "name": "Michaela McRae", "time": 1551045495956, "rating": 5.0, "text": "Completed ACLS recertification today. John was an awesome instructor and made the experience a fun and interactive one. Will definitely be taking PALS with him.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "108499785368084443514", "name": "Dee Simms", "time": 1576878037057, "rating": 5.0, "text": "This was a awesome class! Fun, hands on! Very informative!!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "101195919723679671310", "name": "Heather Agee", "time": 1524624981385, "rating": 5.0, "text": "In my 15 years as an RN this was the most thorough and engaging PALS class I’ve had the opportunity to take part in. John Cobbs is a wonderful instructor who breaks the content down in a memorable and retainable way. Would definitely recommend this class to my friends and colleagues. Thanks for a great course!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "101174009359343975769", "name": "Erin Frizzell", "time": 1431809830492, "rating": 5.0, "text": "Great course! Instructor is very knowledgeable and gives one-on-one teaching, answers questions, and clarifies material with helpful hints and tips. You receive your ACLS certification card the day of class and receive a student manual you may take home. Worth the time!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "114722132262814372366", "name": "Dana Cook", "time": 1557591043819, "rating": 5.0, "text": "CEMS provides a great learning environment with enthusiastic instructors who answer all your questions!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "108537189668825910881", "name": "Chad Lyman", "time": 1431105551265, "rating": 5.0, "text": "The experience was great! John was an excellent instructor. The environment was perfect with adequate space, sound, and supplies. John was also readily available far any questions that I had prior to the course. I highly recommend this course to anyone that needs BLS training.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "115021626397077258669", "name": "Leah Day", "time": 1560277789856, "rating": 1.0, "text": "Doesnt answer the phone, voicemail is full, or have the door unlocked. Personnel that was in the office would not unlock the door in order to get information about taking a class. This was June 11, 2019 at 12:45p.m. Also personnel that was in the office acted as if I was intimidating them and would not open the door unless they were on the phone. If your going to work in a business that has you talking to people and youre so overly paranoid of someone coming to the door, you dont need to work there. Number one way to lose business.", "pics": null, "resp": {"time": 1560384352333, "text": "Leah, I do apologize for your experience the other day when you came by the training classroom.  The instructor that was there that day had just finished teaching a class and was alone, so she locked the door.  Most of our classes are scheduled, and we know when students should be showing up for instruction or to pick up training materials.  The instructor that you encountered that day is pregnant and was alone in the classroom.  Lately, there has been an increase in crime in the area so she was making the classroom a safe environment for herself.  As far as the \"voicemail\" being full, I can only say that I may have been on the other line when you called.  I always reply to my voicemails and keep the mailbox empty and ready to receive messages.  So, I will again apologize for your experience and I assure you that our quality of service to the community is 100%.  I encourage you to please feel free to call me to resolve any additional concerns that you may have. Most importantly,  I would like the opportunity to provide you with the training that you may be seeking so that you can make a difference in Saving a Life.  Respectfully, John Cobb (251) 895-2367\n*** July 12, 2019 - I just wanted to reach out to you again and offer our services for training.  I had not heard a reply from you after my explanation of the circumstances and for my apology for your experience.  I hope all is well.  Respectfully,"}, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "106006856819057550963", "name": "Ashley Pharez Davis", "time": 1453859413683, "rating": 5.0, "text": "John is a great educator and great at adapting material to each student's experience level. I will definitely go here in the future for renewals and certifications. Awesome experience and will recommend to other colleagues.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "103610645151718870397", "name": "Madalyn Weber", "time": 1555089716483, "rating": 5.0, "text": "This was a great class and it helped me reinforce my basic life support skills.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "108060300490548370696", "name": "Kristen Thomas", "time": 1428360117246, "rating": 5.0, "text": "I traveled from Pensacola to take my BLS course here and the class was amazing! The course was very informative and the equipment we were able to demonstrate our skills on was excellent. The instructor was very engaging, knowledgeable, and attentive to each student. I would definitely recommend this place.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "112221075827068007856", "name": "Angel McNair", "time": 1606237395511, "rating": 5.0, "text": "Very informational!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "114789892977157584524", "name": "Del Adams", "time": 1507158873688, "rating": 5.0, "text": "John is an awesome instructor! He made the class very interesting. He was thorough and very knowledgeable! I'd recommend CEMS to all my colleagues!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "112012498204564799460", "name": "Lynn Jablanski", "time": 1570842610581, "rating": 5.0, "text": "John is an awesome instructor, keeps the class interesting, entertaining, and stress free.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "115743705925488214576", "name": "adrian davis", "time": 1445880395398, "rating": 5.0, "text": "If you are looking for a place that give you a personalized approach to learning then this is the place for you. Overall experience was GREAT! I would highly recommend Coastal Emergency Medical Skills to my classmates and coworkers.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "114337787120185073325", "name": "Candace Harris", "time": 1517183285707, "rating": 5.0, "text": "Had the pleasure of taking the BLS course today with John! Not only was he very informative, but he was patient and provided one on one help for those who needed extra time to ensure that they had a thorough knowledge of the course. I have taken CPR courses before, but this by far was the BEST course experience yet! Thank you CEMS! See ya in 2 years!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "118428275733062806017", "name": "Faith Donald", "time": 1558478534438, "rating": 5.0, "text": "After finishing the course, I feel confident to perform the necessary skills for BLS, ACLS, and PALS.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "112942798551372768901", "name": "Stacy Norred", "time": 1552938861224, "rating": 5.0, "text": "Fun, friendly, relaxed environment. Great for learning  and good strong information. 3rd time going here to renew BLS  and plan to come back with each renewal BLS /ACLS/PALS  needed.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "117666046821290317967", "name": "Stephanie Bush", "time": 1552084488044, "rating": 5.0, "text": "This was fun, easy and very informative, I never felt nervous. Great instructor.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "108010597225694178507", "name": "Sahra El-Hamaki", "time": 1498185538661, "rating": 5.0, "text": "John Cobb is the absolute best BLS instructor! He is very thorough with the material, and you will leave feeling like you could actually use the skills you learned in a real-life situation without panicking or feeling lost. The class was interesting and he interacted with me the whole time. He explains the \"whys\" of everything in a way that makes perfect sense.  I highly recommend Mr. John Cobb! You won't find better!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "104917477168056227336", "name": "#Trauma Rn", "time": 1500768252737, "rating": 5.0, "text": "This class was actually fun and provided so much hands on learning. The instructors past medical history added a unique and helpful view on current standards of practice. With varying degrees of experience and prior ACLS knowledge mixed among the students, the instructor made everyone feel comfortable and confident before leaving his class. Great experience and I would recommend his class to anyone seeking ACLS certification.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "113668227616328709910", "name": "Dayton hunn", "time": 1465399124927, "rating": 5.0, "text": "Great, informative session. The best I have BLS course I have taken. Mr. Cobb is incredibly knowledgeable and teaches the course with a friendly and approachable manner.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "105314182648791713971", "name": "Amy Thomas", "time": 1495513190848, "rating": 5.0, "text": "I must say that today class was very awesome.After every review of the film Mr.John made sure that we all understood and was there any questions need to b answered..My experience here were very pleased n impressed by his service and would recommended anyone that are in need to receive there BLS and CPR training ..Thanks again!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "114273174648860806148", "name": "TyTiana Dawson", "time": 1450218914025, "rating": 5.0, "text": "The class was very informative. I really enjoyed the instructor. He taught the class very well. I really enjoyed the fact the it was very hands on and the instructor was very thorough.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "115104371466463985625", "name": "nichole burgess", "time": 1457978279237, "rating": 5.0, "text": "Very informative on the new AHA techniques for basic life-saving skills. Highly encourage those who need certification to use this facility!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "109112335537734228401", "name": "Hannah Greer", "time": 1532459525880, "rating": 5.0, "text": "I am an ICU nurse and have taken several ACLS courses before. I am new to the area and found CEMS through an online search. It was by far my favorite ACLS renewal course and I will continue to attend any certification courses needed at CEMS. John Cobb is extremely knowledgeable and has had great experience throughout his career. He is more than qualified to teach this course. He keeps the classes small which allows for efficiency and more one on one time. He also keeps the class interesting, fun, and relaxed. After taking this course I feel extremely prepared and confident in my knowledge and skills.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "111211135043984040022", "name": "Alice Pope", "time": 1445794614751, "rating": 5.0, "text": "I really recommend Mr. Cobb as an instructor. He went out of his way to accommodate my schedule. The only day I had to complete my renewal before the end of the month was a Sunday. Mr. Cobb opened his facility and did a class just for me. Not only that, he is very knowledgeable. and he taught me some things that I had never learned before, and I am a former Nursing Instructor with a Master's Degree. If you need ACLS or PALS, he makes you feel very comfortable. I will use him again.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "113198393510815454684", "name": "Mary Wingo", "time": 1559583923041, "rating": 5.0, "text": "Knowledgeable and fun! Very convenient and accommodating!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "115952692403846321453", "name": "Angelia Smith", "time": 1431708003783, "rating": 5.0, "text": "I was glad that I took this class! It was very helpful and I learned a lot of things that I have never learned the past.  Very detailed and informative.  Manikins and equipment clean.  I also received a book with the class.  The instructor was great and also worked with my scheduling needs.  Thanks for the class.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "107884665816427677834", "name": "A.N. R.S.", "time": 1501072004374, "rating": 5.0, "text": "Highly recommend this company for many reasons:  instructor is very professional and willing to go out of the way to fit trainee's schedule, neat and clean enviorment, in depth and up to date courses and procedures.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "103403648640251826927", "name": "Taylor Castorani", "time": 1457978722697, "rating": 5.0, "text": "John is great! I highly recommend CEMS for CPR classes. This was my third time taking BLS course and definitely the most enjoyed.John is super fun and personal!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "111536389800888367654", "name": "PaulLeann Wise", "time": 1471470603405, "rating": 5.0, "text": "Very instructive! Highly recommend to anyone needing certification for BLS!  John makes it fun to learn!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "105384223491202111361", "name": "Callie McNeely", "time": 1438445359046, "rating": 5.0, "text": "This course was casual and informative without being intimidating. I enjoyed the instructor and his knowledge of the material.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "100845433644376655740", "name": "Darby Wheat", "time": 1495249844925, "rating": 5.0, "text": "Great experience. Hands on class with a great environment and had all the equipment necessary for a great learning experience. John Cobb is a great instructor and will answer any questions that you have. He has a great sense of humor and makes the 4 hours for the course feel (BLS course) not as long. I definitely recommend CEMS for anyone needing healthcare certification.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "104337660424911133159", "name": "Christy Long", "time": 1495254786514, "rating": 5.0, "text": "BLS class at CEMS was probably the best I've had. The instructor, John, was very thorough and explained \"why\" we do what we do so that anyone in class, regardless of background, could understand. I'll likely return there for ACLS. Great experience!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "106426778562186780553", "name": "ashley polk", "time": 1429722661676, "rating": 5.0, "text": "I really enjoyed the BLS class with Mr. John. Mr. John instructed the class very well. He also made it fun to learn. I would advise people to go to him for BLS training.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "117963340897469075492", "name": "JSH Alabama", "time": 1516632755774, "rating": 5.0, "text": "CEMS did a fantastic job. John Cobbs presentation really resonated with our local utility crews. His presentation was spot on and valuable. Look no further for your training needs, CEMS does a great job. We look forward to relying on CEMS for our OSHA certification requirements and additional certifications. Thanks again CEMS & John.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "104429072929930532465", "name": "Mason Dyess", "time": 1465242584922, "rating": 5.0, "text": "Mr. Cobb was a phenomenal instructor for the renewal of my PALS, ACLS, and BLS renewal courses. The facility was very nice and clean, there were free refreshments and snacks, and, most importantly, there was no time wasted!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "115441393454288529410", "name": "Wanda Jones", "time": 1450851548455, "rating": 5.0, "text": "Wanda Hayes\nI wants people to no that's, John is a very good instrutor and, he made sure that he explain everything so thoroughly, were as you have a good understanding. And willing to work around your schedule, I highly recommended him.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "115767867491746610332", "name": "L L", "time": 1445881010700, "rating": 5.0, "text": "Out of all my years in healthcare, this was by far the most informative and fun BLS class that I have attended. I highly recommend Mr. Cobb for your CPR training :)", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "106428720314834746511", "name": "erica thompson", "time": 1430774364148, "rating": 5.0, "text": "If anyone needs a First Aid/CPR and Blood Borne Pathogens Certifications. I recommend, John at Review Coastal Emergency Medical Skills. Great Teacher, Great Hands Ons, Answers all your doubts and questions. You leave 100 percent sure about what you learned and the safety of others around you.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "103803155045714404258", "name": "Kyle Derouen", "time": 1461529889589, "rating": 5.0, "text": "Very professional, friendly environment. I felt like I learned a lot, and Mr. Cobb was able to answer any questions I had regarding the material. Would highly recommend", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "114913020937524133159", "name": "Tay EdwaRds", "time": 1467848940872, "rating": 5.0, "text": "The class was fun, but we also learned a lot. Very educational!  The instructor was very nice & welcome me & the other students. Within about 3 or 4 hours I received my BLS certifications & I can start my new job in a week!!!!! =) im so excited!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "117655298872543434991", "name": "Capri R", "time": 1455299902942, "rating": 5.0, "text": "This was a great class!  I have used CEMS for several years for my ACLS, BLS, and PALS requirements. They provide an extremely professional and comfortable atmosphere which helps to make it a great learning experience. Definitely the best that I have encountered during my 20+ years in the medical field. I highly recommend this to anybody needing certification!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "116348895127774182976", "name": "Kimberly Barnes", "time": 1468963590169, "rating": 5.0, "text": "John Cobb was an extremely effective ACLS instructor.  I highly recommend him and CEMS for this course.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "104901562843191196646", "name": "tony chaney", "time": 1586039678984, "rating": 5.0, "text": "Very informative and hands on.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "107558340369241710131", "name": "Julia Lindsay", "time": 1428694206774, "rating": 5.0, "text": "I was very pleased with this course and the instuctor great learning atmosphere up to date equipment and the instructor was phenomenal .I highly recommend this class.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "112741656996793500605", "name": "Sara McConnell", "time": 1583710102273, "rating": 5.0, "text": "Great learning environment 👍", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "109138159835075496688", "name": "Brianne Harbison", "time": 1467849702013, "rating": 5.0, "text": "I really enjoyed this class and learned more information that I could apply in my everyday life and professional career. ..", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "109660310696464792253", "name": "Anna Wilkins", "time": 1517179654150, "rating": 5.0, "text": "great environment , fun and educational instructor ! I highly recommend , I was very pleased !", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "112150084953181106339", "name": "MileHighClubTV", "time": 1459186846774, "rating": 5.0, "text": "John provides a refreshing, realistic approach on Basic Life Support. I would attend again!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "101207417145625556792", "name": "Tianna Howard", "time": 1458411835211, "rating": 5.0, "text": "The class was very informative. John made the class fun, and not boring.", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "109537535514740951881", "name": "Marlee Bruno", "time": 1465754329296, "rating": 5.0, "text": "I took my BLS, ACLS, and PALS recertification with John. For the first time ever, I actually enjoyed the courses. He kept it interesting, interactive, and fun! The lab and equipment were better than any I've ever used. I had a great time in class and feel much more confident about my skills. I will use CEMS for any further certifications I need, and I highly recommend them to everyone!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "117969584947068892097", "name": "Joseph Stolfi", "time": 1465860423890, "rating": 5.0, "text": "Excellent customer service and top notch in training!! Will most definately use again!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "105657588838337158058", "name": "Jeffery Boddie", "time": 1564879757206, "rating": 4.0, "text": "Great class with a great instructors", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "103473676905450899559", "name": "Thelma Green", "time": 1445285022743, "rating": 5.0, "text": "Great course and very knowledgeable instructor!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "105892921329365943568", "name": "Raylei Powe", "time": 1459186644657, "rating": 5.0, "text": "Best class ever!! Mr John Cobbs is the BEST!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4b542494149d:0xc210408adfc97815"}
{"user_id": "116210600508857127095", "name": "City Shakers Evangelistic Church (The Prophetic Voice)", "time": 1617296141473, "rating": 5.0, "text": "Nice speaking with MS. Cole, about having my son FOOTBALL PLAYER join her class", "pics": null, "resp": null, "gmap_id": "0x888602e8b8bfffff:0x5abba38616848fe8"}
{"user_id": "103709944521019719199", "name": "Greta Street", "time": 1580945258424, "rating": 5.0, "text": "Ms. Cole is a fantastic and patient ballet teacher. She encourages even her youngest  students to work toward self discipline. The children have so much fun in her classes!", "pics": null, "resp": null, "gmap_id": "0x888602e8b8bfffff:0x5abba38616848fe8"}
{"user_id": "106555765135728086828", "name": "Dixie Mae", "time": 1553010044134, "rating": 1.0, "text": "I'm just going to guess that the 2 five star reviews are granddaughter and friend or friend and son or people paid to review things well, because, from my experience, 1 star is all they get. USE SOMEONE ELSE!! We were wrong in Alabama and we handled it. We were arrested on a misdemeanor marijuana charge and live in another state. We agreed on 15%, instead of normal 10%. After we are released, they \"offered\" us a ride, 2 miles to where we had to pay to get our car out of impound. The owner and his wife would send our receipt by email and gave me the change from our friends who had sent bail money. Upon receiving our receipts, these people took 20% of our bond and charged us $65 for the trip to our car. When we asked them about it, we were basically told to get bent. So, if you want to get screwed in Alabama, let these people do it. Otherwise find another bondsman and line his pockets. Not sure how these work exactly, but I have a screenshot of this in case they can remove it and I have proof of everything I said, in case they want to challenge it.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ddb6f34bf:0x5e99b9cf1ea3ffc3"}
{"user_id": "102824500198251475031", "name": "Jenni Daugomah Granat", "time": 1513698404811, "rating": 5.0, "text": "Absolutely amazing people to work with.  Pop & Ms. Joyce are two of the most honorable, kind, courteous, and genuine people I've ever had the pleasure of knowing.  If you, or anyone you know, is ever in a position of needing a bonding company, this is hands down the BEST company to have on your side.\n\nThank you and God Bless you both.\nJennifer Frias-Daugomah", "pics": null, "resp": null, "gmap_id": "0x888c2b7ddb6f34bf:0x5e99b9cf1ea3ffc3"}
{"user_id": "108579263861136596622", "name": "kenneth brumit", "time": 1533754503849, "rating": 5.0, "text": "Best trusted bonding co in Alabama", "pics": null, "resp": null, "gmap_id": "0x888c2b7ddb6f34bf:0x5e99b9cf1ea3ffc3"}
{"user_id": "102219898801463161898", "name": "The only one D", "time": 1598034991802, "rating": 5.0, "text": "You can't say enough good things about Mr Jackie. If you want to try and get your CWI license there isn't a better teacher. This man knows everything there is to know about welding! He has changed a lot of men and women's life by teaching them a profession that allows them to have a six figure lifestyle. You just have to Qualify to be able to take the test.", "pics": null, "resp": null, "gmap_id": "0x889bb4b0d255e081:0xfa05081dd43e8733"}
{"user_id": "111655128268938699194", "name": "Todd Schlegel", "time": 1581001908573, "rating": 5.0, "text": "Probably the most knowledgeable guy I’ve ever had the pleasure of meeting. If you’re thinking of taking any NDT classes or your CWI, give him a call.", "pics": null, "resp": null, "gmap_id": "0x889bb4b0d255e081:0xfa05081dd43e8733"}
