{"user_id": "111724559403476337420", "name": "Catherine Walker", "time": 1577540004744, "rating": 5.0, "text": "Ariel has been my caregiver since May 2019. She is a blessing to me since  having 2 strokes.\nWithout her coming and caring for me I would of ended back in a nursing home. Ariel treats me like her mother. I truly love her with all my heart. She's the best caregiver my daughter could of found. I recommend her for all your caregiver needs.", "pics": null, "resp": null, "gmap_id": "0x8889056785763c75:0x24b91e62c47f05ce"}
{"user_id": "109698911587785874755", "name": "Tashara Johnson", "time": 1577539122206, "rating": 5.0, "text": "I will recommend this company she has been taking care of my grandmother for over six months and it has been such a blessing.. she is so professional that you are able to let her handle everything about the patient... She loves the patient like family...", "pics": null, "resp": null, "gmap_id": "0x8889056785763c75:0x24b91e62c47f05ce"}
{"user_id": "105072278345839320561", "name": "LaSandra McKinzie", "time": 1562507443564, "rating": 5.0, "text": "I recommend Ariel's Helping Hands. She's a blessing to my mother. I needed someone that had a calling for this ministry.  She loves and take care my mother who had 2 strokes in least than a year.  We recently had a health challenge. She stay with her the entire time even through the urgent care and ED. My brother and sisters  appreciate her been their with them. And I didn't have to take off work at usual. Because of her quick and CNA background this episode went very smoothly and the same night. I was able to take my mother home and she's doing great.\nThanks Ariel for loving and caring for my mother like she was your parent.", "pics": null, "resp": null, "gmap_id": "0x8889056785763c75:0x24b91e62c47f05ce"}
{"user_id": "118446212892897058903", "name": "Kesha Wiggins", "time": 1577539305123, "rating": 5.0, "text": "Ariel have been a blessing to my Mother she loves and treat my mom like that is her Mother!! Words can not express how grateful we are for Ariel!! She is honest, dependable, loving and caring!! I would reccomend Ariel's Helping Hands LLC to anyone that needs a Excellent sitter company!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x8889056785763c75:0x24b91e62c47f05ce"}
{"user_id": "116069190484065959143", "name": "Latonya Johnson", "time": 1558371657547, "rating": 5.0, "text": "I've worked with Ariel at a nursing home facility. She has a passion for others, especially those who are incapable of doing for themselves. She's very hard working and takes her job seriously.", "pics": null, "resp": null, "gmap_id": "0x8889056785763c75:0x24b91e62c47f05ce"}
{"user_id": "105830367783405767525", "name": "Rosetta Pritchett", "time": 1574386798566, "rating": 1.0, "text": "I will Not recommend Ariels Helping hands LLC\nIn Birmingham Alabama. Not a professional company\nat all!", "pics": null, "resp": null, "gmap_id": "0x8889056785763c75:0x24b91e62c47f05ce"}
