{"user_id": "108583947440760159043", "name": "Giant Slayer", "time": 1537209887476, "rating": 5.0, "text": "I would like to express my sincerest gratitude to the kindness that was displayed to me by the couple who owns this business. On Friday, September 8, I ended up at this business, experiencing some very scary pain which ended me up at UAB hospital. The lady who helped me offered me her own bed to rest while I waited a couple of hours for my husband to arrive. She took care of me as if I were a close relative and went out of her way to comfort and encourage me. The owners also allowed us to keep our vehicle there for the weekend, as we were unable to pick it up until sometime later that weekend. This type of compassion and unselfishness is a rare quality in today’s world. I’m very appreciative that I happened across your business, and I’m so very grateful for how giving you were.\nI realize this is not a review of the vehicle services to offer, but I believe how you treated me is a very good reflection of the type of business you run....thank you so much for your compassion and hospitality! May the favor of the Lord rest upon you and your business!", "pics": null, "resp": null, "gmap_id": "0x8889125fb8698f55:0x758eb3575878ad47"}
{"user_id": "112670670138947045787", "name": "John Collins", "time": 1544307318982, "rating": 4.0, "text": "A family ran business and are good people.", "pics": null, "resp": null, "gmap_id": "0x8889125fb8698f55:0x758eb3575878ad47"}
{"user_id": "117322116253667807275", "name": "Guillermo Pérez", "time": 1598653120125, "rating": 4.0, "text": "Nice place.clean", "pics": null, "resp": null, "gmap_id": "0x8889125fb8698f55:0x758eb3575878ad47"}
{"user_id": "116951875308299369153", "name": "Marlenys Farah", "time": 1572530297268, "rating": 5.0, "text": "I wanted to take a minute and thank you for your PATIENCE and extreme level of professionalism during our out of town depositions.  You and your team were incredibly accommodating working with a very last minute deadline and re-arranging your schedules and equipment to make it happen.  They would not have been accomplished without your \"can do\", \"whatever it takes\" attitude.  Thanks again! From the office of The Rockefeller Law Center, Warner Robins, GA", "pics": null, "resp": {"time": 1590770112944, "text": "Thank you Marlenys for your review.  Please let us know if there is anything else we can do to assist you in the future."}, "gmap_id": "0x88891b90de822323:0xbdaeff22f0bf1a07"}
{"user_id": "105482756761817422819", "name": "Robert Mashburn", "time": 1591153676943, "rating": 5.0, "text": "Professional Services for your Court reporting needs, videography, and Litigation Trial Support.", "pics": null, "resp": {"time": 1590770111974, "text": "Thank you Robert! Please let us know if there is anything else we can do to assist you in the future."}, "gmap_id": "0x88891b90de822323:0xbdaeff22f0bf1a07"}
{"user_id": "111907091942164074214", "name": "Jim Sanders", "time": 1437921722958, "rating": 5.0, "text": "Sandy was very accommodating and made us feel like family.  We will definitely use them again.", "pics": null, "resp": {"time": 1481823981042, "text": "Thanks Jim!  We're always here to help anytime.  Looking forward to serving your firm here in Birmingham again soon."}, "gmap_id": "0x88891b90de822323:0xbdaeff22f0bf1a07"}
{"user_id": "115329531027142604602", "name": "nevin mattice", "time": 1499873798775, "rating": 5.0, "text": "Always helpful. Accommodating every need.", "pics": null, "resp": {"time": 1590770117011, "text": "Thank you Nevin for your review. Please let us know if there is anything else we can do to assist you in the future."}, "gmap_id": "0x88891b90de822323:0xbdaeff22f0bf1a07"}
