{"user_id": "106474971677908133248", "name": "Sharon Willcutt", "time": 1614984391969, "rating": 5.0, "text": "This is our go-to/runaway to place!  Love being here to relax and get away from everything.  Love it!", "pics": null, "resp": {"time": 1615074819885, "text": "Thank you, Sharon, We love it's your \"go to\" place!  The cottage is awaiting your next visit :)"}, "gmap_id": "0x88602d438edc6431:0xd5e33bb7cdc1752a"}
{"user_id": "102853839966455572970", "name": "Michael Zirkel", "time": 1603126665125, "rating": 5.0, "text": "Beautiful cabin on a quiet and private lot located not far from downtown Mentone. Nicely appointed and well maintained throughout, so much so that you won't want to leave! A great getaway spot with just enough room inside for your needs and endless possibilities in a serene outdoor setting.", "pics": null, "resp": {"time": 1603131796807, "text": "Thank you Michael!  You will just have to stay longer next time, lol.   Give us a holler when you are ready.  Winters are just beautiful in Mentone and the serenity of the woods is so relaxing.  (hint)   :)\nThanks again,\nClaudia"}, "gmap_id": "0x88602d438edc6431:0xd5e33bb7cdc1752a"}
{"user_id": "118102574334865605177", "name": "BL G", "time": 1589004731860, "rating": 5.0, "text": "We stayed there for our 51st wedding anniversary last October. It was wonderful and cozy..Claudia thinks of every detail to make the experience perfect. I can’t think of a more perfect cottage in such a quiet and peaceful location. The mattress was amazing and the most comfortable mattress we have  ever slept on , ever.  We enjoyed the hot tub on the screened in back porch. We would give it a rating of ten stars if there was an option.  Having at least 10 deer wander around the back yard was an added bonus.", "pics": null, "resp": {"time": 1590171352620, "text": "Thank you! I really appreciate your kind words.  Hope you visit on your 52nd!"}, "gmap_id": "0x88602d438edc6431:0xd5e33bb7cdc1752a"}
{"user_id": "104421197599720061729", "name": "Magan Sellers", "time": 1603123956360, "rating": 5.0, "text": "We have spent the last two Anniversary getaway in Mentone but this year tops all of them. We love this little cabin. The cleanest and nicest place we have stayed. The owners are the sweetest and are very accommodating to every need. The cell service wasn’t bad at all. We have Verizon and my lifeline is my cell service when I am away from my kiddos. We were very pleased with our signal. We love that the cabin is surrounded by woods and no neighbors close to it. We will rent again in the future...\nMagan Sellers", "pics": null, "resp": {"time": 1603131382924, "text": "Thank you Magan!  We hope you make it an annual tradition to stay with us on your anniversary.  Kathy is our housekeeper and is the BEST!  I will definitely forward your comments to her because she works very hard at making sure the cabin is clean and presentable for our guests.  Verizon has certainly upped their game in the last 6 months here in Mentone.  So now we have ATT, Verizon and T-mobile here on top of the mountain.  Hope to hear from you next year! Thank you again -\nClaudia"}, "gmap_id": "0x88602d438edc6431:0xd5e33bb7cdc1752a"}
{"user_id": "113700339599646124283", "name": "Jennifer Shepherd", "time": 1589029736171, "rating": 5.0, "text": "A perfect cabin for a quiet getaway...no other cabins in the yard!  Super clean and has everything you need.  Claudia is so wonderful to work with, we had to change our dates and she adjusted the dates no problem.   We will be going back soon!", "pics": null, "resp": {"time": 1590171392243, "text": "Thank you Jennifer!"}, "gmap_id": "0x88602d438edc6431:0xd5e33bb7cdc1752a"}
{"user_id": "101742610322129726423", "name": "Nathan Steele", "time": 1545921369155, "rating": 5.0, "text": "A wonderful, cozy space just outside of mentone. The owners were so hospitable and easy to work with, they even checked in on Christmas day to make sure we had arrived and found everything in order at the cottage. The hot tub and fireplace are amazing for colder nights in at the cottage. Highly recommended you book a stay and we hope to visit again soon.", "pics": null, "resp": null, "gmap_id": "0x88602d438edc6431:0xd5e33bb7cdc1752a"}
{"user_id": "109254999249226462061", "name": "Jason Pilkington", "time": 1614801639376, "rating": 5.0, "text": "Lovely, quaint cottage. A wonderful weekend retreat. My wife & I always enjoy our stay! So peaceful & quiet, and the owner goes above & beyond to accommodate guests.", "pics": null, "resp": {"time": 1523638158828, "text": "Thank you so much Jason!  We hope to see you and your wife again soon!"}, "gmap_id": "0x88602d438edc6431:0xd5e33bb7cdc1752a"}
{"user_id": "111040182649085865301", "name": "Martin Santana", "time": 1590416250432, "rating": 5.0, "text": "Beautiful place and amazing views", "pics": null, "resp": null, "gmap_id": "0x88602d438edc6431:0xd5e33bb7cdc1752a"}
{"user_id": "104646910663313490039", "name": "Jon Thieman", "time": 1504549253519, "rating": 5.0, "text": "New and very clean, nice owner.", "pics": null, "resp": null, "gmap_id": "0x88602d438edc6431:0xd5e33bb7cdc1752a"}
{"user_id": "109958520698526226742", "name": "Hugh Jacks", "time": 1574528052998, "rating": 5.0, "text": "Excellent View", "pics": null, "resp": null, "gmap_id": "0x88602d438edc6431:0xd5e33bb7cdc1752a"}
