{"user_id": "114672478477893230003", "name": "Austin Faulkner", "time": 1599554016820, "rating": 5.0, "text": "I’m looking for the owner of the 6.0 powerstroke parked outside. Serious buyer", "pics": null, "resp": null, "gmap_id": "0x888d47848c3631e7:0xbdc19336f93d19a2"}
{"user_id": "107385096803779277514", "name": "Fred Green", "time": 1545523449805, "rating": 1.0, "text": "It's okay if you want to buy junk", "pics": null, "resp": {"time": 1545663396183, "text": "What did you buy because i dont have any records of you buying anything you made an appointment to come look at a 2008 honda accord and didnt have enough money to buy it when you were clearly told the price before you made the trip to come look at it . You tried to say well i only got 2600.00 dollars and i told you that was a waste of my time and your time because i had already come down from 5900.00 to 3000.00 for you . Now the car is sold and the girl loves it who purchased it sorry you didnt have enough money and our customers will overlook your childish review saying our cars is junk"}, "gmap_id": "0x888d47848c3631e7:0xbdc19336f93d19a2"}
{"user_id": "103168979372341241335", "name": "Summer Johns", "time": 1531839123930, "rating": 1.0, "text": "Bought a $3000 wrecker and these idiots had the fuel line across the top of the motor which  caused my husband's  wrecker to catch fire the day after buying it", "pics": null, "resp": {"time": 1531858791191, "text": "we didnt put fuel lines on it they were like that when we bought it"}, "gmap_id": "0x888d47848c3631e7:0xbdc19336f93d19a2"}
{"user_id": "117298460926045772553", "name": "Thunder Wolf", "time": 1627056955499, "rating": 5.0, "text": "EKG is a wonderful place to bring your vehicle to for repairs. They are friendly, knowledgeable, and respect your vehicle. They are quick with repairs, will tell you about what needs to be fixed and are very accommodating. After they replaced my faulty water pump, my car ran so much smoother. I am extremely grateful! I highly recommend EKG auto center for all of your car repair needs!!", "pics": null, "resp": null, "gmap_id": "0x888bc3790e70fa19:0xdd0598ce086748d2"}
{"user_id": "107762235413680156701", "name": "Sam NA", "time": 1605057822136, "rating": 5.0, "text": "Very knowledgeable, friendly, a great deal of experience and love for the Chevrolet. I had a great experience there! I will definitely be back.", "pics": null, "resp": null, "gmap_id": "0x888bc3790e70fa19:0xdd0598ce086748d2"}
{"user_id": "103388571868522855066", "name": "Joseph W Williamson", "time": 1627297567469, "rating": 5.0, "text": "Very Professional, Quality Work", "pics": null, "resp": null, "gmap_id": "0x888bc3790e70fa19:0xdd0598ce086748d2"}
{"user_id": "108601074625463438133", "name": "Dennis Farmer", "time": 1628720751234, "rating": 5.0, "text": "Awesome people", "pics": null, "resp": null, "gmap_id": "0x888bc3790e70fa19:0xdd0598ce086748d2"}
{"user_id": "118018247346499517620", "name": "Robert Kyzer", "time": 1583563069751, "rating": 5.0, "text": "Great guys and great work.", "pics": null, "resp": null, "gmap_id": "0x888923b5a314bd59:0x715f1214ae91c175"}
{"user_id": "112848097838126379484", "name": "Lita Peer", "time": 1474320800444, "rating": 5.0, "text": "Great crew and high quality! Definitely would recommend!", "pics": null, "resp": null, "gmap_id": "0x888923b5a314bd59:0x715f1214ae91c175"}
{"user_id": "102777042476403780757", "name": "Michael Hoover", "time": 1474324036157, "rating": 5.0, "text": "Very professional, quality assured and great environment", "pics": null, "resp": null, "gmap_id": "0x888923b5a314bd59:0x715f1214ae91c175"}
{"user_id": "107528720521465974050", "name": "Trent Daniels", "time": 1512442548590, "rating": 5.0, "text": "Nothing here anymore 12-4- 17", "pics": null, "resp": null, "gmap_id": "0x888923b5a314bd59:0x715f1214ae91c175"}
{"user_id": "113290170785518212988", "name": "Michael Stewart", "time": 1621265109405, "rating": 5.0, "text": "John did a fantastic job on my Tacoma. The performance difference is very noticeable during take off, as well as highway speeds. He was very professional and detail oriented. The whole process took about 45 minutes. I highly recommend his services!", "pics": null, "resp": {"time": 1621268156955, "text": "Michael, Thank you for taking the time to leave this review.. I appreciate the trust and support."}, "gmap_id": "0x8889219bb1e604e7:0xc14dc706394c40b4"}
{"user_id": "105029954778527811292", "name": "Phillip Mejia (INKT1)", "time": 1620016931387, "rating": 5.0, "text": "This is how the truck should have come from the factory! John took his time in explaining every step in the process as it went along and answered every question I had. And let me tell you, I had a smile on my face before we even got out of his driveway for the test drive! I don't know how many times I started laughing during the test drive about the difference in how responsive the taco is to drive now. I HIGHLY recommend getting the tune, you won't be disappointed!", "pics": null, "resp": {"time": 1620074004538, "text": "Phillip - Thank you for your trust and support. Enjoy the new Tacoma Tune!"}, "gmap_id": "0x8889219bb1e604e7:0xc14dc706394c40b4"}
{"user_id": "107145963628778572350", "name": "Bob Reid", "time": 1615989489767, "rating": 5.0, "text": "I had been reading a lot of posts about tuning on Tacoma World when I came across a thread about a Kruiser Tune 4.0 that was generating a lot of positive feedback posts. I was fortunate enough to get connected with John, from Overland Tailor Tuning in Hoover, AL\n\nI reached out to John and over the course of 2 weeks we communicated back and forth, he walked me through the entire process (in fact I have 2 pages of messages) John took the time to answer any and every question that I had as well as asking me questions about my truck in the event I decided to go ahead and tune. Note: John even volunteered his email and mobile number should I want to talk more about the tuning process for my Tacoma.\n\nI was still on the fence about driving 4hrs, each way but John’s explanation of what would take place was well thought out and made me feel comfortable that this was a very thorough tuning process.\n\nWhen I arrived, John took 15 minutes to discuss every step that would take place (he had a checklist already prepared) from adding a battery tender and why he did that, checking for codes, if I would need a TSB update, he double checked with me on the following; did I tow or haul, was I needing AGM battery support, had I re-geared, as well as checking the general condition of my Tacoma with the diagnostic tool that he had. I knew I had come to the right place to get my Tacoma tuned.\n\nThe tuning process was relatively quick, and it was now time for the test drive. John explained that he would be accompanying me and would use a bluetooth diagnostic tool to connect to my Tacoma while on the test drive to monitor key engine parameters to make sure that everything was working as it should after the tune.\n\nThe tune? I could immediately notice that tip in flat spot was gone, acceleration was smoother, and my Tacoma seemed to have a little bit of pep in its step now. My 245-mile return trip home would allow the tune to settle in and allow for my required follow up with John to discuss how my Tacoma ran during the ride home and provide feedback.\n\nThe entire process from first contact thru follow up after the tune was first class and professionally done!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNJ98MlKlz403GQkFda7g1TnrrdoqCNsqsnfzra=w150-h150-k-no-p"]}], "resp": {"time": 1620270260847, "text": "Bob - Thank you for the review.. I greatly appreciate your trust and support"}, "gmap_id": "0x8889219bb1e604e7:0xc14dc706394c40b4"}
{"user_id": "101305136814291429203", "name": "Ty Dukus", "time": 1621132004635, "rating": 5.0, "text": "Wow! Is all I can say. I'm blown away at how my truck drives now. I contacted John from a Facebook group we are both in after he posted about tuning Tacoma's. We talked and even tho he could practically finish my sentences I was still a little worried about having someone tune my tuck I do not know. So I kept digging and found a forum on Tacoma world and found there was a guy in Hoover Al. Who also done tuning and was one of their recommended guys. I went to his page, got his number, and started talking to him. After a few quick texts back and forth I confirmed he was the previous guy I had found on Facebook. Rest assured, you're dealing with someone who knows their stuff and has a passion for it as well. After I talked to John and told him what I was looking for and what I was setting my truck up for he worked on a few things and ended up giving me the wow factor my truck was needing.", "pics": null, "resp": {"time": 1621132925662, "text": "Thanks Ty… it was great meeting you and your family.  Thanks for the trust and support. So glad you like the tune !!"}, "gmap_id": "0x8889219bb1e604e7:0xc14dc706394c40b4"}
{"user_id": "106908392425395578033", "name": "Matthew Wilson", "time": 1620268925576, "rating": 5.0, "text": "I have long been disappointed and dissatisfied with how my Tacoma shifted, especially at highway speeds. I found John with Overland Tailor on a forum online and saw where he offered a performance tune for Tacomas. So I did some digging and decided to move forward with getting my truck tuned.\nI have been driving on the KDMax 6.0 Tune for a couple of weeks now and can say that making the choice to go this route with the KDMax over the Kruiser tune was well worth it! Everything from the shift points to acceleration and deceleration is vastly improved and I am so very impressed. That's just the tune, though. I couldn't have asked for a more positive experience working with John through the process. This isn't some guy looking to make some side change flashing tunes. He knows his stuff and has the experience to back it up. Starting from a thorough checklist to ensure everything was in order before performing the tune, to taking a solid test drive to ensure the truck was performing as it should, John made sure he did everything he could to ensure I was satisfied with the tune.\n\nIf you are on the fence about whether or not you should get the tune, you won't find a more knowledgeable and friendly guy to make sure all your questions and hesitations are answered.\n\nThanks, John!", "pics": null, "resp": {"time": 1620270210164, "text": "Matthew -\n\nSo glad you are loving the tune and thank you so much for taking the time out of your busy schedule to write the review.. Appreciate your trust and support.\n\nKind regards,\n\nJohn"}, "gmap_id": "0x8889219bb1e604e7:0xc14dc706394c40b4"}
{"user_id": "116339818204734104569", "name": "Jay Simpson", "time": 1615913253660, "rating": 5.0, "text": "Guys if you are in the Southeast and you aren’t going to see John you’re missing out on how your Tacoma should run/drive. I’ve been on the fence about this for a while and I’ve read up on it and even kicked the idea around about buying vftuner and trying it myself. Instead I decided find someone nearby that could do it that knew what they were doing. I made the right choice; John is so detailed and he makes sure it’s right. He explains everything in detail and it’s obvious he knows what he is doing and even let me take his truck for a test drive beforehand. On top of the tune he even used tech stream to “fix” some annoying sounds, LOL. (Door chime, seatbelt chime) Hands down the best mod available for the money.\n@Boltripper thanks for the killer tune!", "pics": null, "resp": {"time": 1620270341774, "text": "Jay - Thanks for taking the time to write the review.. Enjoy the tune."}, "gmap_id": "0x8889219bb1e604e7:0xc14dc706394c40b4"}
{"user_id": "103620155967053629298", "name": "brett cabeca", "time": 1615956563469, "rating": 5.0, "text": "I've gotta tell you, I've always been leery about tunes. I avoided them in my Acura, Audi and TDI VWs because of nightmare stories I had read- everything from bricking ECUs to engine/transmission/exhaust damage. My nightmare premonition of a kid with a backwards Ed Hardy hat, crawling under my dash to give a 280HP truck 500HP for a couple of days until everything blew was unfounded. And I didn't want any part of that.\n\nWhen I got my JK, I tried a Superchips tuner and was able to do some basic calibrations which worked out. Kind of. Honestly, I mostly read trouble codes (because Jeep), and made a speedometer cal change due to tire size. Ultimately, I ended up removing the crazy throttle tip-in that everyone on the Jeep forum was raving about, which made that small wheelbase Jeep buck and become unlivable. It wasn't really a \"tune\", but gave me pause.\n\nSo to say that I was doubtful about tuning enhancements is a bit of an understatement.\n\nBut after talking to you, and seeing what a competent, reasoned approach might do, I decided to give it a shot. I have to admit that close proximity had a part in it as well. I don't think I would've driven several hours to try this out, which, SPOILER ALERT, would have been entirely my loss.\n\nMy truck didn't feel powerful or entirely capable prior to the tune, and the transmission seemed absent-minded. You can read about that all over this forum. It didn't make the truck unable to be driven- it just wasn't a lot of fun.\n\nGiving the truck the boot during the test drive (post update) and feeling that acceleration and power that has always been there but inaccessible was a real eye-opener. I can sense that the truck isn't 100% just yet, which is expected (because you explained it- thoroughly and in a way that made sense), and because it's hunting like it did when new- trying to learn how I drive it.\n\nI don't drive fast anymore, and most of the time I won't come near the new potential my rig has, but it's nice to know it's there. The way it should have been from the factory.\n\nAnd before I go, I should also mention professionalism. In aviation, we use checklists for everything, so to see you use one for this tune gave me a good impression. As did the cleanliness of your garage and neatness of your gear. I also realize that I didn't ask a question that went unanswered or got shrugged off. You took care during the updates, and the results speak for themselves.\n\nIf you're on the fence about this, do it. You won't regret it.\n\nThanks again for everything!\n\nBrett", "pics": null, "resp": {"time": 1620270307521, "text": "Brett - Thank you for taking the time to write the review. I appreciate the trust and support"}, "gmap_id": "0x8889219bb1e604e7:0xc14dc706394c40b4"}
{"user_id": "117505918540446061463", "name": "Annette Smith Bentley", "time": 1594135362685, "rating": 5.0, "text": "I recommend these guys to anyone. They have worked around my work schedule many times just to make sure that every problem is addressed and that I would be safe in my travels. So with that being said give these guys a try", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "105931572962626369800", "name": "kenneth mote jr", "time": 1600558356946, "rating": 5.0, "text": "Excellent service, super people to do business with!!   This is the only place I carry my  vehicles.   I highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "115311921207622748001", "name": "Jason Bentley", "time": 1597189196792, "rating": 5.0, "text": "First Class Service All Around!!! Recommend these guys to anyone!", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "107069074555890870895", "name": "David Robenstine", "time": 1567865650054, "rating": 5.0, "text": "Russell and the staff are very knowledgeable.  Prices are reasonable.  I will be giving them more business in the future They do the job right the first time", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "114120447781306521154", "name": "Ben Martin", "time": 1586789697806, "rating": 5.0, "text": "Randy and his crew always do really great work, at a very reasonable price. I always recommend them for repairs both big and small, and based on the stuff they always have sitting around, I am convinced they can fix anything.", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "106259516170268633094", "name": "Brittany LelaFaye Mote", "time": 1564943858649, "rating": 5.0, "text": "These guys will definitely fix you up! They are amazing at what they do and they have the beat prices around.", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "105555205937588776773", "name": "Evan Alden", "time": 1546856685384, "rating": 5.0, "text": "Great place, wonderful staff, good quality work and prices are the best around. They do all my work.", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "105059312789048976152", "name": "Jason Crow", "time": 1536440091499, "rating": 1.0, "text": "I took my truck to these people and and there not mechanics they just change parts til they find the one it is what I call a part changer", "pics": null, "resp": {"time": 1536607833374, "text": "Thank you for the review Jason. I am sorry that we were unable to satisfy your needs. Maybe you should have had us diagnose the problem before you told us to change parts.\n\nWe appreciate your business and am sorry that you had such unrealistic demands.\nHave a wonderful day."}, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
