{"user_id": "112691557508745175716", "name": "sawaski jackson", "time": 1484950151918, "rating": 5.0, "text": "A Relaxed, Loving Congregation committed to living life as Christ, Our Lord and Savior.", "pics": null, "resp": null, "gmap_id": "0x888e8118cd8b9dab:0xb3975178c1259c7d"}
{"user_id": "100776432509942426173", "name": "Latoya Boyer", "time": 1496291162086, "rating": 5.0, "text": "The glory that surrounds you from just being there", "pics": null, "resp": null, "gmap_id": "0x888e8118cd8b9dab:0xb3975178c1259c7d"}
{"user_id": "108791845843035799435", "name": "Valtoria Jackson", "time": 1568576394976, "rating": 5.0, "text": "Church with a heart", "pics": null, "resp": null, "gmap_id": "0x888e8118cd8b9dab:0xb3975178c1259c7d"}
{"user_id": "118210079111823328467", "name": "Joy McNellage", "time": 1626628033997, "rating": 5.0, "text": "A wonderful place that does so well tutoring my child! So pleased. Such a wonderful place!", "pics": null, "resp": null, "gmap_id": "0x889a131cd6515b51:0xf7de6b6757816bca"}
{"user_id": "107602840420322876740", "name": "Tiffany Dortch", "time": 1595003109525, "rating": 5.0, "text": "We had such a positive experience with Sylvan in Montgomery, AL. The owner, staff and teachers are all wonderful!", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "113003993805946009866", "name": "Cameron Sheffield", "time": 1565381020930, "rating": 5.0, "text": "Sylvan made school work during the summer fun!! The staff is very caring and friendly. They were able to accommodate our busy schedule and most importantly help our children master the needed course work.", "pics": null, "resp": {"time": 1569246851349, "text": "Thank you for your feedback, Cameron!  I'm so proud of your children and all of their hard work this summer!"}, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "117246863388269659024", "name": "Heidi Ingraham", "time": 1574127528428, "rating": 1.0, "text": "My children tried the after school Robotics program for 2 months. The concepts they learned had very little to do with robotics, mostly coloring sheets. Also, on the final day we intended to participate, the staff emailed at 1:45pm that they would not have the after school program due to staffing shortage and that parents should pick their children up at 3pm. When I inquired about my refund for that date they indicated  that there wouldn't be one because the program was a subscription. So even though they made it impossible for me to use my subscription for the day they refused me a refund for that day.  I do NOT recommend this location.", "pics": null, "resp": {"time": 1575326956218, "text": "Greetings Ms. Ingraham.  First of all, thank you for sharing your lovely children with us for after-school Robotics.  We had so much fun with that bright group of little learners!\nCoding is very heavily involved in Robotics.  It is important to introduce new skills and concepts in a way that is best for the students to understand and grow their basic working knowledge.  At times, it is necessary to use unplugged activities to set each student up for success in these new coding concepts, especially in such a young group of engineers.\nAs for the subscription / final session:  We have been conducting after-school programs since the beginning of the school year for this particular school.  We charge a flat subscription fee no matter the number of weeks included in the month.  Some months had 5 sessions and some had 4 making it even out in the end.  Canceling the last session in the month was a worst case scenario for us.  We regret it was unavoidable due to mass sickness, leaving us with no teaching options.\nI believe in what we do and I'm so proud of how we do it!"}, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "117129150128969149226", "name": "Joel Stephens", "time": 1569026744424, "rating": 1.0, "text": "They guaranteed that my son would receive one on one tutoring,  and he never ever received one on one tutoring at all. The people that work here are very pushy and rude. Every parent that I talk to that has used Sylvan states the exact same thing. Please save your money and time and headaches and go elsewhere. We were referred to Huntington Learning Center,  and they are absolutely the best ever. They are one on one as described and very professional.", "pics": null, "resp": {"time": 1569246788352, "text": "Good morning Joel.  Thank you for your feedback.  Will you please confirm this occurred at the Montgomery location on Lomac Street?  We strive to give the very best service and this doesn't sound like our level of service.  Please give us the opportunity to make this right if it is, in fact, us in Montgomery.  Please feel free to contact me directly.\nMisty Mitchell\nEducation Director\nSylvan Learning Center\n334-262-0043 md@montgomerysylvan.com"}, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "108952846401498897697", "name": "Delane Alexander", "time": 1610751726937, "rating": 1.0, "text": "No stars if I could ... Enough said", "pics": null, "resp": {"time": 1611069943345, "text": "Your student accomplished so much in her time here!  I am amazed at her progress and mastery of skills and concepts.  I have no doubt she will continue to be successful.  She overcame a substantial obstacle, and for that, I am extremely proud!  I am sorry you feel the way you do about our organization.  We give chances and options where there often aren't any options left.  I wish you shared the same positive feelings as us as we cheered her on during her time here.  Thank you for your feedback."}, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "104391823304518753595", "name": "Karen Jones", "time": 1606786233592, "rating": 5.0, "text": "Great tutoring facilities!", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "113848128360815880609", "name": "Misty Mitchell", "time": 1437496514212, "rating": 5.0, "text": "Both of my children took the Math EDGE course over the Summer.  They loved their teacher, Ms. Shan, and loved the math games they played as a group with their peers.  We are looking forward to the after school robotics classes coming this fall!  The newly renovated building is nice too.", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "103771973521769588525", "name": "Keith Wheeler", "time": 1520968257880, "rating": 5.0, "text": "Daughter really likes her teacher, flexible hours, great staff.", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "117978169329440241304", "name": "Andrea Cheatham", "time": 1497563444952, "rating": 4.0, "text": "The staff and teachers are amazing.", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "111966654919886033510", "name": "LaTonya Monik Blanks", "time": 1622685204671, "rating": 5.0, "text": "Very professional. Jake and his team are PASSIONATE about helping their students learn concepts that causes them excel and be confident in math! I soooo appreciate Mathnasium! My daughter has struggled in math for years! We are new to Mathnasium, however I’ve seen the light come on and her confidence level increase in this time! She just completed 9th grade, and did not pass Geometry. However, she is up for the challenge and confident she will do very well! Mathnasium is WORTH THE INVESTMENT!! They make learning math so practical and understandable!! My daughter didn’t want to go to Mathnasium at all..... after 3 visits..... she was smiling and looking forward to going!!! She said “mom they care & Mom I’m finally get it”!!", "pics": null, "resp": null, "gmap_id": "0x88891701fba8d39f:0x98577217b234220a"}
{"user_id": "113576146804549005275", "name": "William Messerschmidt", "time": 1624152201599, "rating": 5.0, "text": "Great way to supplement the school math curriculum", "pics": null, "resp": null, "gmap_id": "0x88891701fba8d39f:0x98577217b234220a"}
{"user_id": "107840456793717117869", "name": "Denise Mayo", "time": 1615950307865, "rating": 5.0, "text": "Great place to take your kids so they can be tutored in a safe, friendly, encouraging environment!  The Director really loves the kids and it shows!!", "pics": null, "resp": null, "gmap_id": "0x88891701fba8d39f:0x98577217b234220a"}
{"user_id": "113107507258352767524", "name": "Nisha Patel", "time": 1585136155739, "rating": 5.0, "text": "My daughter absolutely loves to go to Mathnasium! She has so much confidence about math now and loves learning new concepts that hasn’t been covered in school yet.  I’m so thankful for the staff at Inverness in helping her foster this very important and fun subject!", "pics": null, "resp": null, "gmap_id": "0x88891701fba8d39f:0x98577217b234220a"}
{"user_id": "109270911458024065232", "name": "Dawn Bridges", "time": 1592219562083, "rating": 5.0, "text": "Our daughter’s math skills have  improved significantly. She dreaded math homework and now she really likes it due to increased confidence. The tutors are all super helpful. Now she looks  forward to her Mathnasium sessions.", "pics": null, "resp": null, "gmap_id": "0x88891701fba8d39f:0x98577217b234220a"}
{"user_id": "107521962926179267866", "name": "Laura Sauceda", "time": 1580429417093, "rating": 5.0, "text": "Three years ago, my son was a struggling learner who HATED math and absolutely did not believe that he was ever going to be able to memorize his multiplication tables, much less be able to do any higher math.  Feeling very discouraged, we decided to try Mathnasium.  The evaluation process was thorough and quickly revealed what we already knew; my wonderful son was seriously behind.  A customized learning plan was implemented, and from day 1 he was at least encouraged. After several months of hard work, we were beginning to see him really gain strides.  Fast forward and he is on grade level and thriving!!  Mathnasium's unique approach combines a custom learning plan for every child with consistent evaluations and feedback, just the right amount of repetition to ensure mastery, and learning strategies that employ different teaching methods when one is not working.  My son now has excellent number sense, but more importantly, he BELIEVES he can learn math because he has experienced success.  He still has moments of struggle, but he is now equipped to accomplish the task with hard work.\nI am deeply grateful for all the staff, especially Jake Johnson (a treasure), and their encouragement, patience, expertise, and support!", "pics": null, "resp": null, "gmap_id": "0x88891701fba8d39f:0x98577217b234220a"}
{"user_id": "106199111542363955415", "name": "Hailey", "time": 1602030292546, "rating": 5.0, "text": "My daughter has been going to Mathnasium for about 5 years! I would highly recommend them! They have helped out so much and always help when we need it!", "pics": null, "resp": null, "gmap_id": "0x88891701fba8d39f:0x98577217b234220a"}
{"user_id": "102901113471763421269", "name": "Irina Li", "time": 1578609497835, "rating": 5.0, "text": "I just enrolled my son in Mathnasium Learning Center in Inverness Corners and we are so excited and looking forward for the exciting journey with an amazing educators!\nThank you for all your help and knowledge in Math!", "pics": null, "resp": null, "gmap_id": "0x88891701fba8d39f:0x98577217b234220a"}
{"user_id": "100298834098004079444", "name": "AJ Reese", "time": 1571859377158, "rating": 5.0, "text": "Before coming to Mathnasium, I thought I was pretty good in math, but I never knew there were so many easier ways to do things now that math makes sense.", "pics": null, "resp": null, "gmap_id": "0x88891701fba8d39f:0x98577217b234220a"}
{"user_id": "109077657995091426592", "name": "Lyndsey Lewis", "time": 1567438015566, "rating": 5.0, "text": "Mathnasium is a wonderful program! I highly recommend it!", "pics": null, "resp": null, "gmap_id": "0x88891701fba8d39f:0x98577217b234220a"}
{"user_id": "106403436662973722144", "name": "Kaylie Brasher", "time": 1571867871993, "rating": 5.0, "text": "Great environment! Great tutoring! Great people!", "pics": null, "resp": null, "gmap_id": "0x88891701fba8d39f:0x98577217b234220a"}
{"user_id": "108879487789782495636", "name": "Diane Johnson", "time": 1571860643917, "rating": 5.0, "text": "Awesome Place and Spectacular instructors", "pics": null, "resp": null, "gmap_id": "0x88891701fba8d39f:0x98577217b234220a"}
{"user_id": "105009425184248637680", "name": "Jake Johnson", "time": 1571859894923, "rating": 5.0, "text": "Mathnasium really does Make Math Make Sense!", "pics": null, "resp": null, "gmap_id": "0x88891701fba8d39f:0x98577217b234220a"}
{"user_id": "103883477169374748394", "name": "Tammy Tarrel", "time": 1618263700148, "rating": 5.0, "text": "Unlike many other reviewers, I had a good experience! I only spoke with Ms.Hicks when I called and she was nice each time. I was able to pay a deposit on my account and then was placed on an affordable payment plan.. I made one monthly payment but decided I'd be better off paying the balance in full rather than have interest accumulate & make my balance increase despite having paid on it..  I paid the balance in full (it wasn't cheap but worth it) & received my receipt & satisfaction of judgment letter in the mail a few days later!", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "118015714714591518917", "name": "anon B", "time": 1622891083342, "rating": 5.0, "text": "Very reasonable for a debt collection agency. I was worried about the situation escalating to the courts, but they gave me a very reasonable monthly payment plan instead. The interest rates are trash but that's what our current legislature allows.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "107164701229691855618", "name": "Kareem Spence", "time": 1625621671675, "rating": 5.0, "text": "Excellent lawfirm handle business to the fullest degree.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "110743265015479340109", "name": "Ada Elmo", "time": 1605040578211, "rating": 1.0, "text": "I remember I was placed her as a temporary worker, and I only stayed for an hour! The energy was off. It was clear that this law firm didn’t want my kind in their building. I really wish companies, especially Black-owned company, would do some research on this law firm. They don’t want to hire your people but will take your money. Classy example of the system we live in!", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "106920479456680942283", "name": "Rhon Anthony", "time": 1617307835304, "rating": 5.0, "text": "For the past two months, I received GREAT CUSTOMER SERVICE!!! I don't remember his name but he's awesome, kind and POLITE!!! Before dealing with him, I dreaded calling in to make a payment but now it's much more pleasant!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "106575450091793020952", "name": "B K", "time": 1614871980737, "rating": 1.0, "text": "I have paid this place over 5000.00 lisa is rude and refuses to work with me. They suspended my license because i missed some payments while i was out of work first because of a car wreck then my grandson was airlifted to uab. I offered to pay a large amount to restart payment they refused said i had to offer a settlement i did they refused it. Hung up in my face and refused to be of any help.i called the county where it all started this place has not showed them that i paid a thing. I have to drive my gr2 ba k and forth to ua. I will end up in jail if i get tickets for driving with no license. They are heartless as hell. They dont care if you pay or not they have the power to rui. Your life. Sad thing is i dont mind paying but they will not help you.i do not see how these people work with customer ser2 but have no skill with their own kind. People are people we cant just throw you everything we make we have families too.i make 2.13 an hour im willing to do whats right but you couls care less. I pray that you find hardship like many of us have . you dont deserve to hurt people the way you do", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "109914277118529226676", "name": "Mom & Son Tv", "time": 1605322438961, "rating": 1.0, "text": "I understand their job, I also work in the collection field so I know... but there are ways you talk and treat people , The worse collection company I‘ve ever dealt with. Tammy needs to be fired due to her having a really rude attitude very unprofessional person everyone else I have spoken with has been very understanding and very sweet to me.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "106730174953950426036", "name": "Ashanti K. Smith", "time": 1611605077626, "rating": 1.0, "text": "The level of professionalism is 0!!! No need to call names because I serve a God whose vengeance is far greater than mine!!!", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "103921841147942267369", "name": "Dent West", "time": 1585244687647, "rating": 1.0, "text": "Rude as hell. Never gives you a call back if you leave a message. Highly unprofessional", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "104662468871567580229", "name": "Kayla Toney", "time": 1446481173846, "rating": 5.0, "text": "OK so they are a debt collecting company. I'm sure not a fun job. Of course I owe a lot so they had to sue me. But these people were so nice. They did not treat me as if I was this horrible person. The lady Ginger who does the collections is amazingly nice. I feel so comfortable now getting my issues resolved. Most debt companies treat you with harsh words and do not try to work with you but they do. I will be happy to do business with them and hopefully don't ever have to go through debt again.\nI will make sure they are the first debt collector I pay.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "115995876024001828619", "name": "Itz_Rain Gachatube vids", "time": 1551309323987, "rating": 1.0, "text": "You take people's hospital bills and triple them... and visiting the office today, I feel so sorry for you that this is your life's work and mission. You dont care what people are dealing with as long as you get paid.Yall made a good profit from me. I hope the office lady takes the extra money and gets some needed glasses. I gave it one star only cause your human.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "110016887070521195218", "name": "Shameecka Sharpe", "time": 1517604712480, "rating": 1.0, "text": "I work in a customer service driven industry, I’m a Registered Nurse. I go the extra mile every single day, not because I’m required to but because I have empathy and compassion. This office contacted me after I sent a Cashiers Check via Fed Ex to their establishment on a Monday. Today is Friday, I’ve left several voicemails on several different answering machines, not one single person has returned a call, NO RESOLUTION. I never leave reviews, however I’ve never experienced worse customer service. I will now have to write the judge because they couldn’t take five minutes out of their day to go the Extra mile. As I write this review I sit and I reflect on the living that was very close to death, had I not gone the EXTRA MILE. I hope to GOD, in your future someone goes the EXTRA MILE for you or your loved one.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "100344690378621085956", "name": "Misty Benson", "time": 1508953851152, "rating": 1.0, "text": "Jody has the worst attitude ever! Her tone is very condescending and she talks to you as if you're ignorant. People like her shouldn't be allowed to work with the public. Alice is great, I highly recommend her over anyone.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "102655655028842173414", "name": "Celita Ware-Thomas", "time": 1482347326125, "rating": 1.0, "text": "They are debt collectors but their approch to resolving financial issues is very unethical and inappropriate. Ginger is very unprofessional and inconsiderate. Yelling, threatening, or rude irrational comments does not make debt vanish. However, it does upset the individual in debt. As debt collectors your job is to clear up delinquent accounts but as a person you should be considerate of the individuals financial situation and be willing to negotiate. Thank God I'm a strong person because their antics would have completely broken my spirit.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "106632062537449016525", "name": "Robert Williams", "time": 1596822417959, "rating": 1.0, "text": "Extremely rude receptionist.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "118289979825483616905", "name": "Sydney Contorno", "time": 1520612750074, "rating": 1.0, "text": "They barely ever answer the phone and are no help when they do. They are rude especially alice and jody who does work there because I talked to her last week.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "109273942864307686889", "name": "Brandon Potter", "time": 1573576155644, "rating": 1.0, "text": "Very unprofessional and inconsiderate.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "109690652985076105845", "name": "Wes Mills", "time": 1513891460900, "rating": 1.0, "text": "Called in the day after being served. Was told they could take payment by card. Less than a week later they demand that the payment be in Money Order or Cashier's check for an amount higher than they had originally told me. Shady practices are bad for business", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "100763830047430070173", "name": "Jay Jay", "time": 1508850889383, "rating": 1.0, "text": "I paid what i owe but cant get a paid in full letter.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "100668483139159224711", "name": "Jorge Escobar", "time": 1519411685566, "rating": 1.0, "text": "Nasty and rude people , did not take the time to listen just a specially the branch manager.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "117392310698424747333", "name": "Saira Mateo", "time": 1459365220109, "rating": 2.0, "text": "The receptionist is really rude.", "pics": null, "resp": null, "gmap_id": "0x888c2bb17d260525:0x2cc6deed7f1fdc93"}
{"user_id": "110957877405322169929", "name": "SEKOU KONE", "time": 1565045597460, "rating": 5.0, "text": "Happy Helpers HTX really helps.  I used their service for my moving. I was so so Happy. They were  professional and they know what they were doing. I highly recommend Happy Helpers HTX  for any services they offer. Thank you Happy Helpers HTX.", "pics": null, "resp": null, "gmap_id": "0x8640dbc311805dc1:0x6b679a0cbd1826ae"}
{"user_id": "106276381018578964218", "name": "Kalifa Koita", "time": 1565049004164, "rating": 5.0, "text": "Happy Helpers is a very professional team very dedicated people always at the service of the customers. They are respectful, responsible, caring about their customers wants and needs. I could not choose any other service other than them. I highly recommend them to anyone. They are the best 😍😍. Customers satisfaction guaranteed!!!", "pics": null, "resp": null, "gmap_id": "0x8640dbc311805dc1:0x6b679a0cbd1826ae"}
{"user_id": "105202488041016980882", "name": "Annick Belemou", "time": 1565052207917, "rating": 5.0, "text": "Best helper you can ask for! I needed help tidying the new place we got and they were marvelous from top to bottom!", "pics": null, "resp": null, "gmap_id": "0x8640dbc311805dc1:0x6b679a0cbd1826ae"}
{"user_id": "109829709298792074357", "name": "Don Kaf", "time": 1570322234657, "rating": 5.0, "text": "Happy Helpers HTX , a driving force team who’s providing the best customer service experience. The team is super organized, professional and always on time.\nNeed babysitters?\nAre you moving out of your place ?\nDo you need to clean your house, office etc..?\nDon’t hesitate to contact HAPPYHELPERS.", "pics": null, "resp": null, "gmap_id": "0x8640dbc311805dc1:0x6b679a0cbd1826ae"}
{"user_id": "103346304161837197741", "name": "Justin Collins", "time": 1603814477742, "rating": 5.0, "text": "The only place I choose to take my postal exams.", "pics": null, "resp": null, "gmap_id": "0x8892920cc1fa86cf:0xe81e9929e9b7ed75"}
{"user_id": "113409853706529776815", "name": "Donna Dowd", "time": 1542729128839, "rating": 5.0, "text": "I cannot say enough about Sonja and Charles  Goldsmith and the A+Learning  Services  and Test Center.  She has helped my High School children reach their ACT goals.  I have one son that is presently  attending the United States Military Academy at West Point and a graduating senior who is applying to West Point ,Harvard, Yale and Vanderbilt . His latest score came in last week - with a 35 on his ACT so many doors and scholarship opportunities are now available to him! Thank you so much for helping my boys  reach their potential!", "pics": null, "resp": null, "gmap_id": "0x8892920cc1fa86cf:0xe81e9929e9b7ed75"}
{"user_id": "113100949471099715942", "name": "angie gilchrist", "time": 1623117017832, "rating": 5.0, "text": "Mathnasium has been great for us when my kid's online math class wasn't as great as what we were used to as in person classes.  Crystal worked with me to help get my kid where they needed to be when they return in the classroom. Our tutor was fabulous. He was patient and encouraging to my child. I highly recommend Mathnasium.", "pics": null, "resp": {"time": 1623118738301, "text": "Thank you...it's great to hear...Crystal  and our instructors appreciate your comments. Keep moving forward!"}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "105324510738489746216", "name": "clinton martin", "time": 1619289966868, "rating": 5.0, "text": "My son who is a 3 rd grader is a bright one and we wanted to find something that was more challenging than what the public school was currently offering. My son got a lot of one to one attention, he enjoyed Math more and ended up winning two awards in Math. His team from elementary school won 3 rd place among Huntsvile city schools and my son won first place in individual competition in his entire grade. We are very grateful to all the teachers who have kept him engaged through a very difficult year. The teachers are all so cool, they know how to talk to kids and engage them. I haven’t seen the rigid teaching style but rather saw a deliberate attempt to teach problem solving by approaching a concept from many different styles. This taught my son valuable lessons that there is more than one way to solve a problem.\nMuch appreciated and I am planning on getting my second child enrolled anytime now.", "pics": null, "resp": {"time": 1619291450674, "text": "Mr. Martin - thank you. This makes our day. It's a great feeling hearing of your son's success.\nRuss/Crystal\nMathnasium of Huntsville"}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "110519175267857320635", "name": "Tina Clarke", "time": 1616699230805, "rating": 5.0, "text": "My (8th grade) daughter has been struggling with math all year. A friend recommended Mathnasium but my daughter was hesitant and nervous to start. After the very first session, she came out smiling and saying that she loved the tutor she was paired with and that he showed her a new trick that made working the problems so much easier. She had a big math test after only 3 sessions and her score more than doubled. We've only been going a short time, but we've seen her grades continue to go up on every assignment and test. We are so happy we found Mathnasium. We started with a girl that had given up on math and was headed to summer school if not repeating the entire class. My daughter is now confident and actually enjoying math. 2 days ago I overheard her talking to a friend on the phone explaining how to do their math homework. I can't recommend Mathnasium enough to anyone who has a child struggling with math. Crystal is so nice to work with and all of their tutors are amazing! So thankful!", "pics": null, "resp": {"time": 1623118814353, "text": "Great to hear and thank you for taking the time to share."}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "109990771496129029224", "name": "Melissa Harty", "time": 1611271568862, "rating": 5.0, "text": "So happy we found Mathnasium right here in Huntsville!   My two daughters (age 8 & 9) love going here and the staff/tutors somehow make learning math fun!  They encourage personal goal-setting, and have developed a clever reward system to keep the students striving.   Honestly, mine wish they could attend more than twice per week.  No more home-work struggles and I feel such a burden lifted off my shoulders knowing that I'm supporting them.", "pics": null, "resp": {"time": 1613234098932, "text": "GREAT to hear! This is what we live for! Look forward to helping in their success."}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "113135898935611895728", "name": "Paula Phillips", "time": 1613227963844, "rating": 5.0, "text": "My daughter had many misgivings about tutoring at first, however everyone at Mathnasium Huntsville has done a wonderful job at making her feel comfortable and supported and this is clearly apparent in her academic performance. Her grades are up and so is her confidence! A big shoutout to Crystal and her crew, thank you for all you do!", "pics": null, "resp": {"time": 1613233977728, "text": "This is what we live for! Great to hear. Thank you."}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "101494871995471445076", "name": "Chris S", "time": 1581286778382, "rating": 5.0, "text": "Mathnasium significantly helped my child's grades.  You can drop off at anytime during their hours, which is so convenient.   My kids are always smiling when I pick them up.  They have a great rapport with the instructors and like earning the prizes.  The owner and manager are both great people to work with as well-very supportive. Highly recommend Mathnasium to anyone considering signing up.", "pics": null, "resp": {"time": 1581298550586, "text": "Thank you - our instructors appreciate the shout out. We work hard to assist students of all grades and aid them in their success."}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "113148993312359723587", "name": "Heather Armstrong", "time": 1588898903760, "rating": 5.0, "text": "Miss Crystal loves these kids and their progress. The staff loves what they do and gets the kids to love doing math as well.  We are so lucky we found mathnasium.  It saved so many family fights and helped our daughter find her confidence in her abilities.", "pics": null, "resp": {"time": 1623118874732, "text": "Glad to assist. We enjoy seeing our students excel and move forward."}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "113729414373974828712", "name": "Nita Herrington", "time": 1585164908678, "rating": 5.0, "text": "Incredibly effective. Straightforward process- filling in knowledge gaps and clarifying topics. Our eighth grade daughter is regaining her confidence in algebra, with improved grades after just a few weeks. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "106520617160467728093", "name": "Robyn Wainwright", "time": 1570103580240, "rating": 5.0, "text": "I am so glad we found Mathnasium. My daughter was really struggling with math and I wasn’t able to really help her. The way I was doing it and the way she was learning it was different.  She would get frustrated with me and say, “that’s not how I’m supposed to do it”! So you can imagine the frustration we were both experiencing . The staff at Mathnasium has been great and has helped my daughter a great deal. She is really enjoying it.", "pics": null, "resp": {"time": 1581298734265, "text": "Thank you Robyn. Great to hear we are assisting."}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "108889369331073129136", "name": "Heather Bookout", "time": 1552575281242, "rating": 5.0, "text": "It's a great environment with great people working there.  Both of my girls like it a lot!.  We got great grade-raising results! They keep it fun with great incentives for the kids.  Plus, we feel totally fine dropping the kids off there and running errands.", "pics": null, "resp": null, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "117448560675952219531", "name": "Kelly Finn Parker", "time": 1560028348908, "rating": 5.0, "text": "Every instructor at Mathnasium of Huntsville\nis exceptional!! They all love what they do and it shows with every child that they help.", "pics": null, "resp": {"time": 1581298839451, "text": "Kelly, thank you for your comments and 5 star rating. Team Mathnasium"}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "113155964891793879250", "name": "Lisa Andrew", "time": 1552875575862, "rating": 5.0, "text": "Great teachers. My daughter loves going there. They make math fun.", "pics": null, "resp": {"time": 1581298885132, "text": "Lisa, thank you and elated to hear we were able to assist. Team Mathnasium"}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "103291289012342498393", "name": "Ben East", "time": 1501028795263, "rating": 5.0, "text": "I've used this service from my Jr year in high school to my Freshman year in college. It has continually provided tremendous value in mathematics. The people and management are excellent and the atmosphere is positive and supportive. There's always a tutor That's able to help you work through a problem and grasp complicated concepts. Mathnasium saved me from having to repeat math classes in the past. Thanks again guys :)", "pics": null, "resp": {"time": 1501037298577, "text": "Thank you, Ben! You are always a pleasure to have in the center. I appreciate your positive attitude and willingness to learn. I'm excited to see what the future has in store for you! ~Phyllis"}, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "117476151438808615830", "name": "Erin Boles", "time": 1516712445889, "rating": 5.0, "text": "This was the answer to our prayers! Phyllis Norton, the owner of the franchise in Jones Valley,  is the most amazing person!  The educator shared her own family struggle with her kids and math.  That’s why she opened this business. Her passion is evident! She  and the staff worked diligently and continue to follow up with us to make sure our child is getting what she needs. After many, many tutors and lots of other strategies, Mathnasium was what our child needed.  It offered a family peace that we had not had in a while when it came to math. I highly recommend it  here and continuinally recommend it to friends.", "pics": null, "resp": null, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
{"user_id": "110984384137671950581", "name": "William Helmstadter", "time": 1523231588464, "rating": 5.0, "text": "Mathnasium is Amazing!  The Instructors really care and the kids enjoy going!", "pics": null, "resp": null, "gmap_id": "0x88621257020989f3:0x9dc71c982239e578"}
