{"user_id": "106667157724249684034", "name": "Gretchen Perry", "time": 1602713953548, "rating": 5.0, "text": "I love Torrid. As a plus size woman I feel like I cant go into most places and find sexy trendy  etc clothes but Torrid always delivers. If anything I wish they carried a few more of the bigger sizes in the stores but I know I can usually find it online if not in store!", "pics": null, "resp": null, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "111025507861336035938", "name": "Megan Cook", "time": 1600733351438, "rating": 1.0, "text": "Went in at 6:20. Had a handful of items picked out by 6:30. Just needed to try on and pay. Employee told me their changing rooms were closed because they were preparing to close, despite having just let another lady into a room. Their store does not close until 7:00. I was in town for work and needed a couple things for the week. I do not buy clothes without trying them on. Left without purchasing them. Will not be back to this location.", "pics": null, "resp": null, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "109147436317041029133", "name": "Cornesia Lewis", "time": 1599407943591, "rating": 4.0, "text": "I want to start by saying the only reason I give it 4 stars is because the staff wasn’t welcoming at the time, love the clothes but it made me want to shop else where because of how the staff was. When I went to try on stuff, which I was iffy about (covid-19), but I have to try on certain stuff. At first i was the only one in the store for a little while before a second person came in, I asked about the dressing room, girl went in to clean it sanitize which I appreciate. But if I’m about to buy something & I’m trying it on why is the staff asking how long I got in the dressing room she knocked on door more than once , like was there a time limit or something? she kept asking me other people need to try on stuff I’m thinking like it’s about 4 other rooms & then they told me once I go in I can’t go in but once.  With that being said I made sure that I took in all what I could & wanted to purchase. Like don’t rush I’m trying multiple pieces, come out it’s like one person with two other people sitting including a man, which he is not trying on stuff waiting. Manager kept making small comments to staff hardly spoke when I came in....I wanted to give them a piece of my mind but wasn’t worth my time,  hence store was only open about 45 mins when I arrived so I don’t want to hear anything about a long day. Would have never went into store but shop online but I needed something I didn’t want to wait To ship only to arrive with limited selection. The world is already in a crisis to have people like this   Someone would love to have your job & customers are what keeping it open.", "pics": null, "resp": null, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "114450579005812258229", "name": "gwendolyn johnson", "time": 1621978433618, "rating": 5.0, "text": "Great staff, great sale today", "pics": null, "resp": null, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "109782477926605274135", "name": "100 Real", "time": 1618184419975, "rating": 1.0, "text": "First time shopping there . I wasn't greeted and noone offered assistance", "pics": null, "resp": null, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "111081557260904803010", "name": "Alexandria Gauntt", "time": 1554644371537, "rating": 5.0, "text": "Very nice and has some lovely clothes. The dressing rooms are designed nicely also.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP_nti7fEtryu7fogignYM6MZeR8MW8l5IBpg4f=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "115488493895869929213", "name": "shandia scott", "time": 1584041815510, "rating": 3.0, "text": "First let me say that I Love Torrid. Their clothes are awesome and the fit is even better. However, I do get frustrated with the local Torrid store, because they never have anything in stock. I'm not just talking about the online exclusive things. They always say how they don't have something.  Other than that,  Torrid is awesome", "pics": null, "resp": {"time": 1584205824038, "text": "Thanks for reaching out, shandia scott! We will be happy to pass along the feedback to our corporate team."}, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "116526403183543423222", "name": "Shannon Hopkins", "time": 1620777687551, "rating": 3.0, "text": "A lil confusing on the site", "pics": null, "resp": null, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "105492720409904234476", "name": "Debra H", "time": 1556635888211, "rating": 5.0, "text": "I was pleasantly surprised by all the pretty clothes. I have nerve problems in my shoulders and finally found a pretty bra that is comfortable and doesn't cause pain. I will be going back.", "pics": null, "resp": null, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "111154579157700100467", "name": "Constance Burke", "time": 1557775732349, "rating": 5.0, "text": "Torrid opens an actual store in Montgomery!! We now have several shopping destinations for women of all ages who are curvy and dare to be  fashionable!", "pics": null, "resp": null, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "106410553707269913574", "name": "Ari Rose", "time": 1568204350580, "rating": 5.0, "text": "I love this store so much!", "pics": null, "resp": {"time": 1568311511083, "text": "Ari, we love you too and are so happy to hear from you! Thank you for stopping by and the great review! Have an amazing day!"}, "gmap_id": "0x888c2d875290eaaf:0x936895c4614f43fe"}
{"user_id": "101205061377909102521", "name": "amy revis", "time": 1623113602167, "rating": 1.0, "text": "Came in today really needing a pick me up and there was a red head woman working who ruined this for me...I love this store but will shop in Hoover bc the red head woman was high and rude.", "pics": null, "resp": null, "gmap_id": "0x88891304dd51c1c1:0xfea47593e193f52a"}
{"user_id": "107358104168286123201", "name": "Racheal Bagley", "time": 1600457446457, "rating": 5.0, "text": "The woman there was great and helped me out alot. Happy to shop there again.", "pics": null, "resp": null, "gmap_id": "0x88891304dd51c1c1:0xfea47593e193f52a"}
{"user_id": "117711447631154434340", "name": "Seraphina Croi", "time": 1580945813695, "rating": 5.0, "text": "The sales employee was very knowledgeable, friendly, helpful and polite. I will go back there just because of her. The sale going on was awesome as well. Beautiful clothes in a variety of styles and sizes. Love this store!", "pics": null, "resp": {"time": 1581033773204, "text": "Seraphina, we are so happy to hear from you! Thank you for letting us know you had a pleasant experience with our Leeds Torrid team. Have an amazing day!"}, "gmap_id": "0x88891304dd51c1c1:0xfea47593e193f52a"}
{"user_id": "100873539856770134890", "name": "Caroline Baker", "time": 1562720700030, "rating": 5.0, "text": "I love this store. The staff are always friendly.", "pics": null, "resp": {"time": 1562798947182, "text": "Caroline, we love you and are so happy to hear from you! Thank you for the positive feedback about the service you received! Have an amazing day!"}, "gmap_id": "0x88891304dd51c1c1:0xfea47593e193f52a"}
{"user_id": "103432184903783154726", "name": "shea wilkerson", "time": 1573432398027, "rating": 5.0, "text": "Great quality products with A+ customer service!!!", "pics": null, "resp": {"time": 1573777480998, "text": "shea wilkerson, we are so happy to hear from you! Thank you for letting us know you had a pleasant experience shopping through our great style selections with our friendly Torrid team members. Thanks for stopping by. We hope you are loving your new purchase. Have an amazing day!"}, "gmap_id": "0x88891304dd51c1c1:0xfea47593e193f52a"}
{"user_id": "101888830812202008895", "name": "Sara Thurgood", "time": 1568159370011, "rating": 5.0, "text": "Super comfy clothes, very helpful sales staff.", "pics": null, "resp": {"time": 1568161511291, "text": "Sara we are so happy to hear from you! Thank you for letting us know our team in Leeds provided a great experience for you. Have an amazing day!"}, "gmap_id": "0x88891304dd51c1c1:0xfea47593e193f52a"}
{"user_id": "104114126834917129031", "name": "Cynthia Harkness", "time": 1557516602072, "rating": 3.0, "text": "Not a good selection of cropped or capri pants.", "pics": null, "resp": {"time": 1557752723773, "text": "Thanks for reaching out, Cynthia Harkness! We will be happy to pass along the feedback to our corporate team."}, "gmap_id": "0x88891304dd51c1c1:0xfea47593e193f52a"}
