{"user_id": "118149459923751645956", "name": "Forrest Weeks", "time": 1610041736087, "rating": 5.0, "text": "I have used Snelling over the last 4-5 years to help us fill professional positions.  The team is top notch and they have delivered us great candidates every time.  Using Snelling has allowed us to keep the focus on our business and our customers while trusting Snelling to fill our critical vacancies.  I strongly recommend this business.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "100611160887666802350", "name": "Nadia Mathieu", "time": 1609960375271, "rating": 5.0, "text": "I have been working for Snelling for about 5 months and I have had nothing but great experiences. They matched my experiences and skillset with a great company to work for. Snelling staff and owner have been very communicative and helpful. Absolutely no complaints.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "103295207097204398666", "name": "Sue Ann Sandifer", "time": 1609726659611, "rating": 5.0, "text": "Hollye Hatfield and the team at Snelling of Huntsville have been very professional, responsive and extremely helpful to me. I highly recommend their staffing agency.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "101816853079504515882", "name": "Shakia Williams", "time": 1600874496798, "rating": 5.0, "text": "The ladies here are a pleasure to work with. Everyone's friendly and they are very responsive. Debbie has always been a great help!", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "116439375528227253090", "name": "Susan Huthcens", "time": 1598874098707, "rating": 5.0, "text": "Courteous staff and was great landing me with the job I had been searching for some time!", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "112042773844182025241", "name": "Britney Mitchell", "time": 1555346280616, "rating": 5.0, "text": "If I could give this company more that 5 stars I would! They are the most professional, respectful, and welcoming temp services ever! I had never been to a temp service before so I really didn't know what to expect. Snelling has set the bar high and I think other temp service agencies could learn a few things from them. They made me feel welcome and made my process so quick and easy.When ever I had a question or concern they helped me immediately! I could go on and on about this exceptional company but I would like for anyone that is in need of a job or career and is thinking of going through a temp services I HIGHLY recommend Snelling. I for sure will be send referrals to this wonderful company.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "107329979822201823829", "name": "Tammy Hyatt", "time": 1595423603643, "rating": 5.0, "text": "I sent my resume to the fantastic ladies at Snelling and had a job interview within days!  I’m now employed and couldn’t be happier! Thanks Snelling!", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "102207120861395269005", "name": "Koren Robinson", "time": 1591799908474, "rating": 5.0, "text": "The staff here have been wonderful, they worked hard to find an assignment for me that turned to a permanent position! Kathryn and Hollye were great to work with!", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "100514846918314088435", "name": "Fern Thompson", "time": 1542683951283, "rating": 5.0, "text": "Awesome experience with this great Snelling staff and job placement! They are professional, friendly, efficient, and fast! Within three weeks they opened doors, set up an interview, processed new hire paperwork, and even checked up on the first day jitters. Above and beyond all expectations! A special thank you to Tammy Pruitt and Leigh Butgereit! Your help, kindness, and  extra efforts will not be forgotten. Kudos to Snelling for employing such great professionals!", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "114656833935081909911", "name": "Amy Quinones", "time": 1524249075430, "rating": 5.0, "text": "I had an amazing experience working with the talented team at Snelling!  They were quick to answer any questions I had and they found me a placement within a very short time!  I truly felt like one of the family immediately. I would recommend (and have!) anyone working with them.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "107855975862034136787", "name": "Giga Parts", "time": 1511390135147, "rating": 5.0, "text": "We've been using Snelling of Huntsville for several years for temps and permanent employees and we have always been impressed with their professionalism and willingness to help. Hiring through Snelling reduces the amount of time we spend on recruiting and interviewing and reduces the cost of turnover. They go out of their way to understand our needs and to exceed our expectations every time. I can't say enough good things about them!", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "117655796844720693026", "name": "David Kelly", "time": 1502284034504, "rating": 5.0, "text": "Working with Snelling has been one of the best experiences I’ve had with a recruiting firm.  Snelling did not take a typical job order.  They went above and beyond to understand the culture of our organization, the focus of how we go to market, and the level of talent we expected out of our partnership.  Snelling did not disappoint.  I experienced a true partnership with the recruiter I worked with.  She took it so seriously and made the time to visit our facility and learn more about our company and how we go to market.  This level of customer service exceeded my expectations.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "105098108460230958875", "name": "Kippie Salter", "time": 1528151213575, "rating": 5.0, "text": "Snelling of Huntsville has truly blessed me with their qualified, understanding personnel. I received immediate placement in a position that is a lifetime opportunity for me!!  I had been trying to find employment for months through online resources without any success. Within 1 day Snelling of Huntsville had me in a position that I consider to be ideal. Tammie, Debbie, and Leigh have been available in such a professional, courteous manner that I know regardless of any issues that might occur they are going to help me succeed!! Sincere thanks to all the staff at Snelling of Huntsville, you are the best!!\nRespectfully,\nKippie Salter", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "108306817572735425809", "name": "Donna Lasseter", "time": 1620714767705, "rating": 4.0, "text": "The people are very friendly", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "109184608179665229021", "name": "Monte “Coach” Miller", "time": 1613732408337, "rating": 4.0, "text": "Solid communication even during a buyout.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "106121003456700044811", "name": "Kelly G.", "time": 1514482094873, "rating": 5.0, "text": "Had a great experience with Huntsville Snelling! The staff is helpful, professional and responsive. Would definitely recommend them to anyone seeking short-term or long-term employment. They do a tremendous job with matching skills and experience with the appropriate company. Excellent for individuals looking to become familiar with the Huntsville job market.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "100658876480069570821", "name": "Joshua White", "time": 1537543864425, "rating": 5.0, "text": "Snelling has a long relation with our firm. We consistently get staff from them who meet our needs and possess the perfect skill-sets. Snelling takes the time to listen to what we need and send over people who have good attitudes and are good fits in our environment. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "113156877625669234987", "name": "Chelsea Hughes", "time": 1510858818448, "rating": 5.0, "text": "My experience with Snelling was great. Every employee that I spoke with on the phone or met with at the office was very friendly and helpful. It took a little patience up front, but Kathryn Brashier lined up a couple of great interviews and one that was a perfect for me, that led to a permanent position. Everyone was quick to respond to emails if I had a question, and followed through with me. I looked for a job for months before getting with Snelling, and they made it happen.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "110317574348916389502", "name": "Dinah B.", "time": 1513633668800, "rating": 5.0, "text": "Snelling was awesome in finding employment in my line of experience, Tammy and Debbie are really great with my experience in being hired through Snelling I would recommend any body to go with them. They helped me find a job as soon as I moved here and it was in my profession. I give Snelling 10 stars if I could all good experience with them on my end.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "101709302035865498626", "name": "Deb Kasper", "time": 1549568932177, "rating": 5.0, "text": "I have been working for Snelling for 2 years and have been wonderfully satisfied with them. Hollye Hatfield has been great! She looks out for me, always finding great assignments, and compliments me to clients. She's very kind and helpful. I consider her a friend. The company pays well, is well organized, and the staff answers questions almost immediately and they do whatever it takes to address/answer your question. I highly recommend Snelling - and especially Hollye!", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "113401600153171686628", "name": "George Justiniano", "time": 1470176828211, "rating": 5.0, "text": "I could not be more happier with my experience with Snelling. I thought I was happily employed before prior to my current position, but Pam had other ideas. She scheduled an interview for me and I could not believe how thankful I was to hear her out and attend the interview. Throughout the whole process she made herself available at all times and was very helpful and professional. I am now even happier than I was before and highly recommend Pam and her team. They are second to none!", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "112141680606494134021", "name": "Krystal Sprague", "time": 1486523877326, "rating": 5.0, "text": "I moved to Huntsville from TN and slowly found my way to Snelling. It didn't take very long for them to contact me nor help me find placement with a job! Everyone was very nice and encouraging. Tammy was very uplifting. I have recommended these ladies and will continue to do so!", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "111523727244076230105", "name": "Selena Jefferson", "time": 1525472122398, "rating": 5.0, "text": "Snelling is a great company! Had an interview and got a call back the next day. Very fast process, i start my new job on Monday. So excited!", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "104482917416598687413", "name": "sonja Spencer", "time": 1571337937681, "rating": 5.0, "text": "Snelling has been great and Hollye is by far the best boss I have ever had", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "103307487773864395207", "name": "Brittany Jones", "time": 1471287441976, "rating": 5.0, "text": "This is a wonderful company to work for; Snelling has found me the job of my dreams!! Tammy Pruitt was courteous, kind, and so professional, she found me the perfect job that i just fit right in with. I can honestly say that because of Snelling i enjoy going to work every single day!!!", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "105206768957985869345", "name": "Deborah Burke", "time": 1528829435824, "rating": 5.0, "text": "This was my first experience with a staffing agency and I'm glad I chose Snelling.  Their entire team is professional and patient (I had A LOT of questions) and they obviously care about their employees.  Best of all - Hollye matched me with the perfect position!  I highly recommend Snelling Staffing Services.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "110440593907019419697", "name": "Diane Tyler", "time": 1495125908382, "rating": 5.0, "text": "The staff at Snelling are some of the most pleasant humans I have ever worked with..from the front desk on back!  Working with Snelling has been an extraordinary and unusual experience for me when it comes to staffing agencies.  Looking for a job is unnerving at any age and the staff there put me at ease.   Thank you Snelling Huntsville!", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "114667596672044064116", "name": "Jessica Beckling", "time": 1511021355361, "rating": 5.0, "text": "I came to Snelling because I needed to find employment after being out of the workforce for some time. The whole staff was excellent in helping me find exactly what I wanted. If you are looking for a job, I highly recommend you start here...", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "106062164915688475220", "name": "Beverly Holcomb", "time": 1530204860578, "rating": 5.0, "text": "Excellent company to work with and work for! Tammy not only helped me find a job quickly but one that I am truly excited about! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "118401255415704254978", "name": "Amber Pearman", "time": 1478709674555, "rating": 5.0, "text": "My experience with Snelling was fantastic. Kathryn consistently communicated with me and kept me informed throughout the whole direct hire process. I would highly recommend this staffing company to anyone looking for employment.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "109868497758882456968", "name": "Jason Zarrilli", "time": 1486757144877, "rating": 5.0, "text": "Fast, efficient and attentive. We have hired multiple employees that started as temporary workers from Snelling and all are a vital part of our team. Highly recommended and by far the best staffing agency in Huntsville.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "107816238810147486770", "name": "Christy Reinhardt", "time": 1470139713709, "rating": 5.0, "text": "Paul and his team do a great job of understanding my needs and matching appropriate resources to those needs.  The Snelling team is also easy to do business with and works as a partner with our business.\n\nJason Reinhardt\nCFO\nSynapse Wireless, Inc.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "111297714594985791087", "name": "Steve MZ", "time": 1470835050556, "rating": 5.0, "text": "Very impressive.   They found me a job I love, prepared me for the interview, and I was offered the job at the end of the first interview.  Great experience and made an easy transition from military to civilian.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "115721820122635281562", "name": "Sherry Floyd", "time": 1524691479666, "rating": 5.0, "text": "Kathryn Brashier and her team are professional and courteous; all working to find solutions and exceed expectations.  I would highly recommend the Huntsville Office for future staffing needs!", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "109619773499976104600", "name": "Cindy Peck", "time": 1469836061299, "rating": 4.0, "text": "I can't say enough good things about Wendy Colescott, Executive Recruiter for Banking and Financial Services at Snelling of Huntsville.\n\nI had just moved to Huntsville from my life long home, Oklahoma City and for the first time, since I was 15 years old, I found myself without a job.  Banking has been my career for 28 years and I love it so.  I asked to connect with Wendy though LinkedIn and she immediately accepted and requested my resume and set a time to talk.  After our talk she immediately went to work reaching out to clients of Snelling to see if they had a need for anyone with my skill set.  Within just a few days, she had an appointment set for a meet and greet with a bank here in Huntsville.  For 3 weeks Wendy kept in touch with me to see how my search was going and she would also let me know of her continued efforts.\n\nWendy was the first person that I met in my new city.  Even though Snelling was not able to find a place for me, I still feel that Wendy and  Snelling set the stage for how great Huntsville is.\n\nThank you Wendy! I am truly grateful.  You are a ROCK STAR in Rocket City!\n\nCindy Peck", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "118119888332759092880", "name": "Amy Melton", "time": 1535413897321, "rating": 5.0, "text": "Upon moving to Huntsville, I had every intention of remaining with Snelling as a Temp Agent because of the flexibility.  Having an assignment with clients who were immediately like family changed my mind.  While I enjoyed \"M'Amy time\" with my grandchildren, I wasn't about to pass up the opportunity to work with another wonderful company.  We're so compatible and never thought that I would be happy anywhere other than Snelling.  Thanks, Hollye, for placing me with the P-E-R-F-E-C-T business!!!", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "105301535357444454618", "name": "Jeff Nix", "time": 1464890385084, "rating": 1.0, "text": "When I met with the recruiter I explained my past employment history (over 20 years of sales experience with 13 years as an Regional Sales Manager) after our meeting it seemed positive and she seemed very optimistic in finding me employment.\nThat was a joke, after a week I sent several emails and made several phone calls either going straight to voice mail or being told she is on the phone and will call you back,  I would patiently wait a week or two with no response.\nAlso I was told to email the recruiter employers that I showed interest and met their qualifications before I alpplied since Snelling  needed to be the first source of contact I would've better off emailing Mickey Mouse.\nNow I've missed my chance with the positions expecting her to make contact.\n\nDon't waste your time!!!", "pics": null, "resp": {"time": 1465230350207, "text": "My name is Paul Brashier and I own the Snelling Search and Staffing firm located in Huntsville. We take feedback from our clients and our candidates seriously so I wanted to respond to Mr. Nix’s comments. Prior to his posting this review, I spoke with Mr. Nix on the phone to better understand and apologize for his issues.\n\nOur firm has been serving our clients for over 50 years. Snelling of Huntsville has consistently been recognized within the top 2% of firms in our industry for outstanding customer service and we are a founding member of the North Alabama Better Business Bureau with an A+ rating. We were a finalist for “Best Places to Work” for the last three years. We are consistently one of the top 5 performing franchises in the Snelling network nationally. Our business is client driven so our focus is on identifying and recruiting great talent for our clients that will help their businesses succeed. While we certainly can’t profess to pleasing all people all of the time, our performance and recognition support that we have a great team that takes great care of our clients and our candidates."}, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "108819671967766527483", "name": "Louis Michetti", "time": 1470232009226, "rating": 5.0, "text": "I recently found myself looking for a new job after my position was eliminated. After being employed for 30 years it was very intimidating looking for a new job.  So many things had changed over the years.  I met with Paul and he immediately put my mind at ease.  He introduced me to Wendy. She was extremely helpful, professional, knowledgeable and showed complete understood my situation. We immediately hit it off and she went to work.  I have to say working with Paul and Wendy was very easy and one of the most rewarding professional experiences of my career.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "110947477856525722464", "name": "Cyrena Hodges", "time": 1511888742473, "rating": 5.0, "text": "Snelling-Huntsville is a great company to work with.  I have worked with Hollye Hatfield for 10+ years.  She is always professional, and her level of customer service and satisfaction always exceeds my expectations.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "103980369800948419936", "name": "Ashley mackey", "time": 1478796765393, "rating": 5.0, "text": "Snelling is the perfect staffing agency professionals who are serious about finding a great fit! The entire staff is kind and professional. Hollye was my recruiter and she was so nice and helpful even after I was placed.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "110743487261976941447", "name": "Angela Thornberry", "time": 1471133111606, "rating": 5.0, "text": "Professional. Friendly. Eager to help. Do not mind getting calls. They check up on me to see how I like my job. Answer all my questions.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "111126958516181276488", "name": "Shkeler Atchison", "time": 1471301765801, "rating": 5.0, "text": "I like to thank Snelling for the great opportunity they found for me at a great company. Ms. Tammy Pruitt showed concerned and committment to finding me a job. She just did not find me anything, but a job where I had received training in Medical Billing  and Coding.  If there were more people in this world who cared about others, like Ms. Pruitt, the world would be more loving and kind.  She takes her job seriously and for me she is a great asset to Snelling. There may be alot of events in my life I will forget, but speaking with Ms. Tammy Pruitt will not be one.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "100838715633038625095", "name": "Renee Gurley", "time": 1525288977164, "rating": 5.0, "text": "Kathryn Brashier and her Snelling team placed me with an amazing company. I do not feel like a candidate with Snelling, I feel like a part of the family.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "101338812622273397253", "name": "Lori Norwood", "time": 1536684389716, "rating": 5.0, "text": "Hollye was wonderful.  Took a traumatic experience for me and turned it into a huge positive.   I don’t have enough good words to say about Snelling in Huntsville.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "115471059501058163124", "name": "Chasity Arnold", "time": 1513185692410, "rating": 1.0, "text": "I spoke with Tammy and was assured I would be up for a position. I had to constantly call/email and check the status of my application. She said she would be getting back to me, but I never heard back from her. I emailed her once more, just be certain. No response. I hate that I had a negative experience with this company.", "pics": null, "resp": {"time": 1513373581115, "text": "We take feedback from our clients and candidates seriously so I wanted to respond to Ms. Arnold’s comments. I have spoken with Ms. Arnold to apologize for any confusion on our part and to let her know that she continues to be candidate for roles with our clients where her qualifications meet the client’s needs.\nSnelling of Huntsville has been serving our clients for over 52 years and we consistently rank among the top 2% of firms in our industry for outstanding customer service. We are a founding member of the Better Business Bureau of North Alabama with an A+ rating. Our business is client driven so our focus is on identifying and recruiting great talent for our clients that will best meet their needs and help them succeed. While we wish we could place 100% of the 100’s of candidates that we receive each week, that is simply not possible, nor is it possible to contact everyone to let them know we don’t have a suitable opportunity right now. But, we will keep trying!"}, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "113817738062783290364", "name": "Latika Mccrary", "time": 1544727519936, "rating": 1.0, "text": "You can be qualified for positions at Snelling and all you ever hear is; \"We have your application on file\".  Never a return call even when you are told they will call you because you have great experience!", "pics": null, "resp": {"time": 1548280195918, "text": "We do not have anyone by the name Latika McCrary in our applicant tracking system so we have been unable to contact this reviewer. Perhaps this is an alias. Ms. McCrary, if you would like to speak with the owners directly, please call our office and ask for Paul or Kathryn and tell them the reason for your call. We would be happy to hear from you directly.\nAt Snelling of Huntsville, we help our clients by recruiting great talent that matches their needs. Our clients typically make the decision about which candidate to hire. We have great candidates that are highly qualified that we are sometimes not able to place in an assignment because we do not have the right opportunity for a candidate's great experience in the compensation range they desire. We would put every candidate that applies to our opportunities to work if we possibly could. Unfortunately, we don't always have the right opportunities and it isn't financially feasible to have an employee personally call every candidate that we are unable to employ."}, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "115101352821826730739", "name": "Amanda Wilson", "time": 1544675274846, "rating": 4.0, "text": "I’m let down. Snelling is good at finding you jobs and recently found a error of why I didn’t get paid and fixed right away, it is a professional environment . They sent me to a great work place but a issue happened that seems very one sided . I was let go: I am a hard worker , I have wrote out to tammy asking her if she could help with another job because the job I was given apparently not what God intended me to have so.. Tammy if you see this , you could have emailed back and said you couldn’t help or no jobs right now, I’ve been left hanging ... maybe you have your reason but I can’t bash you guys. You definitely are a great staffing place and people I’ve talked too went through you guys and been at their jobs you got them for years : I wrote a long message on what happened and my side of it all. Remember 3 sides 1. Yours 2. Theirs 3. Truth. Just guess I’m severely let down that I passed up 2 jobs because I dedicated myself to you guys . I thought I would get the same respect", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "112738609347842179727", "name": "Matt Watkins", "time": 1469835475094, "rating": 5.0, "text": "My experience with Snelling was great. I dealt with MJ. She is on point with everything, very responsive, and found a great company for me that I am still with two years later.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "100757654994011338289", "name": "Jonathan Goodwin", "time": 1469883128363, "rating": 5.0, "text": "Paul Brashier, the owner of Snelling Huntsville personally helped me find my Dream Job here in Huntsville. I am a CPA with, at the time, 5 years of experience in public accounting. He got me an interview with a local CPA firm and even did a mock interview with me to prepare. I nailed it and have been happily excelling at this CPA firm for nearly 2 years now. Paul helped change my life for the better and I will always be greatful that he found the time to work with me.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "111928552544195607705", "name": "Sean Currie", "time": 1529419642447, "rating": 5.0, "text": "Kathryn Brashier and the Snelling staff provided excellent service and provided qualified applicants.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "102618466243841273097", "name": "Josh Murphey", "time": 1470071700901, "rating": 5.0, "text": "Great company to work with! Pam Richardson was very professional and exceeded my expectations!", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "109667726465442721398", "name": "Shannon Englehart", "time": 1470024522679, "rating": 5.0, "text": "The first experience I ever had using a recruiter was with M.J. Gillikin of Snelling. M.J. was very effective, and guided me through the process as only a professional with years of experience is able. If my experience with M.J.  is any indication of the level of service and professionalism throughout the Snelling team, I highly recommend the organization to professionals in search of effective experience to represent their employment interests.", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
{"user_id": "110944818009311283502", "name": "Steve Burleson", "time": 1532683841595, "rating": 5.0, "text": "Awesome place and they are so nice!", "pics": null, "resp": null, "gmap_id": "0x88626b430f518383:0x518c3ef792e48879"}
