{"user_id": "104674123558586018307", "name": "wanda Bussey", "time": 1615840570053, "rating": 3.0, "text": "My rating is for the appointment staffing alone. I never had the chance to even meet the doctor. Last week I was contacted by the office with an appointment based upon a referral from my primary care. The lady gave me the information to find the office and date and time of appointment. We even discussed my level of insurance so she was sure she had the correct information. I took a day off work, drove an hour and a half round trip. Only to be told I didn’t have an appointment. No one was willing to even look into it or try to make another appointment for me. I was basically treated as though I had done something wrong. Mistakes happen but treating people the way I was treated by the young lady at the counter is not a mistake.\n\nUpdate added.....the office manager did reach out to me the week after I posted this review. She apologized for what had happened and told me she would look into what transpired. I appreciate her for reaching out and I hope this doesn’t happen to someone else in the future", "pics": null, "resp": null, "gmap_id": "0x8889cff7363b7569:0xf9bae7d52906c18d"}
{"user_id": "115088341813970472559", "name": "Becki Tucker", "time": 1599233802969, "rating": 5.0, "text": "Dr Wallin was very professional. His expertise in his field is exceptional. He patiently explained the problem and the procedures necessary to correct my problem. He listened to each question and answered them thoroughly. He is the most exceptional Doctor and Surgeon I have ever dealt with.", "pics": null, "resp": null, "gmap_id": "0x8889cff7363b7569:0xf9bae7d52906c18d"}
{"user_id": "108099971213409798368", "name": "Tomar Crauswell", "time": 1598485031219, "rating": 5.0, "text": "Great Doctor and great staff. Every thing was clean & well sanitized. Everything is wheelchair accessible and restroom was spotless and fully stocked.", "pics": null, "resp": null, "gmap_id": "0x8889cff7363b7569:0xf9bae7d52906c18d"}
{"user_id": "106713859725812386337", "name": "Lionel Calvert", "time": 1581180637762, "rating": 5.0, "text": "A very knowledgable  professional in what he does. He takes time with you to explain all options and is thorough in what your needs may be.", "pics": null, "resp": null, "gmap_id": "0x8889cff7363b7569:0xf9bae7d52906c18d"}
{"user_id": "118339832381795660322", "name": "Chance lawson", "time": 1628519952938, "rating": 2.0, "text": "I never understood the point of an appointment if imma wait for 2 hours..hire more people or get your schedule figured out and get me in at a better time.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "105609049998442603142", "name": "Brendon Despres", "time": 1620138514951, "rating": 5.0, "text": "NAU has been treating me for the past 9 years.  Their staff is especially caring and listens to the patient. They have keep my treatments up to date with the latest treatment protocols and medicines.  Brittany works with the insurance companies and makes sure my appointments are scheduled.  Dr. Hicks always recognizes my past military service and the fact I am a veteran. Dr. Hicks is easy to talk to about all medical problems and procedures.  The nursing staff is very caring and understanding. They all take pride in their work.  I would recommend North Alabama Urology to anyone, especially my family members.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "111357981120709860117", "name": "Rick Parnell", "time": 1618326495535, "rating": 5.0, "text": "The Madison office has the best personality and personal that an office can ask for, I come here because of that very reason, my doctor is the best you can ask for, and the receptionist, has the best sense of humor one can ask for, they are very tentative to your needs and appointments, the very most I can say is keep up the good work and a job well done. Oh\nLatricia give me my shot when required and I’m very panic when it comes to getting a shot but she does it in a way that honestly I don’t even fill it, again they are the best I recommend this clinic to everyone. God bless all of them.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "104775355506536901488", "name": "Joy Osborne", "time": 1620138922616, "rating": 5.0, "text": "Very kind staff. Brittany was especially helpful. She was kind and cheery and made us feel very welcome. The doctors are wonderful and were extremely communicative and made sure my husband was very comfortable and understood every step of the process.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "106159602360595919502", "name": "TJ Jones", "time": 1618685406606, "rating": 5.0, "text": "My daughter is a patient at the Madison office, and we love it! The staff is wonderful and they just genuinely care about your well-being! Also, Ms Sherri at the front office always has a smile on her face! We love the Madison office and the staff!", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "100264592613645080546", "name": "Curtis Murphy", "time": 1619447257936, "rating": 5.0, "text": "To whom it may concern I would like to commend Kim and Sheri for their professionalism. I have been a patient been at the Madison Office since 2013 they have never waived in their comment to North Al. Urology. They are not often thanked for what they do. I would like to them for going above and beyond for what they do.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "109098138937660205955", "name": "Christina Howard", "time": 1619137751047, "rating": 5.0, "text": "I had my first visit today, at the Madison office.  I walked in and the lobby was empty of people, I turned in my paperwork and took a seat. The receptionist was amazingly friendly, even when I forgot some papers she was patient and kind. I was called back quickly, met the NP and she was phenomenal. She LISTENED to me, and treated me like a person and not a problem. She told me what she was doing every step of the way and made me very comfortable. The phlebotomist was kind, and talked to me and kept my mind off what she was doing. She did a great job and I have no bruising. When I left, the last stop was equally as wonderful. She was through and friendly and she scheduled my other appointments and tests. I told a friend this was the BEST drs visit I’ve ever had, hands down. I highly recommend the Madison office.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "109880500245338591790", "name": "Babs Hall", "time": 1620220954609, "rating": 5.0, "text": "I have been a patient of North Alabama Urology for many many years. The care of have received is beyond my expectations!! The staff and Doctors are knowledgeable, helpful and kind. So thankful for them.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "106496649842308418147", "name": "Eric R", "time": 1620428815451, "rating": 1.0, "text": "I had a procedure done by Dr. Pettus. The procedure went fine, and the office staff informed me that they had a legal obligation to set a follow up appointment. I went to the appointment, and the staff informed me that I had to pay a copay for the follow up. I was curious as to why I would have to pay a copay, because these mandatory visits are typically free. The staff assured me that I needed to pay the copay, then I was seen in the back by Dr. Pettus, and he also informed me that the visit should have been free of charge, so the office staff seems to have misunderstood the reasons for my appointment. I am currently working to fix this issue, but have little confidence in it being resolved due to how difficult it is to get in touch with the office.", "pics": null, "resp": {"time": 1620654347916, "text": "After any procedure your physician would prefer all patients to follow up.  Different procedures have different post op days some could be 10 days, 30 days, 60 days or 90 days.  Please call our billing department to confirm your post op days for your procedure.  If you were billed incorrectly we will issue a refund as soon as possible."}, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "104868509108047745774", "name": "Pam Green", "time": 1619728409745, "rating": 5.0, "text": "Very professional staff; great doctors who provided needed answers and welcomed treatment! I would DEFINITELY recommend this practice to anyone in need!!!", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "111549332468498253306", "name": "Jessie Foster", "time": 1619806337608, "rating": 5.0, "text": "Brittany went above and beyond to help get my hormone therapy approved with insurance. Great staff and environment. - Mike F", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "106322593233779536347", "name": "Kevin Breuers", "time": 1614629058457, "rating": 5.0, "text": "Great experience in getting my daughter an emergency appointment on a short notice.  Karen was awesome and went the extra mile!.  Thank You!", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "106383717021195138467", "name": "alexx laurenn", "time": 1618275095918, "rating": 5.0, "text": "Had a great experience at the Madison office! I loved the staff there and Dr. Hicks saw both of my boys and did a wonderful job.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "115122265310534288851", "name": "mattie smith", "time": 1620761998267, "rating": 5.0, "text": "Every visit has be great the doctor is awesome and his name Trish is smart nice and funny and very helpful love them they take great care of me.                      Roy smith", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "112877752121028241218", "name": "Trent Iley", "time": 1619724709120, "rating": 5.0, "text": "Great welcoming staff and doctors.  Very comfortable experience.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "106326825366284211395", "name": "Jeremy Steagall", "time": 1618436232017, "rating": 5.0, "text": "We love Dr. Black. Him and his staff are very professional and very friendly.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "112296615489953431087", "name": "Leslie Shields", "time": 1618514952877, "rating": 5.0, "text": "Dr. Pettus and his staff are great.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "109516438338706501651", "name": "John Michael Dupree", "time": 1618685337688, "rating": 5.0, "text": "Overall great experience and excellent staff", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "115381872887465355189", "name": "Michael Whitley", "time": 1596200950115, "rating": 5.0, "text": "Dr. Pettus removed a very large tumor and my left kidney and adrenal on 9/5/2020. A tribute to his skills as a surgeon, I was walking 14 hours after surgery and home in less than 24 hours. It was a big scary surgery (to me) that happened very quickly but Dr. Pettus explained everything and I sailed through with the best possible recovery. In addition to his skills as a surgeon, he’s also a damn nice and caring person.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "111025696414748911189", "name": "Matthew “Matt S”", "time": 1601754168170, "rating": 1.0, "text": "Can you please add some kind of contact or support on your patient portal. First your site says there is a problem on your end and I can't reset my password, then later it says I don't even have an account. Your website needs some work.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "112356801841239508521", "name": "norman mckelvey", "time": 1581347593237, "rating": 5.0, "text": "I have been going to Dr. Hicks for over 5 years . He has a great bedside manner. I was getting kidney stones yearly. With recommendation from Dr. Hicks, have been stone free for 3 years. Staff is friend and professional.I recommend him to family and friends.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "101818844178436998275", "name": "Chris Davis", "time": 1578684530684, "rating": 1.0, "text": "I do not recommend this Dr. Office. I also left a bad review on there website which I am not seeing and assume there moderator has declined to post. It had nothing vulgar.\n\nOn to the actual review:\nThis office ran inefficiently. It was crowded in the office. They are overbooking patients. We were on time and it took 45 minutes for us to get called back after our scheduled Appointment time however if you are 15 minutes late then they will pass on to the next associate (which I agree with but where is the accountability of the Dr Office?). There is no respect for the patient's time.\n\nThe receptionist along with other staff did not seem friendly. They were running around appearing too busy. I don't think its 100% the fault of the staff members but rather whoever manages this place.\n\nPlease respect the patient's time by reserving a time that is truly for them. Maybe a more organized culture and some training could help in a friendly and more efficient staff by having less stressed workers.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "104598723464860896211", "name": "Jenny Geddie", "time": 1549765073577, "rating": 5.0, "text": "I find the office staff helpful and polite , despite the number of people they care for . I have been fortunate to get in when I was having problems and could not wait .\n\nDr Black is my physician and he is patient , a good communicator , and thorough . He takes time to answer my questions and does not rush me out of the room. Also, he is pleasant and displays no arrogance with women . I feel fortunate to have his help , and recommend him to anyone who needs a good urologist who will work hard to help you .", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "116397098015397938673", "name": "Jenna Stone", "time": 1568122458648, "rating": 1.0, "text": "We’ve had another terrible experience here.   I’m very disappointed in this office and the “care” they provide.  My husband waited and waited to finally get in to see Pettus about his kidney stones and instead of trying to help him figure out what’s causing them like he said and after I made sure that’s what we were seeing him for, we got a call a few hours after his appointment that told us to cancel our follow up  appointment since it was decided there’s nothing he can do for him.  This is after my husband took off work, went and had x-rays and went for his appointment.  We were excited to finally go the extra step and get a CT scan so we could try and figure out what’s causing his kidney stones.  We know he has them and that’s why we went here to get help, instead they tell us the same thing (like we didn’t know) and that there’s nothing they can do for for us.  After the follow up appt was set up we get a call from someone in the office relaying the message that after further review there’s nothing to do and to drink more water.  My husband drinks 2 gallons of water a day.  We are so disappointed in the time, money and energy wasted AGAIN at this office.  Do not expect to get help here!!  Terrible terrible experience!", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "101619225205594503783", "name": "Ernie Carlson", "time": 1569518081415, "rating": 1.0, "text": "Dr. Pettis is a consummate professional and a superior Urologist. So for him I would rate him as a 5 Star professional. My problem lies with the office personnel. I dropped off paperwork for my FMLA to be filled out on September 6th. Today, September 26th, I am still trying to get all the paperwork sent in. After almost three weeks to the day I gave the office personnel all the paperwork..they first faxed it to the wrong number,after second attempt,they didn't fax the complete paperwork, then in return I received a third notice from Sedgwick saying that they needed complete paperwork.  In return I phoned the office to see what was the holdup...they then said they would have to call me back..After 4 PM yesterday, the nurse finally told me after almost three weeks ..that was when the nurse on the phone said she didn't have page one. I brought the complete paperwork this morning and told the woman at the front window that needed to be completed by this evening or my FMLA would be denied and I could face disciplinary action or be fired for being out without this being approved . the woman at the window was very rude and denied me the right to discuss this matter with a nurse or anyone of authority, also questioning If I had paid for this paperwork to be filled out when it should have been entered into my account that I paid for it..this also happened for other paperwork that was processed in a slow manner. If only the office personnel were as professional as the doctors they work for I would be giving this rating a better mark. Thank you Dr. Pettis for your excellence.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "108648408994549301436", "name": "Sarah Jacobs", "time": 1523629124809, "rating": 5.0, "text": "Just had my first appt with Dr Pettus and he is phenomenal! He took the time to address my concerns and explained everything in a way that was easy to understand.  His staff is extremely friendly and efficient so there is little to no wait time.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "109856540294309480716", "name": "Zhxft", "time": 1548703885537, "rating": 3.0, "text": "Dr. Hicks is wonderful. The front desk staff are rude and incompetent. Some of them shouldn't be dealing with patients due to their lack of sensitivity.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "116766827267777405334", "name": "Cory Leitao", "time": 1569340159541, "rating": 5.0, "text": "I highly recommend Dr. Pettus.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "107578903148100039154", "name": "Rodney D. Rothstein", "time": 1520017474746, "rating": 5.0, "text": "Very pleasant staff and experience. I would highly recommend Dr Pettus and this group for any urologic problem.\nRRothstein MD", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "113453303836073066993", "name": "Julie", "time": 1554913705379, "rating": 5.0, "text": "Highly recommend Dr. Hicks.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "116662045511772687323", "name": "Richard McCollum", "time": 1525102190214, "rating": 1.0, "text": "Terrible experience with staff and billing. Very rude, treated like a deadbeat because we didn't pay a bill they admittedly didn't send to us. Made my wife cry and demanded payment when she was in their office. Poor business office practices.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0xd0047e33c676e519"}
{"user_id": "102404689353238605838", "name": "Jason Hulsey", "time": 1627311045194, "rating": 5.0, "text": "Awesome patient care, really clean facility and staff were speedy.", "pics": null, "resp": null, "gmap_id": "0x8889c9356304bcb5:0x5ac41bbb4fa8b79e"}
{"user_id": "113574496445257899823", "name": "perry humphries", "time": 1610412937000, "rating": 5.0, "text": "Geat staff and Doctors", "pics": null, "resp": null, "gmap_id": "0x8889c9356304bcb5:0x5ac41bbb4fa8b79e"}
{"user_id": "105935848951881922489", "name": "G G", "time": 1406229533746, "rating": 2.0, "text": "The doctor was very good and the wait time to see him was ok but  they asked me to stay to file for another appointment at a diagnostic center. I was told it would just take a few minutes maybe ten. I went to the lobby and waited nearly an hour. I'm not sure what the issue was but I have work today so I don't appreciate waiting any longer then needed. I went to the lobby at 1:30 asked if I was good to go at 1:40 and was told it'd be about ten minutes. Now its nearly 2:30 I've been patient and polite. So my question is how can you get some one in to see the doc faster than it takes to schedule another appointment. Imagine going to a restaurant you order your food and get it within 30 minutes but are made to wait an hour to get your tab. What sense does this make!?", "pics": null, "resp": null, "gmap_id": "0x8889c9356304bcb5:0x5ac41bbb4fa8b79e"}
{"user_id": "102000597179996727277", "name": "L. S. Adams", "time": 1516636588739, "rating": 5.0, "text": "Excellent  medical care ,great staff I highly recommend . prostate cancer survivor !!", "pics": null, "resp": null, "gmap_id": "0x8889c9356304bcb5:0x5ac41bbb4fa8b79e"}
{"user_id": "106506008189482969051", "name": "Samuel Steele", "time": 1627353711923, "rating": 1.0, "text": "I had the worst experience with Dr. Habermacher, I had went to ER with a kidney stone and was told it measured 7mm, was told to follow up with Urologist from your clinic,I saw NP on day of appointment which was very nice,I ask for a scan to be done before so we would know if stone was still there. The morning of surgery, Dr. Habermacher came into room I ask if he was going to do scan to make sure stone was gone, he replied no, it will be gone today one way or another. I had passed very small pieces of stone but definitely not a 7mm in prior week.When I awoke from procedure I was told there was no stone, after getting home I was very sick from procedure and very sore. I went for my follow-up, I told the girl that checked me in that I was upset that he did not do KUB to make sure the stone was gone also, that I am a nurse and have had enough of kidney stone patients to know how to check for kidney stones and I definitely had not passed a 7mm. She said I will tell him, she immediately came back in room and said this is a nurse visit, he wants you to do 24 hr urine and come back in 2 months. I have no intentions of ever using him again, why would you not do a KUB or scan to make sure it's gone before putting someone through this, it sounds like it's all about money to me. WILL NEVER use this Dr again.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "107560826844517747305", "name": "Nathan Herrick", "time": 1611344210315, "rating": 1.0, "text": "Received a referral from my insurance company to this clinic to see a Gastroenterologist and I cannot even schedule an appointment. For the last two months, I have called the only available phone number to make an appointment only to be transferred to the gastroenterology clinic appointment line where I have left several messages with the scheduler because that person was not there. No return calls and the office is closed on Friday.", "pics": null, "resp": {"time": 1614290855284, "text": "Nathan, we would value the opportunity to connect with you further. Our patient care team can be reached at (334) 613-7070 at your convenience. If you would prefer to speak with our Patient Advocate, please call (334) 568-4866."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "118035772244836917308", "name": "Renae Pemberton", "time": 1604533118108, "rating": 1.0, "text": "I would not recommend anyone to Dr. Habermacher. My husband and I received some news that was scary and the doctor was not empathetic towards us. He does not like for his patients to do any scholarly research to help the patient or families to be knowledgeable on their diagnosis. He will get offended if you ask questions in which he feels a patient is second guessing his medical knowledge. He talked down to us and no doctor should ever talk to people in that way. Listen to your gut or in my case the Holy Spirit if something does not sit right with you about someone taking care of your loved one. I pray Dr. Habermacher is a Christian and if not that he will come to know the love of Jesus.", "pics": null, "resp": {"time": 1606179290463, "text": "Renae, we would value the opportunity to connect with you further. Our patient care team can be reached at (334) 613-7070 at your convenience."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "106276702774166680149", "name": "Abby McNeil", "time": 1601472617242, "rating": 5.0, "text": "I’ve been a patient of dr garg for a little over a year and she’s great . Yesterday I came in and I just wanted to call out one of the endocrinology nurses , Jennifer , and tell her how kind and wonderful I thought she was at her job. Jennifer went out of her way to make sure I was comfortable during a really long glucose test I had . Dr garg also takes a whole body approach to your treatment , and it is truly worth my drive from Dothan where all our endos are retiring/booked to come to this clinic .", "pics": null, "resp": {"time": 1601482922083, "text": "Abby, thank you for the kind review. It is our honor to provide excellence in care to the people of Alabama!"}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "111188159416355907851", "name": "Jaime Denise", "time": 1608335886715, "rating": 3.0, "text": "They schedule way too many people at the same time, so the waiting time is HOURS.", "pics": null, "resp": {"time": 1614290484766, "text": "We understand your concerns and know that your time is valuable. Your feedback has been shared with our team and we thank you for your patience in this intricate season of care."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "113464080315346843401", "name": "Tony Boyer", "time": 1545582087126, "rating": 5.0, "text": "At times finding proper care that gives you the feeling your best interest has been top priority can be a challenge in the Montgomery area.  We typically go to Birmingham for peace of mind.  My first visit to UAB Urology clinic was one of the best experiences I've had anywhere.  Professional, engaging, reflective, and not reluctant to challenge the knowledge and awareness of their patients.  Dr. Habermacher understood my level of comprehension to quickly lend understanding to my concerns & how to handle my own personal health going forward.  Without being too long winded, I have to express gratitude for the opening and benefits of this clinic for Montgomery residents & anyone within reasonable distance.  Checks all the boxes both physically and psychologically to assure patients care is their top priority.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "109149654432663969534", "name": "Jeff chappell", "time": 1580739399408, "rating": 1.0, "text": "Apparently negative reviews get taken down quickly?  Dr. Thudi, an endo, has the worst communication skills.  Does not listen, assumes, and is too proud to admit mistakes.  They return calls, but only if you're waiting by the phone.  No voicemails except \"please call us back\" and you never get a live person, so it's voicemail tag over and over and over.  Add that to their \"never on Friday\" rules and you've got a setup for making money with zero customer service, much less patient service.\nAnd DON'T even think of adding a response to this about \"We'd like to talk with you about your experience\".  We spoke, we emailed, and THIS IS my response to your customer care.  Don't act like this is the first you have heard of the problem.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "110810778778295902588", "name": "Evelyn Young", "time": 1529426965919, "rating": 2.0, "text": "I have had zero problems until today. You have one number for the entire clinic. They have several specialists. So it is hard to reach the person you need. I called asking for a specific person and extension. I was asked the person last name .They did not leave a last name. I gave the extension#. I was asked what is the nature of the call. I still did not get the person that left the message. Guess if it's important they will call me back..", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "111193115751902347353", "name": "Tamra Oswalt", "time": 1570210263130, "rating": 1.0, "text": "I'm very disappointed I have been to four doctors in the past month about my foot and my toe I am in excruciating pain mobic is helping and your office closed at noon today because it's Friday well I don't consider an emergency other than I'm excruciating pain and can't walk. So what am I supposed to do?\n\nVery disappointed how the doctor he's never seen me going to know what to do for me", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "114165500896750655586", "name": "Scott Thompson", "time": 1538578909414, "rating": 2.0, "text": "Originally given 1-star: Waited for 6 weeks for an appointment just to have a consult. The Friday before the Monday afternoon appointment I get a call saying Doctor Hablemacker would be out of the office and they had rescheduled me for two weeks later in the morning instead of the original afternoon. They required me to call and confirm to keep the new appointment. No further explanation. No options given for the inconvenience. Attempted to call at 2:30 pm when I got the message, but the office was already closed. Apparently they also don’t work on Friday afternoons...\n\nUPDATE TO POST (10/18): Upgraded to 2-star.The office was able to accomidate a different appointment time since I was going to be out of the country during their first rescheduled time. Initially, they didn't have availability, but were willing to squeeze me in for the short consult given the previous circumstances. I will reconsider again after the appointment/service.", "pics": null, "resp": {"time": 1536593512763, "text": "Mr. Thompson,\nWe are very sorry we did not meet your expectations.  Please do call our office today between 8 AM and 5 PM to find a more convenient time for your appointment."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "105513552415487179721", "name": "Grover Wedgeworth", "time": 1555512481353, "rating": 1.0, "text": "Service sucks, no follow up on lab between visits, .Failed to provide consultation notes and labwork to my wife's primary doc.  Dtaff are curt cna rude", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "100199861040353856532", "name": "DeAndre Scott", "time": 1542033819723, "rating": 5.0, "text": "I have been coming to the UAB Specialty clinic to see Rheumatology. Dr. Gadea and his staff are some of the best medical professionals I have ever come across. Having worked in the medical field for 16 years (21year USAF Vet), I have worked with countless professionals. I can only highly recommend Dr Gadea and his team as their patient care exceeds the standard every visit!", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "109337083997686348338", "name": "Wendy Adams", "time": 1545164083529, "rating": 1.0, "text": "This is a poor excuse for a gastroenterology center. My husband is having issues with abdominal pain and other stomach issues and we were told by Dr. Kahn that if my husband continued to have issues that he should go back to the ER and let them call him and see if he could get in for an emergency colonoscopy. Well he went back to the ER and they ran all kinds of test and just because his blood work came back fine, the ER staff and Dr. Kahn refused to admit him and said that he would have to wait until Feb to have a colonoscopy scheduled.  So the doctor lied to both of us. Needless to say my husband is still in very bad pain. So nothing bad better happen to my husband because of their negligence.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "109629967256740502457", "name": "Andrea Curtis", "time": 1536710565402, "rating": 5.0, "text": "The doctors here are excellent.  I especially like Dr. Nina Jo Hibbard, Endocrinologist,  and Dr. Carlos Gadea, Rheumatologist.  They are knowledgable, patient, and very concerned about the pateient's well-being.    I wouldn't trust my healthcare needs to be handleded anywhere else.   😀", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "105124454187813409107", "name": "Jennifer van Arcken", "time": 1504830525964, "rating": 5.0, "text": "My husband had surgery by Dr. Habermacher and we are very pleased that UAB opened this state of the art clinic in Montgomery and brought such great healthcare professionals to our area. The surgery was a success and the follow up visits at the clinic were accomplished very professionally.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "114492014717223503219", "name": "Bill Flick", "time": 1514917554556, "rating": 5.0, "text": "I have seen Dr. Pazona in Urology and found him to be very competent, professional and pleasant.  The staff were also very efficient and pleasant.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "115584060232493438080", "name": "Tamara Dozier", "time": 1568788922908, "rating": 2.0, "text": "Dr. Mullins was wonderI!!\nI need a new Rheumatologist ...", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "118096554832493583892", "name": "EDDIE SMITH", "time": 1536835072856, "rating": 5.0, "text": "Great doctor took good care of my mother", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "101540982988129630133", "name": "Amber Kimmel", "time": 1623858666571, "rating": 5.0, "text": "Ashley Guy is amazing! She is so knowledgeable and helpful and actually take the time and LISTENS! You’re not just a number and you don’t get herded in and out like cattle. Also, have never waited more than 10 minutes\nTo be seen.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "112693455904258132743", "name": "Brian Embry", "time": 1627263729801, "rating": 1.0, "text": "Do yourself a favor and drive further to get the most comphensove care. Never met Turnbill because he sold the practice and apparently doesn't give a dang anymore because he was constantly out of the office.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "115724527702433978139", "name": "Wondza Rodriguez", "time": 1623961011440, "rating": 5.0, "text": "Everyone  was so nice.I was a nervous  wreck.But I could feel how much Mrs. Guy wanted to get to the bottom  of my problems and she proceeded  to do just that..She has scheduled  some test and ordered some medicine. I couldn't  be more pleased. I am so thankful my primary care physician recommended  this group for me..", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "103142912561317292365", "name": "Lesterelaine Smith", "time": 1619185617476, "rating": 5.0, "text": "I was extremely pleased with my visit to Dr. Turnbull April 21, 2021. He is an outstanding urologist. I highly recommend him. He takes time to understand your problem and knows what to do to help you and truly cares about his patients. He is tops in my book. I am very glad he is my urologist.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "117776458617699143120", "name": "Noel Bergevin", "time": 1617803030893, "rating": 5.0, "text": "Dr Turnbull has been my urologist for many years. This is for good reason he is a great doctor , surgeon , and has a great bedside manner. I would never even entertain the thought of finding a new urologist. Many thanks for all the year's of impeccable health service , Noel B.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "107308012823841026344", "name": "Mary Hulse", "time": 1624464128606, "rating": 5.0, "text": "Dr. Turnbull has been my Urologist for many years. He is the most kind and caring Dr. I have ever had. The only complaint I have is when I need to see him I cannot get through to him. Since he went with this company the wait on the phone is ridiculous and the ladies are rude, rude rude! If it weren’t for Dr. Turnbull I would leave this business.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "101299694215826263989", "name": "denise behling", "time": 1621450499536, "rating": 4.0, "text": "So glad the reception area is expanding. Exam rooms are rather small when accommodating a walker, rolator, or wheelchair. Medical staff are very knowledgeable & caring. Expand med staff to add’l urologist.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "103635950188777655815", "name": "Elaine Moss", "time": 1614724435447, "rating": 5.0, "text": "From the time I arrived until my procedure was finished everything and everyone completely top notch.  Thank you to all for what you do.  Ron Moss", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "107951647158279296867", "name": "Michael Buskett", "time": 1612132805505, "rating": 5.0, "text": "was extremely satisfied from check in staff , nursing staff member , and the Doctor. He was easy to speak with, and he genuinely listened to my concerns, and reason for my visit. I trust Dr. Turnbull, completely", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "118280590094474085143", "name": "Alan Brothers", "time": 1609087739328, "rating": 5.0, "text": "All the Doctors and staff are extremely professional and efficient.  I never have a problem with appointments.  Keep up the great work.\nAlan C. Brothers", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "102184507103638124326", "name": "Caryl Koon", "time": 1623192357082, "rating": 5.0, "text": "Dr.Turnbull is a very caring and knowledgeable physician.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "107624128951420742993", "name": "Cynthia DeKay", "time": 1607994731351, "rating": 5.0, "text": "My husband and I really appreciate it Dr. Turnball. He was very easy to talk to, was very helpful, and understanding the situation. We felt very confident in him and Believed my husband when it was in good hands.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "100350254854477756927", "name": "John Jackson", "time": 1608756981801, "rating": 5.0, "text": "Went recently with my wife and it was busy and went today for myself and it was busy. They do require that you wear a mask, I appreciate that! They have hand sanitizer for you to use. They seem to try to be safe during this pandemic.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "103312279961566031645", "name": "Patrick Revell", "time": 1609863827876, "rating": 5.0, "text": "Great staff. Mrs. Guy was very professional and thorough.  She asked many questions to find out what was wrong with you. If she didn't know it the answer she will find out. I would highly recommend her.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "116543409889684013651", "name": "Jim Jones", "time": 1614792371720, "rating": 5.0, "text": "very thorough and professional visit, addressed all my concerns.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "113340540225354165541", "name": "Dr.Joseph Ndolo", "time": 1618031369196, "rating": 4.0, "text": "Excellent and compassionate doctor  .Great office staff as well .", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "104132714346305712942", "name": "Ronald West", "time": 1615829425992, "rating": 4.0, "text": "I was impressed with the staff, they generally seemed interested in helping me with my issues and had empathy. I felt very comfortable discussing my issues with them and w am encouraged that they will resolve my issues", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "114669046145723390356", "name": "Phillip West", "time": 1621348653040, "rating": 5.0, "text": "Ashley (P.A.) helped me immensely with my anxiety about the condition for which I was seeing them...still working on the solution, but I can now approach the process with confidence (and not \"doomed\")", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "111781280207845411914", "name": "Chuck Woods", "time": 1612381148938, "rating": 5.0, "text": "Dr. Turnbull is always professional and pleasant. Exceptionally skilled doctor.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "106914825582976911646", "name": "Lebron/Sheila Creech", "time": 1605124982569, "rating": 5.0, "text": "Ashley Guy is a very knowledgeable and professional physician assistant.  She is also very prompt with her appointments, and they have a very clean facility.  Her staff is always very friendly and efficient as well.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "112578125244387745954", "name": "Elliott Calloway", "time": 1615905143856, "rating": 5.0, "text": "Have been seeing Dr. Turnbull for a number of years.  I have always respected his knowledge and treatment of my prostate problems.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "111380251970791081791", "name": "Terry Weeks", "time": 1606843362645, "rating": 5.0, "text": "I appreciated Dr.Turnbull's allowing me back to see him since it had been quite awhile back when I saw him for kidney stones the first time. his nurse was very nice and polite also.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "102625482096333465497", "name": "Ben Malone", "time": 1609199135968, "rating": 5.0, "text": "Very efficient office, checked in, had them call me when it was time to go in to a room, while I waited in my car.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "103678676972100508061", "name": "james hanson", "time": 1623171827428, "rating": 5.0, "text": "Dr. Turnbull is great! Very professional staff! Been with him over 3 decades.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "104908958482604680335", "name": "Ricky Simpson", "time": 1620774301250, "rating": 5.0, "text": "Dr Turnbull was very personable and professional", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "116947594140925314940", "name": "Jack Healey", "time": 1623694269954, "rating": 5.0, "text": "Busy, but proficient and professional.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "105930972116077159902", "name": "Daniel Humphries", "time": 1608748300248, "rating": 5.0, "text": "I only saw Ashley Guy but she was very helpful in) and seemed extremely caring.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "118326936887682835031", "name": "William Harmon", "time": 1607444670194, "rating": 5.0, "text": "Everyone in the office was very professional and made my doctors visit pleasant. Thank you to everyone that works there.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "104767263288332381334", "name": "Ralph Buck", "time": 1613420391970, "rating": 5.0, "text": "Excellent. Easy check-in; office made copy of my medication list.\nshort wait to be taken for vitals and short wait before Dr. arrived. This was a routine checkup. No problems to report. Next visit schedule for one year from now.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "104617210012217477243", "name": "Lee Wilson", "time": 1623857821041, "rating": 5.0, "text": "Absolutely very knowledgeable and helpful", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "116913380195571190742", "name": "Quentin Srnka", "time": 1606259638602, "rating": 5.0, "text": "Dr Turnbull and all of his staff are efficient, friendly, and caring. When individuals ask me to recommend a urologist (I am a pharmacist), I recommend Dr Turnbull and his staff with confidence and without hesitation. QMS", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "106997601269701377023", "name": "Jeffrey Miller", "time": 1596198072477, "rating": 5.0, "text": "I feel fortunate to have Mrs. Guy as my physician. She understands all (and I have many) medical issues and concerns. She has developed a systematic plan for treatment of my kidney issues. Fantastic!", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "102974385843588517109", "name": "Joyce Watts", "time": 1603136308262, "rating": 5.0, "text": "Ashley Guy is very caring and knowledgeable.  I highly recommend her.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "117641566859625925200", "name": "dawmlw", "time": 1609258271338, "rating": 5.0, "text": "Dr. Turnbull always takes time to answer questions, explains test results, has a plan for your treatment!", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "110047921093665024096", "name": "Richard Pitts Musgrove", "time": 1616115250776, "rating": 5.0, "text": "Very good group of Doctors. Fast and they answer all questions.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "113740284626435331280", "name": "Chris Durden", "time": 1620998042947, "rating": 5.0, "text": "Always punctual and great job by Doctor and staff. Thanks Chris Durden", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "108910514789199102629", "name": "Loron Holden", "time": 1609248548229, "rating": 5.0, "text": "refreshing, no nonsense doctor,  concentrates on the patient and listens.  Very busy but office overload has improved.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "112842024292549218035", "name": "Cushman Phillips", "time": 1608227945812, "rating": 5.0, "text": "Ashley does a great job, very capable.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "100526264777050255601", "name": "Chip Drago", "time": 1613434728202, "rating": 4.0, "text": "Satisfied. Very professional and helpful.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "107896140091020267039", "name": "Sue Parker", "time": 1608405489432, "rating": 5.0, "text": "Ashley Guy is the best, very friendly and professional!!", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "106941919646996119761", "name": "robert axetell", "time": 1611357086752, "rating": 5.0, "text": "Very professional, very helpful.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "103576779964605529796", "name": "Candace Eatman", "time": 1600883737832, "rating": 5.0, "text": "Ashley Guy was very thorough, professional & personable.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "105488336451319398848", "name": "Norman Alston", "time": 1623973266583, "rating": 4.0, "text": "PA was informative, attentive, and welcoming", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "105056731977593973193", "name": "Hamp Johnston", "time": 1602630417406, "rating": 3.0, "text": "I tried to cancel my appointment today and was not\nSuccessful. Poor system.", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "111578905245505291827", "name": "Robert mills", "time": 1613586973936, "rating": 5.0, "text": "The plp were very nice and professional", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "100646526876981134226", "name": "Anita King", "time": 1611788671394, "rating": 5.0, "text": "knowledgeable staff, efficient", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "112121607014338555176", "name": "Lin Williams", "time": 1599174385484, "rating": 5.0, "text": "Super friendly, quick visit", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "102241219969826487135", "name": "Jeffrey Rust", "time": 1603330609649, "rating": 5.0, "text": "Professional and considerate", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "100626902264667348382", "name": "Ggelaine bostick", "time": 1598595131970, "rating": 5.0, "text": "no commit", "pics": null, "resp": null, "gmap_id": "0x889a0d337afbbe71:0x7217eec9a9b188e6"}
{"user_id": "103793743098361710791", "name": "Candace Anderson", "time": 1623870821392, "rating": 1.0, "text": "Most of the Doctors have left. Only 2 Dr's to handle patient load. Then if one Dr is out.....\nI'm trying to talk my husband in changing Urologists. Takes months to get an apt and he has kidney stones!!!", "pics": null, "resp": {"time": 1623878198466, "text": "Candace you are welcome to call our office.  We see patients the same day or next day for kidney stones.  Thank you!"}, "gmap_id": "0x889a4d7687d412a5:0x359275820756f72e"}
{"user_id": "114771140724209838860", "name": "Lesley Lawrence", "time": 1572373487544, "rating": 1.0, "text": "My husband and I have both been in this office for years. This pass time my husband was seen he saw new pa who very pleasant  but when called a week or so later just for letters saying he was seen in office on the date he was seen and good to go to work they refused. My husband works off shore anytime they see a dr for issues they just have report say they can come back. They stand we can't do because never said he couldn't go to work which we knew and understood. He just a letter saying just that after several phone they final gave letter. The lady on other phone was rude and unprofessional and clear didnt understand what we were asking but they turn around saying we cant be seen in the office due our behavior well we were never coming back anyways. Btw he pass a kidney that the scan didnt pick up a well. Which die history they should have order a Ct scan.", "pics": null, "resp": null, "gmap_id": "0x889a4d7687d412a5:0x359275820756f72e"}
{"user_id": "114423993656717949146", "name": "Rosemary McLain", "time": 1525366004835, "rating": 2.0, "text": "While I found the physician I see very caring,  the office staff and most of the nurses leave much to be desired in compassion and efficiency.   The wait to get an appointment (I am already a patient) was over 4 months and the day of my visit I waited almost 3 hours to see my doctor.   Also, the main reason I was there could not happen because of the failure of the office and front staff to do their job.   I actually arrived early and could have been seen for the reason I made the appt. and then sent back to the waiting room to wait for the doctor to become available.   But since that was messed up, I will need to make another visit to see them but I am still waiting on the office nurse to call me back to get that scheduled.   Again, you will not find another doctor better than Dr. Lori Fleck but just know that to see her you will have to endure less than professional staff who can't seem to do there job correctly.", "pics": null, "resp": null, "gmap_id": "0x889a4d7687d412a5:0x359275820756f72e"}
{"user_id": "104066632293987707836", "name": "JoAnne Kane", "time": 1572969411712, "rating": 1.0, "text": "One star is even too much!! Didn't even get to see a Dr due to the office staff being inefficent! Very rude as well!!", "pics": null, "resp": null, "gmap_id": "0x889a4d7687d412a5:0x359275820756f72e"}
{"user_id": "105686387700681050428", "name": "Emily Davis", "time": 1623967547877, "rating": 3.0, "text": "Doctor Osula is absolutely amazing! The rest of the staff are very nice. Only three stars because it is almost IMPOSSIBLE to contact them on the phone. I have been trying to contact them the entire day and never got a hold of anyone. It usually takes days to get through on the phone. They desperately need to hire more phone staff because you can hardly get an appointment, or even help when you have a problem because your call is not answered or returned.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "100658916054419352143", "name": "Bob Burns", "time": 1619462344658, "rating": 5.0, "text": "I have been a patient of Dr. James Flatt since 2015.  I feel the world class service when attending an appointment at his office on Whitesburg.  Dr. Flatt recently performed a procedure on me at Crestwood Medical.   Leading up to surgery, Dr. Flatt educated me on what I could expect and put me at ease.  I find Dr. Flatt to be professional, knowledgeable, and highly respected in his specialty.  Alyssa and Tiffany do a splendid  job in their duties.  Thank you", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "114918324143671935669", "name": "Ella Watts", "time": 1623080967210, "rating": 4.0, "text": "The whole practice was wonderful from the front to the back. There is a wait time occasionally over the phones, but I am not sure why there are any 1 star reviews to be honest. I would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "105051357605621318400", "name": "Bob Burns", "time": 1619462079224, "rating": 5.0, "text": "I have been a patient of Dr. James Flatt since 2015.  I feel the world class service when attending an appointment at his office on Whitesburg.  Dr. Flatt recently performed a procedure on me at Crestwood Medical.   Leading up to surgery, Dr. Flatt educated me on what I could expect and put me at ease.  I find Dr. Flatt to be professional, knowledgeable, and highly respected in his specialty.  Alyssa and Tiffany do a wonderful job in their duties.  Thank you", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "115663506537701942199", "name": "Lauren Appling", "time": 1621515780353, "rating": 1.0, "text": "I'm amazed that there are 3+ star reviews of this place. I tried to make an appointment with them but no one would answer the phone or return my calls.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "109921118417236812089", "name": "John Davis", "time": 1623813232226, "rating": 1.0, "text": "Worst office staff ever.  Received conflicting info between the staff and the doctor himself. But regardless, can't get back in to confirm or move forward with anything because nobody answers the phone or gives any call backs. Been trying to get an appointment for 3 months. Pitiful!!", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "104526707973257342730", "name": "Bree Bare", "time": 1609780628163, "rating": 5.0, "text": "Wait time was average for such a big facility. Front office ladies were very polite and got information from long lines of people efficiently. Dr. Osula was incredible! He took my issues seriously and provided multiple solutions to help me. Everyone was very helpful and courteous to me through the process.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "118049826062577253494", "name": "Jonathan Farmer", "time": 1621279154815, "rating": 1.0, "text": "Does anyone know how to pick up the phone? Serious question. I've tried calling for almost 6 hours now.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "109678958193365375056", "name": "Greg Smith", "time": 1605885691782, "rating": 1.0, "text": "My initial visit with Dr. Wood left me a little uncomfortable.   The person checking me in acted as if I should somehow know what to do and where to go. I had to ask questions about providing a urine specimen which I felt should have been part of their basic instruction to me. The only instruction I received was a hand gesture in a general direction with words stating to go into the bathroom and provide a specimen. I was not provided a specimen cup or told what to do with it. Asked these questions and received the answers. When doctor Wood came in the exam room 45 minutes after my appointment time, he was polite and professional but I felt rushed.  His response was to suggest a procedure based only on a urine sample. After seeing another doctor in another practice a couple of months later, it turns out the procedure recommended here was unnecessary and would have been quite painful.  Subsequent communications with the office were not very helpful, not fully informative, and at times not accurate.  I was directed to use the patient portal but when I inquired about missing information was told that the portal was not always complete or accurate. I was told a prescription would be called in to my pharmacy, only to be told at 4:30 pm the day before it was required for a scheduled procedure that I would have to come pick it up in person, and they close at 5 pm. And this was the result of a phone call I made, not a call from their office as they had ignored my previous messages. When I look at the other reviews I noticed 3 different 5 star reviews from the same individual. This fact combined with the fact that the reviews so far are either all 5 star or 1 star reviews makes me question the validity of the 5 star reviews.  I have since requested and been referred to a urologist in a different practice I am so far happy with. Turns out the painful procedure Dr. Wood wanted to do was unnecessary.  The new Dr. did some lab work and discovered my issue was treatable with a pill and the results have been great.  I also noticed that of the one star reviews this practice only responded to the 2 individuals who are listed as local guides. Apparently those of us who are not categorized as local guides are not important enough to respond to.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "102475255088753833062", "name": "Ronald Arsenault", "time": 1611752401181, "rating": 5.0, "text": "Dr. Jiminez saved my left kidney via robotic surgery thus I give him very high marks as a urologist. I also give his excellent staff high marks, especially his very knowledgeable head nurse, Danielle, who was with me every step of the way on my recovery.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "113721090207706244252", "name": "Becka Cothren", "time": 1593792142273, "rating": 5.0, "text": "I would highly recommend Dr. Woods! I met him in ER under rough early a.m. like 4 in morning circumstances in a lot of pain from a huge infected kidney stone and kidney infection. He showed me extremel kindness and concern. He scheduled me for emergency surgery that morning, and even busy, he took the time to call and explain to my family over phone and comfort me and answer my questions. He went beyond the job turning two surgeries onto one. Knowing I didn't have insurance, and had a bad experience before, he did not treat me differently then someone who did. My follow up appointments were also good. It was a very busy office and did have a wait, but it was not as terrible as everyone made it seem. Masks and social distance were in place. The nurse, who I forgot her name, was busy busy so kind and personable.  Dr. Woods remembered me even though he has 100s of patients. He relieved my pain, and answered my questions. The check out lady, Dana was so helpful.  She gave me her direct line to help me with finding lowest cost for follow ups I needed. My overall experience was amazing. It is harder then usual to get them on phone, and they are busy, but overall I would do it again! The people especially Dr. Woods made everything great!", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "101222058216945513607", "name": "Richard Carter", "time": 1595858364017, "rating": 1.0, "text": "Would give zero stars if possible. On my first visit, things took over an hour to be seen. Today just for a follow up from tests, which everything was fine and I saw Jimenez for all of 30 seconds, they still charged me $60. It’s absurd, if they would send me an email or actual mail just saying all’s well and no need to come in, I’d return in a year as they suggested. But now I will not be returning. They’re just churning out visits, 10/10 would not recommend", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "118350352655838948941", "name": "Samantha Hatchett", "time": 1565356458546, "rating": 5.0, "text": "I have been a patient since 2014. I have always been treated excellent. Dr. Brown and his staff are great. I saw some say they have had to wait. I have  too but sometimes emergencies happen. I know I am getting top rated care.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "101038801661275499526", "name": "Wendy Strach", "time": 1578516163308, "rating": 5.0, "text": "Dr. V.K. Jiminez is an outstanding physician. He made me feel relaxed and explained my diagnosis and need for surgery thoroughly. He is one of the few surgeons that specialize in Adrenal surgery. Nurse Whitney, coordinated my MRI, labs, preop appt, explained everything including how she would get authorization from insurance for everything I needed. I know I am in good hands with Dr. Jiminez and his staff. They were Awesome!!", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "115942761449838100736", "name": "Amanda Okesky", "time": 1532445074640, "rating": 5.0, "text": "I saw Dr Wood and he was great. He was very kind and very thorough. I was really nervous about a procedure, and he came in and talked to me and really helped calm my nerves. He was sympathetic and caring and took the time to explain everything. I appreciate him so much. I highly recommend him!", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "103917203381688640466", "name": "Christopher Austin", "time": 1566782039349, "rating": 1.0, "text": "My wife saw Dr. Jimenez for increasing pain in her left side. He told her she had stones in both kidneys, so there was no way it was due to kidney stone because she would be hurting on both sides. He told her to go see a chiropractor for back pain. 3 days later, I have to take her to the hospital and they find out she has a 6mm stone near her bladder and a kindey infection. They found with a sonogram and a cup of urine what this clown couldn't find with two CT scans. Not to mention his cocky attitude. It was suggested to us by another doctor to find another urologist in town. A day later, she had to have surgery. Wouldnt recommend this genius to anyone.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "106463655090622114156", "name": "Josie Carter", "time": 1531259879481, "rating": 5.0, "text": "I saw a new dr today named Dr. Wood.  He was great.  He addressed all of my problems and had a very good bed side manner.  His  staff was also very nice.  Dr. Wood would be a great choice for a Urologist.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "109153940960779195931", "name": "Scott Gray", "time": 1542647121886, "rating": 5.0, "text": "I have used Urology Specialist, Dr. Chapman for almost 15 Years. I could not be more happy. Bladder Cancer taken care of with Surgery. Dr. Chapman has done scopes regularly and very pleased with the Staff, Nurse and Dr. Chapman.  I do not understand these negatives, I could not feel anymore taken care of.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "117983776449556265582", "name": "kimberly clem", "time": 1533071334695, "rating": 5.0, "text": "Took my father to see Dr. Wood who is new to the practice. We both liked him very much. Staff was helpful as well", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "100572035398115606123", "name": "michael chamberlain", "time": 1582819731312, "rating": 1.0, "text": "You can not speak to anyone on the phone! Very unprofessional and unacceptable!", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "111303473920098089447", "name": "Ari", "time": 1539528436772, "rating": 5.0, "text": "These doctors may run behind SOMETIMES but they are the best doctors PERIOD. Whatever infraction they make with bedside manners or staff miscommunications, they make up for it with EXPERIENCE and SOUND JUDGEMENT. I am a nurse and I have worked with them and my mother and my grandfather see them as patients. I would trust any of them with my life.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "104997800592983242922", "name": "Bill Boykin", "time": 1439420779543, "rating": 5.0, "text": "My doctor, Dr. Chapman was a great choice to handle my \"concern\". He impresses me with vast experience and a demeanor over and above appropriate for the medical profession. I give him (and staff) high marks.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "107386527476150013491", "name": "Andrea Maples", "time": 1520896187869, "rating": 1.0, "text": "My husband had an appt at 4.  The office closes at 5.  Procedure was just started at after 6.  It's the lack of communication that makes this the most frustrating.  I understand running late, but is it to much to let a patient know that you are running 2 HOURS behind?  There was no wait taking our copay.  I guess that's the priority.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "110919992707160676083", "name": "Kevin", "time": 1529642324244, "rating": 1.0, "text": "My 77 year old mother's doctor is Keith Jiminez I call his office for my mother cause she has questions about her bill. I first talked to Jenifer I was trying to explain to her her that mom's insurance is BC/BS of Michigan and not Alabama and we think they have billed the wrong insurance. Jenifer puts me on the phone with Julie and she asks me if I am some idiot from Michigan calling down there! I could not believe what I was hearing!!!! I explained no that we lived in Alabama and I was calling about her account. She still never apologizes  for her behavior! I have never been treated so rudely by a doctor's office staff! We will be looking for another Urologist. Apparently they have no respect for their patients!  We don't have to put up with this treatment, there are plenty other urology practices in Huntsville.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "111153382654822366050", "name": "Tim Champlin", "time": 1575913012458, "rating": 1.0, "text": "Still waiting appointment at 9am got here at 8:45 to do paperwork it's now 11:12. Very poorly run clinic", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "118370656283189407912", "name": "Anthony Scacca", "time": 1467337629033, "rating": 5.0, "text": "Dr. Chapman and crew are great. I had a torn frenulum, had a quick visit to explain, and another go fix it up. Everyone there is super nice. I would recommend his service to anyone who would need it.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "118396418325273440110", "name": "G", "time": 1556460982393, "rating": 5.0, "text": "Nicest staff and most wonderful  doctors!", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "107894915571765125021", "name": "BOBBY HOPKINS", "time": 1517256690060, "rating": 1.0, "text": "I have called on Thursday (1/25/18), Friday (1/26/18) and today (1/29/18) as of this time I have not received a reply from this place.  Message says they will return your call the same day and if called after 3:00 - it will be returned the next day.    What a way to run a business.  I will ask my Doctor to make me an appointment at some other place.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "118326640492881322261", "name": "Crystal Moore", "time": 1565994674136, "rating": 1.0, "text": "The doctor we seen is fantastic but the staff and office people and nurses is horrible", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "103509358009653108615", "name": "Irmis A.A", "time": 1495126798169, "rating": 1.0, "text": "Dr.  Flatt never took the time to explain NOTHING. got in the room for 2 minutes and then sent the nurse with some instructions for a test,  and never gave us the chance to ask some questions and concerns. After He got the test results,  He just sent a copy by regular mail to our house but never explain NOTHING again, so I had to stop by the office and get some answers,  but apparently He's too busy to take 5 minutes to talk with his patients. He just helped with one my husband's problems,  by giving him some prescription but on the other one He didn't even explain what can help or make it worse, He didn't even give him a treatment or something that might help. So frustrating!!", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "113357508955169562550", "name": "Brax Hanners", "time": 1531273263036, "rating": 1.0, "text": "Terrible! Dismissed every symptom, did ZERO tests and suggested a warm bath after waiting 1 1/2 hours past the appointment time.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "104096141400909843448", "name": "Anon Amous", "time": 1555514848366, "rating": 1.0, "text": "Rude staff. Long waits. They seem busy - must have enough business and don’t want mine.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "109115748179973923331", "name": "Megan Roberts", "time": 1533759239406, "rating": 1.0, "text": "Very rude staff!", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "113102924877299807686", "name": "Denise Miller", "time": 1539951741614, "rating": 1.0, "text": "Poor service, horrible experience.  Will never return.", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "104699100627362068529", "name": "Alberto Bartolomei", "time": 1497629749508, "rating": 1.0, "text": "Had to wait 1 hour past my appointment time to get called in...", "pics": null, "resp": null, "gmap_id": "0x8862133af32551f9:0x5b071313136561a8"}
{"user_id": "109846666760030974775", "name": "Sue S", "time": 1623775991072, "rating": 1.0, "text": "Absolutely horrible! Most unprofessional place ever encountered. Definitely all about collecting the money and NOT ABOUT THE PATIENT/HUMAN standing before them looking for help! Find a private practice, do NOT send your loved one here!!!", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "114145745527545906390", "name": "Jacque Mccants", "time": 1617242732405, "rating": 5.0, "text": "The drs. were great taking care of my husband.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "100296866654054094575", "name": "Nettie. Fowler", "time": 1617663909432, "rating": 5.0, "text": "They was great very careing doctor and nurse and staff member", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "100746307723335970509", "name": "David Connolly", "time": 1615837946149, "rating": 5.0, "text": "Service was quick and courteous.  Thanks.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "113121781149093970983", "name": "stephanie dinkins", "time": 1608064866874, "rating": 5.0, "text": "EXCELLENT SERVICE, THE STAFF IS VERY PROFESSIONAL & VERY KIND.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "117643759670590368339", "name": "James Irby", "time": 1598642453457, "rating": 5.0, "text": "I had a contrast CT Scan the staff and Dr Frischhertz was the best.A true asset to his profession.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "105517004791550963737", "name": "Jamika Black", "time": 1595968311942, "rating": 1.0, "text": "These guys are a joke. I've been going to Dr Reardon for about 2 years now. You know what nevermind.\n\nHow do you not see kidney stones but you call in medicine for kidney stones.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "103474969713475596373", "name": "Frank Myers", "time": 1576294675589, "rating": 5.0, "text": "I have been using Urology Associates of Mobile for almost 12 months. They have been very thorough and absolutely professional!! I would recommend this group to anyone, especially family!!\nThanks so much for helping me!!", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "114873823857950814911", "name": "Diane Keith", "time": 1561059707866, "rating": 5.0, "text": "I had a very bad kidney infection that was extremely painful my primary care was trying to help me with. Nothing she did was working so she sent me to your office. I was treated immediately and diagnosed quickly. Now I am feeling so much better!! The nurses were fabulous and the doctor top notch. I would highly recommend this office!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "107583952547606071606", "name": "Deborah Hodges", "time": 1560822293894, "rating": 5.0, "text": "Dr. Paul Scott has been my urologist for 15+ years. I trust him completely. I have suffered with many kidney stones, and he has taken extra care to ease my pain and discomfort. I have had multiple lithotripsies, and surgeries over the years including three this past year. If you are looking for a caring, professional doctor, I highly recommend Dr. Scott.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "104905072617524466844", "name": "Laci Cunningham", "time": 1559075618116, "rating": 1.0, "text": "This has been one of the worst experiences for my husband. He had a Vasectomy on Friday and something clearly went wrong because when we got home he just about went in to shock from the pain. We called and spoke with the doctor and he said that it was normal. My husband did everything he was suppose to and got worse and worse and after speaking with the On call doctor , he advised him to go to the ER on Sunday. He was sent home with stronger pain meds and this still has not worked. The office was closed on Monday for Memorial Day and it is now Tuesday. We have spent ALL day trying to get someone on the phone and we have left 3 messages with the answering service due to them having phone issues. We decided to drive to the office at 12:30 and we were told that all doctors were in surgery and a nurse practitioner would be available to speak with at 2pm.  So my husband couldn’t even speak with anyone regarding his emergency situation. We called again and left another message with the answering service and it’s 3pm and we still haven’t heard anything and we are back here at the office again trying to get answers. We will NEVER come here again.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "103839155144003731752", "name": "Frank Myers", "time": 1564169419454, "rating": 5.0, "text": "I have had a Prostatectomy and my catheter needed some attention. I live two hours away from the Doctors Office. I called and advised of my situation and they had me an appointment to see the CNA within 3 hours!!! Amazing results and greatly appreciated.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "113578608363820966295", "name": "alan berthiaume", "time": 1583895998433, "rating": 5.0, "text": "Great visit the Doctor and Nurses were 10's", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "104227050622021522809", "name": "Tammy", "time": 1539739732115, "rating": 1.0, "text": "Horrible experience. I have a extensive history of kidney stones and surgeries that accompany them. I was referred by Providence Hospital Emergency room. I have been in extreme pain and nauseous for several days. I went in this morning at 8am and was seen at 10:30. I was seen by a nurse practitioner and then diagnosed by Dr. Scott who does not want to discuss anything other than his years as a doctor and that I have stones in both kidneys that cannot possibly be hurting. I also have a prolapsed bladder due to a bladder sling that was done a little under a year ago. He wouldn't even look at it or request my records. He had absolutely no compassion about a painfull and embarrassing  issues. I have had several Urologist over the years and I WOULD NOT RECOMMEND DR. SCOTT. I am now in the same pain with the same major problems that the Emergency Room treated appropriately. I have no idea what to do, but to pray and hope that I can find a doctor that will do the repair of my sling and remove the stones. Best of luck in whatever you decide, maybe another Doctor there may be more compassionate and you want leave there feeling hopeless and embarrassed like I do.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "109623208947522093677", "name": "David Brockway", "time": 1579122936930, "rating": 1.0, "text": "We have been there multiple times and have had to wait well over an hour every time just to get to go back and wait some more\n\nThe worst thing about them is the fact that they will not share test results over the phone\n\nSo you have to find a way there and some of us live way out of town\nWhich can take weeks  for them to tell you whether or not you have cancer\nThey make you worry all that time, make family or friends take off work and lose money, just so they can make you come in to the office again so that they can make more money\nThey have no shame praying on the old, poor and disabled\nI have begged them to share information about test but each time it's another office visit", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "110693541535811424551", "name": "Breanna Myrick", "time": 1542839474811, "rating": 4.0, "text": "I have gone to multiple doctors trying to figure out what’s going on with my bladder. Dr. Reardon new instantly the route to take and now I feel like I’m moving in the right direction. Didn’t give 5 stars because I waited in the lobby a long time to see the doctor.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "109323910736070971240", "name": "Ira Madsen", "time": 1547682123794, "rating": 4.0, "text": "I called about a potential red-flag.  I am a cancer survivor, always alert to changes.  I was \"worked in\" for xrays and a session with Amanda from Dr. Stevens office on short notice. I arrived early, yet was checked in and xrayed without ever sitting in a waiting room chair!  Excellent, friendly, patient techs wasted no time, yet I never felt rushed.  I moved along upstairs to Dr. Stevens office.  Always courteous and efficient check-ins there.  I received tests I didn't expect, but Amanda explained the troubleshooting/process-of-elimination reasoning in a way that made sense.\nMy fears were allayed, and the usual doctor visit frustrations didn't figure into this experience. I return soon to see Dr. Stevens,  which I always look forward to.\nAs an aging man, I usually dread doctor visits.  Not so with \"Dock Harbour\" Stevens and the Angels at Urology Associates.\n\n(Nobody is perfect.  I don't believe in 5 stars.)", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "106696584894575607312", "name": "Mal Beaverstock", "time": 1565210875711, "rating": 5.0, "text": "Went for just lab work. Very efficient and quick.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "114384512840497196406", "name": "Tonio Will", "time": 1543632246887, "rating": 5.0, "text": "Providence Urology Associates of Mobile gets they're job done,and treating you with much respect!", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "113034886460488293334", "name": "Ron Wallace", "time": 1510761073831, "rating": 5.0, "text": "Excellent, outstanding; not a better Physician in Mobile than Dr Paul Scott.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "105188475639751393628", "name": "Krystal Palladino", "time": 1478282241662, "rating": 5.0, "text": "Great doctors! Down to earth, smart, caring doctors and staff.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "103688643081279068583", "name": "Linda Paragone", "time": 1568316391517, "rating": 5.0, "text": "Efficient and kind staff", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "106139966854174982437", "name": "Nick Bolanos", "time": 1566846642950, "rating": 5.0, "text": "Everyone was extremely helpful", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "112207341363379626190", "name": "CRNA Schedule", "time": 1540410501680, "rating": 5.0, "text": "Lab was drawn quickly & painlessly! Thanks!", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "108550053659376039865", "name": "Stanislav B", "time": 1528471578960, "rating": 2.0, "text": "What’s the point of the appointment if you get called 30-45 min after", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "108141581130952606364", "name": "Jessika Bailey", "time": 1516629904764, "rating": 2.0, "text": "Google says they open at 8am they dont open till 830am. 😒😒😒", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
