{"user_id": "107259739245700973708", "name": "Wanda Olinger", "time": 1619470729270, "rating": 1.0, "text": "This is the rudest people I have ever seen. Go to Dr. Wade in Fort Payne. Nicer and more professional.", "pics": null, "resp": null, "gmap_id": "0x8861eee2740664d5:0x94c88fcce36cf52"}
{"user_id": "108527942023358595844", "name": "Silver Hawks", "time": 1617216391951, "rating": 1.0, "text": "Bad doctor office ! Don’t go here ! This doctor will take you for granted and put you in your grave before u know it ! These people are very rude and nasty. The doctor will tell u that your cancer is spreading when it isn’t and put u through radiation treatment and chemotherapy for no reason !", "pics": null, "resp": null, "gmap_id": "0x8861eee2740664d5:0x94c88fcce36cf52"}
{"user_id": "108735122549203807600", "name": "Andrew James", "time": 1546522729170, "rating": 5.0, "text": "Haven't had a doctor visit but the advertising is super creative!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOJh-FqlMbajUCAK8Qza_dERM199qaphs4-b9Np=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOrV5D0IN1gGaeV1hUglpK3iJuq8yekgqAf4Kvk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8861eee2740664d5:0x94c88fcce36cf52"}
{"user_id": "110925303310619298225", "name": "sunsportpro", "time": 1597200443444, "rating": 5.0, "text": "I’m nearing 60 years old and have seen many urologist over the years and my first visit with Dr. Pritchard was outstanding!!!! No judgment! No embarrassment, friendly and very thorough throughout the entire visit!!! He preformed the complete exam and I wasn’t rushed through like cattle in a sale barn. He took his time, he listened to everything I had to say, and for some reason I felt like I was talking to a friend and not a doctor. I felt totally at ease!! So I’m just saying guys don’t put off seeing a doctor and keeping a check on your health!!! With Dr. Pritchard, it’s so simple!!! With the medication he prescribed I finally feel normal again!!!\nDr. Pritchard, I can’t thank you and all your staff for a making me feel welcome and at ease with my visit!!! Looking forward to my next check up to personally thank you 🙏🏻 for improving the quality of my health!!!", "pics": null, "resp": null, "gmap_id": "0x887d37d4c881c531:0xf1868b9592e63eff"}
{"user_id": "107461451662400286314", "name": "Michelle Summers", "time": 1482452052753, "rating": 1.0, "text": "I had a heart attack and open heart surgery in Dec 2010.  I sought medical treatment ECM Hospital in Florence, AL.  Dr. Prichard was my Urologist.  I am a 100 % service contacted veteran.  Since there were no nearby VA Hospital I went to ECM..  I instructed ECM OF my Medical coverage the VA.  And all my Drs.  They have 90 days to submit to VA for coverage.  Dr pritchard office was told about this as well on my followup visit after I was released from hospital after 8 days.  The bill was like $182.  After numerous attempts to remedy this Dr Pritchard keeps selling my bill to collections since Dec 2010.  Disgusting. Way to treat a Navy Female Veteran. All of my hospital bills from the heart surgery and everything while staying in the hosp. for 8 days was paid my the VA.  If Dr Pritchard office followed protocol and submitted to VA withing 90 days instead of over 6 months he to would have been paid.  A copy of this will be sent to the Alabama Atty General.  This is affecting my credit even though I have been disputing this for over 6 yrs.", "pics": null, "resp": null, "gmap_id": "0x887d37d4c881c531:0xf1868b9592e63eff"}
{"user_id": "108629252613041934875", "name": "Jim Fisher", "time": 1469476699745, "rating": 5.0, "text": "I've been under his care for years. He is patient, takes plenty of time to explain the issues, and quite competent and professional.", "pics": null, "resp": null, "gmap_id": "0x887d37d4c881c531:0xf1868b9592e63eff"}
{"user_id": "114141915961091992785", "name": "Red Tree Realty", "time": 1516632570821, "rating": 5.0, "text": "Dr. Pritchard is the best around hands down.", "pics": null, "resp": null, "gmap_id": "0x887d37d4c881c531:0xf1868b9592e63eff"}
{"user_id": "110299547378232787767", "name": "Sheri Mitchell-Clutts", "time": 1512149992992, "rating": 5.0, "text": "He's a nice patient doctor that truly tries to get your problem solved!", "pics": null, "resp": null, "gmap_id": "0x887d37d4c881c531:0xf1868b9592e63eff"}
{"user_id": "108527779042446248172", "name": "Ray Uzun", "time": 1597064051810, "rating": 4.0, "text": "I loved working with dr. Hicks about my kidney stones. He is very friendly and knows what he is doing. They did have us wait a while and we were confused because the nurse practitioner came in with the wrong chart and argued with me about the mm of the stone. She told me to pass it on my own. Thank goodness dr. Hicks saved the day with MY CORRECT CHART  and I was promptly scheduled for surgery.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0x7954fdb7668a266d"}
{"user_id": "111046813934210185009", "name": "Rosemary", "time": 1578585048174, "rating": 5.0, "text": "Dr. Hicks is wonderful! We loved him and his staff when we met them. Then he performed a surgery that was a success!", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0x7954fdb7668a266d"}
{"user_id": "103599986729025969558", "name": "noplastictrees", "time": 1525811583380, "rating": 5.0, "text": "Dr. Hicks and his staff are probably the most friendly, caring, and attentive group of professionals I have ever had the pleasure of treating me. Other than the 13mm kidney stone I'd say it was an all around pleasant experience. I only wish he was a general practitioner so I could have him as my doctor all the time.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0x7954fdb7668a266d"}
{"user_id": "109061335516806719166", "name": "Samantha Pinter", "time": 1531770812485, "rating": 1.0, "text": "Misdiagnosed my daughter multiple times. Kept giving me meds for UTIs when in reality she was constipated and the poop was pushing on her bladder. Problem got so bad she now has lost nerve function. They even admitted to it. Sad that this is the only practice in town because its hard for me with 4 littles to drive to Nashville or Birmingham. Their office also hangs up on you constantly when being put on hold. I once tried for 35 min to call and get an appointment time.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0x7954fdb7668a266d"}
{"user_id": "110781041540935737859", "name": "Christopher Barber", "time": 1516838567017, "rating": 1.0, "text": "Appointment was at 3:00- arrived early to fill out paperwork. The waiting room had one patient before us. At 3:35, I politely asked the receptionist if she knew how much longer the wait would be, as we had been the sole patient waiting for the past 20 minutes, and had witnessed 6 other patients come out already.\nAt 3:48 (an hour wait at this point) we were finally ushered back to a filthy screening room where we waited an additional 38 minutes to see the \"Nurse Practitioner\" (Our appointment was with Dr Hicks) she quickly interviewed us, took a look at my son, then announced she would have to go talk to Dr Hicks (who was evidently on premises somewhere). 10 minutes later she came back and said they wanted to wait and see him in a year to let things progress naturally.. We will likely NOT make that appointment next year. This is one of the many things wrong with US Healthcare. I paid $20 out of pocket, plus whatever ridiculous amount they will bill my insurance company, for waisting two hours of my time, which is just as valuable as theirs.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0x7954fdb7668a266d"}
{"user_id": "103758225955040784497", "name": "allison blair", "time": 1518017083893, "rating": 4.0, "text": "There is waiting but the doctors and staff are great.", "pics": null, "resp": null, "gmap_id": "0x886213568664e509:0x7954fdb7668a266d"}
{"user_id": "104674123558586018307", "name": "wanda Bussey", "time": 1615840570053, "rating": 3.0, "text": "My rating is for the appointment staffing alone. I never had the chance to even meet the doctor. Last week I was contacted by the office with an appointment based upon a referral from my primary care. The lady gave me the information to find the office and date and time of appointment. We even discussed my level of insurance so she was sure she had the correct information. I took a day off work, drove an hour and a half round trip. Only to be told I didn’t have an appointment. No one was willing to even look into it or try to make another appointment for me. I was basically treated as though I had done something wrong. Mistakes happen but treating people the way I was treated by the young lady at the counter is not a mistake.\n\nUpdate added.....the office manager did reach out to me the week after I posted this review. She apologized for what had happened and told me she would look into what transpired. I appreciate her for reaching out and I hope this doesn’t happen to someone else in the future", "pics": null, "resp": null, "gmap_id": "0x8889cff7363b7569:0xf9bae7d52906c18d"}
{"user_id": "115088341813970472559", "name": "Becki Tucker", "time": 1599233802969, "rating": 5.0, "text": "Dr Wallin was very professional. His expertise in his field is exceptional. He patiently explained the problem and the procedures necessary to correct my problem. He listened to each question and answered them thoroughly. He is the most exceptional Doctor and Surgeon I have ever dealt with.", "pics": null, "resp": null, "gmap_id": "0x8889cff7363b7569:0xf9bae7d52906c18d"}
{"user_id": "108099971213409798368", "name": "Tomar Crauswell", "time": 1598485031219, "rating": 5.0, "text": "Great Doctor and great staff. Every thing was clean & well sanitized. Everything is wheelchair accessible and restroom was spotless and fully stocked.", "pics": null, "resp": null, "gmap_id": "0x8889cff7363b7569:0xf9bae7d52906c18d"}
{"user_id": "106713859725812386337", "name": "Lionel Calvert", "time": 1581180637762, "rating": 5.0, "text": "A very knowledgable  professional in what he does. He takes time with you to explain all options and is thorough in what your needs may be.", "pics": null, "resp": null, "gmap_id": "0x8889cff7363b7569:0xf9bae7d52906c18d"}
{"user_id": "111967622810775475892", "name": "Kerstin Kistler", "time": 1630004565946, "rating": 5.0, "text": "I switched to SWC and Dr Cooper after I had a traumatic birth experience at another BHM hospital. Dr Cooper and her staff are lovely and kind. They truly care for their patients and listen.  The midwives are fantastic and when I went through my second pregnancy I felt that I could trust them with my care. I recommend this place to every women who desires to be treated with respect and who wants her voice to be heard. They are very friendly towards natural birthing, breastfeeding and low intervention.", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "110230002038362439113", "name": "Angela Hollis", "time": 1625199867191, "rating": 5.0, "text": "ENT office was nice and clean. Very fast and timely service. Dr. Clark was awesome. He was very thorough.", "pics": null, "resp": {"time": 1625547432358, "text": "Thanks for the review!"}, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "111966200698929126002", "name": "JoAnn Flood", "time": 1605977308692, "rating": 5.0, "text": "The doctors are wonderful. Love my doctor. Dr Williams is my Dr. He is a very caring and concern Dr. About your health. I don't like the idea of paying all that money to park when you are there for a doctors appointment. I can understand if you were parking to visit someone. You have to pay copay, pay for medicine and pay to park. There should be free parking for doctors visits or a discount.", "pics": null, "resp": {"time": 1605903725127, "text": "We're so glad you had a good experience with us! Thanks for your review, JoAnn."}, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "113604342897260487632", "name": "Felisha Chism", "time": 1614014961571, "rating": 5.0, "text": "My mother’s physician is Dr. William Kirby. He and the nurse staff are absolutely excellent. Always caring. Always flexible and patient. They are about patient care. I would highly recommend this clinic.", "pics": null, "resp": {"time": 1614369076843, "text": "Thanks for your review Felisha! We always try our best to give our patients the quality care they deserve. Let us know if we can do anything else for you."}, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "115281566287393458047", "name": "Bellalinn", "time": 1619027473189, "rating": 5.0, "text": "Dr. Ballio is a very nice and professional doctor. Staff is always kind and smiling. Just saw a new GYN doctor Ballio sent me to. Her name is Dr. Collins and I found her to be very nice. She addressed everything I spoke of and treated me with dignity. This is so important.", "pics": null, "resp": {"time": 1619189753907, "text": "We're glad you had a nice visit with us, Bella!\n\nThanks for your review too!"}, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "101542394593077226835", "name": "Brooke Quintero", "time": 1600384936977, "rating": 5.0, "text": "Dr. Cooper is absolutely amazing. She made my second Birth and PP experience The best I could ask for and more. The Nurses are so kind and genuinely love their job and serving you. The midwives are equally amazing and will be right there with you through labor. Best Labor and Delivery in Birmingham. Hands down.", "pics": null, "resp": {"time": 1601054778912, "text": "Brooke, thank you so much for the positive review.  We wish you and your family the best!"}, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "103070706407070161500", "name": "Tammy Price", "time": 1629171722321, "rating": 5.0, "text": "Easy in and out .Friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "102612551660874626757", "name": "Aminah Shah", "time": 1610554222128, "rating": 5.0, "text": "I’ve had great experiences with the doctors from Simon-Williamson clinic that I’ve used: Dr. Tibbetts (pediatrics), Dr. LeCroy (ophthalmology), and Dr. Wood (internal medicine). There were a couple of doctors that have left the clinic but who were also wonderful. I’ve found the staff to be generally very nice and helpful. Parking is a little pricey, but that’s just part of it. It’s not the clinic’s fault.\n\nI’ve signed up for the health records app, and most of my doctors have been very timely in recording results.\n\nOverall, I am a happy client of SWC.", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "110967872655916869508", "name": "ArianaSaré P.", "time": 1605896722535, "rating": 2.0, "text": "This place charged me for someone else's bill; it's been 3 weeks and they still have not refunded the money they owe my husband and I. They are so unprofessional, I do not recommend.", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "112227062756994831163", "name": "Alexcia", "time": 1597937417635, "rating": 1.0, "text": "Worst hospital ever!!!! Dr. William Kirby and his NP Samantha Williams are the most incompetent people in the medical field. They refuse to run necessary test to rule out various health conditions and then when you fight for medical care they dismiss you as a patient. If you want to die this is the place to go. If otherwise go to UAB.", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "108289249085377010479", "name": "Sharrah Gibson", "time": 1498835312828, "rating": 1.0, "text": "I'm originally from Birmingham and I just recently moved back to Birmingham, so I called the Simon-Williamson clinic today to establish care w/ a primary physician.  I think the person I talked to over the phone name was Donna. And one of the 1st things she said to me was \"none of our doctors prescribe long term pain medications\".  Then she asked me what current medications was I on? Before even really trying to figure out my need I fell like she automatically assumed with her questions and her tone that I was a drug seeking patient with numerous heath concerns.  Even when I told her I'm just new in town, and just wanted to establish care w/ a physician, she still did not listen to me.  She proceeded to tell me that most of the doctors that are accepting new patients will have to receive my medical records and review them 1st before taking me on as a patient.  She told me to go to the website, look at the doctors then call her back.  I've never had this type of customer service before in my life!! 😩😡 I felt like she made so many assumptions w/o discovering my real need.  I'm a healthy 32 year old that just wants to be proactive w/ my health.  You do not only have to go to the doctor when you are sick!!", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "110231408976853333539", "name": "Hannah Miller", "time": 1566229323951, "rating": 1.0, "text": "I made an appointment 2 weeks prior to today and confirmed it with a receptionist over the phone who was not very personable to begin with. I was told how to get here, what floor, what time and even to arrive early. I arrive and the receptionist tells me that she doesn’t even have me scheduled for an appointment yet she took my personal information over the phone! This is ridiculous. She then proceeded to ask if I’d like to schedule an appointment. I did not drive all the way up here to schedule an appointment! I will be finding a new primary care physician. My time, energy, & pto has been wasted today.", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "113714870715404281307", "name": "Josh B", "time": 1539118117345, "rating": 2.0, "text": "Had a child at Princeton, Dr. E. was assigned to us as a pediatrician while in postpartum.  Dr. E. seemed knowledgeable and friendly in the two times he visited us after the birth. The first time he gave our baby an exam and \"tested\" his reflexes.  The second time he came by was similar to the first. Together both visits cost $240 and were less than 30min each. In addition to Dr. E's visit we were discharged by Dr. T.  Dr. T. did less than Dr. E. though the visit was similar to the other two.  $100 for less than 30min as per statement.\n\nAs a cash paying patient, I would have liked to have been notified of the additional charges ahead of time. In addition, I would have expected a higher quality of care for what i was charged. Overall, one star per Dr and minus three for the unnecessarily expensive and deceptive billing practices.", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "112222404269974912653", "name": "Megan Rowe", "time": 1533230889246, "rating": 1.0, "text": "If 0 Stars was an option I would leave it for the primary care physician staff at this clinic. Appointment times are changed without notification and there is NO patient consideration when it comes to time. The staff is very unhelpful and was refused to be transferred to the patient care representatives by the operator. If you have the ability to use a different clinic I highly recommend it. Birmingham is full of wonderful internal medicine physicians but the staff at this clinic makes the experience negative.", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "118394747587989955241", "name": "Terri Ward", "time": 1564685586688, "rating": 1.0, "text": "I worked there and it was awful. I've never worked with doctor's who didn't care about people, like those there. I worked with Dr. Cotton and she would get mad at me for helping our elderly patients fill out their paperwork.  She would say \" if they needed help, they should've brought their family with them\". That is just the tip of the iceberg. Most employee's were nice, but I would never want a doctor from there.", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "106798664875747468633", "name": "Google User", "time": 1555984241458, "rating": 3.0, "text": "I love the doctors. They were so good to me during my pregnacy and was willing to answer any questions I had as a new mom. My son sees the peditricion there. The only thing that makes me not wanna go to our appointments is having to pay for the parking. I moved here from another state and I've never had to pay to get out of the parking lot.", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "118281192469007414634", "name": "Debra Parker", "time": 1621416831967, "rating": 4.0, "text": "It was very busy...", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "107960155749652872954", "name": "Albert McWilliams Sr", "time": 1571240744349, "rating": 1.0, "text": "I do not recommend this facility. I don't believe their primary concern is quality healthcare. Many of the staff members are very adversarial, and cavalier in their interactions with patients.", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "106427196889554845820", "name": "Marilyn Evans", "time": 1424281882791, "rating": 4.0, "text": "Leia the operator is at SWC gives very good customer service. I was not having a good day. She made me feel better by being very courteous to me. Thanks Leia.", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "103398393359293923892", "name": "hugh darty", "time": 1558555615350, "rating": 1.0, "text": "Get ready to sit in the waiting room for hours. Came over to pick up a pair of replacement hearing aids and now am 1.5 hours past pickup time and no end in sight. Been trying to get these picked up for two weeks as they have been here that long according to their representatives. Very unorganized. Had a brother in law sit here all day once as they lost his appointment in the system.", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "102719202108816718773", "name": "Charles Pace", "time": 1546800261856, "rating": 1.0, "text": "Do NOT see Dr James Lindsey. He has been my doctor for 30 years. Liked him better when he had his other nurse, not WENDY... She has screwed up my meds more times than I can count. When my mom was sick with cancer, he told us (the family) that we should leave the hospital room and pull the plug .She lived 4 more months WITHOUT PAIN, thanks to another doctor.   Wendy left me a message, that I still have, telling me that Ambien 10 is going To be discontinued, I contacted the manufacturer. They said they weren't doing any discontinuing.  I called to see about signing a release for my medical records to be sent to another doctor (because he would not fill my diuretic or Ambien) both I had been on for years with no side effects, Wendy called my pharmacist and deactivated all my meds .Thank God I got the refills before this happened. Anyway, tons more\nGoing to file with the Board, BBB ETC .", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "114562763684558359345", "name": "Mandy Jones", "time": 1561543548076, "rating": 1.0, "text": "I had surgery here and I didn't receive but a low dose of pain meds while in tears begging to go home talking to my nurse singing my papers she was like wow no wonder your hurting so bad she did read my chart what if she had given me the wrong medication also I was paying what I could every month but they turned in over to a collection agency so now it goes on my credit the are just money hungry and dont care about you they also let homeless people and drugged up people set in the ER waiting room they beg for money and try to steal your stuff if you go here good luck.", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "113049713112587504049", "name": "daphne richardson", "time": 1506747990096, "rating": 1.0, "text": "I recently visited Dr. Williams (OBGYN), she was very informative and attentive but her nurse was very rude.", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "101513099831135461778", "name": "Brenden Perry", "time": 1473780347488, "rating": 5.0, "text": "SWC and the doctors/nurses there have always been so  helpful and have always been there to assist with every medical need! I would recommend SWC to anyone that needs specialized care!", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "117570992175859480193", "name": "Lanard Crawford", "time": 1499276293487, "rating": 1.0, "text": "Dr.C.Harris and his nurse especially Paula C are the worst people I have ever met all they want to do is keep on using your insurance he kept on telling me different stuff of wrong with me he must need to go back to medical school cuz he is doing in my opinion the worst doctor I have ever came in contact with and his staff are so rude and the doctor office is so nasty my opinion don't waste your time everytime I call I never got a return phone call he don't have time for his patients please don't waste your time going there", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "105722964251617397500", "name": "Grey Peterson", "time": 1570543367293, "rating": 1.0, "text": "The person who answers the phone is rude.", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "105763244207749574550", "name": "Corey Crawford", "time": 1501398220324, "rating": 1.0, "text": "I   had to   get a new doctor  cause Dr.harris was only concerned  about money he didn't  care about my health  I hate I wasted  my time  wouldn't  recommend  him to  a dead dog and the staff is awful", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "103231592723838494755", "name": "R Devon Peoples", "time": 1556043341735, "rating": 5.0, "text": "They are pleasant, clean, helpful", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "116996806613234405583", "name": "Senator Bates", "time": 1611035549913, "rating": 1.0, "text": "Try another hospital please!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "115245696097380000637", "name": "Barbara Sturdivant", "time": 1394227258720, "rating": 5.0, "text": "Great  staff", "pics": null, "resp": null, "gmap_id": "0x88891c2353baef7f:0xc564c0e03a42728"}
{"user_id": "105514768479965026947", "name": "Tomeshia Herbert", "time": 1569179562545, "rating": 5.0, "text": "Dr.Terry is the Very Best Doctor that I have had. My experience was alot different than most. Almost 4 to 5 years ago I found out that I was near death and only had one kidney. Other doctors that were assigned to my case wanted to remove that one kidney and place me directly onto dialysis.  Dr.Terry was just so happening to be walking by and heard was going on,came in talked to me Even Prayed with me. He then became the doctor over my case. He helped me fight against having to be on dialysis.  I didn't have to be on dialysis for years then. I thank God for this Guardian Angel. I'm not gonna write to much. But Dr.Terry is completely an amazing doctor. A GUARDIAN ANGEL to most. I would recommend him to anyone that has similar issues as mine or to anyone that needs an amazing Urologist here in Mobile.", "pics": null, "resp": null, "gmap_id": "0x889a4d7687d412a5:0x4975ae0302a19453"}
{"user_id": "107562302419175106092", "name": "Khalid AlOgbi", "time": 1547188383914, "rating": 5.0, "text": "Before my first visit to Dr.Terry, I was treated by other two urologists and the strange thing was that the first dr said I do not think you have (let's call it  A) and I asked him what is it? he said I do not know but I will treat it as it was (A) I was in pain and nothing he prescribed worked, so I went to another and surprisingly he said the same thing and done the same procedures. I was in pain and none of them was willing to think outside of the box or wonder if this patient is not improving after 8 months so the diagnosis must be wrong.\ntill I went to Dr.Terry, he said I do not think you have (A) I asked him so what do you think and he took a totally different approach to my case and he reached a diagnosis, and I started to feel a little better, and with every visit he was re-evaluating my sickness carefully, I would say I am now 95% better and improving than the time with the other first two. I feel normal again.  This Dr teaches at the University which means all the weird cases and the traditional ones are present in his mind so he will not deal with you based on what is the common cause with other people like your case or will approve what others would think,  he does his own assessment. his work is backed with scientifically proven methods and he will personalize your treatment plan to your needs based on what the science has proven to work. I highly recommend him. his clinic has a great staff, friendly front desk, and wonderful nurses. you will be taken good care of if you go to his clinic. Thank you Dr.Terry and to your staff!", "pics": null, "resp": null, "gmap_id": "0x889a4d7687d412a5:0x4975ae0302a19453"}
{"user_id": "103844637911169206865", "name": "Shunniece Drakes", "time": 1538759780197, "rating": 5.0, "text": "Great doctor! Always kind and listens to you. Very informative. Knows his job very well.", "pics": null, "resp": null, "gmap_id": "0x889a4d7687d412a5:0x4975ae0302a19453"}
{"user_id": "107678325979178734546", "name": "Seth Novak", "time": 1547821922288, "rating": 5.0, "text": "Dr Terry is kind and compassionate to his patients the best Doctor  I seen in Mobile the staff in his office are the sweetest as can be I highly recommend doctor Terry", "pics": null, "resp": null, "gmap_id": "0x889a4d7687d412a5:0x4975ae0302a19453"}
{"user_id": "109968194745507666422", "name": "HumphreyDontBogart", "time": 1555518306403, "rating": 5.0, "text": "Always willing to listen and answer questions and very kind. Really like Dr Terry.", "pics": null, "resp": null, "gmap_id": "0x889a4d7687d412a5:0x4975ae0302a19453"}
{"user_id": "106527719078979434388", "name": "Michael Jenkins", "time": 1572287339440, "rating": 5.0, "text": "Very impressed with Dr. Boemer.  She's friendly,  down to earth, and obviously very skilled in her profession.  I will say that it takes a while to get a return call from her staff, but other than that I  have no reservations in referring her to others!", "pics": null, "resp": null, "gmap_id": "0x889a0dbf48dcf1e7:0xd1b0dafd0efa06e3"}
{"user_id": "116318409224709167030", "name": "Tiffiney Busby", "time": 1572878254490, "rating": 5.0, "text": "She goes over and beyond. She will personally follow up with you on her off time to make sure everything is going well. Highly recommend Mrs. Boemer.", "pics": null, "resp": null, "gmap_id": "0x889a0dbf48dcf1e7:0xd1b0dafd0efa06e3"}
{"user_id": "105306962269761326750", "name": "Kenneth Taylor", "time": 1549418631502, "rating": 5.0, "text": "Dr Boemer recently surgically removed my left kidney along with a large cancerous tumor and tissue. What started as a 2 1/2 hour surgery lasted for over 4 hours . I am happy to say Dr Boemer claimed I am now cancer free. She checked upon my status every day after surgery and even called me at home. I highly recommend her should one need a Urologist.", "pics": null, "resp": {"time": 1549463993776, "text": "Thank you for taking the time to write a review. We are so glad you had a great experience with us! We will make sure to pass along your comments to Dr. Boemer."}, "gmap_id": "0x889a0dbf48dcf1e7:0xd1b0dafd0efa06e3"}
{"user_id": "101481537281126751875", "name": "Barb", "time": 1561212899282, "rating": 5.0, "text": "Very knowledgeable and great bedside manner. She gave a diagnosis that was not even related to kidneys. She knows her stuff!!!!!", "pics": null, "resp": {"time": 1561383584173, "text": "Thank you Barb for taking the time to leave a review. We are happy to hear that you had a great experience with Dr. Boemer and we will be sure to pass along your comments to her and her staff!"}, "gmap_id": "0x889a0dbf48dcf1e7:0xd1b0dafd0efa06e3"}
{"user_id": "102404689353238605838", "name": "Jason Hulsey", "time": 1627311045194, "rating": 5.0, "text": "Awesome patient care, really clean facility and staff were speedy.", "pics": null, "resp": null, "gmap_id": "0x8889c9356304bcb5:0x5ac41bbb4fa8b79e"}
{"user_id": "113574496445257899823", "name": "perry humphries", "time": 1610412937000, "rating": 5.0, "text": "Geat staff and Doctors", "pics": null, "resp": null, "gmap_id": "0x8889c9356304bcb5:0x5ac41bbb4fa8b79e"}
{"user_id": "105935848951881922489", "name": "G G", "time": 1406229533746, "rating": 2.0, "text": "The doctor was very good and the wait time to see him was ok but  they asked me to stay to file for another appointment at a diagnostic center. I was told it would just take a few minutes maybe ten. I went to the lobby and waited nearly an hour. I'm not sure what the issue was but I have work today so I don't appreciate waiting any longer then needed. I went to the lobby at 1:30 asked if I was good to go at 1:40 and was told it'd be about ten minutes. Now its nearly 2:30 I've been patient and polite. So my question is how can you get some one in to see the doc faster than it takes to schedule another appointment. Imagine going to a restaurant you order your food and get it within 30 minutes but are made to wait an hour to get your tab. What sense does this make!?", "pics": null, "resp": null, "gmap_id": "0x8889c9356304bcb5:0x5ac41bbb4fa8b79e"}
{"user_id": "102000597179996727277", "name": "L. S. Adams", "time": 1516636588739, "rating": 5.0, "text": "Excellent  medical care ,great staff I highly recommend . prostate cancer survivor !!", "pics": null, "resp": null, "gmap_id": "0x8889c9356304bcb5:0x5ac41bbb4fa8b79e"}
{"user_id": "106506008189482969051", "name": "Samuel Steele", "time": 1627353711923, "rating": 1.0, "text": "I had the worst experience with Dr. Habermacher, I had went to ER with a kidney stone and was told it measured 7mm, was told to follow up with Urologist from your clinic,I saw NP on day of appointment which was very nice,I ask for a scan to be done before so we would know if stone was still there. The morning of surgery, Dr. Habermacher came into room I ask if he was going to do scan to make sure stone was gone, he replied no, it will be gone today one way or another. I had passed very small pieces of stone but definitely not a 7mm in prior week.When I awoke from procedure I was told there was no stone, after getting home I was very sick from procedure and very sore. I went for my follow-up, I told the girl that checked me in that I was upset that he did not do KUB to make sure the stone was gone also, that I am a nurse and have had enough of kidney stone patients to know how to check for kidney stones and I definitely had not passed a 7mm. She said I will tell him, she immediately came back in room and said this is a nurse visit, he wants you to do 24 hr urine and come back in 2 months. I have no intentions of ever using him again, why would you not do a KUB or scan to make sure it's gone before putting someone through this, it sounds like it's all about money to me. WILL NEVER use this Dr again.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "107560826844517747305", "name": "Nathan Herrick", "time": 1611344210315, "rating": 1.0, "text": "Received a referral from my insurance company to this clinic to see a Gastroenterologist and I cannot even schedule an appointment. For the last two months, I have called the only available phone number to make an appointment only to be transferred to the gastroenterology clinic appointment line where I have left several messages with the scheduler because that person was not there. No return calls and the office is closed on Friday.", "pics": null, "resp": {"time": 1614290855284, "text": "Nathan, we would value the opportunity to connect with you further. Our patient care team can be reached at (334) 613-7070 at your convenience. If you would prefer to speak with our Patient Advocate, please call (334) 568-4866."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "118035772244836917308", "name": "Renae Pemberton", "time": 1604533118108, "rating": 1.0, "text": "I would not recommend anyone to Dr. Habermacher. My husband and I received some news that was scary and the doctor was not empathetic towards us. He does not like for his patients to do any scholarly research to help the patient or families to be knowledgeable on their diagnosis. He will get offended if you ask questions in which he feels a patient is second guessing his medical knowledge. He talked down to us and no doctor should ever talk to people in that way. Listen to your gut or in my case the Holy Spirit if something does not sit right with you about someone taking care of your loved one. I pray Dr. Habermacher is a Christian and if not that he will come to know the love of Jesus.", "pics": null, "resp": {"time": 1606179290463, "text": "Renae, we would value the opportunity to connect with you further. Our patient care team can be reached at (334) 613-7070 at your convenience."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "106276702774166680149", "name": "Abby McNeil", "time": 1601472617242, "rating": 5.0, "text": "I’ve been a patient of dr garg for a little over a year and she’s great . Yesterday I came in and I just wanted to call out one of the endocrinology nurses , Jennifer , and tell her how kind and wonderful I thought she was at her job. Jennifer went out of her way to make sure I was comfortable during a really long glucose test I had . Dr garg also takes a whole body approach to your treatment , and it is truly worth my drive from Dothan where all our endos are retiring/booked to come to this clinic .", "pics": null, "resp": {"time": 1601482922083, "text": "Abby, thank you for the kind review. It is our honor to provide excellence in care to the people of Alabama!"}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "111188159416355907851", "name": "Jaime Denise", "time": 1608335886715, "rating": 3.0, "text": "They schedule way too many people at the same time, so the waiting time is HOURS.", "pics": null, "resp": {"time": 1614290484766, "text": "We understand your concerns and know that your time is valuable. Your feedback has been shared with our team and we thank you for your patience in this intricate season of care."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "113464080315346843401", "name": "Tony Boyer", "time": 1545582087126, "rating": 5.0, "text": "At times finding proper care that gives you the feeling your best interest has been top priority can be a challenge in the Montgomery area.  We typically go to Birmingham for peace of mind.  My first visit to UAB Urology clinic was one of the best experiences I've had anywhere.  Professional, engaging, reflective, and not reluctant to challenge the knowledge and awareness of their patients.  Dr. Habermacher understood my level of comprehension to quickly lend understanding to my concerns & how to handle my own personal health going forward.  Without being too long winded, I have to express gratitude for the opening and benefits of this clinic for Montgomery residents & anyone within reasonable distance.  Checks all the boxes both physically and psychologically to assure patients care is their top priority.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "109149654432663969534", "name": "Jeff chappell", "time": 1580739399408, "rating": 1.0, "text": "Apparently negative reviews get taken down quickly?  Dr. Thudi, an endo, has the worst communication skills.  Does not listen, assumes, and is too proud to admit mistakes.  They return calls, but only if you're waiting by the phone.  No voicemails except \"please call us back\" and you never get a live person, so it's voicemail tag over and over and over.  Add that to their \"never on Friday\" rules and you've got a setup for making money with zero customer service, much less patient service.\nAnd DON'T even think of adding a response to this about \"We'd like to talk with you about your experience\".  We spoke, we emailed, and THIS IS my response to your customer care.  Don't act like this is the first you have heard of the problem.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "110810778778295902588", "name": "Evelyn Young", "time": 1529426965919, "rating": 2.0, "text": "I have had zero problems until today. You have one number for the entire clinic. They have several specialists. So it is hard to reach the person you need. I called asking for a specific person and extension. I was asked the person last name .They did not leave a last name. I gave the extension#. I was asked what is the nature of the call. I still did not get the person that left the message. Guess if it's important they will call me back..", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "111193115751902347353", "name": "Tamra Oswalt", "time": 1570210263130, "rating": 1.0, "text": "I'm very disappointed I have been to four doctors in the past month about my foot and my toe I am in excruciating pain mobic is helping and your office closed at noon today because it's Friday well I don't consider an emergency other than I'm excruciating pain and can't walk. So what am I supposed to do?\n\nVery disappointed how the doctor he's never seen me going to know what to do for me", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "114165500896750655586", "name": "Scott Thompson", "time": 1538578909414, "rating": 2.0, "text": "Originally given 1-star: Waited for 6 weeks for an appointment just to have a consult. The Friday before the Monday afternoon appointment I get a call saying Doctor Hablemacker would be out of the office and they had rescheduled me for two weeks later in the morning instead of the original afternoon. They required me to call and confirm to keep the new appointment. No further explanation. No options given for the inconvenience. Attempted to call at 2:30 pm when I got the message, but the office was already closed. Apparently they also don’t work on Friday afternoons...\n\nUPDATE TO POST (10/18): Upgraded to 2-star.The office was able to accomidate a different appointment time since I was going to be out of the country during their first rescheduled time. Initially, they didn't have availability, but were willing to squeeze me in for the short consult given the previous circumstances. I will reconsider again after the appointment/service.", "pics": null, "resp": {"time": 1536593512763, "text": "Mr. Thompson,\nWe are very sorry we did not meet your expectations.  Please do call our office today between 8 AM and 5 PM to find a more convenient time for your appointment."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "105513552415487179721", "name": "Grover Wedgeworth", "time": 1555512481353, "rating": 1.0, "text": "Service sucks, no follow up on lab between visits, .Failed to provide consultation notes and labwork to my wife's primary doc.  Dtaff are curt cna rude", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "100199861040353856532", "name": "DeAndre Scott", "time": 1542033819723, "rating": 5.0, "text": "I have been coming to the UAB Specialty clinic to see Rheumatology. Dr. Gadea and his staff are some of the best medical professionals I have ever come across. Having worked in the medical field for 16 years (21year USAF Vet), I have worked with countless professionals. I can only highly recommend Dr Gadea and his team as their patient care exceeds the standard every visit!", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "109337083997686348338", "name": "Wendy Adams", "time": 1545164083529, "rating": 1.0, "text": "This is a poor excuse for a gastroenterology center. My husband is having issues with abdominal pain and other stomach issues and we were told by Dr. Kahn that if my husband continued to have issues that he should go back to the ER and let them call him and see if he could get in for an emergency colonoscopy. Well he went back to the ER and they ran all kinds of test and just because his blood work came back fine, the ER staff and Dr. Kahn refused to admit him and said that he would have to wait until Feb to have a colonoscopy scheduled.  So the doctor lied to both of us. Needless to say my husband is still in very bad pain. So nothing bad better happen to my husband because of their negligence.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "109629967256740502457", "name": "Andrea Curtis", "time": 1536710565402, "rating": 5.0, "text": "The doctors here are excellent.  I especially like Dr. Nina Jo Hibbard, Endocrinologist,  and Dr. Carlos Gadea, Rheumatologist.  They are knowledgable, patient, and very concerned about the pateient's well-being.    I wouldn't trust my healthcare needs to be handleded anywhere else.   😀", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "105124454187813409107", "name": "Jennifer van Arcken", "time": 1504830525964, "rating": 5.0, "text": "My husband had surgery by Dr. Habermacher and we are very pleased that UAB opened this state of the art clinic in Montgomery and brought such great healthcare professionals to our area. The surgery was a success and the follow up visits at the clinic were accomplished very professionally.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "114492014717223503219", "name": "Bill Flick", "time": 1514917554556, "rating": 5.0, "text": "I have seen Dr. Pazona in Urology and found him to be very competent, professional and pleasant.  The staff were also very efficient and pleasant.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "115584060232493438080", "name": "Tamara Dozier", "time": 1568788922908, "rating": 2.0, "text": "Dr. Mullins was wonderI!!\nI need a new Rheumatologist ...", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "118096554832493583892", "name": "EDDIE SMITH", "time": 1536835072856, "rating": 5.0, "text": "Great doctor took good care of my mother", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "107545803319680645607", "name": "Justin Baker", "time": 1614960134264, "rating": 1.0, "text": "I typically am easy to please and don't complain.  Dr. Burris himself did a great job and I have no issue with him, however my issue is with the lab and Dr. Burris' staff.  I could go into an elaborate post about how this office has continuously been disorganized and mishandled things numerous times, but I will just focus on the most glaring disappointment instead. I dropped off my lab specimen, which was clearly labeled and they lost it.  The return phone call consisted of, \"we have no record of it...\", with no apology or acknowledgement of the glaring mistake and negligence.  I made mention of \"I sure hope it made it to the trash, and isn't just floating around as a random specimen...\" and the response was a simple, \"...yeah\".  This experience has left me unsettled and untrusting of the entire process, and I hope no one else has to go through the same ordeal.", "pics": null, "resp": {"time": 1614963802181, "text": "Justin, we apologize for your recent experience.  We take your feedback seriously and will look into your recent visit."}, "gmap_id": "0x888925db8da6bbb9:0xf05bd189487a5f80"}
{"user_id": "113081057624561625286", "name": "Roger Shugart", "time": 1604591106755, "rating": 1.0, "text": "Shortly after the nurse left me in the exam room for my appointment as a new patient on 11/4/20, I realized how clearly I could hear the Dr outside speaking with a patient. After saying goodbye to the patient I heard the Dr say my name and ask if I was a new patient, to which I heard the nurse reply \"yes\". I then heard the Dr on the phone calling about his boat. He said \" yes, I can hold\" and during this time I could hear the nurse bring another patient into the room next to mine. While listening to the nurse and patient very clearly discussing personal and private information, I became concerned about my privacy! I then heard the Dr's entire phone conversation about his boat that's in storage for the winter. After the Dr finished his phone call, I then heard him go into the room next to mine, where again I could very clearly hear the entire conversation between Dr and patient. With my concern about the non-existance of privacy and the Dr skipping me for an established patient who came in after me, I decided to walk out and find a different Dr who values and respects their patients privacy.", "pics": null, "resp": {"time": 1604592905880, "text": "UCA apologizes that we did not meet your expectations, and we thank you for your feedback.  We will looking into the issues reported and follow up with you."}, "gmap_id": "0x888925db8da6bbb9:0xf05bd189487a5f80"}
{"user_id": "108437439094182017032", "name": "Greg Dunn", "time": 1564395993681, "rating": 5.0, "text": "I love this practice.  Dr mills is excellent.. they literally have changed my life! my mood is better, my energy is up and I feel great.", "pics": null, "resp": {"time": 1564409676084, "text": "We are happy to hear that Dr. Mills and the UCA family has been a partner in you healthcare needs."}, "gmap_id": "0x888925db8da6bbb9:0xf05bd189487a5f80"}
{"user_id": "105053087152366565601", "name": "Alan Thompson", "time": 1573495330372, "rating": 5.0, "text": "Very pleasant staff and very thorough doctor.", "pics": null, "resp": null, "gmap_id": "0x888925db8da6bbb9:0xf05bd189487a5f80"}
{"user_id": "110353338455908184171", "name": "Stephen Fanning", "time": 1519340567904, "rating": 5.0, "text": "I have been here multiple times, and undergone procedures by 2 different doctors here.  The staff is amazing, the wait before my appointments have been very reasonable, and there is no doubt I'm being well taken care of.", "pics": null, "resp": {"time": 1519403921599, "text": "Thank you.  We appreciate you taking time to give us a review."}, "gmap_id": "0x888925db8da6bbb9:0xf05bd189487a5f80"}
{"user_id": "107783484300594982481", "name": "Austin", "time": 1544040312620, "rating": 1.0, "text": "We called and scheduled an appointment with Dr. Willbanks. When we arrived they told us we would be seeing a assistant instead of Dr. Willbanks, same price of course.", "pics": null, "resp": {"time": 1544042971860, "text": "I apologize for any miscommunication with our appointment scheduling department.  Our practice does utilize highly trained mid-level practitioners to assist with same day appointments."}, "gmap_id": "0x888925db8da6bbb9:0xf05bd189487a5f80"}
{"user_id": "105984107954854688035", "name": "Scott Mains", "time": 1464886765369, "rating": 4.0, "text": "Friendly staff...short wait time", "pics": null, "resp": null, "gmap_id": "0x888925db8da6bbb9:0xf05bd189487a5f80"}
{"user_id": "104575567709624623609", "name": "Marsha Hilliard", "time": 1621819857106, "rating": 5.0, "text": "This nurses here are very nice and good at what they do   my family member is very happy with Dr. Wall", "pics": null, "resp": null, "gmap_id": "0x887d45fbe8b59593:0x7de025c5cf2be9cb"}
{"user_id": "117383735302322495595", "name": "Bobbette Taylor", "time": 1615569135458, "rating": 1.0, "text": "It was a horrific experience since Dr. Yordy is no longer practicing. Went in paid my copay was directed to wait in my car. Two nurses came to parking lot running around to cars. The nurse came to my car window asked me if I had ever had a kidney stone~ I’ve been going here since 1998 for kidney stones. Then said let me see what we need to do. Sent me to get CT scan told me to call when finished. Called asked what I need to do said just wait in parking lot. Where?? It don’t matter. A muse will call you back. Nurse called back gave results of CT said there’s nothing more we can do for you without consulting with Doctor. I called office manager her words were “ that don’t sound like her, did they not give you a urinalysis. Well no it’s not in my chart. I never seen anyone in this office. Very unprofessional. Never took care of my medical issues.", "pics": null, "resp": null, "gmap_id": "0x887d45fbe8b59593:0x7de025c5cf2be9cb"}
{"user_id": "109056724658874428461", "name": "Kathy Long", "time": 1595732890320, "rating": 5.0, "text": "Love Dr Smith has compassion used a couple of the others when he was off or on vacation the group as a whole are great", "pics": null, "resp": null, "gmap_id": "0x887d45fbe8b59593:0x7de025c5cf2be9cb"}
{"user_id": "103658350283982854953", "name": "Derek Weigand", "time": 1491654024323, "rating": 5.0, "text": "I had a GREAT experience at Shoals Urological Associates last week. All the staff from the receptionist to billing were super friendly and helpful. I don't think I waited for a full minute between the lobby and in the treatment room for Dr. Walls to come in. I also can't speak highly enough of Dr. Walls. Extremely skilled, professional, kind, caring and just a great guy to be around. Thanks so much for making a procedure that most guys don't look forward to so simple!", "pics": null, "resp": null, "gmap_id": "0x887d45fbe8b59593:0x7de025c5cf2be9cb"}
{"user_id": "110172135527647099028", "name": "Brandon Taylor", "time": 1456345124868, "rating": 5.0, "text": "Dr. Walls got my surgery in less than a day and done a great job! Don't try and suffer out kidney stones because it's not worth it...TRUST ME", "pics": null, "resp": null, "gmap_id": "0x887d45fbe8b59593:0x7de025c5cf2be9cb"}
{"user_id": "103793743098361710791", "name": "Candace Anderson", "time": 1623870821392, "rating": 1.0, "text": "Most of the Doctors have left. Only 2 Dr's to handle patient load. Then if one Dr is out.....\nI'm trying to talk my husband in changing Urologists. Takes months to get an apt and he has kidney stones!!!", "pics": null, "resp": {"time": 1623878198466, "text": "Candace you are welcome to call our office.  We see patients the same day or next day for kidney stones.  Thank you!"}, "gmap_id": "0x889a4d7687d412a5:0x359275820756f72e"}
{"user_id": "114771140724209838860", "name": "Lesley Lawrence", "time": 1572373487544, "rating": 1.0, "text": "My husband and I have both been in this office for years. This pass time my husband was seen he saw new pa who very pleasant  but when called a week or so later just for letters saying he was seen in office on the date he was seen and good to go to work they refused. My husband works off shore anytime they see a dr for issues they just have report say they can come back. They stand we can't do because never said he couldn't go to work which we knew and understood. He just a letter saying just that after several phone they final gave letter. The lady on other phone was rude and unprofessional and clear didnt understand what we were asking but they turn around saying we cant be seen in the office due our behavior well we were never coming back anyways. Btw he pass a kidney that the scan didnt pick up a well. Which die history they should have order a Ct scan.", "pics": null, "resp": null, "gmap_id": "0x889a4d7687d412a5:0x359275820756f72e"}
{"user_id": "114423993656717949146", "name": "Rosemary McLain", "time": 1525366004835, "rating": 2.0, "text": "While I found the physician I see very caring,  the office staff and most of the nurses leave much to be desired in compassion and efficiency.   The wait to get an appointment (I am already a patient) was over 4 months and the day of my visit I waited almost 3 hours to see my doctor.   Also, the main reason I was there could not happen because of the failure of the office and front staff to do their job.   I actually arrived early and could have been seen for the reason I made the appt. and then sent back to the waiting room to wait for the doctor to become available.   But since that was messed up, I will need to make another visit to see them but I am still waiting on the office nurse to call me back to get that scheduled.   Again, you will not find another doctor better than Dr. Lori Fleck but just know that to see her you will have to endure less than professional staff who can't seem to do there job correctly.", "pics": null, "resp": null, "gmap_id": "0x889a4d7687d412a5:0x359275820756f72e"}
{"user_id": "104066632293987707836", "name": "JoAnne Kane", "time": 1572969411712, "rating": 1.0, "text": "One star is even too much!! Didn't even get to see a Dr due to the office staff being inefficent! Very rude as well!!", "pics": null, "resp": null, "gmap_id": "0x889a4d7687d412a5:0x359275820756f72e"}
{"user_id": "118172391510271759087", "name": "Sarajane Pugh", "time": 1617109684752, "rating": 5.0, "text": "My procedure was basically simple and went well. However, I arrived at 9:00 a.m. as instructed was prepared for the procedure but the actual procedure did not happen until about 1:45 p.m. I don’t understand why I was laying on the transport gurney in the holding room for almost 4 hours. I was very uncomfortable and was not told why or what was causing the delay. I was finally discharged after recovery at around 4:00 p.m.  the Doctors and Nurses were very polite and professional but I think scheduling needs to be addressed. Betty, who carried me out was a familiar face and was an angel at the end of the day. We love DCH, and hope this honest assessment helps to prevent future complaints  by calling this to your attention. Donald Pugh.", "pics": null, "resp": {"time": 1607007224974, "text": "Sarajane Pugh, we really appreciate your feedback!"}, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "110332195887540456600", "name": "Paul Miller", "time": 1601982963102, "rating": 5.0, "text": "Dr Winfield was very warm and caring. He listened to my concerns an shared his knowledge and experience with me and my wife. He gave me all my options and made an educated recommendation based on my current health, age and medical condition. He answered all my questions about any procedure that we were considering and gave us confidence in using him for my robotic procedure. When trying to find the most qualified surgeon, we are impressed that he is one of the top surgeons in this field and this is one of the best facilities for my procedure. I would recommend Dr Winfield to anyone looking for a surgeon with his specialty in robotic surgery.", "pics": null, "resp": {"time": 1601991348216, "text": "Hi Paul Miller, thank you for taking the time to leave a review for us at Howard Winfield, MD. We're happy we could meet your expectations! Your recommendation means so much to us, and we're so happy to have earned it. Thank you again for taking the time to let the world know about your positive experience. Have a great day!"}, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "118103550163897915662", "name": "John Woodward", "time": 1613488688945, "rating": 5.0, "text": "Dr. Winfield showed a complete knowledge of my problems and explained the options clearly.  He has scheduled more tests to further define possible ways to correct.  His explanation of the procedures was very good,  No magic yet but progress on a road to a possible better situation.", "pics": null, "resp": {"time": 1613577723262, "text": "John Woodward, we are very happy we could provide you with a positive experience! Thank you so much again for your feedback! We hope you have a great day!"}, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "105519745169516565199", "name": "Randy", "time": 1592335860851, "rating": 5.0, "text": "I was referred by my Primary Care Physician for followup to Dr. Winfield based on ultrasound imaging.  Dr. Winfield carefully examined me and did some followup testing and further imaging.  His diagnosis confirmed that surgery was necessary.\n\nDr. Winfield did not delay in scheduling me that week for surgery.  The surgery appears to have gone well with no complications.  I am recovering at home with prescribed antibiotics.  The 3 week followup visit with Dr. Winfield will determine how well the surgery and recovery has gone.\n\nDr. Winfield did an excellent job of explaining my medical condition, treatment necessary, and surgery required.  I would recommend him as a Urologist to any family member or friend with medical related illness.", "pics": null, "resp": {"time": 1592834162480, "text": "Randy Schumacker, thank you for the high star rating! We're glad to hear we delivered such a great experience. If there's anything further we can do for you, we are happy to help!"}, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "116043129269796011743", "name": "Frank Kerch", "time": 1602463892849, "rating": 5.0, "text": "Office was run very efficiently and staff was pleasant and professional. Dr. Winfield was very thorough with my first appointment. He provided me with information that was easy to understand and he was very empathic.", "pics": null, "resp": {"time": 1602594845645, "text": "Frank Kerch, we really appreciate your positive review!"}, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "109514704269446984254", "name": "carl martin", "time": 1607620935418, "rating": 5.0, "text": "Thanks to Dr. Howard Winfield and his staff. I am so grateful to God for giving man the ability to help man kind with our sinknes . knowing it is God that is in charge. Special thanks to Dr.Winfield and his nurse practitioner,Susan Windham. I would recommend Dr Howard Winfield to everyone. Praise be to God.", "pics": null, "resp": {"time": 1607699115517, "text": "Hi Carl Martin, thank you for taking the time to leave a review for us at Howard Winfield, MD. We're happy we could meet your expectations!"}, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "107023329276532941591", "name": "Megan Davis", "time": 1613747087628, "rating": 1.0, "text": "Front office was  very rude and did not seem very happy. I also am also scheduled with one doctor but always see a different doctor.", "pics": null, "resp": {"time": 1614003847031, "text": "Hi Megan Davis, thank you for taking the time to let us know about your recent experience. We are disappointed to hear that you are not satisfied with your visit. Thank you for bringing this to our attention. We will use your comments to refine our efforts to ensure this issue does not happen again."}, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "116146245780069560879", "name": "Larry Houston", "time": 1611278959823, "rating": 5.0, "text": "Dr. Winfield is (THE BEST) enough said!", "pics": null, "resp": {"time": 1611326303046, "text": "Larry Houston, we are very happy we could provide you with a positive experience! Your recommendation means so much to us, and we're so happy to have earned it. Thank you again for taking the time to let the world know about your positive experience. Have a great day!"}, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "112050580385842967382", "name": "Dexter Hancock", "time": 1602163354703, "rating": 5.0, "text": "On time and well organized. Good experience", "pics": null, "resp": {"time": 1602250883502, "text": "Hello Dexter Hancock, we appreciate you taking the time to leave us this feedback."}, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "103645518608496779838", "name": "Cynthia Rafferty", "time": 1572636587730, "rating": 5.0, "text": "My mother is 91 yrs old, very hard of hearing and a new patient. Dr. Winfield was very patient and really had a very nice conversation with my mother to learn about her past health history. He took his time and really listened to what my mother said. His nurse Tammy was very kind and caring too during our appointment. We had no problems during our appointment. Check in and check out office ladies were very nice and friendly also.", "pics": null, "resp": null, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "107694967260755058894", "name": "Horace Hall", "time": 1557931596070, "rating": 5.0, "text": "I'm happy to commend Dr. Winfield and his excellent staff to anyone who needs Urological Medical attention. I've received the best of care in the office, surgery in DCH, minimal excision in the office. I recommend Dr. Winfield with highest regards. They make you feel comfortable in Q's and ready with answers, etc. God is love.", "pics": null, "resp": null, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "103711767492298373784", "name": "Betsy Allen", "time": 1558887461030, "rating": 5.0, "text": "We were very impressed with Dr. Winfield.  For a change my husband was paid attention to and not just ignored like so many doctors do.  My husband is 95 years old and most doctors just write him off.  Dr Winfield did not.  Thank you, Dr. Winfield!", "pics": null, "resp": null, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "113192026883692896929", "name": "david jones", "time": 1538113218712, "rating": 5.0, "text": "Dr. Winfield is a thorough and we'll knowledgeable Dr that explains things in full detail that I was able to understand. The staff is very friendly and helpful. I would most definitely recommend him to anyone! Very relaxed and comfortable environment.", "pics": null, "resp": {"time": 1538159283462, "text": "David, reviews like this give us motivation and help us ensure we provide high-quality care. Please don't hesitate to reach out if there's anything additional we can do for you."}, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "100763146978743846059", "name": "Robert Watts", "time": 1557269591313, "rating": 5.0, "text": "Doctor Winfield did a great job. He took the time to talk to me explaining my medicine and helping me understand my health issues. I would recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "108532611527690646112", "name": "Bill Pate", "time": 1541428048306, "rating": 5.0, "text": "Dr. Winfield and his nursing staff were great. As an example , he was extremely busy on one afternoon that I went to his office without an appointment. My wife and I were waiting in an exam room. He poked his head in and checked that I was not an emergency and reassured us he would get to me as soon as he could. It made the wait seem shorter to know that he cared. Oh... we give the nursing staff 6 stars!", "pics": null, "resp": null, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "103855162414906777383", "name": "Joseph Sherrell", "time": 1567610439070, "rating": 5.0, "text": "Very straightforward. He wasted no time and treated me like a person instead of information on a chart like some physicians unfortunately have done. Very professional and genuine.", "pics": null, "resp": null, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "115479522682803295208", "name": "Ashley Garner", "time": 1520171588388, "rating": 5.0, "text": "Dr. Winfield was great. He made me feel comfortable and was very compassionate. Glad I was recommended to him. Will definitely be going back with any future problems.", "pics": null, "resp": null, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "102248136856520403122", "name": "Patricia Braggs", "time": 1544479450532, "rating": 5.0, "text": "Nice staff always good service. Never have to wait to long after you sign in.", "pics": null, "resp": null, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "117344659669088585580", "name": "Kevin Pierce", "time": 1598556333860, "rating": 5.0, "text": "Staff was polite an helpful", "pics": null, "resp": {"time": 1598623554303, "text": "Kevin Pierce, thank you for the high star rating!"}, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "100907926931490893270", "name": "Steven Evely", "time": 1591879310695, "rating": 5.0, "text": "Fantastic staff and providers.", "pics": null, "resp": {"time": 1597243297526, "text": "Hello Steven Evely, we appreciate you taking the time to leave us this feedback."}, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "104262635227218089489", "name": "james rodgers", "time": 1591617969976, "rating": 5.0, "text": "Very good doctor and staff", "pics": null, "resp": {"time": 1597243300159, "text": "James Rodgers, we really appreciate your feedback!"}, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "112874380056592954186", "name": "Don Foley", "time": 1544136240951, "rating": 5.0, "text": "Dr.Winfield and staff are an example of how a practice should be run. Dr. Winfield always is kind and very good at what he does.", "pics": null, "resp": null, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "101596034057682739117", "name": "Herbert Lindemann", "time": 1519756509380, "rating": 5.0, "text": "100% trust in Dr. Winfield. Staff is outstanding , friendly and help me in the given situation. Would recommend Dr.Winfield any given time.\nThanks for taken care of me Dr. Winfield!", "pics": null, "resp": null, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "115770192696338726522", "name": "Milan Waggoner", "time": 1529099277265, "rating": 2.0, "text": "Nice people, but don't feel that his effort was out into the reason I was there. Thanks for nothing...", "pics": null, "resp": {"time": 1532183116190, "text": "Hi Milan, we appreciate your honest review. We set a high standard for ourselves, so we are disappointed to hear that your experience with us was not a positive one. We hope you are willing to give us another chance. Please reach out to us at info@dchsystem.com so we can work towards a resolution."}, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "101588322979543097848", "name": "JAMES NORRIS", "time": 1521635488587, "rating": 5.0, "text": "Had blood drawn at DCH lab prior to visit with Dr. Winfield on 3-21-18. Did not have to wait long and was out within 15 minutes. Amie was my tech that drew my blood and she was very professional and so was the yest of staff. Thank you", "pics": null, "resp": null, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "115608652968073101594", "name": "Joseph Robinson", "time": 1519954898569, "rating": 5.0, "text": "Very happy with Dr. Winfield, his professionalism and treatment.  Would recommend him to others.", "pics": null, "resp": null, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "106152857313187512636", "name": "Milton J Cozart", "time": 1517326626944, "rating": 5.0, "text": "Friendly professional staff, unusually efficient appointment timing, overall a very pleasant experience (given the circumstances).", "pics": null, "resp": null, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "103393083781056846518", "name": "Edward Goins", "time": 1519404905438, "rating": 5.0, "text": "Highly recommend this group for you needs, I use Dr. Windfield and Susan Windom and have always received the best of care .", "pics": null, "resp": null, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "111866077448024654985", "name": "Henry Mok", "time": 1571664437725, "rating": 5.0, "text": "Excellent...in all aspects.", "pics": null, "resp": null, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "102669904336745102783", "name": "Joe Hollingsworth", "time": 1550539593022, "rating": 5.0, "text": "the staff was great and friendly   the office was clean", "pics": null, "resp": null, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "105391092844682842949", "name": "Dottie Williams", "time": 1521237183227, "rating": 5.0, "text": "short, comfortable wait, super nice staff members.", "pics": null, "resp": null, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "109366920994004785489", "name": "Dorothy Sanders", "time": 1518743037843, "rating": 3.0, "text": "Was not ready for my appointment,  didnt have all the information need to evaluate my problem.", "pics": null, "resp": null, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "112826345043397557218", "name": "Hiram Johnson", "time": 1517584491497, "rating": 5.0, "text": "Excellent care in a comfortable and caring environment.", "pics": null, "resp": null, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "104755290517656017309", "name": "Jeff Townsend", "time": 1596243515831, "rating": 5.0, "text": "Very professional Doctor and staff! They seem to have their patients well being first. They care!! Super experience!!\n\nDitto!!", "pics": null, "resp": {"time": 1597243097535, "text": "Hello Jeff Townsend, we appreciate you taking the time to leave us this feedback. Please let us know if there is anything else we can do for you; we are more than happy to help!"}, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "118438708010384781575", "name": "Jimmy Hill", "time": 1614377671718, "rating": 5.0, "text": "The treatment that I received was no less than I expected.", "pics": null, "resp": {"time": 1614608620950, "text": "Hello Jimmy Hill, we appreciate you taking the time to leave us this feedback. We hope you have a great day!"}, "gmap_id": "0x8888a83b707e15dd:0x8053e8f83b5c143d"}
{"user_id": "109846666760030974775", "name": "Sue S", "time": 1623775991072, "rating": 1.0, "text": "Absolutely horrible! Most unprofessional place ever encountered. Definitely all about collecting the money and NOT ABOUT THE PATIENT/HUMAN standing before them looking for help! Find a private practice, do NOT send your loved one here!!!", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "114145745527545906390", "name": "Jacque Mccants", "time": 1617242732405, "rating": 5.0, "text": "The drs. were great taking care of my husband.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "100296866654054094575", "name": "Nettie. Fowler", "time": 1617663909432, "rating": 5.0, "text": "They was great very careing doctor and nurse and staff member", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "100746307723335970509", "name": "David Connolly", "time": 1615837946149, "rating": 5.0, "text": "Service was quick and courteous.  Thanks.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "113121781149093970983", "name": "stephanie dinkins", "time": 1608064866874, "rating": 5.0, "text": "EXCELLENT SERVICE, THE STAFF IS VERY PROFESSIONAL & VERY KIND.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "117643759670590368339", "name": "James Irby", "time": 1598642453457, "rating": 5.0, "text": "I had a contrast CT Scan the staff and Dr Frischhertz was the best.A true asset to his profession.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "105517004791550963737", "name": "Jamika Black", "time": 1595968311942, "rating": 1.0, "text": "These guys are a joke. I've been going to Dr Reardon for about 2 years now. You know what nevermind.\n\nHow do you not see kidney stones but you call in medicine for kidney stones.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "103474969713475596373", "name": "Frank Myers", "time": 1576294675589, "rating": 5.0, "text": "I have been using Urology Associates of Mobile for almost 12 months. They have been very thorough and absolutely professional!! I would recommend this group to anyone, especially family!!\nThanks so much for helping me!!", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "114873823857950814911", "name": "Diane Keith", "time": 1561059707866, "rating": 5.0, "text": "I had a very bad kidney infection that was extremely painful my primary care was trying to help me with. Nothing she did was working so she sent me to your office. I was treated immediately and diagnosed quickly. Now I am feeling so much better!! The nurses were fabulous and the doctor top notch. I would highly recommend this office!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "107583952547606071606", "name": "Deborah Hodges", "time": 1560822293894, "rating": 5.0, "text": "Dr. Paul Scott has been my urologist for 15+ years. I trust him completely. I have suffered with many kidney stones, and he has taken extra care to ease my pain and discomfort. I have had multiple lithotripsies, and surgeries over the years including three this past year. If you are looking for a caring, professional doctor, I highly recommend Dr. Scott.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "104905072617524466844", "name": "Laci Cunningham", "time": 1559075618116, "rating": 1.0, "text": "This has been one of the worst experiences for my husband. He had a Vasectomy on Friday and something clearly went wrong because when we got home he just about went in to shock from the pain. We called and spoke with the doctor and he said that it was normal. My husband did everything he was suppose to and got worse and worse and after speaking with the On call doctor , he advised him to go to the ER on Sunday. He was sent home with stronger pain meds and this still has not worked. The office was closed on Monday for Memorial Day and it is now Tuesday. We have spent ALL day trying to get someone on the phone and we have left 3 messages with the answering service due to them having phone issues. We decided to drive to the office at 12:30 and we were told that all doctors were in surgery and a nurse practitioner would be available to speak with at 2pm.  So my husband couldn’t even speak with anyone regarding his emergency situation. We called again and left another message with the answering service and it’s 3pm and we still haven’t heard anything and we are back here at the office again trying to get answers. We will NEVER come here again.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "103839155144003731752", "name": "Frank Myers", "time": 1564169419454, "rating": 5.0, "text": "I have had a Prostatectomy and my catheter needed some attention. I live two hours away from the Doctors Office. I called and advised of my situation and they had me an appointment to see the CNA within 3 hours!!! Amazing results and greatly appreciated.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "113578608363820966295", "name": "alan berthiaume", "time": 1583895998433, "rating": 5.0, "text": "Great visit the Doctor and Nurses were 10's", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "104227050622021522809", "name": "Tammy", "time": 1539739732115, "rating": 1.0, "text": "Horrible experience. I have a extensive history of kidney stones and surgeries that accompany them. I was referred by Providence Hospital Emergency room. I have been in extreme pain and nauseous for several days. I went in this morning at 8am and was seen at 10:30. I was seen by a nurse practitioner and then diagnosed by Dr. Scott who does not want to discuss anything other than his years as a doctor and that I have stones in both kidneys that cannot possibly be hurting. I also have a prolapsed bladder due to a bladder sling that was done a little under a year ago. He wouldn't even look at it or request my records. He had absolutely no compassion about a painfull and embarrassing  issues. I have had several Urologist over the years and I WOULD NOT RECOMMEND DR. SCOTT. I am now in the same pain with the same major problems that the Emergency Room treated appropriately. I have no idea what to do, but to pray and hope that I can find a doctor that will do the repair of my sling and remove the stones. Best of luck in whatever you decide, maybe another Doctor there may be more compassionate and you want leave there feeling hopeless and embarrassed like I do.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "109623208947522093677", "name": "David Brockway", "time": 1579122936930, "rating": 1.0, "text": "We have been there multiple times and have had to wait well over an hour every time just to get to go back and wait some more\n\nThe worst thing about them is the fact that they will not share test results over the phone\n\nSo you have to find a way there and some of us live way out of town\nWhich can take weeks  for them to tell you whether or not you have cancer\nThey make you worry all that time, make family or friends take off work and lose money, just so they can make you come in to the office again so that they can make more money\nThey have no shame praying on the old, poor and disabled\nI have begged them to share information about test but each time it's another office visit", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "110693541535811424551", "name": "Breanna Myrick", "time": 1542839474811, "rating": 4.0, "text": "I have gone to multiple doctors trying to figure out what’s going on with my bladder. Dr. Reardon new instantly the route to take and now I feel like I’m moving in the right direction. Didn’t give 5 stars because I waited in the lobby a long time to see the doctor.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "109323910736070971240", "name": "Ira Madsen", "time": 1547682123794, "rating": 4.0, "text": "I called about a potential red-flag.  I am a cancer survivor, always alert to changes.  I was \"worked in\" for xrays and a session with Amanda from Dr. Stevens office on short notice. I arrived early, yet was checked in and xrayed without ever sitting in a waiting room chair!  Excellent, friendly, patient techs wasted no time, yet I never felt rushed.  I moved along upstairs to Dr. Stevens office.  Always courteous and efficient check-ins there.  I received tests I didn't expect, but Amanda explained the troubleshooting/process-of-elimination reasoning in a way that made sense.\nMy fears were allayed, and the usual doctor visit frustrations didn't figure into this experience. I return soon to see Dr. Stevens,  which I always look forward to.\nAs an aging man, I usually dread doctor visits.  Not so with \"Dock Harbour\" Stevens and the Angels at Urology Associates.\n\n(Nobody is perfect.  I don't believe in 5 stars.)", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "106696584894575607312", "name": "Mal Beaverstock", "time": 1565210875711, "rating": 5.0, "text": "Went for just lab work. Very efficient and quick.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "114384512840497196406", "name": "Tonio Will", "time": 1543632246887, "rating": 5.0, "text": "Providence Urology Associates of Mobile gets they're job done,and treating you with much respect!", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "113034886460488293334", "name": "Ron Wallace", "time": 1510761073831, "rating": 5.0, "text": "Excellent, outstanding; not a better Physician in Mobile than Dr Paul Scott.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "105188475639751393628", "name": "Krystal Palladino", "time": 1478282241662, "rating": 5.0, "text": "Great doctors! Down to earth, smart, caring doctors and staff.", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "103688643081279068583", "name": "Linda Paragone", "time": 1568316391517, "rating": 5.0, "text": "Efficient and kind staff", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "106139966854174982437", "name": "Nick Bolanos", "time": 1566846642950, "rating": 5.0, "text": "Everyone was extremely helpful", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "112207341363379626190", "name": "CRNA Schedule", "time": 1540410501680, "rating": 5.0, "text": "Lab was drawn quickly & painlessly! Thanks!", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "108550053659376039865", "name": "Stanislav B", "time": 1528471578960, "rating": 2.0, "text": "What’s the point of the appointment if you get called 30-45 min after", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "108141581130952606364", "name": "Jessika Bailey", "time": 1516629904764, "rating": 2.0, "text": "Google says they open at 8am they dont open till 830am. 😒😒😒", "pics": null, "resp": null, "gmap_id": "0x889a4e03439f77eb:0x3e90c543772271b7"}
{"user_id": "103275247537665786031", "name": "Snow", "time": 1617424120018, "rating": 5.0, "text": "Great physicians here. Have helped me with several medical issues. Have been seeing this group for many, many years and they have always been great.", "pics": null, "resp": {"time": 1617629610217, "text": "We are very pleased to hear that UCA has been a trusted medical partner for you."}, "gmap_id": "0x888917a395356241:0x68dd1695a0d6f25b"}
{"user_id": "115518893991040546026", "name": "Diana Shoel", "time": 1607539476046, "rating": 5.0, "text": "Rebecca Kearny, PA is the best! She takes time with her patients, answering all questions explaining in details and if patient's confused, she will explain again slower for patients. I loved her to all the above and have already recommended her to her to a few freinds of mine for the excellent care, knowledge, explanation to all questions thoroughly, etc..", "pics": null, "resp": {"time": 1607542716014, "text": "We are glad to hear that Rebecca met your expectations.  We love hearing that you will recommend her to your friends.  Thank you."}, "gmap_id": "0x888917a395356241:0x68dd1695a0d6f25b"}
{"user_id": "105162757713607351471", "name": "Amy Waine", "time": 1584242313674, "rating": 1.0, "text": "Meds called into the pharmacy that I was allergic to after being Dr. Paula Rookis’s patient for over two years. I was assured by office staff that they worked Monday-Friday until 5:00pm. I called back at 4:57pm and the answering service said everyone was gone. No new antibiotic or a phone call back from her office over the weekend, left in pain until Monday. Going to a different doctor that won’t leave me in pain over a weekend and knows my chart and what I need to cure a UTI.", "pics": null, "resp": {"time": 1617629669819, "text": "We are sorry to read about your experience.  We appreciate the feedback and will review internally."}, "gmap_id": "0x888917a395356241:0x68dd1695a0d6f25b"}
{"user_id": "113441958464513159847", "name": "Nicole Pugh", "time": 1544023310987, "rating": 5.0, "text": "Dr. Holley is the best. His interpersonal skills and ability to explain complex medical terminology os unmatched. We travel from out of state just to recieve his care. Quality over convince any day.", "pics": null, "resp": {"time": 1544035255609, "text": "Thank you so much for your kind words about the care you have received here at Urology Centers of Alabama."}, "gmap_id": "0x888917a395356241:0x68dd1695a0d6f25b"}
{"user_id": "116238820200796561427", "name": "Life in Camo Media, LLC", "time": 1619720614851, "rating": 5.0, "text": "We have used Jackson Surgery Center three times in the last two years and every visit was a positive experience. The staff is friendly, the nurses are kind and knowledgeable about every procedure we were there for. The staff kept the family/driver informed the entire time the patient was there. The billing department was very easy to work with. I was able to get someone on the phone every time I called to get an insurance issue resolved. I would highly recommend Jackson Surgery Center to anyone that needs the type service they offer. I would give them 10 stars if it were possible.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPQmD3NONX5lxnTqqGpPpccmzty7UBXatECy-lz=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "114488075300264503910", "name": "Janice Howell", "time": 1623257740459, "rating": 4.0, "text": "I had a great experience with my kind and caring nurses at my pre-surgery and recovery room time. I'd like to thank Cherri, Philanda and Cheryl personally for their great work. They made sure I was comfortable. As for as the surgery, the anesthesiologist and surgeon made sure I was knocked out for the 7 stitches although I didn't choose to be. Doctor was very late so he didn't want to waste any time. Maybe it was for the best but it was definitely not my choice.", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "117375952924911138946", "name": "Russell Marks", "time": 1614872568983, "rating": 1.0, "text": "I was schedule for a colonoscopy on Mar 4th.  I was notified that I had to report to Surgery Center for Covid 19 test prior to having the procedure.  I called the doctor's office to see if I could have it done in Prattville area as I lived North of Prattville and was told to call Jackson Surgery Center, I did and they said that would be fine.  So I got the test and a letter saying  I had a negative result.  Then next day I get a call from JSC saying what I had was not good enough.  I was asked why I didn't get tested at JSC and explained that it was more convient to have it locally.  She stated that she lived south of Montgomery and came to work every day.  This really upset me!  Long story short I had already spent a whole afternoon getting tested and by the time she called had already begun the prep and had to cancel the procedure.  They need to get better people friendly personal    to contact patients and get there act together as far as what is acceptable covid testing.  I had this procedure at the JSC (prior to Covid) and it was a great experience just glad I didn't have contact with this person back then.", "pics": null, "resp": {"time": 1614949554575, "text": "Mr. Marks, thank you for bringing this issue to our attention. We apologize for any confusion.  We will address this issue with our staff, the response you received certainly isn't our expectation. For future reference we have Important Covid Information on our website. You can find it here to review our policies.\n\nhttps://www.jscal.com/blog/covid-19-information/\nIf you have further issues or questions please contact our director Missy Sallas 334-293-8484"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "100150209495080402340", "name": "Lisa Hudspeth", "time": 1601996170033, "rating": 1.0, "text": "Better check to see what you owe or they will not do the operation.  They never told me the countless times I’ve spoken with them.  They were extremely hateful.  I asked what I needed and they said insurance card and license.  I drove 4.5 hours and they were going to cancel on me!", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "106860308004527833404", "name": "Vernon Hunter", "time": 1550070817024, "rating": 5.0, "text": "We had a wonderful experience here. Very welcoming and professional. The ladies at the front desk were very nice and helpful.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMEA6SuVnqtgNXXnNkzREdg32B0zgufuc5cv_E=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO4uB51fxyaeDpO2yDu2wNTSxPqh2O8yHqB2fs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMKelv6hT0qb05rGgjtyF822D8UYa0I-uSI8Co=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMzww9DxQJkCwnUedUgw9PJeezxKmFfHtLDnDk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipObPWGFUVK4hTVE8lS2E-RgkyerbdsOR4Hh2tw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNXQS8EPgYZFbDmxHO9f_bBDZmc1UFM-44zLdY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMJqrimS9z6XE50WzCh_gGS9Fn5EyK0YrWWMCI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNjU73BEntArb0ed9LGb1NqqNaIqXlaFJzlV5g=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNpw9Gg51OKBGQDnwp4D3vjqdxV92b8CKCXQvY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPZwGldC5pb6lfTxx5riGecXESwGA5LbK89DLY=w150-h150-k-no-p"]}], "resp": {"time": 1550078887420, "text": "Thank you so much for the positive feedback.  Our team will be really happy to hear you noticed.   Thank you!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "113385512553342126004", "name": "Rosilind Maxwell", "time": 1571770585377, "rating": 5.0, "text": "I just wanted to tell everyone how much I appreciated you all for being so gracious and concerned about the experience that I had with you all on October 21st. You made an unnerving and uncomfortable situation pleasant and endearing.  Thank you from the bottom of my heart. God bless each and everyone that works in that entire building.", "pics": null, "resp": {"time": 1571774286418, "text": "We thank you and are very happy to have had a positive impact on your experience.  Thank you for your kind words we will share this with our team.  With sincere appreciation. Take Care!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "103227802844892782214", "name": "Jason York", "time": 1574466873995, "rating": 1.0, "text": "We were surprised by having to pay a second co-pay, one for the facility for the doctor. It was explained that this is because the doctor is not affiliated and it is an out patient surgery. However, the doctor's name is listed as part owner, not to mention the fact that we have had out patient surgeries in the past and not had separate co-pays. We will not be using this facility again, as it appears to be using any way possible to take money. We could have refused, but we already had the time scheduled off work, and it's hard to rearrange a surgery. At the very least, they could have let us know this in advance, instead of at the time of the surgery. We will be using the Baptist hospital system from now on.\n\nUpdate: No, it wasn't really addressed, we were just told that we would have to pay again or reschedule. It's not about the money, it's about letting us know in advance that there are two separate co-pays, which was not done.", "pics": null, "resp": {"time": 1574442580320, "text": "Hi Jason, we apologize for any miscommunication. Our administrative team is aware of the concern and has addressed this with the patient.  If you need future assistance or have further questions about our billing policies, please contact our Administrator Mr. John Gray 334-293-8484"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "103860438254680297210", "name": "Barbara Sowell", "time": 1580652862613, "rating": 5.0, "text": "Great experience! Wonderful staff. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "101193850016028689346", "name": "leo zemke", "time": 1539124545151, "rating": 1.0, "text": "I am glad everyone else had such a fantastic experience at this place but they almost let my step son DIE!  He came in and was scheduled for exploratory surgery to fix SHODDY WORK DONE BY DR CHANDLER during a sinus polyp surgery and my step son began to pour blood from his Sphenopalatine Artery and the office was more worried about getting another three hundred dollar copay out of us than helping my son.  My wife had to scream for help in the office to get nurses and a doctor to get my son and help him.  We were treated shabbily during the whole ordeal.  My step son was bleeding to death and they did not even have the ability to  give him blood at this facility.  They almost killed him!  IT WAS HORRIBLE!  A HORRIBLE ORDEAL!!!!  I should post photos of all the blood.  The clinic manager was not friendly, everyone acted as if they did not know what was going on or what to do.  They had to take my son by ambulance over the the hospital and then the nightmare continued.  The ER doctor threw my son out of the hospital room that he was scheduled to be in.  It was like they tried to kill my son and then they were trying to sweep us under the carpet or out the door.  TO HIDE US AND THE HORRIBLE THINGS THEY DID AND THE WAY THEY ALMOST KILLED MY SON!!!   It was a nightmare!  They were going to give my son a blood transfusion in the ER and sweep us out the door.  MY WIFE HAD TO ENLIST THE HELP OF THE AMBULANCE DRIVERS Who could see that our son was in agony and practically DEAD AT THEIR HANDS!  The ambulance drivers GOD BLESS THEM talked the angry, crazy doctor into keeping our son and putting us in a room for the night.  This was the worst thing that has ever happened to our family.  I would not allow this clinic to operate on a PET COCKROACH if I had one!  PLEASE BEWARE!!!", "pics": null, "resp": {"time": 1539276470948, "text": "Dear Leo, we sincerely apologize for your experience with the Jackson Surgery Center.  We strive to provide the highest level of care equally to all of our patients.  We appreciate your feedback and are addressing the issues mentioned with our administrative team.  We promise to also forward your concerns to the Jackson Hospital Administration.  Our commitment to protecting patient privacy disallows us to discuss this in an open forum.  Please do not hesitate to contact our administrator John Gray at 334-293-8484"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "112297912146866970493", "name": "Whitney Boutwell", "time": 1555592531295, "rating": 4.0, "text": "Very organized...very clean", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOXOLIBacBgsHxJG5iQ1wSlUfQoJG7vzmpR9JTM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOlpBS1BQZG6WSGqYqPA5y9JvzmNyonq_4GAx8J=w150-h150-k-no-p"]}], "resp": {"time": 1555676575347, "text": "Thank you Whitney!  We appreciate your observations and are happy to provide healthcare services to you and your loved ones.  I’ll share your comments with our team. Happy Friday!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "106585088584921164573", "name": "Carol Roberts", "time": 1533780088492, "rating": 5.0, "text": "My husband and I have both been here for minor outpatient procedures. We could not be more impressed with this facility and can enthusiastically recommend it to anyone needing surgery. We both had excellent care while we were there. The nurse even gave me novacaine before placing an IV in my hand (totally unnecessary, but I appreciate the thoughtfulness). I had some questions about anesthesia, and they actually brought the anesthesiologist to me to answer my concerns. After care and instructions were good.", "pics": null, "resp": {"time": 1533781108127, "text": "Carol we so appreciate your observations.   Thank you for noticing the “little” things we do to make your outpatient experience favorable.  Speedy recovery!  We will check on you soon!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "108378131542001498396", "name": "Michelle Swofford", "time": 1515160287657, "rating": 5.0, "text": "They took excellent care of my daughter and staff was super friendly.   She had an excellent nurse in recovery.   Everything is very organized from registration to discharge.", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "116107001445522782197", "name": "Keri Chaney", "time": 1536781345836, "rating": 5.0, "text": "This was my first procedure done here. Wonderful staff, very professional. Pleasant experience.", "pics": null, "resp": {"time": 1536783535671, "text": "Thank you!  We appreciate your kind words and will share with our staff.  Have a super recovery!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "113375147722597424669", "name": "Vincent Seabrook", "time": 1523394870461, "rating": 5.0, "text": "First class service.  5 star rating.", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "118051830061796961119", "name": "William Wheat", "time": 1533699862201, "rating": 5.0, "text": "Very nice service and friendly staff", "pics": null, "resp": {"time": 1533728675636, "text": "Thank you William.  I will share your kind remarks with our team."}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
