{"user_id": "114998029147634072929", "name": "Clarissa Brown", "time": 1619034530060, "rating": 5.0, "text": "Just want to say thank you. Great doing business with great people. Happy to hear good news today. Our family understands the struggle. We would recommend this company for all your instrumental needs. Again thank you.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "109671991912421884742", "name": "213 productions", "time": 1598577371359, "rating": 5.0, "text": "Extremely knowledgeable and friendly. We purchased a saxophone from them. We've always been very helpful and they really do know their stuff", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "106760380598672854451", "name": "Jenny Mayers", "time": 1591885366845, "rating": 5.0, "text": "Nancy Hallman is a patient, funny music teacher. She motivates my young teen to practice and play to her highest potential. She is an amazing teacher and my daughter thinks very highly of her.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "109576693084707685448", "name": "Jahari Watkins", "time": 1600698889774, "rating": 5.0, "text": "I get me saxophone reed from her and she is so nice", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "102790024508243952719", "name": "Laura Campbell", "time": 1616193720422, "rating": 5.0, "text": "Very kind and helpful!", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "115896193312603434029", "name": "Chasity Hassell", "time": 1565468728067, "rating": 5.0, "text": "Sweetest people. I actually went to a place in Decatur and they did not have what I needed called them and they said they had it but I was not going to make it before close. They told me to come on they would wait and still provided great customer service. Thank you so much!!! Will be back and recommend them to everyone!!!", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "104396355717514339586", "name": "Carly Wethington-Nagy (NipNeps)", "time": 1439752079132, "rating": 5.0, "text": "They have simply been fully honest between myself and my brother when it comes to our instrument care as we have on numerous accounts returned time after time for repairs and cleanings. Not once have we had any trouble with the way they worked, giving us estimates on all sorts of timing to receive our instruments. I recommend this place to any newer band members.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "115463860370739341297", "name": "Carla Dawn", "time": 1499749762747, "rating": 1.0, "text": "We dropped off a banjo about 10 days ago with a lady that seemed competent and assured us that restringing it and replacing a few screws would be no issue and cost less than $25; 5 phone calls and 10 business days later, we still do not have our instrument returned to us. We are not happy and feel we have been given the run around. They keep assuring us that it is ready to be picked up but when we arrive, it suddenly needs a few more minutes. We had intended to purchase not only a clarinet in the future but also an oboe from these people but I'm afraid after this incident with the banjo, we will reconsider. We do not feel valued as customers. This is ridiculous and from now on we will take our business elsewhere.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "116673766650215569065", "name": "Jamie Pennington", "time": 1470849630141, "rating": 1.0, "text": "We brought my daughter's clarinet to have a few pads replaced. We were told that the instrument was generic brand and we should look into getting a nicer one. We purposely did not buy our daughter an expensive clarinet because she was in 6th grade and she'd never played before. I told.them to replace the few pads and we'd look into a better clarinet if she made the advanced band. They quoted me a price for the few pads and we could pick her instrument up in a few days. When we went to pick it up we were told the cost was over $200. Apparently they changed most of her pads and not just the few we'd talked about. They never called to ask if we wanted this much work done or to let us know the cost before taking it upon themselves to do it and expect us to pay the outrageous amount. It didn't make any sense to me if they said the clarinet was off brand, etc. You'd think they'd ask if we wanted to spend that much to fix it. We only paid  $50 for her new clarinet on Craigslist and would have put the  $200 into buying her a nicer one instead of paying to fix the one she has. When I confronted them about not asking before doing such an expensive repair, they were non apologetic and basically pay the $200 or they keep her clarinet. We paid it, but will never go back again.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "110509677100453812169", "name": "Marcie Eppling", "time": 1401284690139, "rating": 5.0, "text": "The Hallman family has been nothing but helpful and encouraging since we walked through the door in October 2013.  Both of my children take lessons from them.  We bought one instrument and we also rent an instrument from them.  We have had no issues and I would definitely recommend them.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "111851935213610652277", "name": "Kim Perry", "time": 1473859367965, "rating": 2.0, "text": "Owner is very crass......that's fine, we all have are personalities......BUT maintenance insurance is supposedly included in the (higher than anyone else's) monthly rental fees and when I took the sax in for maintenance they wanted to charge my just over $200 for things that were supposedly covered. Not cool.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "100477370345359056071", "name": "Katherine M. Barber", "time": 1502663725107, "rating": 5.0, "text": "They were excellent!! So nice,kind and absoultly perfect service!! They are definitely much more than 5 stars, and I really recommend to come to their store!!!", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "117659042521204871217", "name": "Jaime Garner", "time": 1472687057633, "rating": 1.0, "text": "By far the worst experience of my life.  My daughter joined Beginners Band at her school to play the flute.  Hallman's was suggested by the band instructor so we went there for her flute.  Upon arrival they quoted me a $1200 flute and when I said we would not be purchasing a new flute because she was not 100% sure if this was her passion I was told about the lease to own program.  What a mistake?  I paid first and last month payments and returned the instrument within 2 weeks and was advised that my request for my last month payment would be considered a refund.  This company is a scam and wants you to pay for a service that is not rendered.  I was even told that the instrument had to be sent off for cleaning and inspection and that costs them money however this is something that they do in-house.  When the report comes back is when  Mr. Hallman will determine if I am entitled to a refund!", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "114987573965337887334", "name": "Garrett B. - Gtmkm98", "time": 1539048624657, "rating": 5.0, "text": "Great place. Great music lessons. Great staff. It's all great.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "110733416546012650638", "name": "Sara Coble", "time": 1486398895811, "rating": 1.0, "text": "I HATE this place. They are very rude. When I came in they asked me things like \"have you ever dropped your flute\" in a very rude tone. I was tempted to just walk out of there and go to Southeastern. All they did was fix a leak and charged me about 60 dollars.When I picked up my flute they played it without my permission and basically told me I had a bad flute. The next time I needed a repair I took my flute to Southeastern and they did a wonderful job. Yes, both stores are a little over priced but Southeastern does a flawless job and is very polite.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "111425860092185481207", "name": "Johanna Massey", "time": 1506037668313, "rating": 5.0, "text": "The service is excellent! The staff saved my son in a bind. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "101604166019040664143", "name": "Ben Neighbors", "time": 1475814271452, "rating": 5.0, "text": "I asked my son's band director where to send my son for lessons, without hesitation he recommend Hallman's Music. I asked other parents and had received the same answer. My son took lessons from Nancy Hallman and Phyllis Peterson over a period of seven years. Both instructors were excellent. He went from being a sub-par beginning musician to making district band in a few months and made superior ratings every year there after. It was an astonishing change.\nI had a co-worked who had a junior in high school and she was at the bottom of the barrel musically, she was in the schools \"C\" band as the only upper class man. I called Nancy Hallman and handed my co-worker the phone and told her to set up lessons. She set up lessons and her daughter took lessons from Mr. Peterson, two months later she made district band. The next school year she made the school jazz band after 5 months of lessons. This young lady is now a music major at the University of Alabama in Huntsville. Hallmans transformed this student that had no passion for music into a musician.\nMy son played the alto sax, I noticed year after year that 7 of the 8 sax players in district band members were Hallman's students, both at the middle school level and high school levels. State honor bands were the same way, Hallman's students. One of my son's peers was awarded the top musician in the state his senior year in high school.\nAfter reading some of the other reviews here I would make the following observations:\nIf you want to put a pacifier in your kid's mouth buy a $50 instrument off Craig's list and have your kids dissatisfied and frustrated from playing an unplayable instrument, then this is probably not the place for you.\nIf Hallmans replace additional pads, it was because they presumed that you wanted an instrument that could actually be played by a student. My experience is when you think a pad or two is leaking and you fix it, you will find the next pad leaking and it was not particularity identifiable until you fix the two pads with the more significant leak.\nIf you want to raise a kid with skilled music instruction and the self esteem from being a good musician, then you have found the right place. The instructors are phenomenal.\nI was always treated fairly with the sales and service and I ended up with a highly skilled musician who I am very proud of.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "113855420172697394514", "name": "Evie", "time": 1474492708135, "rating": 5.0, "text": "I got my sax from hallmans and they have been every so kind! I'm in 7th grade and have been taking lessons from Mrs. Nacy, and I'm going to midstate this year. I'm the first every in my school to go,and thanks to Mrs.Nacy and everyone there I am improving every day. I recommend this store to anyone who is looking to bye an instrument for there child!", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "105807671804565530997", "name": "Oree Tanking", "time": 1483230832201, "rating": 4.0, "text": "I appreciate that the owner works with a college student's budget when tuning instruments.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "101517920814661353913", "name": "Katherine Watson", "time": 1460413476846, "rating": 1.0, "text": "I took my trumpet in to get a dent out of the valves, and without my consent the trumpet was chem cleaned. Any of the crud that was on the inside was gone (that could've been fixed by me washing it at home) and the debt was gone, but the cleaning stripped the lacquer off of the trumpet. Hallman's refused to re-lacquer it unless we paid for it. I haven't gone back since...", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7eab6ee1903e8f2b"}
{"user_id": "105483069876778988960", "name": "Ray Reynolds", "time": 1626815480730, "rating": 5.0, "text": "I had a wonderful experience here. I was able to purchase a ukulele, and also started looking at acoustic guitars to purchase in the future. They have some amps available, and lots of goodies. Super friendly and easy to work with… even offered me guitar lessons!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPke728319yVJe_q6wolIbZNsoBvRZsGPVBj_us=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNSayr67WDTv_L4m8o6ocZshLaasjV_dyjqXOfb=w150-h150-k-no-p"]}], "resp": {"time": 1626825476110, "text": "Thank you very much Ray!! We really appreciate your business!!"}, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "108616931055360345102", "name": "Kathleen Miller", "time": 1608639125283, "rating": 4.0, "text": "Everyone was insanely helpful from who I spoke to on the phone for customer support, to the guy that helped me out when I came to pick up the amp in store. GULF COAST MUSIC takes care of its customers. Will definitely be returning for anything else I need in the future.", "pics": null, "resp": {"time": 1608653682309, "text": "Thank you very much Kathleen! We really appreciate your business!"}, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "100222446622273788683", "name": "Dylan Davis", "time": 1594492087509, "rating": 1.0, "text": "Says open saturday 11-1 am on the internet and drove a hour to see it’s closed.", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "104950421944317078604", "name": "Steve Roth", "time": 1524774622106, "rating": 5.0, "text": "As a guitarist, Gulf Coast Music has everything I need. Great selection of new and used guitars, amps and accessories. I love there new location at the beach right where all the live music venues are.\nGreat pricing and super customer service!!!!", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "113568688341498695175", "name": "Miranda N", "time": 1434823756855, "rating": 1.0, "text": "places never open when they say they are came here on Saturday to get. on the sign it says they're open I'm 11 a.m.  to 5 p.m. when I called the number lady answers the phone and says that they closed at 1 when I got there it was 12:45 pm. she stated that on Saturdays they are closed at one end is on her website when I looked at the website it says 2 p.m. so this place just like with another place in Orange Beach needs to get those two hours corrected stay open when they say that they're open. I should not have to call a business everytime that I want to go to see if they're open. one of these days I will get enough money to open a music store in Baldwin County that stays open when they say they stay open do not recommend anybody to go here.", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "114842666379822912167", "name": "Billy Colburn", "time": 1430500764159, "rating": 5.0, "text": "My first time in I was surprised to see some really fine guitars hanging on the wall.  Bought some excellent PigHog mike cables and was greeted very friendly and made to feel appreciated.  Happy to have a quality music store just a couple of minutes away.  Will be back for sure!", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "105274487585648823824", "name": "Eric Adams", "time": 1470978857533, "rating": 2.0, "text": "I brought in two guitars to get setups(setup costed $25 per guitar) and one came back to me in the exact same condition but with new strings and other still has dead notes on the fretboard. Which was the purpose of my visit. On the plus side the staff was friendly and the strings were reasonably priced. I will not be bringing my guitars back here to get worked on.", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "108394777301105316057", "name": "Joseph schwerdtfeger", "time": 1562167655163, "rating": 5.0, "text": "If your a local musician...this is the place to get your gear...they have a wide selection of strings,sticks,picks,cables,pedals,new and used instruments...And PA gear too... Matt is curtious and knowledgeable and there to help you with all your musical needs...located on hwy 59 between GulfShores and Foley...five stars and two thumbs up... I'll definitely be back...", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "109752350677023787313", "name": "GSPD 550", "time": 1559900664213, "rating": 4.0, "text": "Great locally owned musical instrument store.", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "102146815865530054014", "name": "tina eaves", "time": 1465056145861, "rating": 5.0, "text": "What a quaint store! Love the vibe! Super friendly and laid back! No pressure sales! went in for picks and they had a great sele tion! very clean, lots of instruments considering how small it is. easy find off hey 59 in Foley. i will go back!", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "117129401063050416305", "name": "Royce Teal", "time": 1505835426072, "rating": 1.0, "text": "I am a local and pass by on hwy 59 at least twice a day. This place is not open on a consistent timetable. I have only been able to shop there twice, due to the inconsistency of the hours of operation.\nBoth times the staff was helpful and friendly with no pressure to buy anything. I am saddened by the fact that it is not open on a consistent timetable.\nDon't bother calling the number listed, goes straight to voicemail and the mailbox is full.", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "113915049027232408113", "name": "Emma Mattox", "time": 1476376270399, "rating": 5.0, "text": "Very positive! Super nice, had everything I needed, great prices. I'll definitely come back.", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "104873743695319614092", "name": "Ed Harrison", "time": 1438143391453, "rating": 5.0, "text": "Great little shop!!! I came to get a pack of strings for my guitar and walked out with a beautiful 12-string Martin acoustic and 2 free sets of strings for each of my guitars!! Very Knowledgeable and helpful employees!!! If anyone is in the area please stop by and check it out!!!", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "112810908631259857913", "name": "Bradley Rice", "time": 1557429051178, "rating": 3.0, "text": "Came in and tried out a few guitars for about 20 mins. Guy left behind me and locked the door at 1:00 even though his hours are until 3 seemed upset when I didn't make a purchase.", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "111609086141102176609", "name": "Kristin Phillips", "time": 1483752413202, "rating": 5.0, "text": "I am very pleased with my experience at Gulf Coast Music. The owner, Matthew Johnson put new elixir strings on my acoustic and my instrument  plays like royalty again. Johnson had wonderful hopitality as soon as I walked through the door!\nI was smiling from ear to ear and he had an amazing set up goin\" on. He spoke of a gentleman who was playing at The Hangout today that he had helped with Earthwood strings...which are tough to get, yet Johnson can get them anytime for you!\nOverall, I'm a happy musician.\nThanks Matthew Johnson!!", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "100310447330902319411", "name": "barb Olson", "time": 1521303266532, "rating": 1.0, "text": "I was at Gulf Coast Music this past Tuesday. I wanted to purchase a ukulele but was not familiar with what to buy.  I purchased a Glarry Ukulele for $89.00 plus tax. When I got it home I decided I wanted to buy a better brand so I took it back to find the place closed before the time it said on the door. The sign said \"Sorry for the Inconvenience\". I brought the Ukulele back the next day and he told me I couldn't  return it because he is a wholesale dealer and the said \"no returns\". I did not look at the signs he had in the store or my receipt because I paid him in cash. Needless to say I left as a very unhappy customer. Now, I went on line to see what this Ukulele sells for because if he's a wholesale dealer I should have saved some money on the ukulele.  With tax, I paid $98 plus dollars and I could have paid $36.00 with free shipping on line.  This guy should not be in business and  he ripped me off. Had he taken it back or......put the cost of the ukulele toward another one there wouldn't have been a problem....So much for him saving me money because he's a wholesale dealer.   He's dishonest!  Don't give him your business.", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "107703731987666724908", "name": "washedupification", "time": 1550866549251, "rating": 5.0, "text": "Nice family owned, knowledgeable...friendly", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "117198822398030714750", "name": "Joyce Allmon", "time": 1548285402459, "rating": 5.0, "text": "Nice store with reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "111926470869340052245", "name": "Ashley Garcia", "time": 1494428109987, "rating": 5.0, "text": "Extremely helpful, was kind,  and patiently taught my son how to string his guitar.", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "106914214203157362962", "name": "Rollin Rippel", "time": 1547734311787, "rating": 4.0, "text": "Small space. Lots of guitars. Friendly lady.", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "113420825528145543308", "name": "Fred Blell", "time": 1511293896937, "rating": 4.0, "text": "Great prices on some very nice guitars", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "100050218791867538762", "name": "Isaiah Edwards", "time": 1520706552697, "rating": 5.0, "text": "came right when it opened. great service.", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "110785992615272609407", "name": "John Corn", "time": 1375238811937, "rating": 4.0, "text": "Convenient place to buy my strings and picks", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "106744634513804293185", "name": "Rita B", "time": 1552508187366, "rating": 5.0, "text": "Awesome just awesome", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "101452011848183544862", "name": "Julie Herndon", "time": 1527722367983, "rating": 5.0, "text": "Convenient location, great selection and very helpful.", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "115700349971992429034", "name": "Colin Stimson", "time": 1532722655691, "rating": 1.0, "text": "Closed during advertised hours with no apparent reason.", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "117503343023624171572", "name": "Norman Alms", "time": 1549410621557, "rating": 1.0, "text": "Have not been to gulf coast music", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "105715183180191680652", "name": "Fowler Cunningham", "time": 1434087963672, "rating": 5.0, "text": "Great shop with Great Prices!!!", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "105046667239058632818", "name": "cyotie42", "time": 1545743982597, "rating": 2.0, "text": "They moved", "pics": null, "resp": null, "gmap_id": "0x889a0fc94ee69deb:0x9e3e3d5ca369f399"}
{"user_id": "103434953636452611588", "name": "braxton guthrie", "time": 1611850643436, "rating": 5.0, "text": "The older gentleman I assume he was the owner or manager provided the best experience I've had at a gun store I've been coming here since 2015 when I bought my first AR. The prices are competitive and when trading in a gun or selling they offer the best prices around. Was offered 300$ in store credit on a handgun while 200 was the average I was offered (had a offer from tuckers in priceville for 100$, 200$ lower than Bama)  biggest thing for me is that I've never been disrespected or talked too in a negative or condescending way when I'm there I'm not a firearm expert but that doesn't mean I'm stupid or don't know anything.", "pics": null, "resp": {"time": 1616795878451, "text": "Thanks for your business!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "113203699890849866904", "name": "Hannah Foot", "time": 1619750083937, "rating": 5.0, "text": "Great place to do business, friendly people great prices definitely recommend", "pics": null, "resp": null, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "112366164988636451088", "name": "Trevyn Goode", "time": 1619636563041, "rating": 5.0, "text": "Nothing but smiles! Everyone was super helpful and very knowledgeable aswell as the competitive prices!!", "pics": null, "resp": null, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "107635322009993660273", "name": "Richard Booth", "time": 1606496697035, "rating": 5.0, "text": "The people running this shop are great. They are down to earth, fair, and easy to talk to. If you need tools, this is the place!", "pics": null, "resp": {"time": 1616795905307, "text": "Thanks for your business!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "101566101279422434669", "name": "James Stockfisch", "time": 1622499855823, "rating": 4.0, "text": "The gentleman behind the counter was great", "pics": null, "resp": null, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "110901165800194970734", "name": "Joe Pike", "time": 1616414184147, "rating": 1.0, "text": "Unfriendly.,and overpriced ,,,especially for used merchandise, shelves overstocked  maybe because of the price. .never shop there again", "pics": null, "resp": {"time": 1616795786723, "text": "We have been here over 29 years.  Our regular customers seem to like our prices."}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "105313202993887161433", "name": "Trish Hill", "time": 1619675965963, "rating": 5.0, "text": "Friendly, knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "110644838318245002754", "name": "RereDaGod Sears", "time": 1593796493067, "rating": 5.0, "text": "Great customer service. They're great people and they're great to work with and talk to", "pics": null, "resp": {"time": 1616795922632, "text": "Thanks for your business!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "104181119110822683766", "name": "Daniel Hughes", "time": 1557354765934, "rating": 5.0, "text": "Great business! Bought a rifle online and the whole transaction was handled very professional and went very smooth. Great communication, Fast shipping. Dont hesitate to deal online! Oh and the item came so much better then described.  Thank you Bama Pawn & Gun!!!!!!", "pics": null, "resp": {"time": 1557494743749, "text": "Thank you!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "117559507132659863844", "name": "L3ML", "time": 1504905160209, "rating": 5.0, "text": "This shop is great! They always have tons of tools in stock. Every time I go in to sell some jewelry, they are very honest about what I have, and if I don't know what I have they are very good at figuring out what I have. They are just honest and up front about pawning, selling, and buying. I've never had a bad experience.", "pics": null, "resp": {"time": 1512226643585, "text": "Thank you for the positive feedback!  We do our best!  Come back and see us!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "102941486509567872405", "name": "Ed Colton", "time": 1528924909283, "rating": 4.0, "text": "I see some of the bad reviews but disagree for the most part. My son and I know guns, know prices, and know calibers and can make our own informed choices. We like being left to our own devices to peruse the inventory and ask to see a weapon if we have interest. The guys always are ready to help if we need them. What else can we ask. Plus we liked the fact they had their Boxer dog laying around.  She was a good old gal and will be missed.", "pics": null, "resp": {"time": 1528925675565, "text": "Thanks Ed, we sincerely appreciate your opinion!  Honest, straight forward, and like a boss!  Appreciate you coming in!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "100845273794176453292", "name": "Jake Livingston", "time": 1558887960611, "rating": 1.0, "text": "Rip off!!!! Was charged $120 for a USED tool bag and 5 USED hand tools. $60 for a used tool bag I later found out I could have got brand new from Home Depot for $59. Was charged and additional $60 for 5 USED NON-NAME Brand hand pliers for a total of $120.\nThis place is a joke a scam and a rip off, save your money go else where not only will you get better service you will get better quality and fair pricing.", "pics": null, "resp": {"time": 1559137170359, "text": "I am sorry you feel you were not treated fairly, but if you were unhappy with the price of the items that you knew were used you could have placed the items back on the shelf an not purchased them. This is a pawn shop so it should not be a surprise that most all the items for sale are used items. We check prices daily to make sure we are 30 to 50% below fair market value. Name brand items are priced accordingly."}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "113167067818344906464", "name": "Tammy Balentine", "time": 1536521125889, "rating": 1.0, "text": "Absolutely the rudest pawn shop I've ever felt with! Private messages me when I gave them a Facebook review not about product but only to be rude and complain about their review! I messaged their business around 10am on sat they didn't respond till the next day being terrible towards me and my opinions,  the other businesses I messaged about my husband's new gun responded right away or at least by the end of the day.", "pics": null, "resp": {"time": 1536607319948, "text": "Rude customer, she did not appreciate us trying to honestly work through the situation of her review.  She left a review upon false information, there were never any questions that could have been answered about the \"product\" in the time frame she \"offered.\"  The sad part is she could have made a short, simple phone call to avoid her situation.  Rash and ill tempered she would only see it her way. Short sidedness, a lack of understanding, and poor communication on her part lead to this review.  Her opinion is the only one that matters to her, and we cannot please someone out looking for problems.   We fulfilled our end of what we advertised.  We are thankful for our customers, their respect of our business practices, and common sense!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "108841947463807311252", "name": "Cedric Banks", "time": 1513966776432, "rating": 1.0, "text": "Wanted to spend good money but no was interested in helping me, visited 3 times to give them a chance not to leave me with a bad impression but it was painfully clear I was not welcome, not trying to play the race card but I did not feel welcome and there was no indication of concern to help me.\nThanks for giving me the opportunity to shop else where.", "pics": null, "resp": {"time": 1513973480694, "text": "I'm sorry you feel this way Mr. Banks.  Did you ask for help?  I would like to address the situation with any employee that would refuse to help an interested customer, buying or not.  We pride ourselves in giving the best customer service we can.  If you'd like to come back in and ask for Grant, I will personally help you myself.  There are no race cards to be played up here as well Mr. Banks.  We do not interpret race that way.  Everyone is a customer, no matter the race, no matter the clothes, everyone matters.  We've been here over 25 years for a reason."}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "105051630391577621489", "name": "Bob Gohn", "time": 1501790420241, "rating": 5.0, "text": "Fantastic place! You never know what you might find at Bama Pawn. The folks there are very friendly and helpful with all of your needs", "pics": null, "resp": {"time": 1512226678135, "text": "Thank you for the positive feedback!  We do our best!  Come back and see us!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "100831091305713100470", "name": "Trevor Bright", "time": 1456420194515, "rating": 1.0, "text": "I have been in the store multiple times and on every occasion I haven't had one employee greet me or ask of I needed help. I had great intentions of buying something but it seemed that they figured since I'm a young I'm not going to spend alot of money so there is no point in helping him...", "pics": null, "resp": {"time": 1456424731962, "text": "We're sorry for any experiences you've had where you were not greeted or helped in our store. We actually pride ourselves on our customer service and tell all of our employees to greet customers when they come and go. I'm not making an excuse but at times we do get busy either helping other customers or keeping up with all the paperwork that comes through the store so we may miss a customer here and there. But if you've been in multiple times we should have helped you. As far as judging you by your age or if you're going to spend a lot of money... we have a huge range of prices on tools, guns, and accessories. So whether you're going to spend money or not we aren't going to discriminate against you based off your age, race, gender, or even the size of your wallet. Again, we apologize that you had such bad experiences in our store but we appreciate you bringing it to our attention. Hopefully you'll come back and give us the chance to treat you differently."}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "102504413277881159600", "name": "LG Knives", "time": 1475173561553, "rating": 5.0, "text": "Bama Pawn and gun is a great place to go...I use them as my FFL and they have ALWAYS been helpful, VERY attentive, even answering calls to check on arrivals of merchandise.  I will continue to do business with them as they are just good people...They are a busy store, but so worth the wait in their customer service.", "pics": null, "resp": {"time": 1528987381351, "text": "We appreciate you and your business!  Thanks so much for the great review!  Keep on coming back!!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "100612018170298573871", "name": "Billy Schofield", "time": 1550676955380, "rating": 5.0, "text": "Been doing business here for years. Barry and Danny are always a pleasure to deal with and very knowledgeable on firearms.", "pics": null, "resp": {"time": 1550781081193, "text": "Thank you!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "107098713342470660073", "name": "Katlyn Crowden", "time": 1504894672696, "rating": 5.0, "text": "Great prices and even better customer service! Friendliest staff I've ever dealt with.", "pics": null, "resp": {"time": 1512226601562, "text": "Thank you for the positive feedback!  We do our best!  Come back and see us!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "104207337211029632934", "name": "Jonathan Dennison", "time": 1497731832091, "rating": 5.0, "text": "Had a gun malfunction(used) of the extractor damaged, called and let them know and they told me to bring it back and put the money i spent towards a newer model. Wonderful people, make you feel like family!", "pics": null, "resp": {"time": 1512404085663, "text": "Thanks so much for the positive review!  We really try!  Glad we could work things out for you for the better!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "118384626511936029186", "name": "Paul Hoffmann", "time": 1446217738768, "rating": 5.0, "text": "Always a good deal on guns. And always got a top quality firearm. Also will trade and buy other things.", "pics": null, "resp": {"time": 1559139682275, "text": "Thank you!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "106343354513327639374", "name": "Rita Brown", "time": 1566869194306, "rating": 5.0, "text": "Very honest dependable store.", "pics": null, "resp": {"time": 1568209302589, "text": "Thank you"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "103975442917092006003", "name": "Derrick Evans", "time": 1517431810390, "rating": 5.0, "text": "Best pawn shop in Decatur!  Fair prices, great folks!", "pics": null, "resp": {"time": 1517436547518, "text": "Appreciate the review and the business!  Thanks for stopping in!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "117069082740408574524", "name": "Sea Dragon", "time": 1512151104536, "rating": 4.0, "text": "Prices are a little high but selection is awesome!", "pics": null, "resp": {"time": 1512226493472, "text": "We appreciate the positive feedback, ask about our price matching next time you're in the market to buy a gun locally!  Come back and see us!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "103473980187356272218", "name": "Randy Tucker", "time": 1432157660245, "rating": 1.0, "text": "They try to get rich off every sale. No customer service. Rude. Goto Tucker Pawn priceville for a great deal. I saved 119.00 on one purchase and Tuckers are great people. No relation to me but great people.", "pics": null, "resp": {"time": 1432220189203, "text": "If this customer has been in our store, he or she has never addressed any issues with us or asked us to price match, I've never had any issues price matching Tuckers pricing, ever.  We typically compete with other stores in our radius just fine.  Academy Sport is right down the road as well.  We often get phone calls of them having to price match us.  Also, I find it odd the customer has the same last name whether they \"claim\" no relation or not and praise tuckers all in the same review.  Never the less, all of our other reviews speak for themselves.  It's a shame someone sink this low to jeopardize our ratings.  I hope this review speaks multitudes for the type of person this is.\n\nJust a comparison for all you googler's out there, check out our pricing vs their pricing on Davidson's Gallery of Guns, it just proves this was a low blow and we are cheaper."}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "104735340354091264902", "name": "Bear Man Mountaineering", "time": 1399301577479, "rating": 5.0, "text": "Excellent guys to do business with!  Great weapons at even greater prices!", "pics": null, "resp": {"time": 1528987224997, "text": "We appreciate your business and the great review!  Thanks so much and keep on coming back!!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "115982696467980770318", "name": "SSGT Scott", "time": 1518878251134, "rating": 1.0, "text": "Open @830 on saturdays. Well 0836 and no one is here to open the store for me to get my property that has already been paid for.", "pics": null, "resp": {"time": 1518894547236, "text": "We are a mom and pop store, family emergency's can't be helped.  Nor were you in the parking lot at 8:40 AM when I arrived.  We went above and beyond to remedy your situation and we cannot help your attempt to pickup your merchandise at the last minute and late might I add. We did not have to do what we did.  Nor any of the help we've ever given to you and your family.  I do apologize for running late.  We do however appreciate the review and know where we stand after years of business based on one instance, and not all the other smooth transactions we have shared together.  I do not understand the rash decision to sacrifice a relationship over a temper tantrum, a personal mistake, and 10 minutes. - Grant C, Management"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "101164267795248489531", "name": "bella _ gacha", "time": 1549636181462, "rating": 5.0, "text": "Great staff knowledgeable and friendly!", "pics": null, "resp": {"time": 1549641040779, "text": "Thanks Sherry, we appreciate the review and your business!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "111639040724580985194", "name": "smitty5006", "time": 1442672070089, "rating": 5.0, "text": "I don't come to Morgan County often but when I do I try to visit these guys!!! Friendly staff and a decent selection of reasonably priced firearms.", "pics": null, "resp": {"time": 1528987183733, "text": "We appreciate you coming in every chance you get and the awesome review!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "111756221796426435762", "name": "Jon Madrigal", "time": 1457513583695, "rating": 5.0, "text": "Cheap guns and 300% APY, unbeatable.", "pics": null, "resp": {"time": 1528987236560, "text": "We appreciate your business and the great review!  Thanks so much and keep on coming back!!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "105671904070116890657", "name": "Edward kajdas", "time": 1429882576260, "rating": 5.0, "text": "Great place with good prices and excellent loan prices!!", "pics": null, "resp": {"time": 1528987245333, "text": "We appreciate your business and the great review!  Thanks so much and keep on coming back!!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "106554456628954992823", "name": "Jack Monroe", "time": 1524761093762, "rating": 5.0, "text": "Great, friendly, wholesome staff  with great guns :-)", "pics": null, "resp": {"time": 1559137234839, "text": "Thanks !"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "109051681297488137340", "name": "Matthew Hand", "time": 1568117604021, "rating": 5.0, "text": "This place is amazing", "pics": null, "resp": {"time": 1568209281766, "text": "Thank you !!!!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "111661253174019010946", "name": "G Crowden", "time": 1504894794375, "rating": 5.0, "text": "Great place and great people!", "pics": null, "resp": {"time": 1512226585647, "text": "Thank you for the positive feedback!  We do our best!  Come back and see us!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "111082965585508898263", "name": "Blake Dimick", "time": 1626011698482, "rating": 5.0, "text": "Just an honest to goodness guitar shop with the best damn luthier in the river region for repairs! Matt approaches each guitar as he would his own and his attention to detail is phenomenal. He just re fretted my 65 Fender Mustang and its never played better!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMX3HCh8eIsuBI0qq_kCBrMuK5N-gWU_gdfj1Cd=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPIHzBJGqq7TLD9bQjLwCIOnKPX0en220vIlmht=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN1FEbeB_qhydlmVQnKdg54dfsEU4DNugUx8Bpb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP_fOLRRQrrjohU9tbxsN9gGMQ03hbjbLxs1uFR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMBW8LT2MHUK7tUuKz83Sj3SPeVgP2k1h-WemgD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP2Ph3FLDP_TO3hQjv_y35n8RE0_fAiKlTbMT-K=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMEAMty-0sVY2RZuRNeUgWWym0N4EoLBFAVqI3Z=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNIvzMgcPvLguKqX22DffOZXFWUNGs6FYBCMzsI=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "114939669254900723157", "name": "D “LowAndFast” G", "time": 1618608444890, "rating": 5.0, "text": "Tweed music is stellar! This place is really something special. Matt is a wealth of knowledge when it comes to all things music and the environment itself is very unique and inviting.", "pics": null, "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "107896198043083976200", "name": "Berrey Art", "time": 1616178842889, "rating": 5.0, "text": "I had a Fender Acoustic fall of my wall and cracked guitar pretty badly.  Matt ordered the original wood/material and hand fixed it back to original quality. Highly recommend! Great communication.", "pics": null, "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "111362700430829864905", "name": "Cameron Heyward", "time": 1541611644486, "rating": 5.0, "text": "I’ve never been to a guitar shop I like more than tweed. Matt’s knowledge and skill as a luthier Is incredible. I’ve had 5 guitars setup at this shop and they always come out perfectly. Matt has always been friendly and helpful regarding any questions or advice I need, and has never tried to up-charge or oversell me. If you’re looking for a great deal on a guitar, I’d also recommend stopping by. I’ve bought both an electric and acoustic here, and have gotten a great deal on both.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNGVPOIDhwNwtT8UORAUid1pWDS8Fn0tg_0Qo7P=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "113791341213157573289", "name": "Terrence Coleman (tcoleman701)", "time": 1581363621034, "rating": 5.0, "text": "I'm just getting into playing guitar and had three new guitars in need of professional setup. Was getting the run around from the store I bought them and I was fortunate enough to find Tweed's. Matt was and is awesome! He was able to get my guitars setup on the same day and did a phenomenal job! The store has this very welcoming aura in addition to Matt's friendly and down to earth demeanor, you know your equipment is in great hands. Definitely will be a repeat customer, if you're looking for an amazing music store experience....look no further than Tweed. Highly recommend over any big brand store in the area.", "pics": null, "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "114434761404379476441", "name": "Glenn Mize", "time": 1518796194516, "rating": 5.0, "text": "Just had a complete set up done on my Gibson ES-335 Government Model and it is perfect. Great job and friendly atmosphere. Best in town.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMkrSg1KJMpXFXgXwrlO5xe9oHdUNzWAaIW6T3d=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "103280268436993251278", "name": "Aric Huffman", "time": 1603063242289, "rating": 5.0, "text": "Absolutely amazing store, love the atmosphere, the service is always top notch, and the pure quality of the store is absolutely phenomenal, best around", "pics": null, "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "102252274900193000370", "name": "Paul Baker", "time": 1603828686263, "rating": 5.0, "text": "Matt can usually fix it but if he can't he will be the first person to tell you and probably know someone that can.", "pics": null, "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "100793162251275268110", "name": "Willard Sitz", "time": 1544148731749, "rating": 5.0, "text": "Edit: Worth the drive back to follow up. This is what a guitar shop should look and feel like.  Cool gear, big plush seating to take your time getting to know the guitar in your hands.  That guitar, by the way, at a reasonable price, with a rotating stock so it's different every time and an open workbench up front keeps your visits interesting.\n\nI love coming by to window shop. They were closed down back and July (12th) and agin today. Maybe one day I’ll get to go inside!", "pics": null, "resp": {"time": 1539374176626, "text": "Sorry man.  This is a one man operation and we are on family vacation this week. Drop by soon."}, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "111284266159861616750", "name": "Rodney Dwyer", "time": 1467854243708, "rating": 5.0, "text": "Super friendly, laid back atmosphere, but he definitely knows guitars. Expert, professional, and approachable; unlike the big chain places that make you feel like an outsider.", "pics": null, "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "101278988856006170572", "name": "Mike Gossett", "time": 1537288344737, "rating": 5.0, "text": "Matt is the man and still the only tech I let touch my guitars. We moved away but Tweed is one of the places I make a point to stop in at every time I'm back in town.", "pics": null, "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "117967897362507003823", "name": "Soccer Storm", "time": 1544819976538, "rating": 5.0, "text": "Nice shop", "pics": null, "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "113469307841248397870", "name": "Robin Ricks", "time": 1622074954659, "rating": 5.0, "text": "Super-nice, knowledgeable people, huge selection, and they gave me a great deal!  Loved that I could try out so many different keyboards hands-on.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "100644189284951177146", "name": "D M", "time": 1555982691503, "rating": 5.0, "text": "Great selection of name brand pianos and organs including Yamaha and Hammond.  Their prices are very reasonable for what they sell.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOppdVU70TwyDCRn1Sz_4vpNzfFxEYD3FnS2-mw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOD1a0kNc6O6_8xdQS_LJKV3WJa1wBjiDD8Wwth=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN3ZHpCgXcXVYG1xrdI9goeGduTz86_D6F0spa-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN0o6mWFOZrXTSNHZaOnpsHCQVYKjpxYKB2nCqM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipML83BPOpfeAa5dyJxFZjghQdDMPNjndy9RaZL8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMSrfRe36TQAXpltGCXhOMj0i7hh4Ot3wViOetB=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "111662239498819613694", "name": "Anna Soltani", "time": 1616625345591, "rating": 5.0, "text": "I spoke in-depth with David Ellis about a Yamaha grand piano and he was very knowledgeable and extremely honest. He gave me so much of his time. I truly valued his opinion and would highly recommend Ellis Piano!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "105705542174405422415", "name": "Fred Westrom", "time": 1605135966071, "rating": 5.0, "text": "Ellis Piano is a too notch shop.\n\nThey have a little of everything,\nFrom entry level electric pianos,\nAll the way up to the nicest concert grands that money can buy.\n\nYou will not find a piano store with a better selection, and definitely not with nicer people.\n\nThey are not pushy, and are so friendly that they will spend a little extra time to show you how cool the products that you wish you could afford are.\n\nIf you are thinking of getting a piano, this is definitely the place to go, explore, play, learn, and eventually buy the piano that is right for you, and maybe even the piano of your dreams one day too.\n\nAsk for Jason Ellis, and if you think of it, tell him that I sent you.\n\nI am sure that you will be as impressed and satisfied as I have been with them.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "101080815740163609727", "name": "Valencia King", "time": 1551915411776, "rating": 5.0, "text": "Very friendly staff. Really good people. Awesome pianos.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO6azmKF5-BkJ_zdKI9gHNtNFOivyW9pq2Lf8a6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMvHjdHMNoWF-jwUWlb4z0SfIgpnVAyS0hxflJk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "102096260059049267508", "name": "john condon", "time": 1621724383534, "rating": 5.0, "text": "(review by full-time pro-musician) Ellis is awesome! And take note, David Lambert is the in-house electronic repair \"wizard\" with a degree in Electrical Engineering. Awesome inventory of acoustic and the best in elec keys including NORD, KAWAI, ROLAND, YAMAHA, etc. Plus hybrids which are the latest designs that combine acoustic/elec by using a whole new trigger system that's NOT the midi triggers on each key which slows down the action. It's a completely new technology you have to see. Btw, if you walk in and don't know it there's a room in the back with over a $million in concert grands that blew my mind!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "112801141358444577390", "name": "Jonathan Hart", "time": 1602220903634, "rating": 5.0, "text": "Fantastic family-owned business! I was in the market looking for a new digital piano, and decided to check the place out. Got to talking with one of the family members named Jason about all sorts of piano-related topics. He showed me around the place, helped me get familiar with the layout of the store, answered questions I had about their keyboards, and overall was extremely helpful. Extremely passionate about what he does as well — I enjoyed discussing some of their piano history with him. Ended up purchasing a Roland FP-30 along with a stand and bench for a fantastic price! If you're in the market for anything piano-related, I would highly suggest Ellis Piano!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "116260528175263832757", "name": "Christy Donovan", "time": 1606280812108, "rating": 5.0, "text": "Our favorite piano music store. We try to visit every so often when we are in the Birmingham area. Great selection of music, and plenty of pianos to play it on to see if we like it.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "118317806934458958220", "name": "Kristi Gill", "time": 1611964334885, "rating": 5.0, "text": "I went in for some general information and Cory helped me tremendously\n5 stars go ellis oiano", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "102003740648044982564", "name": "Wendy Jessup", "time": 1572980339100, "rating": 5.0, "text": "❤️🎹❤️ Ellis Piano Store in Birmingham, Alabama, is filled with people who truly have compassion for their customers! Their dedication to excellence is off the charts! I have been shopping at Ellis for over ten years, and every time I walk into the store, they treat me like loving family! They have the very best pianos, accessories, and music at the very best prices! I am beyond pleased with the piano I bought from them! Every time I visit Ellis Piano Store I am blessed! It is the best and most loving family business I have ever seen! It will always be my favorite store!", "pics": null, "resp": {"time": 1574102800097, "text": "We're so glad you choose to shop with us for any piano needs you have! 10 YEARS? That's loyalty and we appreciate that so much."}, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "106053219834463264725", "name": "Yun Jian", "time": 1604099040035, "rating": 5.0, "text": "We bought our piano from here. They are have reliable services.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "108193513562002346577", "name": "D mckenzie", "time": 1584480807697, "rating": 5.0, "text": "I would like to thank the Ellis family for such wonderful service and attention to our Church's needs. Please don't change a thing about how you do business in the community, because you are a pillar of excellence on how to provide awesome customer service and great products. Thank you again for a great experience on the phone and in the store.\n\nThanks Kindly\nGreater Lily Star Baptist Church Family", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "102155996666713963873", "name": "Krystal McCarty", "time": 1579137100001, "rating": 5.0, "text": "I cannot recommend Ellis Piano enough!  Jason and his dad, David, were absolutely amazing through the entire process of piano shopping and purchasing!  If you are in need of a piano (or sheet music) Ellis piano is hands down the place to go!  It is clear that they take pride in their work, and that they want the very best for all of their customers!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "108831394462764944954", "name": "Mary Evans", "time": 1624929240115, "rating": 5.0, "text": "Lots of choices and friendly employees.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "116719126000786713731", "name": "Bob Clocker", "time": 1599965828252, "rating": 5.0, "text": "Excellent place to do business. Helpful, knowledgeable and friendly.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "107379355955868403523", "name": "Patrick Cash", "time": 1578018487164, "rating": 5.0, "text": "I can't say enough good things about my experience here. I had been looking, waiting, researching a Roland RD-2000. Finally stopped in and talked with Cory Ellis and then his Dad.\nThey both helped me and I felt very at home. Both were super nice and very friendly. You can tell they genuinely care about their customers. I would HIGHLY recommend Ellis Piano if you are needing a piano or keyboard. Check them out. You won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "118409397586047919711", "name": "Anabel Sanchez", "time": 1597791534249, "rating": 5.0, "text": "We loved Ellis piano!  They go above and beyond and far as customer service!  Very kind people!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "117338219481207571487", "name": "gail tucker", "time": 1554341630808, "rating": 5.0, "text": "After driving by this place for years with intent to stop in, I did finally stop in ... for only some piano music. I was greeted upon my entrance and made to feel welcome. I was definitely awestruck by the beauty of so many gorgeous pianos gathered in one place !\nI was helped and allowed to browse through music and this adventure has added to my desire to begin playing My piano again .  I will definitely be back!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "114769520970925276864", "name": "Dana", "time": 1553804488987, "rating": 5.0, "text": "Had a great experience shopping here.  They were super patient while I looked at used pianos and then helpful when I finally made my decision to go electric.  When something would work with the Roland app they stopped by to see if they could help, even though I know they were having a super busy day.  And they checked back in with me months later to make sure an accessory had arrived.  Thanks y'all!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "116819620911585758527", "name": "Jeremy Sams", "time": 1584148333566, "rating": 5.0, "text": "These guys really made my dream come true of owning a Nord Piano  the customer service is outstanding ! Thank you guys! They are out doing their competition", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "107674773353864506612", "name": "Allen Jones", "time": 1550533300173, "rating": 5.0, "text": "The purchase of my piano made a lifelong dream come true. Completing the experience was the service of the Ellis family. Family owned businesses have a pride and mindset like no other. Fully attuned to my interests and needs, the Ellises guided me to just the right piano and provided excellent delivery service and guidance on long term care for the piano. I cannot imagine a better experience and am deeply grateful. Sincerely, Allen Jones", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "103176055082092245829", "name": "Allison Walls", "time": 1542165908633, "rating": 5.0, "text": "If you're in need of a piano or keyboard, this is the place to go.  They are not only experts in their field, but they will make you feel extremely comfortable and right at home.  My mom is a private piano teacher and has shopped here for as long as I can remember.  They have, by far, the best selection in Alabama, and their floor room is filled with absolutely beautiful pianos.  Mr. Ellis and his sons are honest and loyal, and we will never buy from anywhere else.  Do yourself a favor when piano shopping and just make one stop here.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "109566530114305587140", "name": "Tiffany Walls", "time": 1541432296429, "rating": 5.0, "text": "Mr. Ellis and his sons are amazingly kind, knowledgeable and honest. My wife's family have been friends and patrons of Mr. Ellis for decades. We would recommend Ellis Piano for the purchase or repair of your piano. You'll never feel more like family than you would here. The store is set up beautifully and these guys will take the time to walk you through features, the history of each piano and feel out your needs to make sure you find the perfect addition to your home and family.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "108820928193929927829", "name": "Luca Guazzotto", "time": 1533917051880, "rating": 5.0, "text": "Great store for piano buyers. Cory and David are very helpful. They will spend the time to knowledgeably talk with you about the various instruments and to let you try on even the ones that are above your goal or budget. They won't press you into buying anything, nor try to convince you that some expensive piano is \"the best piano in the world\" or that some cheap one is a great deal. I didn't buy a piano, but I will definitely be back for one when I am ready.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "100272983077853455931", "name": "Brian Farrar", "time": 1519173532251, "rating": 5.0, "text": "Talk about a class act organization. My wife and I purchased a baby grand piano from this loving and welcoming establishment in September  of 2017. After having the instrument in our home for 4 months 2 keys at the very far end of the piano were sticking. I called Mr. Ellis told him the problem and he sent out a professional to fix it in a very timely manner. Not only did they fix the 30 second minor problem Mr. Ellis had my piano tuned at no expense to us. If that is not customer service I don't know what is. If anyone who reads this post is contemplating purchasing a piano please please please rest assure from the time you meet Mr. Ellis, his sons, and the staff that work there, you will be well taken care of. These people are genuine from the word go. They will assist you if you know absolutely nothing about  a piano to help you find the right instrument for you. Words cannot express how wonderful this business is. Thank you, thank you, thank you Ellis Piano & Organ for being who you are.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "109163112225142637396", "name": "Enoch Ko", "time": 1531756236570, "rating": 5.0, "text": "I recently purchased a Yamaha gc2 from Ellis Piano. Mr. Ellis and Cory were fantastic from showing me their inventory all the way to purchasing. Very approachable and down to earth people. Fantastic people. They could not have made the buying experience any easier. Piano also arrived quickly and I could not be happier with the purchase. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "112222387225320975707", "name": "Andrew Carter", "time": 1553541798082, "rating": 5.0, "text": "They have a great selection of pianos and sheet music!!! Music for all skill levels and all genres! Music Staff is super friendly, very knowledgeable and always willing to help!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "112408207506991275610", "name": "David Porter", "time": 1525810541919, "rating": 5.0, "text": "You might as well call this \"World of Pianos\" because it is FILLED with beautiful new and used instruments. Mr. Ellis and his sons are wonderful people who will go out of their way to help and will work with you to get the right piano in your home. They have a wealth of experience and knowledge. If you are thinking of buying a new or used piano, sheet music or electronic keyboard, you owe it to yourself to check with Ellis Piano.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "104654767959016746921", "name": "Kim Beverage", "time": 1549302627239, "rating": 5.0, "text": "Ellis piano is simply THE BEST place to not only buy a piano but to enjoy the experience of doing so.  Purchasing a piano is a matter of very personal taste and preference...what matters most to David Ellis and his sons is quite simply whatever matters most to you.  My husband recently surprised me by taking me to Ellis to pick out the piano of my dreams.  While they could have pushed me to purchase on the spot, they did exactly the opposite and accommodated me on multiple visits to make certain I went home with the instrument I not only liked....but with which I fell in love (as did my husband).  They went out of their way to educate us about the instruments and encouraged me not to settle.  Not once did I feel pushed to make a purchase.  David and his sons knew this was a very special gift from my husband and they went above and beyond to make sure it was all he wanted for me...and all I wanted as well.  The Ellis family knows pianos, they know the value of a good investment, they know the value of superior customer service, they are approachable and meet every pianist on their level - from the young child just beginning lessons to the most accomplished world-renown performers and everyone in between and they treat them all with the same utmost care and respect.  When you select a piano from Ellis, you receive not only a stellar instrument suited just for you, but also the benefit of a family legacy based on fulfilling musicians’ dreams.  If you’re in the market for a piano, question no further where you should go...Ellis Piano is your answer.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "102677519364029701049", "name": "Gary Kendrick", "time": 1606944497767, "rating": 5.0, "text": "Wonderful visit with the Ellis family.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "100203204711961058003", "name": "Anja Willis", "time": 1608070919761, "rating": 5.0, "text": "Very knowledgeable staff", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "110706796979307173825", "name": "Susan Hanshue", "time": 1523478306471, "rating": 5.0, "text": "My mother was in the store thus past Monday and was very pleased not only with her purchase but the service as well. Cory and Jason were great on all counts. She received a good deal and great service.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "110516190378052860309", "name": "Ken Schmidt", "time": 1609794618910, "rating": 5.0, "text": "Awesome Store!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "102833127230372590892", "name": "Eric Morrison", "time": 1515426515225, "rating": 5.0, "text": "Place is awesome. Family owned business, they go out of their way to accommodate their customers. Salesman walked around explaining everything to us and playing so we could hear the difference between the pianos. Great experience.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "117847787445135229374", "name": "Deborah Hatchett", "time": 1595887309250, "rating": 5.0, "text": "Very personable and ease of purchasing.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "107302468916664438793", "name": "Dustin Wheat", "time": 1502009238738, "rating": 5.0, "text": "I recently bought a digital piano at an wonderful price for my family from this store. The owner and his family of employees helped me choose the right piano that suited our needs. They took the time to help me with all my concerns. I truly felt taken cared of from start to finish with the purchase. I will be sure to go back if I need anything else.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "110155729712176639847", "name": "Roxanne Kutzer", "time": 1493744875603, "rating": 5.0, "text": "My family and I were so excited to purchase our first digital piano and the experience of buying it at Ellis just contributed to that. David, our sales rep, asked us some simple questions about our playing experience and goals and helped us find a great entry-level piano that suits our needs. We're really pleased with our purchase and will return when we're ready to upgrade!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "108255715688584953941", "name": "Robin Leece", "time": 1499651404123, "rating": 5.0, "text": "The owner and his son as well as all the other staff were kind, considerate and professional with obvious integrity. I enjoyed my visit and would only buy a piano here. I wish more of today's business owners took this much pride in their work and were as sincere in helping customers!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "115233342624986170577", "name": "Batman 67C", "time": 1529621208288, "rating": 5.0, "text": "AWESOME STAFF!!!!! One of the employees went out of his way to show/ tell me about practically everyone of the pianos in the main showroom!! Had the best time in here!! Will definitely be buying a piano from here in the future!!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "105356074816387381622", "name": "ines villarreal", "time": 1506489318375, "rating": 5.0, "text": "The Ellis family is one of a kind. Since the first time I walked in, till I finally left with my piano, they were stupend, thoughtful, and inquisitive.\n\nThe father has all of his boys working at the store, which makes it seem like if you were coming home for lunch. They always have good suggestions and fun stories to tell.  On top of that, they are experts on the subject of music, piano and organs.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "115540654412385238950", "name": "Sue Oden", "time": 1473707507117, "rating": 5.0, "text": "There is something wonderful about coming to Ellis Piano to browse through their music.  I am always treated so courteously and feel valued and wanted as a customer.  This is a rare experience in today's society.  I don't feel like a transaction; I feel somewhat like family.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "114937060095745626999", "name": "Lisa Hall", "time": 1544378173679, "rating": 5.0, "text": "Salesman David was so nice. He was very informative about the product. Very pleasant experience", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "112624522857495453849", "name": "Matthew Langkamer", "time": 1569195716867, "rating": 5.0, "text": "Great selection of classical and pop sheet music. And about three dozen pianos I wanna buy.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "105073025225261485030", "name": "Clay Barnett", "time": 1557853259719, "rating": 5.0, "text": "Great service and helpful folks explaining things. Good sheet music collection too.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "112363574607264582263", "name": "Coby Fuson", "time": 1567899439509, "rating": 5.0, "text": "An awesome place with awesome pianos and kind people.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "106812794086520904637", "name": "Jill Carter", "time": 1521664514829, "rating": 5.0, "text": "I love this place.  They are always so helpful and kind. And because I am a teacher, I recieve 10%off. Which is so wonderful of them.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "117259978054771811622", "name": "Angela Manasco", "time": 1514597570815, "rating": 5.0, "text": "Wonderful experience. Knowledgeable friendly staff. Excellent selection for every budget", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "115214418687047774609", "name": "Ricardo Pedraza", "time": 1546888782602, "rating": 5.0, "text": "Beautiful piano selection with very friendly personnel. If looking for a good piano this is the place.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "101459032627051506681", "name": "StevieD Life Vids", "time": 1480187657109, "rating": 5.0, "text": "Worked with Cory who had watch my wife and I come in a few times over the years.  We finally narrowed down our options in the price range we were looking to spend.  Couldn't be happier with the purchase.  Delivery and setup were perfect and we had no issues.  I would buy from them again!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "106118232643256540733", "name": "Casey Middlebrooks", "time": 1460377266563, "rating": 5.0, "text": "You can always tell when you buy from a quality, family owned business.  The folks at Ellis Piano were very courteous, knowledgeable, and helped us pick out the best piano for our needs.  I would highly recommend buying from Ellis Piano.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "108073061521346595386", "name": "Brenda Reaves", "time": 1454386461375, "rating": 5.0, "text": "Wonderful experience all the way around! Great Piano, Great Price and Great Service, what more can you ask? :) This piano is a gift for our son, who is graduating college as a piano major and he picked it out. See Chris Reaves review for more details, he's my husband.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "111506453182554934735", "name": "Chris Byrd", "time": 1598839403918, "rating": 5.0, "text": "Beautiful selections", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "106197121139812433422", "name": "Linda Bartlett", "time": 1528906671501, "rating": 5.0, "text": "They are always very helpful and they usually carry the music that I need for my students.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "114578683997239747709", "name": "John Green", "time": 1520708105245, "rating": 5.0, "text": "Beautiful, beautiful piano's. The staff is awesome. Very friendly.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "116364124460632507436", "name": "Kim Vinson", "time": 1458155777649, "rating": 5.0, "text": "David, Corey and Jason Ellis were very helpful recently in helping me choose and purchase a nice upright piano. The staff at Ellis Piano is always very helpful in meeting my needs either as a singer, piano teacher or purchasing an instrument.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "103419430664304935450", "name": "Rus Hardy", "time": 1498777169161, "rating": 5.0, "text": "Some of the friendliest people around!!  Great selection.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "112187373128068655943", "name": "Virginia Blackwood", "time": 1504047594495, "rating": 5.0, "text": "Best music store I have ever been in!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "115342890563357368190", "name": "TImothy Burns", "time": 1566066240727, "rating": 5.0, "text": "Incredible selection of fine pianos", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "112767678362645238479", "name": "Tony Riddle", "time": 1458834164740, "rating": 5.0, "text": "We have always had a great experience dealing with the staff at Ellis Piano.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "113767253062565218129", "name": "Aaron Joyner", "time": 1518566190556, "rating": 5.0, "text": "Beautiful Pianos and helpful, knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "117729702020867245109", "name": "Joel Hinkle", "time": 1555626828375, "rating": 5.0, "text": "Great people and great deals", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "115484730936948464842", "name": "George Benson", "time": 1490140435529, "rating": 5.0, "text": "Great selection of acoustic and digital pianos.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "104157465691080144718", "name": "Sylvia Jones Davis Stevenson", "time": 1555447921575, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "100685460720006466165", "name": "jessie pugh", "time": 1496212480675, "rating": 4.0, "text": "Nice, helpful staff", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
