{"user_id": "100811678791818039001", "name": "Gabby Zepnick", "time": 1614789848248, "rating": 5.0, "text": "Angela who works at both the Northport and Tuscaloosa location has great customer service skills and is extremely personable. I remember her every time I go into the store. I can tell that she is genuine and cares about assisting her customers in any way possible and as best as she can. Thank you, Angela for your hard work and dedication!", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "113826335387058694826", "name": "Cristan Watership", "time": 1605634164113, "rating": 2.0, "text": "Well stocked store but the women handling the copies are not careful at all and seem confused by anything more than just a single copy. I would take projects to a more competent facility.", "pics": null, "resp": {"time": 1605637733661, "text": "Hi Cristan:\n\nThank you for taking the time to provide us your feedback. I am so sorry to hear we let you down. This is not the experience we want for our customers. We will research this immediately.\n\nWould you please be so kind to send an email to socialmedia.service@officedepot.com with your best contact email and phone number, and a short recap similar to below? Please include the store #2274 in the subject line.\n\nWe are here to help!\n\nChloe :)"}, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "112513237728603061182", "name": "Rose Sharples", "time": 1603206216790, "rating": 5.0, "text": "clean store and the staff was nice and they had what i was looking for at a reasonable price", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "116424778769689894094", "name": "Bryce Besherse", "time": 1611761095755, "rating": 1.0, "text": "Came inside instead at the counter for 20 minutes, the clerk proceeded to help 4 people standing behind me without even acknowledging me. This place should be ashamed of themselves. You've earned yourselves a report to your corporate office. Disgraceful business practices, I will never use Office Depot again.", "pics": null, "resp": {"time": 1612219324664, "text": "Hi Bryce, Thank you for bringing this Customer service issue to our attention. I am so sorry for the negative experience you recently had at our store. I would like to send your comments to the appropriate team, so that this can be addressed properly. They will want to contact you for additional details. Kindly send us an email to socialmedia.service@officedepot.com. Please provide the store # in the subject line along with your contact information and these details. We are here to help! -Emma"}, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "104791667644189869065", "name": "Deepsouth Kuntrydiva", "time": 1588532571626, "rating": 5.0, "text": "I love the entire staff at Office Depot(Skyland). There inventory is always stocked with what I need. The printing departments customer service\nis beyond excellent. Such a warm and inviting atmosphere.They are more like family.\nCharlotte", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "107373939516915055274", "name": "Stacy Bennett", "time": 1563683003062, "rating": 5.0, "text": "It's awesome the staff is friendly. It's clean and they always have what I need. They have every thing for school and the best prices in town . they price match also with no problem\nLoved it everybody needs to come check it out especially tomorrow no taxes July 21", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "112465708765750357085", "name": "Jay Hughes", "time": 1574019049298, "rating": 1.0, "text": "This was my first disappointing experience at this store. I went to make self serve copies and and both machines were down. After 20 minutes of trying to bring them up, they offered to print behind the desk. I said great. What I didn't know was they were going to charge me almost double the self serve. I asked could I get the price matched because it wasn't my fault..they said No. It was a lose-lose. I left the copies there!", "pics": null, "resp": {"time": 1574178301090, "text": "Hi Jay, thank you for taking the time to provide us your feedback. I am so sorry to hear we let you down. This is not the experience we want our Customers to have and we want to look into this immediately. I have shared your feedback with the Field Management Team responsible for this stores location. We would like to try and make things right. Would you please be so kind to send an email to socialmedia.service@officedepot.com with your best contact email and phone number. We are here to help! :) Emma"}, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "103079969129167579836", "name": "TriSeed", "time": 1596237779098, "rating": 1.0, "text": "Me and my wife went in to the store to find a USB head set for her job they looked it up on there computer after they looked they just said they couldn't find it and walked away not even trying to help us find something they did have that may work", "pics": null, "resp": {"time": 1596551175173, "text": "Thank you for bringing this Customer service issue to our attention. I am so sorry for the negative experience you recently had at our store. I would like to send your comments to the appropriate team, so that this can be addressed properly. They will want to contact you for additional details. Kindly send us an email to socialmedia.service@officedepot.com. Please provide the store # in the subject line along with your contact information and these details. We are here to help! -Emma"}, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "112793675042594123554", "name": "Anna Henson", "time": 1543460742099, "rating": 5.0, "text": "HUUUUGE shout out to Ashley and the rest of the crew in the print department. I was in a bind needing a last minute print job and Ashely totally went above and beyond. She was very knowledgable and kind. She had great recommendations for getting the most out of my project and I will certainly be back with anything I need in the future.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "113753666233879809378", "name": "Allison Gage", "time": 1557088110083, "rating": 2.0, "text": "First, they tried to charge me double the price that was online for a print job, then when I went to pick it up all 375 copies had a black line running down the middle. Yes, they re-ran the job, but without any apology at all.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "112923804550760433349", "name": "Craig Parker", "time": 1506784798059, "rating": 5.0, "text": "I was surprised. The salesman  was very helpful and showed me where everything was I was looking for. Very impressed.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "104476824455300035199", "name": "jim cantell", "time": 1383080366245, "rating": 1.0, "text": "Took my computer into this store. Talked to an extremely nice gentleman named Robert. Little did I know that he was about to try and screw me out of a ton of money! I left my computer there for a \"free\" check up. When I came back two days later, this guy had just deleted all my stuff off the computer. It had a virus and if I wanted to wipe all the stuff off the thing I could have done that myself. He then tells me that I owe Office Depot $240 for the work. And then stuck his hand out like I was going to give the cash to him! So now I have lost all my stuff off my computer. If you don't want to waste your time and money don't take your computer here.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "117759622648817544005", "name": "K. “Stunts” P.", "time": 1495217401387, "rating": 2.0, "text": "Ok so they messed up my computer and now no antivirus program will work on it. It's been a week now. Yesterday they said that they have absolutely no idea what's going on with it and that they were going to take it to another office Depot location to let them have a look. I call the other location a little while ago and the tech guy tells me he doesn't know what I'm talking about because he didn't work yesterday when my computer was to be taken to them. Anyways he's supposed to be checking it out and getting back up with me. I'm hoping they figure something out. On the plus side they are really nice people and seem to be taking responsibility so I gave them 2 stars.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "112441212817693469546", "name": "Agent Phrosty", "time": 1470335619924, "rating": 2.0, "text": "Staff lacks knowledge about products sold, particularly technology. Store cluttered with little attention paid to items fallen on the floor. Lines often several customers deep with only one register open. Several attempted purchases failed because items were not in stock, despite product boxes being on the shelves. Save the stress and the gas and go elsewhere.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "103857433614098597155", "name": "Rodney Lucio", "time": 1479350297314, "rating": 4.0, "text": "Office Depot always has great clearance sales. Staff is always helpful and courteous.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "106445416894083423253", "name": "Christie Parker", "time": 1500908910347, "rating": 1.0, "text": "They never answer the phone when I call to see if what I need is in working order, and every time I've been in lately, mysteriously, whatever machine I happen to need that day in the print services department is 'broken.' Not sure if the person is just being lazy or their luck is really that bad.  Do yourself a favor and drive across town to the other location.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "114644026785020341986", "name": "Sven Holiday", "time": 1551749431533, "rating": 2.0, "text": "Store is very dirty. Candy wrappers, bits of paper trimmings, and old gum on the floor.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "110429701100738620479", "name": "Bryan McElroy", "time": 1510370108970, "rating": 4.0, "text": "Great for all of your office needs.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "111989233813889467946", "name": "John Heathcoat", "time": 1546714864859, "rating": 5.0, "text": "The clerk took care of all my computer needs", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "115388145690955091870", "name": "Harry Knight", "time": 1545428627659, "rating": 5.0, "text": "Very helpful.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "101597814296287837258", "name": "Elizabeth Brasfield", "time": 1486431225327, "rating": 3.0, "text": "Great products and service.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "104037052230040687895", "name": "Iain M", "time": 1478739880397, "rating": 4.0, "text": "Stationary!!", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "110003547842982332467", "name": "Camilla Pickens", "time": 1474414519327, "rating": 5.0, "text": "Great customer service.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "109541689856131342292", "name": "Jeremy Butler", "time": 1485867172440, "rating": 3.0, "text": "Well-stocked office-supply store. A lot of turnover in its staff, however. So the service is hit-or-miss.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "103039775318863817911", "name": "Brennen Privett", "time": 1608412207744, "rating": 2.0, "text": "This was the worst experience I think I've ever had in a store. The staff was horrible. I asked a simple question and the guy said I'll go get it from the back. I sat at the front for 45 minutes. Not only that but the girl at the online pickup/print area literally cussed out a customer. He left. Not to mention how messy and dirty the place is.\n\n(Edit) When I found the guy he apologized. I understand that people can forget things. 1star to 2 stars. (Because that chick was super rude and like I said she cussed a customer out)", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "113416110037510340805", "name": "Messy Potamia", "time": 1576600811442, "rating": 4.0, "text": "Okay.  Heavy rains last night. Wonder if he spent the night in their men's restroom handicapped stall.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMsYtawJYYLHTMXw6gS_XsMQ2Jes_AD3UCC-ga2=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "106623994486252017043", "name": "patricia mccoy", "time": 1621055645747, "rating": 1.0, "text": "Very rude and unprofessional person that works up front I would gladly take his job and I could guarantee that every customer that came through there would be helped and smiling when they walked out. I will never go back and I bought nothing.", "pics": null, "resp": {"time": 1621440487065, "text": "Hi Patricia:\n\nThank you for taking the time to provide us your feedback. I am so sorry to hear we let you down. This is not the experience we want for our customers. We will research this immediately.\n\nWould you please be so kind to send an email to socialmedia.service@officedepot.com with your best contact email and phone number, and a short recap similar to below? Please include the store #2564 in the subject line.\n\nWe are here to help!\n\nChloe :)"}, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "114654694346750625790", "name": "Stephanie Mims", "time": 1607317657466, "rating": 2.0, "text": "Last 2 times I been in this store, staff was non existent. Couldn’t find anybody to help. Finally found one guy that didn’t offer that much help or knowledge. Went back in to return an item and cashier had an attitude for no reason. Store was messy and disorganized. Went down to Staples and had an awesome experience. Also spent $200+ there. So sorry about y’all’s luck. I won’t be back to this location.", "pics": null, "resp": {"time": 1607787227490, "text": "Hello Stephanie,  Thank you for taking the time to provide us your feedback. I am so sorry to hear we let you down. This is not the experience we want our Customers to have and we want to investigate this immediately. I have sent this to the Field Management Team responsible for the store's location. We appreciate you bringing this to our attention.  Leesa"}, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "100735062210791365838", "name": "BJ Winston", "time": 1607134748522, "rating": 1.0, "text": "This store needs more workers and ones who actually service all customers and not those of their same skin tone. Waited an hour for assistance. Found what I needed but no one was around to help except for the guy who went from the the counter to every other customer except me. Ordered the product online, finally ask for help again only to be told that the display could not be sold.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "104940383881701636080", "name": "Shawna L.", "time": 1607093682986, "rating": 5.0, "text": "Five Stars to Tech Services Rep *Will*. He was extremely patient in helping me with issues with my desktop (White Dell AIO). His advise, skillset and overall mannerism was the epitome of customer service. Thank you Will !", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "117502573981034452638", "name": "Ashley Wright", "time": 1602525576880, "rating": 1.0, "text": "Went into store to buy two computer chairs for our household. We found the ones that we wanted at the price point we wanted. No one seemed to be available to help us, so we had to load them up ourselves. Once reaching the register, the chairs rang up $100+ higher than the signage. Even after verifying the price tag did indeed show the lower price, we were (rudely) told that since the sale had ended (6 days earlier, btw), they would not honor their price tags. Either update your signage when the sale ends, or learn something about customer service and own up to your mistakes. I've worked in retail before, and this is not how you treat customers.", "pics": null, "resp": {"time": 1602539983634, "text": "Hi Ashley, Thank you for bringing this Customer service issue to our attention. I am so sorry for the negative experience you recently had at our store. I would like to send your comments to the appropriate team, so that this can be addressed properly. They will want to contact you for additional details. Kindly send us an email to socialmedia.service@officedepot.com. Please provide the store # in the subject line along with your contact information and these details. We are here to help! -Emma"}, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "103954730020821207937", "name": "Brandi Westrom", "time": 1597165644070, "rating": 1.0, "text": "I ordered a printer to be delivered.  Shipping confirmation stated that I would receive the printer on 8/10/20.  I received another shipping communication after the printer was not delivered stating that the printer was not on the truck but delivery would be attempted again.  I contacted customer service and found out that I would have to reorder the printer to actually get it.  The email said nothing about needing to reorder!!!!   It is no wonder Amazon is doing so well.", "pics": null, "resp": {"time": 1597253819679, "text": "Hi Brandi:\n\nThank you for taking the time to provide us your feedback. I am so sorry to hear we let you down. This is not the experience we want for our customers. We will research this immediately.\n\nWould you please be so kind to send an email to socialmedia.service@officedepot.com with your best contact email and phone number? Please include the store #2564 and the order # in the subject line since this is more of a order issue.\n\nWe are here to help!\n\nChloe :)"}, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "112122945503852262767", "name": "Carl Esch", "time": 1548246265669, "rating": 3.0, "text": "I gave a 5, STAR review on this sight. HOW EVER this time when we went to pick up our new batch of Business Cards for our Band, they was not as well made as the original was. I gave the Lady at the desk one of out old cards told her to duplicate it. She said Very well. We ordered two boxes. When I picked them up they was off centered to the Left cutting My wife's right shoulder and part of her hat off. The lettering was so darn small and light colored we could see it with a magnifier glass. But when you hand a card to a Potential Client, you want them to be able to read it easily. If they have to strain they will chunk it. I cut the rating down to a 3 star. If it is no better I will cut it out all to gather. They have always been good there is why we went back.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "104131972493762022041", "name": "kevin nguyen", "time": 1579522417916, "rating": 1.0, "text": "I went here to get my business gift certificate done. i gave them a copy of my old gift certificate and tell them that how i want, when i pick up and take it home until my boss take a look, he was so up set how poor and ugly it look, I regret that I didn’t look before take it home. I never come here again, staple is the best place to go", "pics": null, "resp": {"time": 1579619952733, "text": "Hi Kevin, Thank you for bringing this Customer service issue to our attention. I am so sorry for the negative experience you recently had at our store. I would like to send your comments to the appropriate team, so that this can be addressed properly. They will want to contact you for additional details. Kindly send us an email to socialmedia.service@officedepot.com. Please provide the store # in the subject line along with your contact information. We are here to help!   Emma"}, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "117967493083315865309", "name": "Dokter Xomby", "time": 1585357422659, "rating": 1.0, "text": "If I could rate zero stars, I would. Ordered a computer for curbside pickup, they assured me on the website and when called they had one in stock, but they didnt even have one. I drove from an hour away to be told they dont know what I'm talking about. I spent $566.74 and $10 in gas to be turned right back around. They were rude and kept avoiding me because it was 30 minutes before closing time. Now I have to wait 3 days to be refunded my money. I will never be doing business at this store again. Better off going to your local Goodwill or Walmart for a computer than this Office Depot. Horrible experience!", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "107876123964304094875", "name": "Amy Gilmer", "time": 1531249993672, "rating": 4.0, "text": "It's an older store, but it's well organized and clean. Employees were all friendly and helpful. I did an online print order and one item was wrong. The employee at the print center fixed it immediately and everything turned out great.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "104383117432529953986", "name": "Amber Puckett", "time": 1562285147887, "rating": 5.0, "text": "I love shopping at this store. I do a lot of personal and business transactions at this store. The staff always makes me feel at home and part of the family.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "113876422452428467601", "name": "Donna Stamper", "time": 1539215198431, "rating": 3.0, "text": "I appreciate the Office Depot staff walking 20 feet to the ink section to retrieve the single black cartridge I ordered online. Apparently, the online ordering process is only convenient if the item you're ordering is not actually in the store and you need it to be.  Otherwise, you will spend just as much time, if not longer, standing at the online pickup counter trying to pick up the item you searched and already paid for online.  Office Depot scanned my driver license (I had already clarified that I personally would pick up the order, as the online form asks). I was asked twice if I wanted a receipt, once by the computer then by the rep (the receipt already came to my email,  along with the $ withdrawn from my account when I placed the order).  I had to sign the credit card panel.  Honestly, I don't have to do all that when I order $200 worth of groceries online for pickup at Walmart.  Office Depot--please make your online ordering more efficient.  Isn't that the point of ordering online--efficiency and convenience?", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "108034972724537357610", "name": "CC", "time": 1554511308006, "rating": 1.0, "text": "I ordered a poster print at 11:47 am because I needed for a trip I'm taking tomorrow and they claim to provide same day service. They said it would be ready by 7 pm. That gave them 7+ hours to have it done. When I came to pick it up 7pm, the guy behind the counter said, \"Yeah, I haven't even started it yet.\" No apology. When I got upset he asked when I needed it. I said, now. You had 7+ hours to get it ready! I won't being doing any business here again!", "pics": null, "resp": {"time": 1554813123962, "text": "Colleen, , I am sorry to learn that you were disappointed with the service you received during a recent visit to your local Office Depot store.  When you enter one of our stores you are our guest, and as such are entitled to be greeted by knowledgeable employees who are willing and eager to assist you.  From your comments, it appears that this is not the level of service that you received, and we regret disappointing you.\n\"\"If you would like I can place a note for someone to contact you back after they receive the complaint, would this be okay?\" If you would reply back to SocialMedia.Service@OfficeDepot.com . Please enter the store#2645 in the subject line.  Thanks  Shirley!"}, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "111455539412458117269", "name": "S.Hazen Guthrie", "time": 1434644251369, "rating": 5.0, "text": "I have had two copying crises.  Not a normal Office Depot customer, I followed a suggestion to try  a particular Office Depot store in my city:  University Drive, Huntsville Alabama.\n\nCustomer service by the copy specialist, Katie, was just amazing.  There was no job too unusual, time limit too constraining.  She was creative, competent, and fast.  The second occasion, I was helped by the manager, Gary.  He set me up with the copy center.  Once again creativity, confidence, and service.\n\nAs an individual businessperson, my crazy schedule and over-full priority list were made so much easier today.\n\nThank you!!!", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "110760664684586358913", "name": "Paulette Risher", "time": 1488836419565, "rating": 5.0, "text": "Yesterday, I purchased a 27\" Samsung Computer Monitor.  I installed it and was extremely unhappy with the quality of the color and resolution.\n\nOnly then did I go back and read the reviews on the Office Depot website and found that I wasn't alone in my negative assessment.  I called the store and the customer service manager could not have been more accommodating.  There was no whining or critique.  He simply told me to bring it back and they would give me a refund or trade it for another monitor.  This morning I took it back in and the man that helped me could not have been more helpful.  I bought a Dell (one with great reviews).\n\nThis is a true example of what excellent customer service looks like.  Thank you!!!", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "100463571348503777909", "name": "Justin Mullen", "time": 1536445083480, "rating": 1.0, "text": "Very disappointing customer service. Came in to pick up extra  mechanical pencils and note cards while in the area and went to the check out.  No one was running the registers, but three employees were behind customer service (2 high school/early college age male and female, as well as a older female)  The two young employees were actively engaged in a conversation, one makes eye contact while the other has back turned but continues with conversation.  The older female notices me as well and has to tell the younger female with her back 4 times to return to her register.  She goes to register, doesn't greet me or ask if I found everything alright.  Instead only asks if I want to sign up for a membership a few times after I decline repeatedly.  She puts my order in the bag and walks off before I can take my card out of the chip reader and back into my wallet.  Didn't even get a thank you for shopping.  Will not return again since staff doesn't want to make their customers feel welcomed or care if they make the sell. Will just order supplies from Amazon in advance, or go to Walmart in a pinch.  At least then I can use self check out.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "102527292129215127093", "name": "Gwen Thomas", "time": 1539027136236, "rating": 2.0, "text": "I go to the copy department to get a couple of sheets enlarged. It will be ready in 10 minutes the employee says. I leave and come back in 30 minutes. There is a new lady behind the counter now!! Asking me all kids of questions because the first employee didn't do her job.\nSo frustrating!! So now I still have to wait.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "102674955996533736309", "name": "Mattea Matthews", "time": 1564684152653, "rating": 1.0, "text": "Placed an online print order and called to see if it really was going to be ready at 7pm or if I could get it earlier. When I got transferred to their department the girl answered \"Printing\" I told her about my order and was told \"If it said 7pm then it will be ready at 7pm\"  then she asked if that was all I needed because she was busy. If ya hate your job that much go find a new one. If management reads this (I really hope you do) if your staff is too overworked and can't keep up with orders than put more staff on and if not then talk to them about customer service. I wont be ordering here again.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "100271898301250768017", "name": "john morton", "time": 1570611180545, "rating": 5.0, "text": "Friendly staff. Nice set up of products.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "113363326513093680070", "name": "James Burton", "time": 1483768165016, "rating": 1.0, "text": "Always available to help. (5 star)\n\nUpdate Dec 2016 (dropping to 2 star): went by on a Saturday and they were closed by 6:30 even though their sign says they're open till 9. The agent on the phone kept insisting their hours were listed as until 6, and i think he was only satisfied when I read him the hours sign that they really were listed as open until 9.\n\nUpdate Jan 2017 (dropping to 1 star): I contacted the company about the incident above, and they forwarded my message to the local manager but I have not heard anything after several days. Seems like they should want to fix this. . .", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "105582021345420739973", "name": "Joseph Chandler", "time": 1550546462492, "rating": 5.0, "text": "This is the 2nd time over the years we've bought a new computer from this Office Depot. They actually have really good prices a wide selection of computers both online and in store, and they are friendly and don't push anything you don't need.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "102733867975260162027", "name": "A Shirey", "time": 1539009024194, "rating": 5.0, "text": "Awesome customer service... Oh did I mention their backpacks are 60% off - don't forget to check out all the Office Furniture upon ur visit and ask for Apollo Furniture assembly service", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "111174830013976424422", "name": "Dark Hatter", "time": 1513448991803, "rating": 5.0, "text": "Miss Talitha, who works in the copy/print section is amazing.  She is extremely helpful and goes out of her way to help how she can. Someone please PROMOTE her!", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "111960708488432984299", "name": "Constance Tiller", "time": 1542403076129, "rating": 5.0, "text": "Always friendly service. I found some great deals today!", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "106098771998297944446", "name": "youknowit158", "time": 1526837693072, "rating": 1.0, "text": "Walked in to look at chairs for a home office. Now it had been open for 2 hours by the time I walked in, and there was trash all over the floor looks like they haven't clean that place in months. And with the horrible lighting of the place and garbage all over the floor and when I mean garbage I mean candy wrappers pieces of plastic receipts and random other things of trash this place just seemed disgusting in the lack of acknowledging my existence by the employees this place gets one star because there's no option for zero Stars. Myself and one other person were the only customers in the entire store literally the employees had us out number 2 to 1. And no one could even say welcome or even clean that place very lazy employees from what I've seen. I can safely say I will never go back to that place.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "114546726941031957510", "name": "Emilee Vinton", "time": 1535216928777, "rating": 1.0, "text": "Literally the WORST place EVER! Drive AWAY Drive Away FAST! Go anywhere else! I don’t even know why I keep coming back. Every time I go there to get print work done, they forget about my order and when I go to pick it up they never know what I’m talking about. I even go in an place my order in person every time and they still manage to not do their job! It’s ridiculous and then they expect you to pay full price for a huge inconvenience!!! I needed invites printed out recently and needed to mail them on a certain day. I told the lady she was like sure no problem. It will be ready at such and such time. Keep in mind I have a toddler in which it’s hard enough to make time to run errands. I go in with my toddler to pick up my order and I’m actually an hour later than what she told me because I figured they could use the extra hour.  Well when I get there, they had no idea what I was talking about and said the lady never put my order in. My stuff that I wrote down for her along with my usb drive is missing too. My toddler isn’t happy at this point and neither am I! Finally they find it and he said oh yea it’s not done sorry. I can have it done in like a few hours..... I was like well that’s not very helpful bc I needed them mailed today and he said yes I’m sorry. Okay well do you expect me to pay full price bc I sure as heck am not!!!!! Like don’t go here if you want things done right! This is seriously the worst place to go! I wouldn’t even give them a 1", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "104545075494302764697", "name": "John Belt", "time": 1556921735641, "rating": 5.0, "text": "The really tall skinny guy was very helpful and very friendly. I'm sorry I don't know his name.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "102678947769045333164", "name": "Ashley Fountaine", "time": 1368633526673, "rating": 2.0, "text": "I found the other Office Depot location (at around Drake and Memorial) to be more helpful. The University location had my item \"in stock\" but they couldn't locate them. They had it marked on sale and it wasn't, according to the manager. So, I visited the other location and they honored the sale even though this location is the one that messed up and left their sign up.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "103085755643987955460", "name": "Rosemary Davidson", "time": 1509174111750, "rating": 5.0, "text": "Great customer service. They scan my documents for me, and had some great clearance items for the Teachers.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "103778460469912688270", "name": "Jessica Polk", "time": 1492274460216, "rating": 4.0, "text": "Awsome customer service. Store was very organized. Staff was more than willing to help.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "114026981524584990985", "name": "Lynn Howze", "time": 1502420374315, "rating": 5.0, "text": "Great customer service. Keep up the good work", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "111129544741600877237", "name": "Deborah Lee", "time": 1498591823492, "rating": 5.0, "text": "I purchased PC, modem, etc. Gary was a terrific rep to work with. Very helpful and efficient.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "109842370976235742300", "name": "Chantaine Rhoe-Bulluck", "time": 1538448943755, "rating": 5.0, "text": "Great service, product s and prices! It's a triple win!", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "111782793664577030461", "name": "Cynthia Riddle", "time": 1549126533219, "rating": 5.0, "text": "The staff was very friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "105260404103213638759", "name": "Lee Mills", "time": 1493045360957, "rating": 4.0, "text": "The folks were nice but everything I needed was out of stock.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "110590860214026251235", "name": "David Brewer", "time": 1556140119066, "rating": 5.0, "text": "Friendly personnel and a great sale.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "104358650742509000140", "name": "Kayci Williams", "time": 1552514035915, "rating": 1.0, "text": "Called to get a quote to see how much a repair was. Got put on hold then they hung up.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "111735215265011923940", "name": "Michael Pukish", "time": 1549841727945, "rating": 5.0, "text": "I got help in the aisles from a salesperson without having to ask, and that's everything these days because it's so rare now.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "116491253873525216004", "name": "Paul Tidd", "time": 1534951397553, "rating": 5.0, "text": "They had everything we needed", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "112982658453514223724", "name": "Scott Smith", "time": 1533780873928, "rating": 4.0, "text": "I can really had a hard time finding an Android USB mini charge cable everything you have it's for an iPhone right.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "113611150480649721892", "name": "annette bramblett", "time": 1498003200042, "rating": 4.0, "text": "Customer rep didn't know what steno pads were (showing my age lol), but we found them. Manager checked me out so there would be no waiting.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "117337554654179213796", "name": "Robert Kemper", "time": 1527888017871, "rating": 4.0, "text": "Lots of selection except in the telephone area. Couldn't find what I needed.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "100017718313714410450", "name": "AnnMarie Martin", "time": 1535423791045, "rating": 5.0, "text": "Great customer service!", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "115421978000062935647", "name": "Pat Stolz", "time": 1540493410623, "rating": 3.0, "text": "Hard to find someone to help find an item and then only had one of something i was looking for, but the south store had 5 in stock.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "106947754633020076261", "name": "Arthur Arthur", "time": 1455417459403, "rating": 5.0, "text": "Customer service by the Computers specialist, Stefan, was just wonderful.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "107288027382965199795", "name": "Sabrina Faer", "time": 1511289517513, "rating": 5.0, "text": "Great service!", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "100017718313714410450", "name": "AnnMarie Martin", "time": 1535423791045, "rating": 5.0, "text": "Great customer service!", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "106947754633020076261", "name": "Arthur Arthur", "time": 1455417459403, "rating": 5.0, "text": "Customer service by the Computers specialist, Stefan, was just wonderful.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
