{"user_id": "108351957672070451415", "name": "Remain Nameless", "time": 1625696759826, "rating": 5.0, "text": "Ward.... you were a little hard on the Beaver. The worst place in Oxford is on the south side of Hwy 78 East. The BEST place is A&B and they are located on the north side of 78 just east of Hutch Touch. I'm in retail sales in the trailer industry myself and A & B Trailers is my go to source for information, parts, and trailers. If  I have a question about ANYTHING in regards to dragging a wagon... A&B Trailers.. Knowledge level? I'll put it this way; theres not anything they can't  cover on your trailer.  I promise, they will never lead you wrong. These guys are not pencil pushers that have sit behind a desk all of their lives. They are blue collar, hard working, hands on, highly experienced fabricators and they know their stuff. If you want to spend half of your retirement on junk just to have it fall apart in a few months, then go across the street and shop with Ward. Now if you want an extremely well built, solid piece of equipment at a reasonable price  from an excellent company that stands behind their product AND appreciates their customers?... Welcome home family!! You are in the right place. A&B Trailers. You won't find better people anywhere and let me just add this in there.... these cats are Perfectionists. I know. I have worked side by side with them in a fab shop and I am a perfectionist also, but these jokers....well they take it to a whole nother other level. I will take an oath to say, \"They do things at A&B with a whole bunch of heart and a truck load of pride. It's done once, done right, and that's the product they will provide you every single time. I highly recommend A&B Trailers for all of your parts, accessories,  tires, wheels, batteries, or even if you are looking to upgrade with a brand new piece of pride attached to your vehicle.. Come on down to A&B. I'm sure glad I stopped here. Received a solid product and made two friends for life. Where else can you get service like that? A&B Trailers. Ask for Andy or Barney. NO need in referencing my review. They'll know who sent ya when you call them by their names 🤣", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "104375517629357760498", "name": "Helen White", "time": 1610829596860, "rating": 2.0, "text": "I orginally posted a 5 star for this company. But after the delivery of building I purchased, very disappointing experience.  The delivery driver charged an additional $100 for the height and still wasn't at the height for the charge. We had to redo all blocks because it wasn't level or supported correctly. Was basically told not responseable for third party, I didn't purchase it from third party purchased from this business.", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "106890390879591004809", "name": "Fred Luhn", "time": 1601319542310, "rating": 5.0, "text": "Always a great experience here. Guys there are always helpful and pleasant to work with.", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "107259342179334744693", "name": "Yansi Taboada", "time": 1627338239356, "rating": 5.0, "text": "Truly amazing", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "100765945374256710859", "name": "Ian Hutchins", "time": 1598540567529, "rating": 5.0, "text": "Always been a good experience and the staff has always been nice!", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "114101882504774297237", "name": "Jack Witteveen", "time": 1597183177282, "rating": 5.0, "text": "to those of you who have posted a negative comment, tell the whole story so that we all can understand!! thank you", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "117344392039055704868", "name": "Wesley Elkins", "time": 1563376276116, "rating": 1.0, "text": "Rude staff and we're no help I wouldn't stop here if I were you", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "113574574772820989533", "name": "MIKE Armstrong", "time": 1367849753885, "rating": 5.0, "text": "Gentleman & scholar, fun to play with & loved his music", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "108498857249648326575", "name": "Bradley McCurry", "time": 1599592836023, "rating": 1.0, "text": "We ordered 10 trailers from them and paid them over $8k as a deposit.  They won't answer calls and keep promising delivery in text messages but they never come.  They were supposed to be done in 3-4 weeks.  It has now been 6 months.  We have demanded a refund or delivery and have even sent someone to their shop.  They are dishonest and not to be trusted.   I will update this review if we get our money back or the trailers are delivered.  Does anyone know an attorney in Madison County?\n\n8-24-20 UPDATE - We still have not received our order despite repeated promises they would be delivered in whole and/or in part depending on which week your are talking about.  We are filing a BBB complaint and will file suit against them if that doesn't resolve it.  We have put them on notice of this and are doing everything possible to resolve this without taking that step.\n\n9-8-20 UPDATE - We still have not received our order.  The last promise made was they were going to deliver a load on Sunday 8/30 (not our entire order but enough to cover our deposit).  Since we paid by wire transfer we have now filed a complaint with the FTC as well which was suggested by the BBB.", "pics": null, "resp": null, "gmap_id": "0x88626a2944b87333:0x34bc6dd0e1f8a1a"}
{"user_id": "116198764319997524302", "name": "Aiden Rayner", "time": 1602110461002, "rating": 1.0, "text": "“If I could leave zero stars, I would. I gave them a 700 dollar deposit, over a year ago, and still haven’t received my trailer. They are literally impossible to communicate with and whenever I do speak to them “something has came up” on a time or day to meet. Seriously starting to think it’s a sort of scam or such. do your research and read the other reviews! I’m not the only one.” from my boss Mr. Wong. He asked me to post this because he’s not too tech savvy.", "pics": null, "resp": {"time": 1616296908350, "text": "I don't have anything in the computer under your name...give me your name that the item is under under and I will get it rested asap."}, "gmap_id": "0x88626a2944b87333:0x34bc6dd0e1f8a1a"}
{"user_id": "102098164107016390249", "name": "jon k", "time": 1616294887316, "rating": 5.0, "text": "Excellent work and attention to detail.", "pics": null, "resp": null, "gmap_id": "0x88626a2944b87333:0x34bc6dd0e1f8a1a"}
{"user_id": "103766234096555403606", "name": "Andrea Wiley-Bigelow", "time": 1572142542118, "rating": 1.0, "text": "We ordered a grill I’m December of 2018.  Because my husband is on the road a lot, we were promised the grill would be ready the end of Feb.  we left a deposit and received a receipt for balance due once the grill was finished.  My husband was on the road so I went by late Feb to check on the status and it was barely started.  Hubby came home around Mid April and we went to check on it and again, not ready. Was promised we would have it time for Memorial Day Grilling. While my husband was on the road, he called frequently as did I.  Not only did we never get anyone to answer but no return calls.  Needless to say, it wasn’t ready for Memorial Day nor 4th of July.  Because they would never answer the phone nor return calls, I went to the business several times to check on the grill and each time only a few workers were there and not the owners and each time the grill looked like a totally different grill.  My guess is they were building and selling it to other customers because they knew my husband was on the road.  Each time my husband came back home, he checked on the grill and because it would not be ready, the owner would throw in extra things. We finally put our foot down and told the owner that we didn’t want the grill and he wanted our deposit back.  Miraculously the grill was completed with a quick paint job and they delivered it.  The owner also charged us several hundred dollars more for things we didn’t ask for and we didn’t get things that were promised on the contract.  We have not used this grill yet as it was also promised that they would come o\nPick it up and install the additional rack and other item and we are still waiting.  I would not recommend this business or conduct business with Rogers Welding ever again!", "pics": null, "resp": {"time": 1572148699654, "text": "I am sorry that you aren't satisfied. We offered your husband his money back but he declined. We will be more than happy to refund your money. You can return the grill at your earliest convenience. We delivered the grill at no cost to you. In fact the grill you received was not the one you initially ordered. The one you received retails for $1200.  We upgraded because we couldn't find the small size water heater tank to use. (You ordered a 80 gallon tank you received a 150 gallon tank.) The one you ordered would have been a water tank heater which can not support double racks. Again, we do apologize and we would be more than happy to refund you. Thank you so much for taking the time to leave a review. If you need to drop off the grill after hours, we will be more than happy to make arrangements. Have a great evening!"}, "gmap_id": "0x88626a2944b87333:0x34bc6dd0e1f8a1a"}
{"user_id": "100417095260112369808", "name": "Bill Parks", "time": 1575743822359, "rating": 5.0, "text": "I have known David and Tiffany about 8 years. They are a growing business that has provided their services at reasonable prices and have always provided great customer service. I work for a local HVAC company and have needed them to build many stands, a few roof curb adapters and have used their welding services on job sites.\nI would absolutely recommend this company for your welding needs.\n\nBill Parks\nConditioned Air Solutions", "pics": null, "resp": null, "gmap_id": "0x88626a2944b87333:0x34bc6dd0e1f8a1a"}
{"user_id": "101335441409321471238", "name": "Stephen Coppi", "time": 1583849121220, "rating": 1.0, "text": "Great trailer. I got a 16 ft hybrid. The problem is the axels where off causing my tires to go bald in a matter of 2 months. I thought\nwe’ll go thing I have a warranty. They have not called me back, email or returned any money back to me. The worst customer service. They are impossible to get a hold of.", "pics": null, "resp": null, "gmap_id": "0x88626a2944b87333:0x34bc6dd0e1f8a1a"}
{"user_id": "101281492229239846840", "name": "Amy Carkhuff", "time": 1587497645339, "rating": 1.0, "text": "Be prepared to be ripped off!\n\nWe ordered a dump trailer on February 9, 2020. We originally paid a deposited of $3,100 via square trade. The owners wife Tiffany contacted us On February 14 saying the transaction did not process properly. She then asked us to pay the deposits via PayPal friends and family. We verified that the first payment was returned so we went ahead and complied with her new request.\n\nThe company changes the date the trailer would be available for pick up 6 times. My husband explained that we had purchased cabinets via an online auction and we needed the trailer in a timely fashion. They said they would refund us the deposits. We were told on multiple occasions the deposits was “in the mail”. Fast forward....it’s been over two months and we still have not received our deposits back. When we try to reach out they do not return our calls.\n\nBecause we paid via PayPal friends and family PayPal will not refund the deposit.  This company was unreliable, dishonest, and took $3,100 from us. If I could give 0 stars I would.", "pics": null, "resp": null, "gmap_id": "0x88626a2944b87333:0x34bc6dd0e1f8a1a"}
{"user_id": "107176681852015427362", "name": "Benny Jones", "time": 1577560627149, "rating": 5.0, "text": "I have two trailer's built by Roger's Welding, one was a special order. David and Tiffany were great to work with and build a great trailer my rating is A +++", "pics": null, "resp": {"time": 1577564542918, "text": "Awwwww thank you so much!! You were a complete delight! If you ever need anything else please let us know. ❤❤❤❤"}, "gmap_id": "0x88626a2944b87333:0x34bc6dd0e1f8a1a"}
{"user_id": "112156107741374287967", "name": "Cartrille Ervin", "time": 1564967353720, "rating": 5.0, "text": "Just picked my dump trailer up , love it good customer service.  Recommend to anyone", "pics": null, "resp": null, "gmap_id": "0x88626a2944b87333:0x34bc6dd0e1f8a1a"}
{"user_id": "115249132029098614531", "name": "J Christopher Johnson", "time": 1571081662671, "rating": 1.0, "text": "Bought a 7x16 dovetail trailer from SLE equipment that was manufactured by Roger's didn't even have it 3 months wheels started going balled took it to trailer shop bent axle. They put a bent axle on my trailer and refuse to fix it even though it has a warranty on it. Never return phones poor customer service. NEVER BUY FROM THEM", "pics": null, "resp": {"time": 1571084927601, "text": "I am so sorry you aren't satisfied. Have you been calling the right number...(256) 334-1113? When could you get it back to our shop? Each axle.is built to order. They are delivered to us brand new. Before we place an axle on a trailer, we inspect it ourselves to make sure they do not have any issues. Axles are bent when a trailer has been overloaded. Would you like to set up a time to bring the trailer on to be evaluated?"}, "gmap_id": "0x88626a2944b87333:0x34bc6dd0e1f8a1a"}
{"user_id": "108755991335391280147", "name": "Peter Carlson", "time": 1554130982107, "rating": 1.0, "text": "They sell cheap dump trailers that are poorly made.  Wiring shorted out after the first week. Spot welding after it was painted (it wasn't painted after the welding), stake pockets weren't square or the correct size, wheel fenders were mounted to the sub-frame instead of the box, poor paint job (if you stare at it, it falls off), and to top it off they are difficult to work with.", "pics": null, "resp": {"time": 1554132558282, "text": "I am so sorry that you are not happy. I would be gladly to repaint your trailer for you. Please call the office at your earliest convenience. Thanks and have a great day!"}, "gmap_id": "0x88626a2944b87333:0x34bc6dd0e1f8a1a"}
{"user_id": "115053584354032309568", "name": "Joshua Gonzalez", "time": 1536187158229, "rating": 5.0, "text": "They finished my trailer so fast", "pics": null, "resp": null, "gmap_id": "0x88626a2944b87333:0x34bc6dd0e1f8a1a"}
{"user_id": "117417627202261231035", "name": "Chris Carkhuff", "time": 1587498460707, "rating": 1.0, "text": "We ordered a dump trailer on February 12, 2020. We originally paid a deposited of $3,100 via square trade. The owners wife Tiffany contacted us saying the transaction did not process properly. She then asked us to pay the deposits via PayPal friends and family. We verified that the first payment was returned so we went ahead and complied with her new request.\n\nThe company changes the date the trailer would be available for pick up 6 times. They eventually said they were having trouble finding a fitting to make the pump work. My husband explained that we had purchased cabinets via an online auction and we needed the trailer in a timely fashion. They said they would refund us the deposits. They paypal was not working to refund us..then we were told on multiple occasions the deposits was in the certified mail. Fast forward....it’s been over two months and we still have not received our deposits back. When we try to reach out they do not return our calls.\n\nBecause we paid via PayPal friends and family PayPal will not refund the deposit. This company was unreliable, dishonest, and took $3,100 from us.", "pics": null, "resp": null, "gmap_id": "0x88626a2944b87333:0x34bc6dd0e1f8a1a"}
{"user_id": "107061590295575988009", "name": "Arthur Pitts", "time": 1521086257550, "rating": 4.0, "text": "It's a good place to do bissness with", "pics": null, "resp": {"time": 1532400688361, "text": "Awwww thanks so much!"}, "gmap_id": "0x88626a2944b87333:0x34bc6dd0e1f8a1a"}
{"user_id": "105509293168662138513", "name": "Renson Dalizu", "time": 1532399307936, "rating": 1.0, "text": "Too expensive for simple repairs???", "pics": null, "resp": {"time": 1532400521155, "text": "I am so sorry. Our minimum is $40. Shop rate is $85 per hour. I thought $40 was fair considering I never charged you in the past."}, "gmap_id": "0x88626a2944b87333:0x34bc6dd0e1f8a1a"}
{"user_id": "106523639294776235893", "name": "Stephen Coppi", "time": 1583773950794, "rating": 1.0, "text": "Poor customer service!!", "pics": null, "resp": null, "gmap_id": "0x88626a2944b87333:0x34bc6dd0e1f8a1a"}
{"user_id": "105263224177058896079", "name": "Tiffany Rogers", "time": 1484537234358, "rating": 5.0, "text": "Great trailers!", "pics": null, "resp": null, "gmap_id": "0x88626a2944b87333:0x34bc6dd0e1f8a1a"}
{"user_id": "117655515946282463862", "name": "WHT U TAKING BOUT WILLIS", "time": 1543064339902, "rating": 5.0, "text": "Happy", "pics": null, "resp": null, "gmap_id": "0x88626a2944b87333:0x34bc6dd0e1f8a1a"}
{"user_id": "114532986218116488280", "name": "Curtis Perry", "time": 1586017423945, "rating": 5.0, "text": "Great guys to deal with, you the get paperwork with your trailer. Reasonably priced.", "pics": null, "resp": null, "gmap_id": "0x8889e01cfb9047a9:0x11130e5d4733b60f"}
{"user_id": "110614043025173186001", "name": "sean schofield", "time": 1555720847925, "rating": 5.0, "text": "Radford and his son Andrew make a great team. Radford took care of business and his son Andrew got the trailer hooked up and ready to go. Full service at a fantastic price. Highly recommend if you're in the market for a quality trailer at a competitive price.", "pics": null, "resp": null, "gmap_id": "0x8889e01cfb9047a9:0x11130e5d4733b60f"}
{"user_id": "109552354081100620053", "name": "Danny Evans", "time": 1571167409814, "rating": 5.0, "text": "Great prices and a good company owner", "pics": null, "resp": null, "gmap_id": "0x8889e01cfb9047a9:0x11130e5d4733b60f"}
{"user_id": "104628335328248407757", "name": "Dennis Mc", "time": 1538102174316, "rating": 5.0, "text": "Great prices for quality trailers. Highly recommended if you're in the market for a new trailer.", "pics": null, "resp": null, "gmap_id": "0x8889e01cfb9047a9:0x11130e5d4733b60f"}
{"user_id": "112696710140656818046", "name": "Adam Graham", "time": 1533510627441, "rating": 4.0, "text": "Good place too shop.  They have wierd stuff and wild and crazy setup lol.. I like it.", "pics": null, "resp": null, "gmap_id": "0x8889e01cfb9047a9:0x11130e5d4733b60f"}
{"user_id": "105969574643934975094", "name": "Frank Smith", "time": 1620513027724, "rating": 5.0, "text": "Friendly, competent, and they actually have stuff in stock. I have a problem with my Ranger and they are ready to fix it at a great price.  I'll be turning it in soon.", "pics": null, "resp": {"time": 1620514468670, "text": "Glad to hear from you and happy that your experience was a positive one!  We look forward to the opportunity to keep earning your business.  See you soon!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "110252099810614571917", "name": "Kenneth Lovett", "time": 1564693683430, "rating": 5.0, "text": "What a great experience. Spoke with Craig on the phone yesterday. When we arrived, after driving 71 miles, we were immediately greeted by Craig and taken to the bike. After the test drive, I bought it. I saved several $$ on this bike that is like new that they sold new and serviced it regularly.  Everyone here is so nice and they made us feel like we were a part of their family. I give Champion Powersports a big thumbs up !!! Thank you !!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNsRik5ZRRnKylE5pV7VusORKZu1yFXwUIxzrLJ=w150-h150-k-no-p"]}], "resp": {"time": 1565475617593, "text": "Glad you had a world-class experience, and thanks for the review!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "110501743489689813402", "name": "Michael Vega", "time": 1615656869522, "rating": 2.0, "text": "Not one to leave reviews good or bad. But really disliked all my dealing with this place. Called two separate times to get my Rzr looked at (once was for a clutch recall), both times someone took my name and number and never got back to me. The other day went in there to get a price on a part. Was met with some attitude bordering on hostility. Dealership looks like it’s going downhill, very few units and low inventory. Real, shame since it’s the closest dealership to me.", "pics": null, "resp": {"time": 1615659560831, "text": "Thank you for your feedback. We aim to provide an exceptional experience for all of our customers. We're sorry we may have missed the mark with your visit. Please reach out to us at (256) 262-0888 to let us know how we can do better."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "114289758220957682328", "name": "Jacob Johnson", "time": 1615652790445, "rating": 5.0, "text": "Fast friendly service. Bought a rzr winch kit service kit and a belt. Fair prices and great products.", "pics": null, "resp": {"time": 1615655910071, "text": "We appreciate the feedback Jacob, and are glad you had a good experience with us.  Thank you and have a great day!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "100679709063211961693", "name": "Maria McSherry", "time": 1595888857175, "rating": 1.0, "text": "The sales experience was great! No complaints.\n\nMy garage kept, babied ATV with less than 22 hours on it started experiencing issues in May 2020. After researching the issue in case it was a simple fix, I requested a service appointment, and after several days I finally received a call stating they were behind. Fast forward to now almost 2.5 months later and every time I call to schedule the service, I’m told is that service department is behind, and they’ll get to me. That is too long for a service appointment. It makes me question how good the products really are...What good is the extended warranty if you can’t use it? My ATV is basically new and I can’t ride it. I will never purchase a Polaris product again.", "pics": null, "resp": {"time": 1595942996413, "text": "Sorry for the unusual experience.  We understand the frustrations of vehicle down-time, and work hard to shorten the time it takes to get your vehicle repaired when it does have issues.  We did have you scheduled for an appointment to bring your vehicle to us on May 18th and when you did not show we attempted to contact you to reschedule.  Since we did not hear from you we assumed the issues with your ATV were no longer a problem.  If your ATV still needs service, please contact us and we will be happy to get you back on the schedule for the next available appointment."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "113348500940330346829", "name": "Nickolas Shrewsbury", "time": 1601160669430, "rating": 5.0, "text": "Great Service. Got a new rzr they had us in and out within a hour. Wonderful people.", "pics": null, "resp": {"time": 1603145908500, "text": "Thanks Nickolas!  We appreciate your business!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "102981865910519606897", "name": "James Toquero", "time": 1592192642932, "rating": 5.0, "text": "Great customer service! The crew at Champion Powersports will  definitely take care of you. Purchased a Polaris XP 1000 and couldn’t be happier! Thank you", "pics": null, "resp": {"time": 1592227722374, "text": "Thanks James for the positive review of CHAMPION POWERSPORTS. We appreciate you taking time to leave your feedback and we look forward to seeing you again soon!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "114856057493093119114", "name": "Lance Borner", "time": 1602777529469, "rating": 4.0, "text": "Nice facility, they were helpful and quick to unload the trailer.", "pics": null, "resp": {"time": 1603145957672, "text": "Thanks Lance!  Hope to see you again soon...."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "107257019692456628620", "name": "Angie Porterfield", "time": 1527690552702, "rating": 5.0, "text": "If you are looking for an off road vehicle (atv, side by side) this is the first place to look. There was no pressure to buy today. Only the desire to listen so that could find the right machine for our needs and not the most expensive thing on the lot. Our salesman Spencer and the rest of the knowledgeable staff was able to answer every question that we had. The Staff also treated my wife with the respect that lacks in other dealer experiences . We left that day feeling like we have gotten a great deal and amazed at how friendly and respectful the staff is. We cannot say enough great things about the buying experience through Champion Powersports. The parts department has also been very knowledgeable and courteous while helping with parts and accessories for our ATV. The Polaris 570 utility edition that we purchased could not have been a better choice for our needs. This ATV has no trouble pulling the 950 pound trail mower we use on the farm or putting that smile on your face at the end of a hard days work . The 570 has more than enough power for the tough jobs or excitement out on the trail. The best way to describe the Polaris 570 utility edition and Champion Powersports is simple. The right tool for the job. Thank you to everyone at Champion for what you do.\nMatthew Porterfield", "pics": null, "resp": null, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "118212818408385569752", "name": "chrisnfwb1", "time": 1592610725141, "rating": 4.0, "text": "Friendly people, good service.", "pics": null, "resp": {"time": 1592664488518, "text": "Thanks for your feedback, we appreciate the great review!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "104060068834511235346", "name": "chip pollard", "time": 1558792928585, "rating": 5.0, "text": "Awesome sales staff! We've bought 2 ATV's and a trailer from here. A possible new purchase soon.", "pics": null, "resp": {"time": 1563052344549, "text": "Thanks for the great review Chip! We appreciate it!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "109022703254944020962", "name": "Richard Harris", "time": 1469392629510, "rating": 5.0, "text": "Best buying experience I've had in a dealership type purchase. Very courteous and laid back staff that do not put pressure on you. Very straight up and honest with you. I will definitely be back for future purchases", "pics": null, "resp": {"time": 1498422111323, "text": "Awesome review - thanks!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "104552545058395716550", "name": "Aaron Lutz", "time": 1503011078518, "rating": 3.0, "text": "It seems to be only a dealership. There is not a lot of appeal that i could find. Seems to be a little cramped in the store as well. If you came here to buy a Polaris or Victory definitely a good store to go to! If you want jackets and acccessories then might need to try some where else. I was told when i got recommended there that there was tons of appeal and accessories but i was very disappointed to find nothing really for motorcycle riding. Staff seemed nice but they are sales men so keep that in mind.", "pics": null, "resp": {"time": 1503063706627, "text": "Thanks for your feedback Aaron. We work very hard to ensure high levels of customer satisfaction and are proud to be the local shop focused on the customer, and not a \"big box\" retailer focused on the bottom line.  We have direct relationships with all apparel/accessory vendors and can get whatever you need to maximize your riding experience and customize your ride. Thanks again for your comments, and we look forward to seeing you again soon!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "117680176084032162806", "name": "Jesse Waldrep", "time": 1495312249993, "rating": 1.0, "text": "Was asking a tall sale guy to look at my unit right quick so I can order parts  wouldn't take 2 mins but he said they too busy and 26 buggies in front of me. ..  I wasn't asking to fix it just getting info  so if I did have to buy that 500 dollar parts I do it that day...  but no... so I said I go somewhere else  then  he said fine with him.  So I told him to stick them parts up his ass and I waliked out. So his Billy bad ass follows me out side running his mouth.  Seen I was packing and shut his mouth before I kicked it in   so I will never purchase another  part  from them again...", "pics": null, "resp": {"time": 1495545546572, "text": "We understand the frustration of vehicle down time, and work hard to get our customers in and out of our shop in an efficient and timely manner. We apologize that we weren't able to put you ahead of other customers already here for services, and based on your reaction in the store when you were told we would be glad to check your vehicle in to have it properly diagnosed it was not the answer you wanted to hear. If your vehicle still needs to be diagnosed or repaired our Service Team will be glad to assist you in making an appointment to address your vehicle repair needs."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "104135130942264585315", "name": "Joe", "time": 1572103753232, "rating": 5.0, "text": "Nice store, will not find better ppl!", "pics": null, "resp": {"time": 1581179148896, "text": "Thanks Joe - we appreciate your business!!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "113945110795457964611", "name": "Lon Flurer", "time": 1442874362412, "rating": 5.0, "text": "Love my Victory Crossroads.   Friendly staff and fair price.  Not a lot of hidden addons to price. Big discount for former military.", "pics": null, "resp": {"time": 1498422234103, "text": "Thanks Lon! Hope things are going well and look forward to your next \"drive-by\" at the store :-)."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "104724655789776760365", "name": "Thomas Clendening", "time": 1519051649971, "rating": 5.0, "text": "Fair and honest. They're in business to make money, not lose it but my deal was as good or better than others in North AL.", "pics": null, "resp": {"time": 1519057827816, "text": "Thanks for the review Thomas!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "105159955907924829915", "name": "WAR CHILD", "time": 1541720648823, "rating": 5.0, "text": "Liked working with Mike Ferrazas!  Go see him!", "pics": null, "resp": null, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "116368612235696203835", "name": "Bradley Owens", "time": 1526768873524, "rating": 5.0, "text": "Robert and Brink are my go-to guys. Even though, Xtreme Offroad Ind. LLC (me) and Champion Powersports are competitors in our profession, every time I need to refill my supply shelf with Polaris specific maintenance items, or need to order specialty parts, I go see them. Usually you'll never hear of another powersport repair shop praising competition, but again these guys help me when I need it most.\n\nI sometimes order parts that are on back-order or out-of-stock, but Jeff and the parts guys can usually get me fixed up somehow by working some magic! I ordered a crankshaft that was 3 months out on back-order and somehow they got it in 2 weeks. That is true customer service!\n\nAgain, Jeff, Robert, Brink, I appreciate you guys and whenever I need more Polaris supplies you'll be where I go first!", "pics": null, "resp": {"time": 1526907960722, "text": "We appreciate your confidence in us! Thanks for the great review, and for your business."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "101624471453393067613", "name": "Savannah Nesmith", "time": 1343080854681, "rating": 5.0, "text": "Great vehicles for the outdoors!!! You will definitely have a great experience working with this store!!! Best prices in North Alabama.Thanks to Mike for taking care of everything I needed!!!!", "pics": null, "resp": {"time": 1498422272097, "text": "Thanks Savannah for the great review!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "116829956589378256821", "name": "Joel Hamm", "time": 1381424596980, "rating": 5.0, "text": "Bought a Gem Car - Great Price and Great people - Highly recommend this is where you go buy an ATV or motorcycle.", "pics": null, "resp": null, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "105862115595276623097", "name": "David Hagood", "time": 1368727562013, "rating": 5.0, "text": "Awesome Group of Power Sports enthusiasts great knowledge and Friends atmosphere.", "pics": null, "resp": null, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "102598608647219907155", "name": "Terry Hess", "time": 1515519472285, "rating": 5.0, "text": "Great place was my first time but not my last!!", "pics": null, "resp": {"time": 1515855346246, "text": "Thanks for the review Terry!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "111284376921523949815", "name": "Tyler Parker", "time": 1532711036811, "rating": 1.0, "text": "Very Racist/Dishonest Company, will never go back again & I wouldn’t advise anybody else to go either. they claimed that it was a state law that you had to be 21 or older to purchase a atv. Then when proved wrong they switched and said they couldn’t do it cause of insurance purposes. When atv is purchased and pulled off the lot a company is not liable for anything after that, if that was the case plenty of companies would’ve been shutdown because of deaths on four wheelers.", "pics": null, "resp": {"time": 1532961050235, "text": "Thank you, Tyler, for being willing to sit down and discuss the issues you felt you had during your visit to the store.  We're glad we were able to get the miscommunication sorted out.  We appreciate your offer to remove the negative review you posted after we were able to talk through the situation, and we look forward to working with you on your new ATV!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "104271767828684659575", "name": "Jeff Moore", "time": 1528579255099, "rating": 1.0, "text": "Called the Polaris dealer in Athens today about a recall I got on my RZR,I was told the service dept would call me back,I called at 3pm,not heard a word,guess because I didn't buy it from them they don't want to deal with it,this is my first and last dealing with them,if there service department is like this I will take my money to another dealer", "pics": null, "resp": {"time": 1528722580884, "text": "Not sure where the miscommunication is, but our Service Mgr spoke to you Saturday afternoon and has you on the schedule for completing your recall.  Please contact us so we can understand why you offered a 1-star review.  Customer service is our top priority and we want to ensure we've addressed any concerns you may have."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "110605400580200011504", "name": "Leo Dob's", "time": 1502234168921, "rating": 4.0, "text": "Is not about the sell... They make every effort to satisfy and maximize your purchase..", "pics": null, "resp": {"time": 1502236973357, "text": "Thank you Leonardo!  We appreciate the kind words and support!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "105217816832437138969", "name": "John Davis", "time": 1470049329654, "rating": 5.0, "text": "Great Bikes, Great Store, Great People! Best Victory dealership in the state!", "pics": null, "resp": {"time": 1498422184341, "text": "Thanks John! We try hard to ensure exceptional customer service and it's great to know that it's being noticed."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "104418751710128846141", "name": "Miles Armstrong", "time": 1603686726113, "rating": 5.0, "text": "Amazing", "pics": null, "resp": {"time": 1603145838359, "text": "Thanks for the 5-star review Miles!  We appreciate your confidence and your business."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "116834055332689850398", "name": "Marvin Gann", "time": 1482505677913, "rating": 5.0, "text": "Well equipped for parts and the staff is friendly and knowledgeable.", "pics": null, "resp": {"time": 1498422091896, "text": "Thanks for the great review Marvin!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "104824048619679247495", "name": "Hot Wings57", "time": 1488656582657, "rating": 1.0, "text": "My son is 12 5'5 and 200 lb and we were looking at an ATM for him we get there and the guy said he can't sell it to usbeacause it said you had to be 14 + to buy it he said.just get the 125 that my 8 year old nephew could ride my son needs a 200", "pics": null, "resp": {"time": 1490047329271, "text": "All manufacturers have age limit and safety guidelines imposed by the federal government.  We are required to adhere to these guidelines."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "111277326165513920573", "name": "Alex Thornton", "time": 1520876910544, "rating": 5.0, "text": "Great place, very nice inventory also!", "pics": null, "resp": {"time": 1520883038534, "text": "Thank you for the 5-star review, Alex!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "112889609219421571439", "name": "Bobby Holt", "time": 1492344081361, "rating": 5.0, "text": "Great people here .. always helpful", "pics": null, "resp": {"time": 1498422374505, "text": "We appreciate the fact that our customers are the reason we are here - thanks for the great review Bobby!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "102245338941022736299", "name": "Piper Hill", "time": 1546183208356, "rating": 5.0, "text": "Get help from parts counter on my older model ranger.", "pics": null, "resp": {"time": 1546613016896, "text": "Thanks Piper!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "102215904349563594941", "name": "Edie Cox", "time": 1511816614220, "rating": 4.0, "text": "Nice place", "pics": null, "resp": {"time": 1514297679319, "text": "Thanks for the 4-star Edie!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "100428221790786546966", "name": "Gregory Hickok", "time": 1510076959094, "rating": 5.0, "text": "Great service!", "pics": null, "resp": {"time": 1510151372103, "text": "Thanks Greg! Great to see you and we appreciate your business."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "105865712782356408869", "name": "George Laviers", "time": 1494857390130, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": {"time": 1498421844527, "text": "Thanks for the great review!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "103581480276435391192", "name": "Ben sovilo", "time": 1505693157163, "rating": 5.0, "text": "(Translated by Google) Very good people and good prices\n\n(Original)\nMuy buenas personas y buenos precios", "pics": null, "resp": null, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "114272195222499992001", "name": "Paul Kuehn", "time": 1615394842611, "rating": 5.0, "text": "I can’t say enough good about how Brandon took care of me. A couple of buddies and I were traveling back from Daytona Beach to Arkansas when we experienced a tire separation and broken leaf spring on the trailer. Brandon saved our trip by providing outstanding service to get us back on the road safely. He even gave us a great restaurant recommendation since we were all hungry. Thanks again for the prompt customer service.", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "107114303268376116227", "name": "J Irby", "time": 1614479367189, "rating": 5.0, "text": "I highly suggest anyone to shop here. I will not be buying anything trailer related from anyone else. I was very satisfied with the service I received. I would give more stars if I could.", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "114344371290066086386", "name": "Conner Jung", "time": 1602870837351, "rating": 5.0, "text": "Great group that will help you out in anyways and make suggestions on what you should do or don't have to worry about. They aren't there to rip you off. They are there to help and get you back on the water as quick as possible. They have great prices that you can't hardly find anywhere.", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "108470976107952464251", "name": "Daniel Payton", "time": 1612892206967, "rating": 5.0, "text": "This is my new go-to spot for all things trailer related. Best customer service in town hands down.", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "106019244548346544782", "name": "Vaughn Traywick", "time": 1579807157448, "rating": 5.0, "text": "Brandon and his crew did a great job setting up a trailer for my new boat.  They even notified me (and photographed) a few major issues with the actual boat that I will get resolved with the manufacturer.  This is outstanding customer service.", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "108910691427084429519", "name": "Scott Dauenheimer", "time": 1578702704151, "rating": 5.0, "text": "They have everything you need to repair a trailer or buy a new boat trailer at the best price I could find any where within 100 miles.", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "116697285341167430234", "name": "JWDozer", "time": 1599750673731, "rating": 1.0, "text": "Very impatient.  Looking at a boat that was still on the internet... \"don't have it bye!\"", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "116157495825019848239", "name": "divots dad", "time": 1583949298902, "rating": 5.0, "text": "Brandon and his staff  offer the BEST prices and service in Mobile hands down!", "pics": null, "resp": {"time": 1583954859904, "text": "Thanks!"}, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "116260372922042583270", "name": "Johnathan Schemerhorn", "time": 1578004841994, "rating": 5.0, "text": "Great honest operation here I called 20 trailer places in the entire area only one who called me back and got me a trailer Fast and fair prices", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "109140619467024295017", "name": "Ryan Brightman", "time": 1526320825825, "rating": 5.0, "text": "Brandon was a life saver this weekend.  I had a hub blow out on the side of the road on a Saturday.  Brandon was nice enough to meet me at his shop on a Saturday to sell me a hub to get me going.  Best customer service experience I have had in years.", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "101532047203766071451", "name": "Jason Riemann", "time": 1517536828413, "rating": 5.0, "text": "Best place in Mobile for Quality trailer parts and service, boat sales, and engiine service. 4 tires and wheels installed and engine serviced in a few hours! More fishing time.  Can’t recommend anyone else.", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "100912757445122220704", "name": "Travis Poling", "time": 1517590229308, "rating": 5.0, "text": "Great in every way! Friendly service and GREAT prices and selection. THE place to go for everything boat trailer related.", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "100982891821650576285", "name": "Josh McNickle", "time": 1517530950991, "rating": 5.0, "text": "I purchased a boat from recreational sales and service just over a year ago and was very pleased with service received from Brandon during my purchase. I have and will continue to refer people to recreational sales and service for all boating and trailer needs. Great place!", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "113300819056760542159", "name": "Glen Chaplin", "time": 1529372016689, "rating": 5.0, "text": "Have used several times and always had great service.  Have called ahead to see if they could stay past closing time for me to pick up what I needed!", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "111424860662882954941", "name": "chad palmer", "time": 1550932012709, "rating": 5.0, "text": "We have a multi boat charter business and could not do it without these guys. Fast super friendly and great in stock inventory", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "105122982368344981091", "name": "Thomas Miller", "time": 1550878124880, "rating": 5.0, "text": "Great service. Will definitely go back", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "111109312147076213200", "name": "Ben Nelson", "time": 1569531704823, "rating": 5.0, "text": "Excellent selection of trailer parts in stock", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "109980687227566712089", "name": "Reese Swartz", "time": 1551297631188, "rating": 5.0, "text": "Man, what a bunch of nice guys!  Great transaction!", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "102585314936322439190", "name": "Jon Dreaden", "time": 1566065818612, "rating": 5.0, "text": "If you need trailer parts or service,  this is the only place to go.  Very friendly staff.", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "117360462795610452962", "name": "Robert Rhodes", "time": 1539715547889, "rating": 5.0, "text": "Brandon and his staff always have what we need at great prices & great service.", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "106559781597176960895", "name": "Michael Robinson", "time": 1535325795984, "rating": 5.0, "text": "Best place to get what you need for your trailer", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "108607586054948785583", "name": "riverrat1946@yahoo.com Lunceford", "time": 1515296975752, "rating": 5.0, "text": "Great place to get your boat fixed or tailer parts and repaired", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "117899295269896040264", "name": "Greg Callaghan", "time": 1525702344097, "rating": 5.0, "text": "Brandon is very knowledgeable, I was looking for boat trailer parts", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "103655707597889362384", "name": "Aaron Allen", "time": 1517721183178, "rating": 5.0, "text": "Needed help on the side of the road and not from the area. Brandon was refered to us and had everything to get us going. Thanks", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "117665820460142693950", "name": "Judson Taylor", "time": 1497717166088, "rating": 5.0, "text": "Excellent customer service. Friendly. I got just what I needed no extras.", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "107764213569378449617", "name": "jonathan brown", "time": 1540435706451, "rating": 5.0, "text": "You may have 99 problems a trailer problem shouldn't be on that lost with a place like this. Brandon has got it together, Mobile has needed a place like this for a long time.", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "104539833263909620362", "name": "Shirley Olson", "time": 1577631245083, "rating": 5.0, "text": "Very professional and polite", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "108759156464748649997", "name": "David Rinaldi", "time": 1533894650055, "rating": 5.0, "text": "Done right. Done quick", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "106281587024050967730", "name": "Marc Mott", "time": 1562007009155, "rating": 5.0, "text": "Everything you need for your trailer and more.", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "118440893648343615222", "name": "Butch W.", "time": 1564797082873, "rating": 5.0, "text": "Knoesgable and Friendly", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "114600010431387947517", "name": "Rod Cromer", "time": 1536618202653, "rating": 5.0, "text": "Knowledgeable,  friendly and helpful", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "102590664106034256655", "name": "Hayden Lunceford", "time": 1517529642254, "rating": 5.0, "text": "Nice place to do business.", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "116360354978747726751", "name": "H Pipkins", "time": 1517529939635, "rating": 5.0, "text": "Great service!", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "101089703396097681271", "name": "Brandon Lunceford", "time": 1517531164176, "rating": 5.0, "text": "Was blown away buy the inventory and cheap prices.", "pics": null, "resp": null, "gmap_id": "0x889a4cf030208f31:0xad17654a12bc8991"}
{"user_id": "117473254734011158611", "name": "Tami Lou", "time": 1619720819052, "rating": 1.0, "text": "Took lawn mower in for repair. I told them what was wrong but while they had it just look it over. I was told it needed a lot of work which I knew. So I went to get mower of course it started raining. So the first girl I dealt with was nice the second wasn't. Really no one up there was helpfully. When they finally brought my lawn mower it washy even put back together. I couldn't believe it. I was even planning on buying a mower. But they was just so ugly. I had to come home and put lawn mower back together. Don't recommend them at all from my experience.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "115623797327140997722", "name": "Brittany Nan", "time": 1619710739903, "rating": 1.0, "text": "Went to have my lawn mower fixed they said it was pretty much unfixable so told me to come pick it up. Get there and they did not have my lawn mower put back together all the way. Two things needed to be bolted back on. Then when I called to complain about them. The front desk girl got mad and said there is nothing I can do and she hung up on me. I was set to buy a lawn mower from them so glad they showed their true colors before I did.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "104386341314402442505", "name": "Christy Cook", "time": 1619408874009, "rating": 5.0, "text": "Very Nice Place,  very sweet workers! Definitely go back and recommend to others", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "114136098961671959682", "name": "Dylan Daring", "time": 1617324239505, "rating": 5.0, "text": "Fantastic prices and service. Professional, great place to buy", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "108010648996613059729", "name": "Bob Edwards", "time": 1602698821171, "rating": 4.0, "text": "Two thumbs up! I recently purchased a New Solis tractor from these guys and the service was amazing, the tractor and equipment was delivered ASAP and when I called back a few weeks later the  sales team was helpful and reassuring that they were only a phone call or a short 2 hour drive away in need be to rectify any problems I might have. P.S. I will put the Solis tractor up against any brand I tested and at a much better price.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "117654253449947994574", "name": "Jonathan Jones", "time": 1606265753252, "rating": 5.0, "text": "Purchased 2 dirt bikes! Very very easy people to deal with. They have some of the best pricing around!", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "109619879871181020695", "name": "Heather E", "time": 1600457572962, "rating": 5.0, "text": "These guys were AWESOME! I just moved here and not only did they hook me up with a lawnmower, but they also pointed me in the right direction for numerous other contractors for things I needed done. Super friendly and helpful!!!", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "101549652033093565300", "name": "Joe Haydock", "time": 1600968800407, "rating": 5.0, "text": "Awesome experience.. they hello you work the experience of finding a vehicle for the need.\n\nThese guys are awesome and work with everyone I watched come through the door!!!!", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "109953984770856381022", "name": "Donald Reding", "time": 1611862333890, "rating": 4.0, "text": "Great place to do business.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "114897459368240836191", "name": "Jay Shipp", "time": 1609437459081, "rating": 5.0, "text": "It was amazing they are good 👍", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "102261478708804137419", "name": "Marilyn Collier", "time": 1591811796372, "rating": 5.0, "text": "Awesome Folks,got a Great Deal on a Cub Cadet zero turn. Super Friendly and very helpful people!!! 😀😀😀😀", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "109613999584235336334", "name": "Gun Wench", "time": 1584496076906, "rating": 1.0, "text": "I'd give them no stars. I called and asked if they could look at and fix my ATV. The guy on the phone said bring it in he'd fix it up for me. When I got there I was told they only work on stuff they've sold.  They wouldn't even look at it because I didn't buy it from them.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "108402375250696105679", "name": "Anthony Hyatt", "time": 1588705169729, "rating": 1.0, "text": "One star means negative one (-1). Stagnant Waters sold me a NEW Toro mower with a torn seat last year. I showed them the tear when they delivered it. They said they would replace it with a new one but they never did! The owner won't even return my calls! If you're looking for a place that won't service what they sell and will lie to you, Stagnant Waters is the PLACE!", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "109623157812364990776", "name": "Michael Coley", "time": 1550366192633, "rating": 2.0, "text": "I bought a utility trailer from them. The trailer I bought was their top of the line fully tubed model. The trailer itself is great and is really sturdy. The problem that I have is with the paint job. They don’t use primer and I doubt they do any prep before they spray it. I have a 3 month old trailer with rust all over it. So now I will have to sand and paint all the rust as long as I own it. It just sucks having to do that when you pay $1300 for a 12 foot trailer and get this result.", "pics": null, "resp": {"time": 1550522497131, "text": "Mr. Coley, Muddy Waters is a dealer of Native Trailers LLC, we have sent your info over to the manufacture they are the ones that would supply the warranty on the trailer. We are sorry for the inconvenience . If you do not hear from them please give us a call."}, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "117204046498058032475", "name": "Timothy sides", "time": 1570575866338, "rating": 5.0, "text": "It is a good place to buy used autos and mowers, and small tractors and trailers. The people are very nice.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "102009651810929288238", "name": "Levi Ogle", "time": 1565999571566, "rating": 2.0, "text": "Buying a trailer from this company was easy. Getting what you paid for what like pulling teeth. The advertisement of gate folds flat is not true, it does not. The welding job is absolutely terrible. The available options they have should not be offered cause they do a half job adding them. The \"conduit\" used is just PVC. My wiring connect looked like it came off a 10 year old trailer. When i went to pick it up, the gate latches only engaged on one side. Had to leave it there to be fixed.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "114175283282030905323", "name": "Roger Hill", "time": 1617049101142, "rating": 4.0, "text": "Good people", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "111222949521552927576", "name": "Raymond Key", "time": 1598550257808, "rating": 1.0, "text": "I recently purchased a building from Muddy Waters at $213 down on the day of purchase I asked the sales representative to send out someone to see if they could bring the building up my drive and set the building up the sales rep Said no that they had a machine they could put the building anywhere on day of delivery they could not deliver and set up building , when I asked for a refund they said no and referred me to the manufacturer in return they manufacture said no to a refund and also told me you had to have a 14 foot wide path and fairly level ground to set the building up which is something Muddy Waters didn't tell me, and it will also cost for  another delivery I get a monthly government disability check and don't have money to burn an lose and screwed out of 213 dollars", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "112047006297574103153", "name": "Michael Hurlburt", "time": 1580256293808, "rating": 5.0, "text": "Fantastic people they bend over backwards to make sure you get the best deal", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "100961420421915828871", "name": "Tommy Harris", "time": 1553040303287, "rating": 5.0, "text": "Had a great experience.. Great price.. friendly  and professional service. Would highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "104978924891409544965", "name": "DANIEL Terry", "time": 1569422150806, "rating": 1.0, "text": "Took my older bass boat up there for a tune up , ran rough before I took it but did run .over 300 bucks later with new battery and plugs it won't start at all . Battery that was installed is way to small for one and on top of that now I have a boat I sunk $300+ in won't start at all and the battery is junk. NEVER AGAIN. THATS JUST THE MARINE SERVICE SIDE ! Everyone was really good on pleasing me up till I got home and tryed cranking the boat and it turns over maybe 8 times and dies so I just called it a loss I guess😒guess most of the positive reviews are family and friends. Talk to real customers if you know any. They will let you know to do business elsewhere. CROOKS BY THE BOOKS", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "111067138095657120089", "name": "Rob Richardson", "time": 1588376201273, "rating": 5.0, "text": "Very friendly people, and great quality equipment.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "110678064507898834455", "name": "Troy Potts", "time": 1569694704518, "rating": 5.0, "text": "Great place to get tire work done and very friendly people", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "112833404476856746306", "name": "Dale Frederick", "time": 1552086068001, "rating": 5.0, "text": "Super wonderful people very helpful knowledgeable prices are extremely good  highly recommend them", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "105503163131721582122", "name": "Wesley Crunk", "time": 1529968051107, "rating": 5.0, "text": "Great people, great deals! This is a local business worth supporting for your outdoor needs or a good used car!", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "112998364180912878335", "name": "Anthony", "time": 1536447604608, "rating": 5.0, "text": "Great place to get your outdoor needs. Good people, friendly an great service.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "101685026933365854656", "name": "Gavin Foster", "time": 1535244722199, "rating": 5.0, "text": "Best purchase of a used vehicle I've had. Great employees and great service", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "112327901503403682457", "name": "Kristin Watson", "time": 1462201469868, "rating": 1.0, "text": "My husband and I bought not just one but two little four wheelers for our kids,   I had been shopping g around d we got a fair price for them.  The reason for my one star, NO CUSTOMER SERVICE!  My kids wore down the brakes, I don't think they were hard on them, or our brake light is working.  We called while they were under warranty.  It took two weeks to get back about parts.  At that point the parts were out of warranty.  So we paid for them and shipping.  We got the wrong parts.  I even took picture the second time.  We got parts that look similar but size was wrong, would not work.  So Mailed them back along w one of the brake pads off the 4 wheeler and tracked them..  I found out that the package was delivered Thursday 4/28 .  I called and was told spouse was sick bit she sent picture to manufacture.  No call that we got them, they are working on it,, nothing.  This has been the way we have been treated.  You have to chase them down to get answers.  I asked to be called by the end of the week, with answers and a solution!  I haven't been able to ride our 4 wheelers since early March!  It's May 2nd!  It's not like we got these for free and didn't pay for replacement parts or shipping!", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "106851997751050804875", "name": "Martin Hall", "time": 1502244941472, "rating": 5.0, "text": "I bought a Utility Trailer from Muddy Waters today and it's the best built trailer I've ever seen. Instead of using angle iron, like everybody else, the use all tubing to built their trailers. Then on top of that, they were hundreds of dollars cheaper than anyone else. They also sell ATVs and tractors", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "101716964388592533349", "name": "heath Johnson", "time": 1558111970094, "rating": 5.0, "text": "ItThey was very friendly and put dirtbike tire on an my son still riding", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "101893151314903170009", "name": "Bethany Phillips", "time": 1558647037863, "rating": 5.0, "text": "Super Friendly Knowledgeable Folks  Highly recommend", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "115946072538472959038", "name": "Jamie Young", "time": 1551743823551, "rating": 5.0, "text": "Great customer service and affordable prices", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "109848582717781141753", "name": "keith davis", "time": 1538503266204, "rating": 5.0, "text": "Awesome selection and service. If you need lawn equipment of any kind this is THE PLACE!!", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "114257068215379972069", "name": "Barron Latta", "time": 1533506278358, "rating": 5.0, "text": "Bought a trailer there. Great little trailer.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "114545053332452484331", "name": "Thomas Flint", "time": 1522190097513, "rating": 5.0, "text": "Friendly, helpful service...would definitely recommend to others", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "114324110790693778957", "name": "dustin terry", "time": 1535573192861, "rating": 1.0, "text": "Tires was reasonably priced but lock for my lug nut came up missing", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "112134100719766047707", "name": "Vernon Legg", "time": 1527095640534, "rating": 5.0, "text": "Great people great products very nice people", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "109587033123628032888", "name": "Jp 396", "time": 1523533849861, "rating": 5.0, "text": "Great place too by tiers and  other products", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "113752572701075996446", "name": "Jeff Willingham", "time": 1559052745423, "rating": 1.0, "text": "Bought 4 wheeler that was rebuilt and it started smoking and blowing oil out exhaust", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "103492681013837805172", "name": "Dan Booth", "time": 1449690373401, "rating": 5.0, "text": "Well built trailers, best price around, hands down. Will be buying more from them.", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "112261636685818343808", "name": "Nicole Priebe Strickland", "time": 1523648260734, "rating": 5.0, "text": "Great place. !!nice people.!! good deals.!!", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "116614552175015155663", "name": "Mitch Montgomery", "time": 1516234291011, "rating": 3.0, "text": "Did not buy anything", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "100236834385411215823", "name": "Robin Bell", "time": 1479561374965, "rating": 5.0, "text": "Friendly service", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "113535859318216791044", "name": "Crickett Lynne Turrentine", "time": 1456520229274, "rating": 3.0, "text": "Used car dealer, makes things right on vehicle sold", "pics": null, "resp": null, "gmap_id": "0x8862a0976daa347d:0xef6451dc8df12111"}
{"user_id": "112012259365763636192", "name": "Twanskey Colvin", "time": 1620280707864, "rating": 5.0, "text": "I had a very  satisfying experience at Trailer World. Chris is a real down to earth guy. You can’t help but to like him....lol...but he helped me in every way he could and he kept his word all the way down to the last signature. I’ll most definitely be doing business there again and I would recommend Trailer World to anyone. And very well built Trailers. Thanks Chris! 🙏🏾", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "113461771093388392203", "name": "The Adventurous Mom", "time": 1615816551980, "rating": 4.0, "text": "CP was helpful and nice with purchase of trailer. Prices are great too.\n\nThe only bad thing is, when I got home I did a thorough inspection and find a big scratch on the fender.  I wish I had noticed this there but I did not. :(  The company response was that it wouldn't rust and they aren't sure how it got there.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPiEa5Qe5BxwIu79_mqJ5XeI5M22OWmigblPziB=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "111385174713718750812", "name": "Zach Lott", "time": 1620573930810, "rating": 5.0, "text": "Phenomenal customer service by Chris Wallace.  Brought my trailer in that I bought from another dealer because the tail and running lights and one interior light were not working. He quickly determined it was a blown fuse for the tail and running lights and helped me repair the interior light on the spot without charging me. I was expecting to have to drop off the trailer to get it fixed. I was in and out in 30 minutes. It  was awesome to have someone make life a lot easier that day. Can't recommend Chris and Trailer World Alabama enough. To put it simply, he is one solid dude and sincerely wants to take care of customers! Every business could use a guy of his caliber! Thanks again Chris for the help; you're the man!", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "114708829107073755591", "name": "Camelia Shears", "time": 1620280666089, "rating": 5.0, "text": "If you’re looking to purchase a trailer you should definitely make this your first stop. They have great prices and a very helpful and friendly staff. I had the pleasure of being helped by Chris. Chris provided me an excellent customer service experience and for that reason I am a loyal customer for life. ⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "101698504137208264364", "name": "ashley allen", "time": 1551720125738, "rating": 5.0, "text": "Great service, friendly staff. We're so excited", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPMTGNlrByiMtOUIGfv8NhfGlPUT2x1yyJ35SQa=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPhRdTSMa13Y7LLWgf3HWZFTTY8P_AOeWdUpYI5=w150-h150-k-no-p"]}], "resp": {"time": 1552492068932, "text": "Thank you, Ashley!"}, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "101663922587362310332", "name": "Kevin Seahorn", "time": 1620347107423, "rating": 5.0, "text": "Amazing people to deal with. Chris was great, made everything so easy and and a quick turnaround.on the trailer. I will definitely be back again and send all my friends to them. You can't go wrong", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "115907364035591272204", "name": "Chris Sowell", "time": 1620235752528, "rating": 5.0, "text": "Purchased multiple trailers over the years. Some directly from the inventory yard while others have been custom made. Always have been happy with each trailer. My needs/purpose changed which always led me back to trailer world to mfg my new one. Great service and they have always stood behind any issues that came up (which thankfully was many many years ago). Does what it was built for and fits everything I need!", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "105212568988128171219", "name": "Herbert Agueda", "time": 1620228564389, "rating": 5.0, "text": "I'm thoroughly pleased with my experience with Trailer World, If you're in the market for a trailer, this should be your go to place!! Chris is very knowledgeable and more than willing to jump thru hoops to make sure you get exactly what you're looking for!! They won't try to sell you something you don't need. Quality construction done in a timely manner and you won't feel like you just came from the proctologist office!! First rate customer service, friendly staff, well built equipment, what else could you ask for?", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "107633399558794384624", "name": "Nathan Ring", "time": 1620227731137, "rating": 5.0, "text": "Wonderful company and Wonderful people! Would recommend to anyone and everyone, you won’t be disappointed!", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "105898287846736017477", "name": "Chase Lawrence", "time": 1620247990868, "rating": 5.0, "text": "Great quality trailers at a reasonable and affordable price with excellent customer service to match 👌🏼", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "104840369629358167344", "name": "taylor starling", "time": 1620227836659, "rating": 5.0, "text": "Trevor was amazing! He was so helpful when I purchased my trailer!", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "118445867995579877712", "name": "david vitulski", "time": 1620237851892, "rating": 5.0, "text": "Great selection of trailers at very reasonable prices and the staff was courteous, very helpful and professional.", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "113391969834470342922", "name": "Jesus Catala", "time": 1620227579557, "rating": 5.0, "text": "Highly recommend this place if you need to buy or service your trailer.", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "107696151011536026744", "name": "Cameron Lee", "time": 1620248713195, "rating": 5.0, "text": "Great products and excellent customer service! Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "105343663868714620188", "name": "Robbie Swanson", "time": 1620228344833, "rating": 5.0, "text": "Great service..absolutely best pricing..and the staff was more than willing to meet my needs. I would say if you are in need of a trailer or anything having to do with a trailer go to trailer world in Ozark..", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "110487773549030666698", "name": "Ellen Farmer", "time": 1618020643004, "rating": 5.0, "text": "Incredible company! Everyone is so nice and helpful.", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "111187663011279714682", "name": "Hobie Turvin", "time": 1620239823295, "rating": 5.0, "text": "Great customer and always will to help! Chris always goes above and beyond for what I need!", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "112863307184290468161", "name": "Trent Sanders", "time": 1620226784359, "rating": 5.0, "text": "BEST SERVICE!! HIGHLY RECCOMEND", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "103092534893433812589", "name": "Emily Wallace", "time": 1620239975491, "rating": 5.0, "text": "Great place, Chris was very knowledgeable and willing to help!", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "116425596981920357562", "name": "phillip aldenderfer", "time": 1620244316747, "rating": 5.0, "text": "Friendly and knowledgeable staff, extremely happy with service.", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "114734344190573187416", "name": "Rock Estes", "time": 1620228569482, "rating": 5.0, "text": "Great product.  Love my trailer!!!", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "114535130529435925133", "name": "Trevor Adkins", "time": 1620231094131, "rating": 5.0, "text": "Great place, Trevor was very informative and helpful", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "110047172097579058244", "name": "Neelee Wallace", "time": 1613178840504, "rating": 5.0, "text": "chris is an amazing salesman he was very kind and helpful.", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "114673602442979698506", "name": "dan chandler", "time": 1615227543925, "rating": 1.0, "text": "Bought trailor in December. promised next week,next week next week.  it is March now.", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "116284971651451634347", "name": "Silverback STFFST", "time": 1622160281287, "rating": 5.0, "text": "Great place great staff", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "116577784867394640952", "name": "Barry Jones", "time": 1614052784753, "rating": 1.0, "text": "Want return any of my calls tried 4 different times", "pics": null, "resp": {"time": 1614053766832, "text": "Hey Barry I’m sorry for the inconvenience. What’s a good number or email to reach you? I’ll have a manager reach out first thing in the morning and we will do our best to earn your business back."}, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "111563526844784225875", "name": "PAKMAIL PAKMAIL", "time": 1620226272551, "rating": 5.0, "text": "Great product and great people", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "103518974964910815525", "name": "Heather Lynn", "time": 1604515761141, "rating": 5.0, "text": "When you get there there's great customer service and very helpful and great salesperson", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "115311896090916992720", "name": "Sunny Clark", "time": 1610155978169, "rating": 5.0, "text": "Superb customer service! Very helpful!", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "114798429624121086951", "name": "Josh Penton", "time": 1620227232983, "rating": 5.0, "text": "Friendly and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "113399891472591444698", "name": "Ken Faint", "time": 1588122602370, "rating": 5.0, "text": "Nice, friendly and knowledgeable sales staff.  Thank you Chris for jumping through hoops to get my last minute tire upgrade done. This is probably a half dozen trailers I've bought from these guys and I will be back for the next one too!", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "111330100692851790831", "name": "Shiftie Mcgee", "time": 1598453735923, "rating": 3.0, "text": "The only thing keeping me from shopping here, is the fact they don't even list a base price for their products. Sadly, I'm sure I'm not the only person to do this.", "pics": null, "resp": {"time": 1598458754931, "text": "Hey Shiftie, I'm sorry you feel that way. You can call any Trailer World dealership and a salesmen can price you any trailer we offer. You can also email whatever is easiest"}, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "117930581167483792651", "name": "Ryan Pope", "time": 1588782549145, "rating": 5.0, "text": "Quick and painless, very competitive pricing and offered several financing options! Thanks Chris!", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "115118938417693660060", "name": "bcflys", "time": 1527361786370, "rating": 5.0, "text": "A little bit of a drive, but worth the customer service and the quality of their products. These guys are pro's and will listen and get you in the perfect trailer for a great price. This is my 3rd major perchase with trailorworld. And I'm very happy with the deal and my new LoadTrail trailers. Chris went above and beyond getting my trailers set up exactly the way I wanted them. Thank you guys.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPC8mAZBl-HRRC8rUdM3DujI5yaPLQRmwNBZvEF=w150-h150-k-no-p"]}], "resp": {"time": 1527599859213, "text": "Thank you for your kind review and thank you for your business!"}, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "103867076836824981023", "name": "Alex Wetherington", "time": 1563934405398, "rating": 2.0, "text": "I’ve purchased 4 trailers now from trailer world and always been happy until I purchased my most recent trailer a 6x16 I had custom built. After about a week of having this trailer I noticed the the paint chipping pretty bad on the wheel wells, I called and they sent me a can of spray paint to cover over it. It’s now been about 2 months since I’ve had the trailer and the whole trailer is chipping paint really really bad. The trailers I’ve had in the past have never had this problem but this trailer is chipping extremely bad.", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "101398286985333262485", "name": "Shane Key", "time": 1606946363555, "rating": 5.0, "text": "Had everything ready for me!", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "103719468382710594384", "name": "Nikki Haire", "time": 1501609820365, "rating": 5.0, "text": "I had to buy trailer tires for my boat a few weeks ago.  They were an odd size, but they had them in stock.  These guys were great!  Clay and Bo will be getting my business for all of my future trailer needs!", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "115284914666350365412", "name": "Frankie Sutton", "time": 1539481699053, "rating": 2.0, "text": "After having my trailer for 2 weeks they managed to change one brake assembly. I picked up trailer today after them telling me it could be monday or so before they could finish it. Brought trailer home to install other brake assembly and brakes still not working. After I finally got brakes working correctly on the assmbly I installed, I removed hub that they installed on the same side on the rear tandem. When removing the hub I removed the hub nuts with my hand, they werent even tight. After removing hub and inspecting it noticed that the new seal they had installed was goulded and the spindle was also goulded. Have to replace seal again on the new one they just installed. Have had issues with brakes from the day i purchased trailer. I run hotshot loads and cant afford to be down as long as they had my trailer and still have to go behind them to replace stuff. I have replaced the seals on this trailer twice now and replaced 2 magnets on the brakes with no warranty applied. As for as purchasing trailer I could not ask for better service, but maintenance and offering warranty coverage for parts, there has not been any mention of it other than the brake assemblies.", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "110552336556726718015", "name": "Fred Eurich", "time": 1504317775734, "rating": 5.0, "text": "It was a pleasure to do business with. Great price on the trailer. Everyone was kind and professional. Thank you.", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "109221693055039885633", "name": "Daniel Ring", "time": 1501619470166, "rating": 5.0, "text": "Knowledgeable, helpful and friendly sales people.  Best prices in the region for Brand New Trailers!", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "108481435636654646102", "name": "Kolby Green", "time": 1513992736101, "rating": 5.0, "text": "It has competitive utility/equipment trailer prices.", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "110388159854561877653", "name": "Art V", "time": 1552490783983, "rating": 4.0, "text": "Great folks that work there ..!", "pics": null, "resp": {"time": 1552492057356, "text": "Thank you, Art!"}, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "116874573918798976763", "name": "Tammy Narup", "time": 1525303940784, "rating": 5.0, "text": "These guys are rock stars!!! Wheel bearing went out on our trailer, we wound up buying a new trailer, they went way above and beyond to help us get the new trailer set up for business and back on the road! Thanks guys, you saved the trip!!!!", "pics": null, "resp": {"time": 1527599897634, "text": "Thank you so much for your kind review!"}, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "115486784845538878436", "name": "Debie Lynn", "time": 1426977026216, "rating": 1.0, "text": "we were all excited about being able to empty out a rented storage  and be able to have all our belongs with us.  My husband works on the road and we travel alot.  Got to this place and there was one man working.  Two ppl ahead of us.  He told us he would be with us after them. Understandable right? WRONG.  More ppl showed up and he never waited on us. We had CASH money and CAME to BUY. Hate he missed a great sell and I hope he thought it was worth the loss of a sale and a\nBAD reputation when ppl ask us about it.", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "114423711290045932206", "name": "Jeff White", "time": 1515023751613, "rating": 5.0, "text": "Good place to get a trailer.", "pics": null, "resp": null, "gmap_id": "0x889278e660717c8d:0xb2817478692b9f07"}
{"user_id": "113386124934499612437", "name": "Kevin Pitcock", "time": 1620222390233, "rating": 5.0, "text": "Best value on the market. The craftsmanship and attention to detail surpasses other small time builders at a price that is fair. For the $ you won't find anything better. Built to last!", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "105560613797804906528", "name": "Kevin Ellison", "time": 1620225009835, "rating": 5.0, "text": "Excellent staff with excellent service. I would personally advise anyone in need of a trailer to speak with Chris. His professionalism, in my opinion, is top notch and can't be matched. He will work tirelessly in order to ensure the best deal possible, along with providing outstanding customer satisfaction.", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "106780955146917366983", "name": "Andrew Jones", "time": 1620232015279, "rating": 5.0, "text": "Solid company that makes well built and reliable trailers.  I will always buy my trailers from trailer world!", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "101233263154104109085", "name": "Neil Simmons", "time": 1613150516585, "rating": 5.0, "text": "Trailer world is the best. It’s the only place to go if you need a trailer. Their staff and prices are second to none.", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "105022440161330464828", "name": "Ted Herring", "time": 1614394763402, "rating": 5.0, "text": "Awesome service. Great products, trailers are top quality,  not cheap, but quality and that's what We need.  Thank you.", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "111417423488197211242", "name": "charles cutts", "time": 1621022874169, "rating": 5.0, "text": "Awesome people to work with and great product. This is our 2nd trailer we have bought from them.", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "115949365823182624988", "name": "Johnny Kincey", "time": 1620224936231, "rating": 5.0, "text": "Great customer service and a fantastic trailer", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "117031750751082222602", "name": "Jeffrey Barth", "time": 1601318004663, "rating": 5.0, "text": "Very helpful staff and have a good knowledge of their products.  Price i paid for tow doll was great.", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "115135451437639367082", "name": "Glen Pratt", "time": 1596139832114, "rating": 5.0, "text": "Friendly and knowledgeable personnel. Good prices on quality trailers.", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "115385248520901550693", "name": "Summer Knight", "time": 1593794129818, "rating": 5.0, "text": "All of us kids and grandkids bought  a trailer for our grandfather because he is always helping somebody move something or build something. We ran out of ideas. His birthday is the same as Thanksgiving this year so he was shocked and thrilled by a surprise party plus Thanksgiving. Thank you Mr Bradley for all your hard work dealing with the whole family and a few friends. We looked at every single trailer on the lot more than once. It took us several months to raise the money but we did it!\nWe bought the  6’ x 12’ white trailer. Our grandpa is out of that lazy boy and going again. 🙌🏼 We need to get him some steps next for the back of his truck.", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "103656347429215669852", "name": "Gary Mcallister", "time": 1576282310511, "rating": 5.0, "text": "Great place to get a trailer. Friendly staff. Prices are reasonable.", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "102383096834410423856", "name": "Jesica Woods", "time": 1579811964255, "rating": 1.0, "text": "Dothan Al dose not answer the phone and you can not leave a message so they can return your call.", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "115342551679620052856", "name": "Joe F. Watson", "time": 1568678768452, "rating": 4.0, "text": "Great place to buy utility trailer at an affordable price.", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "111810290964581992422", "name": "Johnny Spann", "time": 1485979858575, "rating": 4.0, "text": "Well Andrew was a pretty good guy with a likable personality and the guy knows what he is doing when we hooked the trailer up to my 2016 4 runner some of the lights didn't work Andrew said man you have a blown fuse I said nope new truck but I checked anyway and old Andrew was right. Well they just got my business next time I need another trailer", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "108816089737719126802", "name": "Anita Baird", "time": 1544563415459, "rating": 5.0, "text": "Excellent customer service and excellent selection. Will definitely go back for all of our trailer needs.", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "103315500884180346693", "name": "Edwin Knowles", "time": 1574810686147, "rating": 4.0, "text": "Good people and will help you", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "105977498628125905617", "name": "Laketh Sweet", "time": 1605640740823, "rating": 5.0, "text": "Great!", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "111565552199788135343", "name": "Ram 2017", "time": 1539480674893, "rating": 1.0, "text": "I went to trailer world to buy a trailer that i had spoke with the sales man a day before and i had asked him tge price of it which he told me. So i said i would be down the next day to get it. When i got there the next day i had ask him alittle more info on the trailer well he acted like he didn't know that much about it. So i said this is the one that we talked about the day before. So he just stood there like he didn't  remember. So i ssid this is the one that you told me the price. Then i told him the price and he said no thst not the price i had drove 110 miles to he's company and now he change the price. We went inside and he acted like he didn't  want to sale the trailer at all. Very cold to me NOT professional at all. So i left his store after driving 110 miles. WOW VERY POOR  SALES PERSON..\nWELL NOT EVER GO BACK AND WELL TELL VERY BODY ABOUT THAT PLACE.", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "105388091695391256952", "name": "Pamela McKinney", "time": 1547661964369, "rating": 5.0, "text": "Drove from Florida to purchased a trailer and the guy stayed after hours until we got there, even in the rain.  Awesome customer service...highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "103225340536093768317", "name": "Paul Guerrero", "time": 1587840733177, "rating": 1.0, "text": "Not much of a world more of a lot.", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "114431132800354347620", "name": "Roger Jones", "time": 1488912679259, "rating": 4.0, "text": "Good price on our trailer and well built still going strong", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "117264457473797926828", "name": "Charles Petty", "time": 1495814925339, "rating": 5.0, "text": "Had the tire I needed at a reasonable price.", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "102226408439672939236", "name": "jerry chandler", "time": 1556810796542, "rating": 5.0, "text": "Had the parts for my rig . Mr.jerry", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "110166899219004487098", "name": "Donnie Skinner", "time": 1535077245251, "rating": 5.0, "text": "Great people and prices!", "pics": null, "resp": null, "gmap_id": "0x8892ed23c3339165:0xeae2cd1e0bf4306e"}
{"user_id": "107985182638164536630", "name": "Mitch Kadow", "time": 1615509454220, "rating": 5.0, "text": "First rate trailer supplier. The show room is impeccable. They truly have any and anything you would need to meet your trailering needs. A friendly knowledgeable staff will answer any questions you have. I only wish I had found them a year ago!", "pics": null, "resp": null, "gmap_id": "0x889a6f83a83c5379:0x18e3201979f62ef1"}
{"user_id": "104686946616582078558", "name": "Bruce Andrews", "time": 1599603458439, "rating": 5.0, "text": "This is a fantastic place to visit for all of your trailer needs.\nThe staff is pleasant and very knowledgeable.\nThis place is not a disappointment!!!", "pics": null, "resp": null, "gmap_id": "0x889a6f83a83c5379:0x18e3201979f62ef1"}
{"user_id": "108883590610715436613", "name": "Cathy Young", "time": 1622342000320, "rating": 5.0, "text": "We drove 2.5 hours to purchase our beautiful, new Can Am Spyder RT Sea to Sky from this dealership and it was well worth it. From the very get go, Bree was amazing and straight forward.  We knew what we needed and wanted and she was able to give us it at a price that worked for us. Bree and the team here give: 1) true up front, out the door pricing, 2) a fair amount for trades, 3) no hassle financing and 4) great service all the way around. We appreciated the honesty she gave us from the get go knowing we had been working with another dealership. She never bad mouthed them or tried anything sneaky (can’t say the same for the Big #1) to win our business. She beat them in price and overall customer service. Casey, in finance, was able to get us a deal we could work with, warranties and services we needed and our financing approved quickly. When we arrived everything, to include our bike, was ready to go. When parts we were expecting were not immediately found, Tim, the General Manager, stepped in and started looking and found the part. From first phone call to driving away on our bike, it was a wonderful experience.", "pics": null, "resp": null, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "106241217057016831175", "name": "Doug Loveless", "time": 1613843572135, "rating": 5.0, "text": "The staff are wonderful, Bree was very professional and knowledgeable enjoyed working with her. Casey was witty and made the financing quick and easy. The whole process was slick. Would recommend them to anyone who wants a quick and painless transaction. Thank you", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPu8xMpPRX8NBCHJCNOizVd20gIKuAaYZRWx5j9=w150-h150-k-no-p"]}], "resp": {"time": 1614014665361, "text": "Hi Doug Loveless, thank you for taking the time to leave a review for us at Motorcycle Sport. We're happy we could meet your expectations! Mr. Loveless, reviews like this give us motivation and help us ensure we provide high-quality care.\r Your recommendation means so much to us and we're so happy to have earned it. Thank you again for taking the time to let the world know about your positive experience. Have a great day!\rWelcome to the largest family in the Southeast the Motorcycle Sports Family."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "105931572962626369800", "name": "kenneth mote jr", "time": 1620834168613, "rating": 5.0, "text": "Very pleasant experience!!  The lady at the parts counter is top notch!   She was very friendly and knowledgeable.   She knew exactly what I needed and had it waiting for me when I got there!!   Excellent customer service!!!   I will definitely be back!!   I highly recommend them to everyone!", "pics": null, "resp": null, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "116110650769048544704", "name": "Kendall Welch", "time": 1619436778302, "rating": 5.0, "text": "Thankful I chose to purchase our 2019 Canam Defender from them.   Everyone I spoke with was so nice and helpful.  Bree and Casey were a pleasure to work with, even tho this process was a little more difficult than the usual, they were patient and made things quick and easy.  Thank you to all! We are enjoying our ride.", "pics": null, "resp": {"time": 1620054244748, "text": "Thank you, Kendall! We work hard to provide our amazing customers with a seamless buying experience. Hope to see you again soon!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "108000662799752695598", "name": "Bud der", "time": 1615570365489, "rating": 5.0, "text": "Took great care of us. Price was better that all 10 other places I looked! Got exactly what I wanted.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOIbucJpl7QzlTWEFlAYcisuYw7a4NzRvKsuZap=w150-h150-k-no-p"]}], "resp": {"time": 1618841595349, "text": "Thanks for the kind words, Bud! We work hard every day to provide the best customer service experience. Thanks again for trusting us to be your powersports dealer."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "116128964467651176365", "name": "Michael Stevens", "time": 1623121168613, "rating": 2.0, "text": "A place called motorcycle sports should probably have more than a couple bikes to choose from. Seems like they only focus on off road vehicles now. The last 2 times I've been here there selection was awful and their prices were like 20 percent above retail. It's a shame considering what this dealership used to be. Won't be back.", "pics": null, "resp": null, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "104039132383829380438", "name": "Dwayne Oden", "time": 1617812455722, "rating": 5.0, "text": "I had a great experience at Motorcycle Sports. Bre is a truly awesome sales person. She helped me and made sure I was truly happy with my 2021 Can Am Ryker 900.", "pics": null, "resp": {"time": 1617891555181, "text": "Hi Dwayne Oden, thank you for taking the time to leave a review for us at Motorcycle Sport. We're happy we could meet your expectations! I will make sure Bree gets this fabulous review and we share it with the team. We're glad to hear we delivered such a great experience. If there's anything further we can do for you, we are happy to help! Welcome to the Motorcycle Sports family!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "115074976624088181989", "name": "Gabriel Ivan", "time": 1615646322660, "rating": 5.0, "text": "Wonderful staff, best prices to buy! Definetly worth driving from Georgia to buy from them!\nJody was the best salesman i ever meet.", "pics": null, "resp": {"time": 1615921968740, "text": "Thank you so much for the kind words, Ivan!! We appreciate you being a part of the Motorcycle Sports family!! Enjoy the new Maverick!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "109785634870851990685", "name": "Dawn Russell", "time": 1618608326595, "rating": 5.0, "text": "Just wanted to Shout Out April in parts!  Amazing gal - friendly, patient and got me all the info I needed to get an accessory for my new Sea Doo!", "pics": null, "resp": {"time": 1618683287156, "text": "Dawn Russell, thanks for your praise and comments about our team. We will pass along your kind words to April! We sincerely thank you for the positive review, and look forward to seeing you again soon! Welcome to the Motorcycle Sports family."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "116922923881531554058", "name": "Levy Lawson", "time": 1617752388506, "rating": 5.0, "text": "Motorcycle sports have outstanding staff.Bre is the best salesman I know.she was always there from the beginning to the end.Thanks Bre", "pics": null, "resp": {"time": 1617808264609, "text": "Hi Levy Lawson, thank you for taking the time to leave a review for us at Motorcycle Sport. We're happy we could meet your expectations! I am happy to hear Bree took care of you from start to finish. If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day also welcome to the Motorcycle Sports Family."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "100048761325860203170", "name": "ROBERT PATRICK", "time": 1606318146751, "rating": 5.0, "text": "Best motorcycle and recreational vehicle business on the planet. I've made ATV, Jet-Ski, and multiple motorcycle tire purchases over the years. Sales staff, parts staff, and service staff all professional, accommodating, and friendly. Love witnessing their huge expansion and continued growth.", "pics": null, "resp": {"time": 1606485266715, "text": "Robert Patrick, thank you for your kind review; we are happy to pass along your comments to the team here at Motorcycle Sport! We always strive to provide top quality service to every guest, and are pleased to hear that you enjoyed your experience here at Motorcycle Sport!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "116722868265776415925", "name": "Briana Sawyer", "time": 1615662256501, "rating": 5.0, "text": "Casey was fantastic! She got us in and out so quickly. Great customer service.", "pics": null, "resp": {"time": 1615922868731, "text": "Thank you for the awesome review, Briana!!! We hope you and Joseph are enjoying the new ride!! We appreciate your business."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "112596110347375276550", "name": "lilmama 44", "time": 1571427122128, "rating": 5.0, "text": "Great sales agents, good prices and friendly service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPdHgS5jLp7-mZjx11QRIEEKYmNw-EgK7MXTPcq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNOPIkC8S8u4j2mhh0AMwftXPgC27Eyw6J8qZUy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNTFD5FUxEu0QBJlE2BYnTzfpnc5gq4qW9NTwZK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPAi7esFWalrsoaeCvYANg_O-2tooslb9YFAYXt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMORWG5g6F1P6K_fLi8VA4tZDzmIAwov7OZ0VkB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMbBUj-t35esrb27GJzh_Pq32QCM4M7KMfOhVNh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNhCWEcuNczDig6aziqGQQ-n1Y_uN44g9ltxBx-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMSrznMgM1x8E6R3qI14Ke5XF3H4jlfhQc4PBEd=w150-h150-k-no-p"]}], "resp": {"time": 1571499791934, "text": "Hello, we are glad we could help! We look forward to your next visit! Take care!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "104689553960878305227", "name": "Richard Taylor", "time": 1615921186793, "rating": 5.0, "text": "Great people and service will definitely be back for another sxs", "pics": null, "resp": {"time": 1615925389099, "text": "Mr. Taylor, thank you for your kind review; I would be happy to pass along your comments to the team here at Motorcycle Sport! Your recommendation means so much to us and we're so happy to have earned it. Thank you again for taking the time to let the world know about your positive experience. Have a great day! Welcome to the Motorcycle Sports family!!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "103470361927139628564", "name": "Mac Jemison", "time": 1606519105028, "rating": 5.0, "text": "Picked up a 2018 Suzuki BOULEVARD M109R from Motorcycle Sport and the Customer Service was excellent! I would recommend to anyone! Smooth, easy, and quick process!!!", "pics": null, "resp": {"time": 1606575438467, "text": "Mac Jemison, thank you for your kind review; we are happy to pass along your comments to the team here at Motorcycle Sport! We always strive to provide top quality service to every guest, and are pleased to hear that you enjoyed your experience here at Motorcycle Sport! Enjoy the new bike and welcome to the largest family in the southeast the Motorcycle Sports Family!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "117623102554006539157", "name": "Mark Brown", "time": 1602939945631, "rating": 5.0, "text": "Professional, courteous and friendly staff. Great facility with plenty of inventory to choose from. Would highly recommend. Ask for Bree, she's the best!", "pics": null, "resp": {"time": 1603116022275, "text": "Mark Brown, thank you for your kind review; we are happy to pass along your comments to the team here at Motorcycle Sport! We always strive to provide top quality service to every guest, and are pleased to hear that you enjoyed your experience here at Motorcycle Sport!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "105135521848199511104", "name": "Deb", "time": 1590789669767, "rating": 5.0, "text": "We were very happy with Dwight and bought a Polaris ranger.  He helped us with out being  pushy as some sales people are. He seemed very honest and got us what we wanted at a fair price. We recommend Dwight. What a great place to shop.", "pics": null, "resp": {"time": 1595524131435, "text": "Thank you, Deb!!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "106581585101460586556", "name": "Billy Hall", "time": 1604609392277, "rating": 5.0, "text": "I have bought 2 Can Am Outlander machines from the folks in the last 2 years. Always a friendly staff waiting to help meet my needs. I can really suggest working with these guys!", "pics": null, "resp": {"time": 1604675081169, "text": "Hi Billy Hall, thank you for taking the time to leave a review for us at Motorcycle Sport. We're happy we could meet your expectations! We always strive to provide top quality service to every guest, and are pleased to hear that you enjoyed your experience here at Motorcycle Sport!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "111756127828910160551", "name": "Mike Coleman", "time": 1616527994360, "rating": 5.0, "text": "Very friendly and helpful people.", "pics": null, "resp": {"time": 1616596676534, "text": "Mike Coleman, we strive for 100% satisfaction, and it is great to see you had such a positive experience at Motorcycle Sport. Please don't hesitate to reach out if there's anything additional we can do for you. Welcome to the Motorcycle Sports family."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "116521149163905302303", "name": "arthur hoover", "time": 1603941115923, "rating": 5.0, "text": "great place to shop staff was friendly and there to answer any questions  you would have would recommend to anyone", "pics": null, "resp": {"time": 1604357906718, "text": "Arthur Hoover, we're happy you found our staff to be so supportive during your experience here at Motorcycle Sport. We always strive to provide top quality service to every guest, and are pleased to hear that you enjoyed your experience here at Motorcycle Sport! Welcome the Southeast largest family the Motorcycle Sports family."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "100054743734990089951", "name": "Susan Brown", "time": 1593719105810, "rating": 5.0, "text": "Love this place! I have bought 4 units and have always had a great experience! The service is truly the best!", "pics": null, "resp": {"time": 1594830949318, "text": "Thank you, Susan! We appreciate your business!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "112596110347375276550", "name": "lilmama 44", "time": 1571427122128, "rating": 5.0, "text": "Great sales agents, good prices and friendly service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPdHgS5jLp7-mZjx11QRIEEKYmNw-EgK7MXTPcq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNOPIkC8S8u4j2mhh0AMwftXPgC27Eyw6J8qZUy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNTFD5FUxEu0QBJlE2BYnTzfpnc5gq4qW9NTwZK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPAi7esFWalrsoaeCvYANg_O-2tooslb9YFAYXt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMORWG5g6F1P6K_fLi8VA4tZDzmIAwov7OZ0VkB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMbBUj-t35esrb27GJzh_Pq32QCM4M7KMfOhVNh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNhCWEcuNczDig6aziqGQQ-n1Y_uN44g9ltxBx-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMSrznMgM1x8E6R3qI14Ke5XF3H4jlfhQc4PBEd=w150-h150-k-no-p"]}], "resp": {"time": 1571499791934, "text": "Hello, we are glad we could help! We look forward to your next visit! Take care!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "100418586885987487154", "name": "Todd Reid", "time": 1585603472392, "rating": 5.0, "text": "I had the most incredibly positive experience buying my motorcycle from Dwight at M.S.  I made an offer over email from a listing I saw in Cycletrader.  He accepted my offer.  I paid exactly what my offer amount was with no junk fees.  Even the back office was incredibly helpful with the forms for titling in GA.  5 star experience all the way!", "pics": null, "resp": {"time": 1595524306635, "text": "Thank you, Todd!!!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "107207176741835092677", "name": "William King", "time": 1596141532653, "rating": 5.0, "text": "Bought my 570 sportsman from Jody and Kim ! Real down to earth folks to deal with. I feel like I got a good product for a fair price and very reasonable payments!", "pics": null, "resp": {"time": 1603114228020, "text": "Thank you for the awesome review, William! We appreciate your business!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "109569108845002789131", "name": "Thomas Stapp", "time": 1590941604573, "rating": 5.0, "text": "I had been dealing with another dealership in AL but I could never get the salesman that I was assigned to on the phone. He was always busy but would text me and then not respond for hours at times. I started looking elsewhere and came across Motorcycle Sports and gave them a call and talked to Dwight and he had what I was looking for. Within a few hours Dwight and Kim had me ready to go. They held the unit for me until I could there. I made a 2.5 hr drive and Kim had all paperwork ready to go. Dwight showed me the unit and explained the features and I was ready to go. I also found out 2 days before heading out that a friends uncle has purchased a unit from here a few weekends prior and had a great experience. Dwight and Kim and a few other staff members told me a about a few local riding spots. I highly recommend this dealership and will go back when its time for another one.", "pics": null, "resp": {"time": 1620054051126, "text": "Thank you so much for the kind words, Thomas!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "105135689729486813668", "name": "V Z", "time": 1591421847115, "rating": 1.0, "text": "**SHADY EBAY SELLER**\n\nThis outfit does not honor binding pricing agreements. They cancelled my order because the selling price was apparently too low, only to turn around and relist the same part for much higher. They also took it a step further and FALSIFIED the reason for cancellation, stipulating that it was buyer's request (it was not). Further requests for explanation went ignored.\n\nI can only imagine what goes on inside the business if the dishonesty pervades the online portal.\n\nConsider yourself warned.", "pics": null, "resp": {"time": 1591504657189, "text": "V Z, we pride ourselves on providing exceptional service, so we are disappointed to hear that your visit with us was anything less than satisfactory. Please call me and we can discuss further. we can not fix the issue without knowing more.  Thanks,"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "112304156881143069163", "name": "Tiffany Thompson", "time": 1595962859095, "rating": 5.0, "text": "Great service and super friendly staff. Two of our friends have recently made purchases and had the same experience.", "pics": null, "resp": {"time": 1595963718852, "text": "Thank you for the review, Tiffany!! We appreciate your continued business over the years."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "106416963101575470417", "name": "Terry Payton", "time": 1603824582851, "rating": 5.0, "text": "Great selection and very nice folks.", "pics": null, "resp": {"time": 1603825724270, "text": "Thank you, Terry! We appreciate your business and hope your son enjoys his go cart!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "105248736788572307945", "name": "Tiffany Adkins", "time": 1619822208265, "rating": 5.0, "text": "Motorcycle sports is awesome !!", "pics": null, "resp": {"time": 1620053786633, "text": "You're awesome, Tiffany!!! Thank you for your business!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "100065327823670993999", "name": "Mandy Whitson", "time": 1595956560697, "rating": 5.0, "text": "We could not be happier with our purchase from Motorcycle Sports! Great service and great people!", "pics": null, "resp": {"time": 1595957690576, "text": "Thank you, Whitson family!!! We hope you're enjoying your Polaris Sportsman!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "101451856812777011760", "name": "jan hurd", "time": 1596053312344, "rating": 5.0, "text": "The employees are so helpful and the service department is superior.", "pics": null, "resp": {"time": 1603114343026, "text": "Thank you, Mrs. Hurd! You all are certainly part of our MS family!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "111802949849375094648", "name": "Hannah Lively", "time": 1593321676134, "rating": 1.0, "text": "If there was an option for no stars I’d definitely put it... This place is over priced on used and new items, and their employees obviously don’t care if they sell you anything or not. They are rude and we will not be doing business with them again. Go to Speedzone in Gadsden if you want to buy anything and not get ripped off.", "pics": null, "resp": {"time": 1593440929568, "text": "Hannah Lively, we pride ourselves on providing exceptional service, so we are disappointed to hear that your visit with us was anything less than satisfactory. Motorcycle Sports was built on top notch customer service, competitive prices, and after the sale service. We are a family owned business that prides itself on taking care of each customer. Here at Motorcycle Sports, we are always looking for ways to improve; we appreciate your input. If you would be willing, we would like to have you contact our manager Tim  at (256) 831-6495 to discuss ways we can better serve you in the future."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "100304825037913256814", "name": "Peyton Hall", "time": 1619822103979, "rating": 5.0, "text": "Awesome place", "pics": null, "resp": {"time": 1620053920864, "text": "Thank you again for taking the time to let us know how we did. We hope you have a great day! We look forward to your next visit! Take care!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "115036543434564119895", "name": "Mary Catrett", "time": 1592618304995, "rating": 5.0, "text": "Great service I in getting the deal and contract ready so fast.", "pics": null, "resp": {"time": 1595524055584, "text": "We appreciate you taking the time to leave us a review, Mary. Thank you for your business!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "104036076210689586707", "name": "Randy Moore", "time": 1597506659504, "rating": 5.0, "text": "Great folks to do business with,very friendly and helpful", "pics": null, "resp": {"time": 1597510433404, "text": "Thank you so much for the review, Randy!!! We appreciate your business."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "102325678096447042035", "name": "Patrick Neeley", "time": 1600905911851, "rating": 5.0, "text": "Great experience on my new purchase", "pics": null, "resp": {"time": 1601414287348, "text": "Thank you for the kind words, Patrick!! We hope you’re enjoying your new Can Am Defender!!!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "110595145357561349219", "name": "April Duke", "time": 1595952908490, "rating": 5.0, "text": "Great deals and the best parts department anywhere!", "pics": null, "resp": {"time": 1595957769756, "text": "Thank you , April!! Yes, our Parts Department ROCKS!!!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "100948028514725053684", "name": "Jamie Camper", "time": 1619821983191, "rating": 5.0, "text": "They are the bomb!!!", "pics": null, "resp": {"time": 1620054003530, "text": "Jamie Camper, we strive for 100% satisfaction, and it is great to see you had such a positive experience at Motorcycle Sport. We hope to see you soon!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "107226694798510708626", "name": "Joseph Smith", "time": 1592343681810, "rating": 1.0, "text": "Lairs and damaged my new saddle bags on my bike.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPezU4jd15aakEA2AJGW7_kw1TsoPY13pHaaQyK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPftSU9hsgoUz0d3CDlvTys2eELAccwvX4XK6JD=w150-h150-k-no-p"]}], "resp": {"time": 1592401807646, "text": "Joseph Smith, we regret to hear that you had a negative experience with us, but would appreciate the chance to turn your experience around. Please contact Tim at (256) 831-6495 when you have an opportunity, and we will be more than happy to try and turn your experience around."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "114036775820130912776", "name": "Tommy Hunter", "time": 1570664902043, "rating": 5.0, "text": "Just bought Can Am defender from this place! They tell you the price and that is what it is, I checked all over the southeast for months and no one can compare to these guys!!!! Thanks again Dwight and staff for making this purchase so easy!!!", "pics": null, "resp": {"time": 1570665827357, "text": "Thank you so much for the kind words, Tommy!!!! Welcome to our Motorcycle Sports family. We appreciate your business!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "104275673963254012683", "name": "benny ogles", "time": 1507159659716, "rating": 5.0, "text": "Thay went all out for my family we have boult 4 Polaris from them and we are very happy with them Grate people and GRATE Place of business VERY friendly people", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPwptpI0fCshA77VlCeuQPYEYF4mEt2sFlM3yIp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNLyNy1-LZQYfYUH0_I7ADD20A3W_afzN--9cBT=w150-h150-k-no-p"]}], "resp": {"time": 1549299298777, "text": "You're awesome, Benny! Thank you for your business!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "102457324278991471679", "name": "Jasper Bonner", "time": 1586465898317, "rating": 5.0, "text": "Great place, great people, they are polite an will help you in anyway they can! My boy Ashley got it done for me. If your looking for an sxs or atv. Goo see ashley at motorcycle sports", "pics": null, "resp": null, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "104951066241705196546", "name": "Larry Phillips", "time": 1587576998810, "rating": 5.0, "text": "The more I drive my new Ranger XP 1000 the more I love it! Thanks Motorcycle Sports!!!", "pics": null, "resp": {"time": 1595524117165, "text": "So glad you're enjoying your Ranger, Larry!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "108849831976062179854", "name": "Thomas Quest", "time": 1582849431760, "rating": 5.0, "text": "Got my parts a day early and in the condition promised! Thanks again.", "pics": null, "resp": {"time": 1583265765571, "text": "Thomas Quest, we strive for 100% satisfaction, and it is great to see you had such a positive experience at Motorcycle Sport. If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "116880038874461818440", "name": "Snoopy Walden", "time": 1576984001412, "rating": 4.0, "text": "Nice Store! Great Inventory! for your color and choice of side by side CanAm's!", "pics": null, "resp": {"time": 1576988123881, "text": "Thank you, Snoopy!!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "113271622595705274251", "name": "j smith", "time": 1596650848580, "rating": 1.0, "text": "had a windshield when bike went in for tire change bike fell over in their shop broke windshield and would not honor their shop mishap oh they order one and replace it at your expense which was total bs\nso be careful when you have to have service on your ride", "pics": null, "resp": {"time": 1596744874344, "text": "Here at Motorcycle Sport, we strive for excellence, and are disappointed to hear that you received anything less. We wanted to clarify the shop did not damage the windshield and it was not a shop mishap. We felt like we gave you many options for the windshield that was damaged due to you parking the bike improperly. We offered you multiple options to help you replace the windshield and all the options you choose to deny. We are a family owned business that has built its reputation for 20 years on doing the right thing and taking care of the customer in all situations. Our manager Tim would really like to speak with you more regarding this matter. Please reach out to us at (256) 831-6495. We look forward to hearing from you."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "113545109884551969828", "name": "Ha'kim Josey", "time": 1567872910148, "rating": 5.0, "text": "I bought my 2nd RZR today from MC Sports and the experience couldn’t have been any better.  Vic and Ashley made my trade-in simple and gave me a fair value.  They were friendly and made the whole experience fun!  I will be back and I recommend everyone to buy from these folks!", "pics": null, "resp": {"time": 1568047055665, "text": "Thank you, Ha’kim!!! It was a pleasure doing business with you. We appreciate you being such a loyal customer with our dealership."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "101124469375526003683", "name": "Pat Mason", "time": 1535626038407, "rating": 5.0, "text": "A great company to deal with. I bought my Polaris side by side from them a year ago. Best prices in the south. Excellent service. The staff is excellent, friendly, and helpful. I would definitely buy from them again.", "pics": null, "resp": {"time": 1534789505611, "text": "Your recommendation means so much to us and we're so happy to have earned it. Thank you again for taking the time to let the world know about your positive experience. Have a great day!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "114192423544973690490", "name": "Bradley Barker", "time": 1584985601978, "rating": 5.0, "text": "They was quick to help and easy to deal with made the buying process quick and easy. Even stay after hours to help me out!", "pics": null, "resp": null, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "113798785795279233857", "name": "Kristie Roper", "time": 1574510352878, "rating": 5.0, "text": "Awesome place got our new 4 wheeler there", "pics": null, "resp": {"time": 1574536476329, "text": "Kristie, thanks for choosing us for your motorsport needs! We hope to be of service to you again in the future.  Best wishes,  Motorcycle Sports."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "101758739267928914372", "name": "John Durham", "time": 1541717203522, "rating": 5.0, "text": "Just bought my 3rd and 4th Polaris Ranger from these guys. That says it all. Class act from top to bottom. Thanks, Mark and team.\nKeep up the good work.\nJohn Durham", "pics": null, "resp": {"time": 1541778370714, "text": "Hi John, thank you so much for your positive comments about Motorcycle Sport! Please let us know if there is anything else we can do for you; we are more than happy to help!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "116227252378014779123", "name": "Scott Wages", "time": 1561686216691, "rating": 5.0, "text": "Dwight is the man! Really enjoyed working with him again!! I have sent all my buddies to them and will continue to!! Thanks guys!", "pics": null, "resp": {"time": 1561687409553, "text": "Thank you for the awesome review, Scott!! Dwight and everyone here at MC Sports appreciate you."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "117474177116805331822", "name": "The Johnson's", "time": 1587057212574, "rating": 4.0, "text": "Sales manager reached out to me. We cleared up any miscommunication.", "pics": null, "resp": {"time": 1586873752405, "text": "The Johnson'S, we pride ourselves on providing exceptional service, so we are disappointed to hear that your visit with us was anything less than satisfactory. We would like to have a better understanding about your experience. Please reach out to the General Manager at (256) 831-6495 at your earliest convenience and we will do our best to resolve this with you."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "114112738206586089453", "name": "chrish toffa", "time": 1583267494194, "rating": 1.0, "text": "I came early one morning and they seemed shocked that I was there. However I had 20k dollars to blow glad I didnt spend it there", "pics": null, "resp": {"time": 1583261486382, "text": "Chrish Toffa, thank you for leaving us feedback. We are disappointed to hear that your experience was not a positive one. Here at Motorcycle Sport, we are always looking for ways to improve; we appreciate your input. If you would be willing, we would like to have you contact Tim at (256) 831-6495 to discuss ways we can better serve you in the future."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "117602866426604065291", "name": "FordTough Lady", "time": 1546789646521, "rating": 2.0, "text": "Always have to order what we need!! Nothing ever in stock but they do have fair prices and nice staff!!", "pics": null, "resp": {"time": 1546790506175, "text": "Thank you for the review. Sorry you had a bad experience. We always strive to serve our customers and give them a 5 star experience."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "113961674504135353356", "name": "Marty Mangham", "time": 1576844122428, "rating": 5.0, "text": "Good service,  good folks.", "pics": null, "resp": {"time": 1576891790031, "text": "Marty, thank you for your kind words and this wonderful review! Thank you, and have a fantastic day!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "102300706278601839104", "name": "Taz Branch", "time": 1595948977710, "rating": 3.0, "text": "Was lied to by salesman to my wife & myself ! Got it home & found several screws loose on front plastics.Ive spent over 50k in last year BET I don’t buy another one from them !!😡", "pics": null, "resp": {"time": 1595968067283, "text": "Taz thank you for the feedback. I wanted to make sure we took care of your issues once you brought them to my attention. The center cap I handled the next day and now that I am aware of the other issue we have it handled. If you have any other issues or concerns that come up please don't hesitate to reach out.  Thanks for your business."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "117954174449388600235", "name": "Brent wheat", "time": 1538169023130, "rating": 5.0, "text": "Called and told them what I wanted and they had it and all the paperwork ready for me when I got there great service", "pics": null, "resp": {"time": 1538271238905, "text": "Brent, we are very happy we could provide you with a positive experience! Feel free to reach out to us if you need anything. Have a wonderful day."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "109656055212756631145", "name": "Jason Cook", "time": 1538566286302, "rating": 5.0, "text": "Broke a tie rod on a Friday night, called Saturday morning right at 8, talked to Christy in parts, they had replacement in stock, she set it aside for me.  No price gouging, awesome customer service, go see them.", "pics": null, "resp": {"time": 1538849325756, "text": "Jason, we are glad we could help! We are always more than happy to assist you if anything else comes up. Take care!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "117067616823193344241", "name": "Lacy Kuenzel", "time": 1523108237851, "rating": 5.0, "text": "It was so easy to make a purchase. Great staff! Friendly faces and attitudes!", "pics": null, "resp": {"time": 1522942507399, "text": "Thank you for taking the time to leave us a stellar review, Lacy!!! We appreciate you being a part of the Motorcycle Sports family!! Don't forget to like us on Facebook to stay up to date on new products, sales, events, etc.!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "117485579893878149449", "name": "Hannah Tolbert", "time": 1568474364388, "rating": 5.0, "text": "Such great people and very helpful.", "pics": null, "resp": {"time": 1568475645042, "text": "Thank you, for the kind words, Hannah! We appreciate you being a part of MC Sports family!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "104655649512308667850", "name": "stan jones", "time": 1533338781499, "rating": 5.0, "text": "Very helpful every time I have done business with them", "pics": null, "resp": {"time": 1533679923264, "text": "Thank you, Stan!! We appreciate your business."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "104601801342625828621", "name": "Billy Wood", "time": 1564786356643, "rating": 5.0, "text": "If I need a new Polaris this is the only place I would go to buy. Get all of my parts there", "pics": null, "resp": {"time": 1564789125329, "text": "Thank you for the kind words, Billy. We appreciate your business!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "106332479236336061186", "name": "Kim Fisher", "time": 1559248408973, "rating": 4.0, "text": "Alex was very friendly and helpful.", "pics": null, "resp": {"time": 1559416676121, "text": "We're happy to hear Alex was able to provide you with a positive experience. Thanks again for taking the time to leave us this information about your recent visit. Take care!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "113497659263630150146", "name": "Daniel Rollins", "time": 1524349894165, "rating": 5.0, "text": "Great staff that treats you like family they go the extra mile to help", "pics": null, "resp": {"time": 1524362077733, "text": "Thank you for the kind words, Daniel! We have awesome customers and love them all!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "105323410513682676288", "name": "chad morris", "time": 1524681614743, "rating": 5.0, "text": "GREAT PLACE TO SHOP.FRIEDLY STAFF.HAD A GREAT EXPERIENCE WHEN PURCHASING MY RZR AND SALES EVEN STAYED LATE TO WAIT ON ME.SERVICE DEPARTMENT AND CHRIS ARE GREAT TO DEAL WITH.JUST HAD A REPAIR DONE AND THEY DID GREAT.CHRISTY IN PARTS HELPED ME GET A PROBLEM RESOLVED WITH SOME TIRES AND WAS GREAT TO DEAL WITH.I WOULD SAY IF YOUR WANTING A SIDE BY SIDE OR ATV THAT THIS IS THE BEST PLACE TO SHOP.", "pics": null, "resp": {"time": 1524683175458, "text": "Thank you for taking the time to leave us a review, Chad!! We appreciate you and your business. If you ever need anything else, you know we will always be here for you. Also, don't forget to follow us on Facebook to stay up to date on events and promotions! ;)"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "107148224241086119695", "name": "Eric Hawkins", "time": 1511231442435, "rating": 2.0, "text": "If you are wanting to purchase a motorcycle or ATV, this may be the place to go. If you are wanting someone to repair your motorcycle or ATV, KEEP SHOPPING AROUND. I took my motorcycle to have the carburetors rebuilt. After spending about $700, the bike spewed fuel from a ruptured fuel line all of the way home. The service manager said that it must have leaked before it was dropped off. It didn't. The mechanics do not stand behind their work and the labor prices are outrageous.", "pics": null, "resp": null, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "113511470729329490746", "name": "Dan Rains", "time": 1524927189470, "rating": 5.0, "text": "Very good . I'll do business with them again.", "pics": null, "resp": {"time": 1524927985051, "text": "Thank you, Dan!! So happy to hear you had a great experience. We appreciate your business!!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "111437908668848224823", "name": "heath smith", "time": 1521204290470, "rating": 5.0, "text": "Fantastic people,  always a very helpful  place with all my RZR wants and needs!", "pics": null, "resp": {"time": 1522952838833, "text": "Thank you, Heath! As always, we appreciate you!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "108366051964873281667", "name": "Brandon Paulk", "time": 1522497325523, "rating": 5.0, "text": "Great Customer Service. Great turnaround time in service.", "pics": null, "resp": {"time": 1522953350227, "text": "Thank you, Brandon!!! Customer service is our #1 goal!! Don't forget to like us on Facebook to stay up to date on new products, sales, events, etc.!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "104688956203717834170", "name": "shawn franks", "time": 1567867963454, "rating": 5.0, "text": "Loved it nice friendly and professional service", "pics": null, "resp": {"time": 1567869260867, "text": "Thank you, Shawn! We appreciate your business!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "113722932962902794108", "name": "James Moore", "time": 1497062021292, "rating": 4.0, "text": "Very knowledgeable and friendly. Best service prices around.", "pics": null, "resp": {"time": 1549299780430, "text": "Thank you, James!!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "106251511293341970899", "name": "beardenjim", "time": 1505440453922, "rating": 4.0, "text": "Good selection, cool sales guy. Plenty of used quads and utvs as well.", "pics": null, "resp": {"time": 1549299351689, "text": "Thank you for the review!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "106877475715358589508", "name": "Cindy Chandler", "time": 1552099645771, "rating": 5.0, "text": "Nice people. Very understanding.", "pics": null, "resp": {"time": 1552167301283, "text": "Thank you for your business, Cindy! We appreciate you!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "111652193642698530993", "name": "Daniel Mathews", "time": 1564254903926, "rating": 5.0, "text": "They worked well with me to get the bike i wanted. Willing to fix problems as well!", "pics": null, "resp": {"time": 1559599818247, "text": "Hi Daniel! Thank you for review!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "111148899454537881486", "name": "Steve Sanders", "time": 1498862060392, "rating": 5.0, "text": "Excellent Service!! Went in for new tire on a Friday. Out in 45 minutes....", "pics": null, "resp": {"time": 1549299459659, "text": "That's what we like to hear! Thank you, Steve!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "100045119981043128804", "name": "Richie Goodman", "time": 1506873693050, "rating": 5.0, "text": "Always got treated on sales and service, great place to shop", "pics": null, "resp": {"time": 1549299324754, "text": "Thank you for the review, Richie! We appreciate you!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "115575059244131563293", "name": "Kaitlyn Scott", "time": 1533406065683, "rating": 5.0, "text": "OUTSTANDING customer service!!! Fast and eager to help!! HIGHLY recommend!!!!", "pics": null, "resp": {"time": 1533680008005, "text": "You are greatly appreciated, Kaitlyn!!!! Thank you for taking the time to leave us an awesome review!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "104680268567761918595", "name": "Johnny Denson", "time": 1618528529119, "rating": 4.0, "text": "Great Selection!!!!!", "pics": null, "resp": {"time": 1618683225434, "text": "Thank you again for taking the time to let us know how we did. If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day! Welcome to the Motorcycle Sports Family."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "108348304299108276988", "name": "Michael Carpenter", "time": 1524941717073, "rating": 5.0, "text": "Covered my misadventures without any issues.", "pics": null, "resp": {"time": 1524943888722, "text": "Thank you, Michael!!!!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "115194688671237554427", "name": "Johnny Whitman", "time": 1501884674853, "rating": 5.0, "text": "Very helpful and great place to do business", "pics": null, "resp": {"time": 1549299399460, "text": "Thank you, Johnny! We appreciate your business!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "116078076495006865158", "name": "Robert Crist", "time": 1564344513357, "rating": 1.0, "text": "I don't know  I was not there...how was it...", "pics": null, "resp": {"time": 1564387735553, "text": "Hello Robert, we appreciate your feedback. If there is anything that we may do to assist you in the future, please reach out at  (256) 831-6495 and we will do our best to help."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "100136351237878612946", "name": "Jewition", "time": 1501266005373, "rating": 5.0, "text": "Great very quick to help", "pics": null, "resp": {"time": 1549299442636, "text": "Thank you, Bradley!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "114890842716101671492", "name": "Lonnie Barnett", "time": 1534892110522, "rating": 5.0, "text": "Good service", "pics": null, "resp": {"time": 1527014092984, "text": "Thank you for the review, Lonnie! We appreciate you and hope to see you again soon."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "112413751328603209779", "name": "Tim Jones", "time": 1497099248164, "rating": 2.0, "text": "Unhelpful and rude as hell", "pics": null, "resp": {"time": 1549299766349, "text": "We always strive to give our customers a 5 star experience every time they visit. Sorry we did not meet your expectations, but we appreciate you taking the time to leave us a review."}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "108485693288193910138", "name": "coppa c", "time": 1522532244052, "rating": 3.0, "text": "Don't have a large selection of parts for can am.", "pics": null, "resp": {"time": 1522953239312, "text": "Sorry to hear that you are unsatisfied with our selection of Can-Am parts. Being a new Can-Am dealer, we don't have a huge selection of parts right now. We understand your concern and we are working on this issue diligently. Thank you for your patience!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "114118334133145228213", "name": "Brian Peppers", "time": 1505236898809, "rating": 4.0, "text": "Very helpful and knowledgeable", "pics": null, "resp": {"time": 1549299366112, "text": "Thank you, Brian!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "108207823365190866846", "name": "Rodney Govens", "time": 1479661816529, "rating": 5.0, "text": "Quick and reliable service", "pics": null, "resp": {"time": 1549299801116, "text": "That's what we like to hear! Thank you, Rodney!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "101797264974499360806", "name": "Jeremias Duarte", "time": 1383767167598, "rating": 5.0, "text": "Mark and Nick are an absolute pleasure to be around. I couldn't believe the amount of pride they take in their establishment!", "pics": null, "resp": {"time": 1549299865561, "text": "YES!!! We love what we do and our customers. Thank you, Jeremias!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "111756221796426435762", "name": "Jon Madrigal", "time": 1463191431227, "rating": 5.0, "text": "Mark and Nic = awesome", "pics": null, "resp": {"time": 1549299827249, "text": "You're awesome! Thanks for the review, Jon!"}, "gmap_id": "0x888bb749faec487f:0x93a10a4777279b28"}
{"user_id": "109733948153970732998", "name": "Lori Wade", "time": 1618019568783, "rating": 5.0, "text": "Help build my credit score back up along with purchase of new mower. Very helpful friendly staff. Thanks guys so much", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "110848049207439763390", "name": "Joseph Morrison", "time": 1617048154504, "rating": 5.0, "text": "Wonderful experience. Very helpful people. Great staff. Give them a shot before anyone else.", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "106795780364913559424", "name": "John Cagle", "time": 1623023623234, "rating": 5.0, "text": "Fantastic customer service,  got what I needed and will be a regular customer...", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "115169424028665824204", "name": "Carl Payne", "time": 1599825857644, "rating": 5.0, "text": "A friendly and helpful place to do business. These people have the right attitude to carry on a business. I would recommend to anyone needing their products.", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "106832065758346559535", "name": "Johnny Morris", "time": 1621492001244, "rating": 5.0, "text": "Clean and professional service", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "105440305418593173123", "name": "Barry Gillott", "time": 1605895181007, "rating": 5.0, "text": "Great people to work with Kelley will take care of you", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "106936786996544205836", "name": "Michael Steelfox", "time": 1616249636568, "rating": 5.0, "text": "Staff is very knowledgeable and friendly", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "110172373542702968068", "name": "Crystal Cronk", "time": 1617395675483, "rating": 5.0, "text": "Very friendly service!! !", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "117113312982491134547", "name": "Anna McDonald", "time": 1598733954033, "rating": 3.0, "text": "Lawnmower part. Courteous", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "112552503212451880129", "name": "Danny Roberts", "time": 1590590452302, "rating": 5.0, "text": "Deal with this company pro at their best", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "106002884806397556799", "name": "Terry Adams", "time": 1555418087828, "rating": 5.0, "text": "These folks our down to earth very friendly and treat u like family. Would recommend them to anybody.very kind.thanks terry.and love pops..", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "107949889359578661129", "name": "Scott Barnett", "time": 1553892364464, "rating": 5.0, "text": "Great equipment service. Great choices for lawn care equipment.  Fair and honest owners...!!", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "105158493311500411196", "name": "Douglas Gibson", "time": 1557408109876, "rating": 5.0, "text": "A awesome place to know about for parts and whatever for Husqvarna equipment.", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "116753804185840392024", "name": "Roger Forrester", "time": 1490910042926, "rating": 5.0, "text": "Great place to buy a Husqvarna. I've had one for quite a few years and have gotten good service out of it. Also have always gotten good service at the Husqvarna store in Curry.", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "102820840509289826920", "name": "Dave Hall", "time": 1558999837969, "rating": 4.0, "text": "Very helpful and informative about zero turn mowers.", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "110371461325500385554", "name": "Allen Godfrey", "time": 1517004932698, "rating": 5.0, "text": "Wonderful experience very friendly service an very carrying about your equipment needs. I definitely a Husqvarna man😀", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "112734622353341664291", "name": "Jason Workman", "time": 1567461716891, "rating": 5.0, "text": "Love this place great equipment!!", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "100767339416374100454", "name": "larry thompson", "time": 1489801187581, "rating": 5.0, "text": "Great mower almost three years old still runs great", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "116391433636924253920", "name": "Phillip Bridges", "time": 1526003038105, "rating": 5.0, "text": "They are very helpful & have everything you need", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "111715568501012362026", "name": "rae taylor", "time": 1557593175707, "rating": 5.0, "text": "Very nice and helpful.", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "111935429059058421154", "name": "The Cottage Potters David Allen Akins", "time": 1561672499517, "rating": 5.0, "text": "Excellent owners and staff.", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "110033585842036153406", "name": "Mark Bell", "time": 1569541004528, "rating": 5.0, "text": "Great products and services", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "112221729185493072339", "name": "Leonard Doss", "time": 1553554834045, "rating": 5.0, "text": "Very good service.", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "110464064050757108996", "name": "Darrell Abbott", "time": 1554925832594, "rating": 5.0, "text": "Great people, great service!!!", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "110554337155880398225", "name": "Stephen Ray", "time": 1503084836502, "rating": 5.0, "text": "Great people to deal with.....", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "100861486345582694233", "name": "Matthew Walker", "time": 1575906110747, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "114803824905777766824", "name": "Eugenia Hardin", "time": 1556551758349, "rating": 3.0, "text": ")Im not a fisherman my husband is", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "107881530645786039491", "name": "Josh Miller", "time": 1561863549140, "rating": 4.0, "text": "Nice and helpful", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "110554337155880398225", "name": "Stephen Ray", "time": 1503084836502, "rating": 5.0, "text": "Great people to deal with.....", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "101438631784932246238", "name": "terry short", "time": 1496585637797, "rating": 5.0, "text": "The young Lady behind the counter knows everything about the store and in the store", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "107881530645786039491", "name": "Josh Miller", "time": 1561863549140, "rating": 4.0, "text": "Nice and helpful", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "113072579413800811202", "name": "Sonja R. Thomas", "time": 1492715386911, "rating": 5.0, "text": "Great staff and service!", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "104331138901271986453", "name": "Korrouptor", "time": 1494350487303, "rating": 1.0, "text": "Every time I have had them work on my Husqvarna it comes back with the same  problems it was taken there for.", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "109973020277686563364", "name": "Butch Shelby", "time": 1554392527503, "rating": 5.0, "text": "Friendly service", "pics": null, "resp": null, "gmap_id": "0x888867fa6e882263:0x1ddb4e7122c9ece"}
{"user_id": "108531206953022530831", "name": "Thomas Richardson", "time": 1622327196084, "rating": 5.0, "text": "Great people, service and prices.", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "103954925502415020241", "name": "Amy Strickland", "time": 1526685441341, "rating": 5.0, "text": "Excellent price, product, and customer service!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO5DLDejKk_V_R91NTo6I_MYF_VkA02zwAW1AWg=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "104146607796122412734", "name": "Kimberly Cole Zemke", "time": 1602257464440, "rating": 5.0, "text": "Michael us amazing and kind and helpful.  He sold us the golf cart we have which was an AMAZING DEAL!!!  We have had it for over 4 years and no issues it runs like a brand new one.  Love it!!!  If you need a trailer or a cart this is the place to go.", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "116852313633494775461", "name": "Tommy Zaffina", "time": 1609551317072, "rating": 5.0, "text": "they took great care of my golf cart at a very fair price", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "105730269914771033381", "name": "Bill Crum", "time": 1594301199639, "rating": 5.0, "text": "I got a great price on a golf cart.", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "105950400399598896068", "name": "John Weeks", "time": 1549691075250, "rating": 5.0, "text": "On a trip to Atlanta to pick up a motorcycle I had a bearing failure on the trailer.   The staff saved my trip! Great price, great service, and just nice guys!  Thanks again guys!", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "118211182111054245412", "name": "Melissa Kenney", "time": 1556066087013, "rating": 5.0, "text": "I had a great experience. Lance and his staff are extremely helpful, and made the purchase of my utility trailer a breeze. Thanks guys!  I love my trailer!", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "112878877166662110359", "name": "David Coleman", "time": 1590600595546, "rating": 5.0, "text": "Good service and fair price", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "105707995202022143772", "name": "J Bishop", "time": 1523668593477, "rating": 5.0, "text": "Lance and his staff are absolutely top notch! I can’t say enough good about them. They bent over backwards for me on a trailer purchase with accessories. Outstanding experience and I would deal with them again! Absolutely amazing customer service, very friendly and honest!", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "114766514451668720681", "name": "gustavius Maxie", "time": 1558489983838, "rating": 5.0, "text": "Great people to work with i purchased a great golf cart and a enclosed trailer best pieces in town", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "102519569392415995511", "name": "Michael Reed", "time": 1576413545246, "rating": 5.0, "text": "Helpful and friendly  and honest people and i will be back", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "117623726088012499943", "name": "LadyA", "time": 1566281882048, "rating": 3.0, "text": "Good access to highway with decent prices.", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "104073533512037095696", "name": "Garrett Pass", "time": 1448979103820, "rating": 5.0, "text": "Very pleased with the help and service I received from TNT Outfitters.  I found them to be very honest people and not just trying to make a sell. Good business.", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "100827980336443509071", "name": "Ron Rothenstine", "time": 1537028761947, "rating": 5.0, "text": "They were very helpful and the only place that was open, I would recommend them to my friends.", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "112758005858889481584", "name": "Asher Flatt", "time": 1400992146554, "rating": 5.0, "text": "The staff at TNT Outfitters was extremely helpful and had exactly what we were looking for.  I highly recommend Truck-N-Trailer Outfitters for golf carts and trailers!  And my husband loves the truck accessories!", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "104348308464920940592", "name": "Retriever Fever Kennel & Co.", "time": 1544383267290, "rating": 5.0, "text": "Great service , made me a honest deal on some tires", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "105326765472364841139", "name": "Ar Binder", "time": 1502328990662, "rating": 5.0, "text": "Great visit,  received  excellent  service...thanks for for ur help Mick.", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "110727654775874212674", "name": "Donreco Glaze", "time": 1538292673649, "rating": 4.0, "text": "Great place for ur Golf Cart needs", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "117510777673596781507", "name": "Bill Lewis", "time": 1553091716631, "rating": 5.0, "text": "Great place fair on price and friendly", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "111347733909384461792", "name": "DonReco Glaze", "time": 1539593494435, "rating": 5.0, "text": "Great place for your golf cart needs", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "109908490511245862445", "name": "Jerry Plyler", "time": 1530386930483, "rating": 5.0, "text": "Good service great prices", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "111783116724064207118", "name": "Villeboi Racing", "time": 1553314353087, "rating": 5.0, "text": "Great guys good deals", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "114299529375906353889", "name": "Eric Jerkins", "time": 1544637645139, "rating": 4.0, "text": "Good selection", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "107507338406564971042", "name": "Robert Davis", "time": 1533465066972, "rating": 5.0, "text": "Very nice owner", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "102587419672656525972", "name": "Tommy Champion", "time": 1532798167169, "rating": 5.0, "text": "Great work", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "108491582765694770269", "name": "Jamacia Rudolph", "time": 1553269675922, "rating": 5.0, "text": "Great place and service", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "100845360677973159976", "name": "pete herman", "time": 1519238604129, "rating": 5.0, "text": "Great service with no pressure", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "114570348319076463380", "name": "Danny Lewis", "time": 1557845904008, "rating": 5.0, "text": "Awesome 👍👍", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
{"user_id": "117834243295787295873", "name": "Tanya Gillyard", "time": 1506557714120, "rating": 5.0, "text": "Cargo Trailers, Utility Trailers, Truck Accessories and Golf Carts... Oh my!", "pics": null, "resp": null, "gmap_id": "0x888c2c2fffffffff:0xec8f641e3683c1ce"}
