{"user_id": "106488074538242291676", "name": "Molly Riser", "time": 1622288773259, "rating": 5.0, "text": "Dropped my Dyson ball upright off, was able to pick it up one day later completely fixed. Staff were friendly and efficient. I would be happy to use their service again.", "pics": null, "resp": null, "gmap_id": "0x886212c889e5b777:0x1349d98af15336e"}
{"user_id": "113566275588363293123", "name": "Cindy Peake", "time": 1623094150014, "rating": 5.0, "text": "I had service done on my Kenmore vacuum cleaner everything went great cost effective I appreciate the good service as well", "pics": null, "resp": null, "gmap_id": "0x886212c889e5b777:0x1349d98af15336e"}
{"user_id": "103642628565370577807", "name": "L P", "time": 1555281770323, "rating": 5.0, "text": "They replaced the hose on my Dyson when it developed a tear. Very reasonable price and nice people working behind the counter. Would recommend!", "pics": null, "resp": null, "gmap_id": "0x886212c889e5b777:0x1349d98af15336e"}
{"user_id": "109376420260822976287", "name": "John Lake", "time": 1502200181354, "rating": 5.0, "text": "I have had great repair services at the US 231 South location. He is polite, and his charges are reasonable!\nI recommend this Company", "pics": null, "resp": null, "gmap_id": "0x886212c889e5b777:0x1349d98af15336e"}
{"user_id": "116424236329109685500", "name": "Melissa Escamilla", "time": 1545354277311, "rating": 5.0, "text": "This small business is awesome! They work with your warrantied items and the warranty works! Quick, reliable, & Happy to Help", "pics": null, "resp": null, "gmap_id": "0x886212c889e5b777:0x1349d98af15336e"}
{"user_id": "105518055231140574458", "name": "Stephanie Wynn", "time": 1477496857726, "rating": 1.0, "text": "I constantly got the runaround. Every step took weeks. After a month and a half they say they can't fix it and they will be shipping it to the manufacturer. I started to feel better until she says \"don't get your hopes up they won't be quick about it\". I gave it two weeks. They said they shipped it, so I called the manufacturer - big surprise they don't have it!\nDyson calls the shop directly and suddenly they don't remember my vacuum and hang up on the guy twice!!!!", "pics": null, "resp": null, "gmap_id": "0x886212c889e5b777:0x1349d98af15336e"}
{"user_id": "106487994308563103367", "name": "Petter Familias", "time": 1548937307936, "rating": 1.0, "text": "You would think they would be a little more knowledgable. I needed the short belt that goes on our Kirby's roller brush.  I didn't have the vacuum with me, but i knew the year of manufacture, so I went by and the guy said \"Kirby makes many many belts, so without the vacuum here I refuse to sell you one because it will more than likely be the wrong belt!\"\n\nI drive 3 miles to R&S Sewing at the corner of Oakwood and Memorial Parkway. I go in and tell the guy, \"I don't have it with me, but I need a Kirby belt....I do know the year it was made though.\" The guy said \"don't need to know nothing because Kirby only makes 2 sizes of belts...the one for the motor and the one for the floor brush....here you go.\" After being told 15 minutes ealier at Vacuum World that there were numerous sizes of belts for Kirby vacuums. Educate yourselves on what you do!", "pics": null, "resp": null, "gmap_id": "0x886212c889e5b777:0x1349d98af15336e"}
{"user_id": "114955256324181872756", "name": "Jess", "time": 1505910503203, "rating": 5.0, "text": "Have moderately priced machines. Owner very helpful and full of advice. Thank you. Will.do business again!!", "pics": null, "resp": null, "gmap_id": "0x886212c889e5b777:0x1349d98af15336e"}
{"user_id": "100447025835298915325", "name": "Thelonious Jazzman", "time": 1507480509116, "rating": 5.0, "text": "Owner, Tom is extremely knowledgeable and helpful.", "pics": null, "resp": null, "gmap_id": "0x886212c889e5b777:0x1349d98af15336e"}
{"user_id": "116673653449901590832", "name": "UNREAL RC", "time": 1547766322962, "rating": 5.0, "text": "Very very goid people", "pics": null, "resp": null, "gmap_id": "0x886212c889e5b777:0x1349d98af15336e"}
{"user_id": "107997551431783266587", "name": "Raymond Stapler", "time": 1483896802416, "rating": 5.0, "text": "Great repair place", "pics": null, "resp": null, "gmap_id": "0x886212c889e5b777:0x1349d98af15336e"}
{"user_id": "111320787458338732450", "name": "Joy Willett", "time": 1620840523874, "rating": 5.0, "text": "I’ve taken several vacuums for repair and have been pleased with their service. The repair time was quick and efficient. I do know that he will stand behind his service and do his best. Thank you! Joy", "pics": null, "resp": {"time": 1621350333799, "text": "Thank you for taking time to review our business! We appreciate your kind words and that terrific 5-star review! We take pride in what we do, and it’s always great when customers recognize it and share their experience! We look forward to seeing you at The Vacuum Clinic the next time you need us!"}, "gmap_id": "0x888602021a148aa5:0x1d362b2eee03c4e1"}
{"user_id": "106046629375134758382", "name": "Clarissa Harris", "time": 1618660914179, "rating": 5.0, "text": "I bought a Sharp Vacuum Cleaner from this place when they were off Greensboro Avenue  in 2004. This Sharp Vacuum Cleaner lasted me for 17 years. If they still made parts as my motor went out I would still have it. But I had to part with it this week in exchange for another which is another grade and believing God it will last more than 30 years.", "pics": null, "resp": {"time": 1618663505078, "text": "Thank you, Clarissa! We are happy to hear that your Sharp vacuum was a good match for your needs and served you well! That is our goal! We expect your new Cirrus to be up to the challenge of meeting your cleaning needs!"}, "gmap_id": "0x888602021a148aa5:0x1d362b2eee03c4e1"}
{"user_id": "100350654372398362039", "name": "A.M.", "time": 1607666941561, "rating": 5.0, "text": "I love visiting the Vacuum Clinic!! Gary is always so kind and knows exactly what I'm looking for. He's honest and always tries to save me money when I bring my vacuum in for repair. I wouldn't take my vacuum anywhere else!!", "pics": null, "resp": {"time": 1607717531128, "text": "Thank you for your vote of confidence! Customers like you are why we do what we do! We’ll look forward to seeing you next time, Michelle! 😊"}, "gmap_id": "0x888602021a148aa5:0x1d362b2eee03c4e1"}
{"user_id": "103075356804892922762", "name": "Emilee Smith", "time": 1606881873187, "rating": 1.0, "text": "Actually your response is not accurate.  You clearly said there are no parts available anywhere and instead delayed and tried to push other vaccine on me all after I paid you already for a repair.  Also,I was able to locate the part simply with an internet search within minutes.  The same part you held my vacuum cleaner for 8 months saying it was impossible to get.  Crazy me to think a repair shop that only does vaccines cleaners could locate a part faster than I could on google.  It is less concerning that your expensive repair broke again after a few months than it is to deal with dishonesty", "pics": null, "resp": {"time": 1607014827474, "text": "Once again, I am very sorry that we were not able to repair your vacuum cleaner this time. I am glad that you found the part on the Internet. If we miscommunicated, I apologize.  We were not able to get the part because the only parts warehouse that Dyson supplies was not able to get the part. I do understand your frustration from having to repair an expensive vacuum cleaner twice for two completely different issues in a very short period of time. That is why I offered to show you some vacuum cleaners that are more reliable and have parts readily available. I can't imagine why you would think that we would choose to hold your vacuum cleaner hostage for 8 months, just taking up space, instead of repairing it like we did when it initially broke. I assure you, that is definitely not in our business plan! I hope your vacuum cleaner lasts a very long time and serves you well after this repair."}, "gmap_id": "0x888602021a148aa5:0x1d362b2eee03c4e1"}
{"user_id": "108555050799190066411", "name": "Kimberly Tsoukalas", "time": 1607117995120, "rating": 1.0, "text": "I’ve encountered the owner of this establishment several times and he’s always been exceptionally rude and condescending. He’s great if you’re wanting to buy something from him, but for parts and service all he does is tell you how terrible your vacuum is, how you made a terrible choice buying it, and you should just get rid of it and buy one from him. I was glad to find another place for service after multiple bad interactions.", "pics": null, "resp": null, "gmap_id": "0x888602021a148aa5:0x1d362b2eee03c4e1"}
{"user_id": "117746675800482197079", "name": "Emillee J", "time": 1606790234710, "rating": 1.0, "text": "Took our vacuum cleaner to them less than six months after spending over $100 for a repair.  WAs told a part needed to be ordered that was on back order or he could give us a small credit on a trade in for an expensive replacement.  Called and came in monthly and was told it was still on back order but was constantly hard sold on trying to sell me a new vacuum.  After 8 months picked up the broken vacuum cleaner and was told he would call me when the part came in.  Again tried to sell me a new vacuum.  After getting home I was able to order the new part with 20 minutes of searching and had it delivered in two days.  For 8 months I was told the same part wasn’t available anywhere while he tried to sell me a new vacuum instead of fixing mine.", "pics": null, "resp": {"time": 1606792017720, "text": "I’m glad to hear that you were able to procure the Dyson part needed for your broken vacuum cleaner and that it is now working sufficiently for you. As I explained, we do not buy Dyson parts from Dyson. We purchase them from the only parts warehouse that Dyson will supply. Many of the Dyson parts (made in China) are still on back order to this parts warehouse at this time. Evidently Dyson will supply consumers before filling these back orders since you easily purchased the part we told you was needed for repairing your machine. We apologize if you were offended or felt pressured when we explained that other vacuum manufacturers are more willing to insure their parts are available to their dealers."}, "gmap_id": "0x888602021a148aa5:0x1d362b2eee03c4e1"}
{"user_id": "108523393249880356979", "name": "Brian Williams", "time": 1613605678934, "rating": 5.0, "text": "A great hometown atmosphere with personable service.  A gem of a store.", "pics": null, "resp": {"time": 1614198765106, "text": "Thanks so much for your 5 star review! It’s customers like you that make our job fun! Call us, or even better, stop by, when you need us again!"}, "gmap_id": "0x888602021a148aa5:0x1d362b2eee03c4e1"}
{"user_id": "101448240144845269488", "name": "Sandy McDonald", "time": 1564541379529, "rating": 5.0, "text": "I've been doing business with The Vacuum Clinic since they first opened, many years ago.  I have allergies.  Both Gary and Gina put forth a lot of effort in helping me select the vacuum that best fit my specific needs.  I bought an upright and a canister over 15 years ago.  Gary periodically services them as a preventative maintenance measure.  Both are still working great after all these years.  You can't beat the customer service you get with them!", "pics": null, "resp": {"time": 1564578528167, "text": "Thanks for taking time to give The Vacuum Clinic another awesome review! We look forward to seeing you next time!"}, "gmap_id": "0x888602021a148aa5:0x1d362b2eee03c4e1"}
{"user_id": "115832162716247994111", "name": "jay giovengo", "time": 1479842750817, "rating": 1.0, "text": "Don't take anything here. I dropped off a hoover floor mate over a year ago and still haven't gotten it back yet. When I dropped it off he told me 7-10 days. I called moths later and he said oh yea, here it is, I forgot about it, ill start working on it now. I called again months later again got the exact same response. Since I have left multiple messages and none have been returned.", "pics": null, "resp": {"time": 1556303087859, "text": "We're sorry to hear about your experience a couple of years ago, Jay. We can assure you that what you're describing is not a typical day-to-day procedure at our store. When we get repair requests, we turn them over and complete them ASAP. We would never just forget about a work order, especially for months, so this is surprising for us to hear. You're always welcome to come into our store with any issues you have regarding your vacuum -- we'd be happy to have an in-person discussion with you. -Gary I., Owner"}, "gmap_id": "0x888602021a148aa5:0x1d362b2eee03c4e1"}
{"user_id": "105757869091614728344", "name": "Kimberly Roberts", "time": 1490819836240, "rating": 5.0, "text": "Great service!  We have used them for years.  Gary can fix it all!", "pics": null, "resp": {"time": 1551979699126, "text": "Thanks for the thumbs up!"}, "gmap_id": "0x888602021a148aa5:0x1d362b2eee03c4e1"}
{"user_id": "111991132260274396659", "name": "Chris Gagnon", "time": 1548876227792, "rating": 5.0, "text": "The staff is very friendly and helpful.", "pics": null, "resp": {"time": 1551979677228, "text": "Thanks for the thumbs up!"}, "gmap_id": "0x888602021a148aa5:0x1d362b2eee03c4e1"}
{"user_id": "105765920176336616479", "name": "Lee Ann Wagner", "time": 1484705658032, "rating": 5.0, "text": "Helpful and friendly service", "pics": null, "resp": {"time": 1556216582820, "text": "Really appreciate your review, Lee Ann! Can't wait to see you in the future. -Gary I., Owner"}, "gmap_id": "0x888602021a148aa5:0x1d362b2eee03c4e1"}
{"user_id": "109324409891443943980", "name": "Guy Dewees", "time": 1613867820584, "rating": 5.0, "text": "Excellent service and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88892215eb7c6603:0x9259045cc871f8d1"}
{"user_id": "105923911871189283910", "name": "Ann Price", "time": 1571862759231, "rating": 5.0, "text": "The tech cleaned up my vacuum and put belt on great service", "pics": null, "resp": null, "gmap_id": "0x88892215eb7c6603:0x9259045cc871f8d1"}
{"user_id": "116205224445308955880", "name": "Ginger L", "time": 1465423541901, "rating": 5.0, "text": "The lady that has been there for years  (I think her name is Alethea) is awesome!  You can ask her just about anything and she knows it all. She represents what customer service should be and the repair folks are top notch as well...plus my vacuum is the best vacuum I have ever owned (the extra $$ is worth it folks!) and I will continue buying from them for those reasons.", "pics": null, "resp": null, "gmap_id": "0x88892215eb7c6603:0x9259045cc871f8d1"}
{"user_id": "102367429089668373916", "name": "sam “The Man with the Plan”", "time": 1557546576170, "rating": 1.0, "text": "Hey folks, fake reviews, I'm real, and here to tell it like it is, how in the world is somebody supposed to buy a piece of plastic, for 1200.00 dollars? I mean these things are junk it's a cheap motor, in a plastic box, with a tube attached to a plastic handle? When it breaks, they try to get you to trade it in for a new one??? It's a con, just over the top, a scam, and they are belligerent, when you need something, hey it's unreal, I'm a working person, not a rich stay at home mom, you get the same thing with a 50 Buck vacuum, waste of money.", "pics": null, "resp": null, "gmap_id": "0x88892215eb7c6603:0x9259045cc871f8d1"}
{"user_id": "113862108449082692283", "name": "Zeke H", "time": 1576209693833, "rating": 5.0, "text": "Excellent service and staff.", "pics": null, "resp": null, "gmap_id": "0x88892215eb7c6603:0x9259045cc871f8d1"}
{"user_id": "107219650174570198597", "name": "Amy Sommers", "time": 1545916120618, "rating": 4.0, "text": "Helpful and friendly", "pics": null, "resp": null, "gmap_id": "0x88892215eb7c6603:0x9259045cc871f8d1"}
{"user_id": "115385233505495464188", "name": "Donna Creel", "time": 1627103386457, "rating": 5.0, "text": "Great service wonderful selection.  5 star\nI have bought 3 embroidery machines here and have enjoyed excellent instruction and service.\nHighly recommend", "pics": null, "resp": null, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "107088506254364168918", "name": "Elizabeth Witherington", "time": 1590465820561, "rating": 5.0, "text": "I have bought an embroidery machine and a quilting machine here. I love the owners, always helpful and honest, never pushy about sales. She helps me get the machines I need for what I want to do. Highly recommend American Sew and Vac for your sewing machine needs.", "pics": null, "resp": {"time": 1590500667684, "text": "Thank you we truly try to help out our customers and I always appreciate that they bought from us"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "105448489379222785316", "name": "King Ghidorah", "time": 1591526508929, "rating": 1.0, "text": "Waited over 5 mins before I was asked what can they help me with. Then in the mist of helping me, another customer walks in and just began to ask questions about a product and the employee just stop helping me and started helping the other customer. No excuse me from either one of them. I guess my money wasn’t good enough. Needless to say I change my mind about shopping there. Never again!", "pics": null, "resp": {"time": 1591537300476, "text": "Well you obviously have not been to Walmart or places such as that getting help and waiting over 5 minutes 5 minutes is a short time and you got help in person.\nAnd helping someone else as well at the same time that is what multi- tasking.\nAnd I don’t need any customers that need coddling.\nbecause they are impatient and they with my blessing can leave and never come back!!!\nOver enhanced value you place on your self as a customer is your problem not mine you got help in person not dealing with waiting on hold on a phone or online.\nYou got help in person!!!\nYou waited 5 minutes!!!!\n\nGo to a box store and spend your money!!!!\n\nI have no problem at all with you not coming back. That’s what American is all about if you don’t like something you can go somewhere else and you’re free to do so with my blessing."}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "112781907859449301380", "name": "diane brookerd", "time": 1597203862113, "rating": 3.0, "text": "I called last Friday and spoke to a super nice man. I described my problem and he assured me he could fix it. I told him I worked quite a ways away so I'd drop it off in the morning (which was a Saturday). He said \"thats fine but I won't be here. I'll look at it when I come back\". I agreed and we hung up. So I went on Saturday around 1130 am (the man said they opened at 10 am) and the lights were off and door was locked. So I called a few times with no answer. Fast forward to the following Tuesday (I worked from home that day) I went to the store to drop it off....it was about 2 PM. The door was locked and lights were on. Another lady (probably in her 70s) was standing there with me and we were discussing the fact the door was locked and why. So I put my face to the glass and saw someone so I knocked. A young man came to the door and mouthed something about an errand (we couldn't hear him thru the glass). After a few times of yelling \"WHAT, WE CANT HEAR YOU\" I yelled \"CAN YOU CRACK THE DOOR OPEN AND TELL US WHAT YOU ARE SAYING?\" well...he didn't...he yelled thru the door louder that it would be 25 or 30 minutes til someone came back. Not really sure why HE couldn't open the door so we could leave our vacs but she and I looked at each other and said to each other as we left that we won't be back. For me it was about a 20 minute drive to get there from my house. The ONLY reason they get a star is because of the super nice man on the phone. I ended up taking it to Fairhope (I work in Daphne) and they were nice and open!\n\n**thank you for such a nice response. I'm sorry it didn't work out this time. I will definitely keep you in mind in the future. All your son had to do was open the door and tell us what he was trying to say. The nite he was pointing to said \"will return by 1130\". When I questioned him about it he said it was an old note. Also there are sooooo many notes on the door its hard to know what is what. Maybe clean it up a bit. No one will stop to read all that. I'm glad you got your vehicle repaired, that is more important than my vac. i edited my post to 3 stars. Stay blessed!", "pics": null, "resp": {"time": 1597197643584, "text": "We are slow on Saturday and I am the only one who works on Saturday and I had to get the van to the repair shop and to get the transmission fixed. And I had an opportunity to arrange it Saturday and It has to be repaired and they were nice and said if I could get it to them by Saturday they would work on it this week and the truck air conditioning doesn’t work and the vans does. The truck air conditioning part wasn’t coming in until the 21st and it came in Yesterday and so it was able to be fixed today but when it was ready at 2:00 I put a sign on the door and locked it because the vacuum man and I are the only ones that run the store during the week and if I didn’t get him to take me to get my truck I wouldn’t have any vehicles or a way home I had no customers and the trip to pick it up is about 30 minutes. I have tried leaving the store open with my 15 year old and my husband who cannot get around but it doesn’t work I get 50 phone calls because someone needs something they can’t find or a software question if it was only repair machines to be dealt with I would not mind it but it never is so I told my son leave the door locked I will be back in 30 minutes. I had to get my truck and if I waited I would not have any one to take me to pick it up. You picked the two days that I had to make a decision to fix and pick up vehicles I apologize for your inconvenience but it was a bad situation either way so I left locked the door put a note with my number and my van is not fixed but my truck after a month of waiting on a part I have a vehicle with air conditioning. I apologize for the situation but it is what it is and I would rather be at the store instead of dealing with 2 vehicles and repairs this week but no matter how you feel I after a month I have air conditioning in the truck and it’s wonderful and my van is still in the shop"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "102349168727065123974", "name": "Alexandrea Blackwell", "time": 1580336909063, "rating": 1.0, "text": "I only called to ask if they sold parts I was looking for. When I told the lady on the phone what I was looking for on what type of sewing machine she was quick to cut me off. She told me she did not sell those part because it is a cheap sewing machine (understandable). However what bothered me is her lack of customer service skills. I asked her if she knew anybody who sold the parts. She said no because it's a cheap sewing machine that's only a 150. I get that it's a 150 but not everybody has a 150 laying around. I have only had the sewing machine for 6 months and it accidentally fell of my work table and broke a few pieces. I would rather fix it then go spend 150 I don't have. Mind you I know how to fix my machines so I dont have to pay for labor.", "pics": null, "resp": {"time": 1580394195672, "text": "A $150.00 sewing machine that fell off a table and busted its plastic bobbin winder off is not worth fixing the customer is likely to totally ruin the machine by taking it apart herself and then not work at all I told her to go to Joanns or Walmart and buy a separate bobbin winder for about $30.00 and be done a $150.00 machine with broken off parts is not worth fixing but if the bobbin winder was the issue buy a separate bobbin winder and be done those machines were not built to have those parts replaced they aren’t worth it"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "117708720406267256893", "name": "Sonya Miller", "time": 1559261117491, "rating": 5.0, "text": "Mike and the folks at American Sew and Vac are honest and professional. He could have told me anything about my machine and I would not have known the difference. How often does the actual cost of services turn out to be LOWER than the estimate? It happened to me at American Sew and Vac. And by the way my machine is working perfectly. Thanks, guys! Highly recommended.", "pics": null, "resp": {"time": 1559263253161, "text": "Thank you"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "112187464182160008355", "name": "Moto Moya", "time": 1550604679092, "rating": 5.0, "text": "This is a very nice place for people to save their $$.\nLet's say your vacuum has a problem or sewing machine ain't working, I recommend you that this is the place to seek for help.\nThey fix tools and always have some for sale.\nIf you need spare parts, they do have some too or incase they don't have any, I believe they do order replacements for their customers. ..\nIt's a family owned business.\nThe lady and her husband are my favorite people in the area.\nThey treat customers so good.", "pics": null, "resp": {"time": 1550288244523, "text": "Thank you"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "111100797873159312963", "name": "Robert Brown", "time": 1596240493867, "rating": 1.0, "text": "Great products. Rude staff.", "pics": null, "resp": {"time": 1596246587846, "text": "Rude is what you make of a situation that’s how your opinion feels however one customer feeling that is rudeness another it is not everyone is entitled to their own opinion"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "105224457692289388971", "name": "Patricia Porter", "time": 1580759617701, "rating": 1.0, "text": "I've been in the shop two times both time I went in the customer service was aweful. They were so rude and neither time I went in did I find what I needed and didn't give me any clue where I could the part. In matter of fact the man that was rude today. Told me he didn't work with sewing machines, he worked with vacuums. So I know I want be going back", "pics": null, "resp": {"time": 1580763489812, "text": "Parts are not as easy to find as customers make them out to be a lot of parts are no longer available so you try to find what you can some simply are not sold Rude goes both ways in a service relationship so opinions are what you make of them Customers come to find parts here but you try to find what you can but success is never a guarantee."}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "116179281197022738537", "name": "K Butts", "time": 1490962374384, "rating": 1.0, "text": "Rude and condescending to customers. Owners are rude and argue in front of customers.  Misrepresentation of products. This has happened on several occasions. Bought machine 15 years ago there. Because I like my machine, I broke a promise to myself recently and returned to shop for upgrade.  Same story/same page!  I'm still in market for new machine and software.  High on my list of needs is customer service.  I have yet to find it at American See & Vac!  Absolutely will not trade w them again.", "pics": null, "resp": {"time": 1534565582247, "text": "Some times customer service is what you choose to make of it how people perceive each other is subject to interpretation it is all about feelings in business making everyone feel how they think they should feel when they shop here.\nMisrepresentation is also about how one feels something should or should not be represented a belief of the person verses how someone else portrays the product often is simply a different opinion or view neither way is right or wrong it is all in the eyes of the individual view life is full of all types of people and things sometimes what works for one person doesn’t satisfy another that is everyday life in all businesses."}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "117243104773044614855", "name": "Elizabethann Moore", "time": 1519862466114, "rating": 5.0, "text": "I have had my machine worked on here several times, and the support team has been extremely helpful answering all my questions. I drive from Fairhope to have my Baby Lock serviced, and learn new things about the machine each time. One day I was running late and they kept their shop open until I arrived. I cannot say enough good things about this shop and the employees! I highly recommend them and only wish they were in Fairhope!! You will love their friendliness and professionalism !", "pics": null, "resp": {"time": 1521438055227, "text": "Thank you"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "102458696156402885000", "name": "Tammy Jones", "time": 1588182222796, "rating": 5.0, "text": "Took a older sewing  machine in to get a cord for it, not only did they find a cord they also oiled the machine, getting ready to upgrade my embroidery machine and I’ll go here first to see if they have what I’m looking for and in my price range.", "pics": null, "resp": {"time": 1588190180436, "text": "Thank you I appreciate it and I try to take care of my customers and I am glad you are happy be safe and have fun making Masks"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "105274187926064325072", "name": "Ben Martin", "time": 1354387764856, "rating": 5.0, "text": "I don't understand how previous posts could be negative. We purchased an embroidery machine from them 15+ years ago and have since moved out of state. They were extremely nice when we purchased the machine so we called them in hopes they could help us with a service question. Our local dealer wanted $75 just to look at the machine and couldn't advise us about how to troubleshoot it to see if it was even worth the effort since it was an electronic issue (calibration problem). They could only tell us a new board would be around $600. When we called American Appliance, the service technician and another staff person were eager to help us over the phone and guided us through the steps on how to reset the calibration on the screen. We mixed up the steps- our fault- which led to 4 more short return calls and each time they were still very willing to get us back on track and help us. In less than 30 minutes, we were up and running with perfect calibration- and it saved us $675. They could have taken the easy route on a busy Saturday morning and told us to go to the local dealer or buy a new screen but they were genuinely interested in helping us and their extra service efforts are very much appreciated!", "pics": null, "resp": {"time": 1534565815783, "text": "Thank you"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "115529216062481844793", "name": "Neil Cater", "time": 1493584839898, "rating": 4.0, "text": "Always have what I need in stock. Long time Oreck fan and since Mobile's Oreck store closed they've kept my favorite vac supplied with bags, belts, and whatever else I might need to keep my OCD self happy!", "pics": null, "resp": {"time": 1534447478636, "text": "Thank you"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "118295797813694006292", "name": "Stephanie Bassenger", "time": 1440426634355, "rating": 1.0, "text": "I wouldn't even check off a star if I could avoid it.  American Sew and Vac has disappointed me for the last time.  Four months ago I went to a serger class, that was a good class, but during this class I discovered I needed a fabric guide for my serger.  I requested the part to be ordered that very night.  I have since called and requested this part 4 more times, once even going back to the shop to do so.  Each time I'm told that they just got inventory in and to let them check, then I never get a call back.  I have decided it will be quicker to ride over to Mississippi to another Babylock dealer to get my service and parts.  I would never recommend this dealer, however, they are the nearest to me for quite a few miles.  Sad.", "pics": null, "resp": {"time": 1534552313225, "text": "Sometimes life happens you had a good class and that’s what you wanted and obviously the teacher showed you new accessories for your serger fabric guides despite ordering we often back ordered items which I have no control over the dealer in Mississippi just had not sold all of their seam guides out and had to reorder or they would had the same problem with getting one as well You had a good Class and learned that is what is important not something we were out of stock on and it was back ordered that is called life"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "102473883313570209642", "name": "Arnold Singleton", "time": 1556719785688, "rating": 5.0, "text": "(×××××)to God be glory A_S_&_V )", "pics": null, "resp": {"time": 1556721017184, "text": "Thank you"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "111376613262740025218", "name": "Fairhope Sewing School Fairhope, AL", "time": 1492787793939, "rating": 5.0, "text": "Always been very fair, helpful and gone beyond what others have done.  Would recommend them to anyone.", "pics": null, "resp": {"time": 1534447489785, "text": "Thank you"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "113825371196513834377", "name": "Debbie Hudgens", "time": 1539720902470, "rating": 5.0, "text": "Always so helpful, knowledgeable, and friendly!", "pics": null, "resp": {"time": 1539756317190, "text": "Thank you"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "109432662914474956355", "name": "Peggy Stone", "time": 1450104431540, "rating": 1.0, "text": "I first purchased my machine 25 years ago. Took it in during the summer for full service, when I picked it up only oiled and oil was coating every service. $50 for this.\nThe only reason I bought from them to begin with was they were the only Bernina dealer.", "pics": null, "resp": {"time": 1534565804264, "text": "Oil is a necessary part of older mechanical machines we do our best to clean any excess oil up and sometimes after cleaning up a machine if it sits for a while sometimes oil will settle on something. I apologize for any excess oil we try to do our best."}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "105896723410149121465", "name": "paula dixon", "time": 1546958921846, "rating": 3.0, "text": "Dont know nothing about this store", "pics": null, "resp": {"time": 1546959665621, "text": "Ok, well we sell and fix sewing machines and vacuum cleaners and supplies for both but thank you for your review"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "104966292441070450518", "name": "Danita R.", "time": 1606580777524, "rating": 2.0, "text": "Due to its refurbished policy on products and the warranty. They will check the appliance before delivering and again at your home; however after 60 - 90 days...you are on your own. All products and sets start in high $300 up. There were no individual washers at the time of my visit. Check the brand name and the warranty policy before you buy.", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "110862739819491700128", "name": "TRAVONTAE GHOLSTON", "time": 1606579365633, "rating": 1.0, "text": "Junky used old products and unprofessional. I will no longer support this sorry place or their products DON'T SHOP HERE GO ELSEWHERE. They products break down so quick. With only 90 days warranty you know damn well yall products some real junk.", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "105476034455846865854", "name": "Lauren Blankenship", "time": 1618111105611, "rating": 1.0, "text": "Said they only had 2 washers but I saw 100 with tags", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "107034661664852213290", "name": "MsDondrell", "time": 1593622277769, "rating": 1.0, "text": "I bought two dryers from them, both stopped working in less then 6 months. I contacted them, and ask can some one come look at my dryer, he stated, due to COVID 19 they cannot come out, but they are still delivering appliances and hooking them up, sounds like an excuse. I wouldn’t recommend no one to shop with them and the customer service is horrible.", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "111495551653865474262", "name": "Linda Harris", "time": 1553112542783, "rating": 5.0, "text": "Bought a washer back in 2009 and it's still working great. Just moved from living with my mom and I let her us it so I need another one now. Great service here.💯💯😀😃", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "108318044285239926366", "name": "Tiffany Belser-Temple", "time": 1605932569031, "rating": 5.0, "text": "Great Customer service", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "115301608526774038463", "name": "Brenda McCoy", "time": 1452008883486, "rating": 5.0, "text": "I purchased a dryer and refrigerator from this store approximately 4 years ago and I must say I have been satisfied with both. I have had to call them twice in reference to the refrigerator having slight issues, but in both cases the service I received was always prompt and helpful. I recommend this store to friends and family often, because of their great service.", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "106350767182777437343", "name": "Nicole D", "time": 1572875980001, "rating": 4.0, "text": "Good prices and very easy to work with", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "114482214858310128183", "name": "Victoria Simmons", "time": 1569088477228, "rating": 5.0, "text": "Great Appliance i have had my washer and dryer for 11yrs only had problems 1 time and they fixed the problem", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "101602831447926626977", "name": "Phyllis Sanders", "time": 1600194743724, "rating": 2.0, "text": "For used appliances  they are to high", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "104943451319642788218", "name": "MegaKittyRawr", "time": 1548460300364, "rating": 1.0, "text": "Got a dryer from them and 3 weeks later the timer stops working and the dryer won't switch off on it's own. Made promises of fixing it and even replacing the dryer altogether and haven't heard anything since. Now the heater in the dryer doesn't work at all. Waste of time and money. Terrible business.", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "111246105534743508645", "name": "Michael Varner", "time": 1501481784531, "rating": 1.0, "text": "I bought dryer and fridge also stove, dryer stopped heating, service man great guy came out fixed, wires loose, okay.Dryer stopped heating again open up back of dryer top element jumped over bottom element control burned out cause it's so rusty.This business should take more pride in what they sell,90 days warranty is ok but risk of burning your home down ain't worth saving the money.Cavieat empore ,buyer be ware their turning a quick buck.Went in a few days ago fridge 399 mold still on bottom freezer rails, examine their stuff very close before you leave they have brand new attitude when you have a greivance.", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "117898567919884639543", "name": "Harold Williams", "time": 1491066391864, "rating": 1.0, "text": "Am looking for a nice use refrigerator\nDouble doors, ice maker, water dispenser.\nTrying to see if this the place to go", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "106295305435566096823", "name": "Talisa Simmons", "time": 1499515491906, "rating": 5.0, "text": "Wonderful place shop I bought items", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "105746191122172036500", "name": "C Wilson", "time": 1568762562844, "rating": 3.0, "text": "Good selection available", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "116079566545067673232", "name": "lavonda ausborn", "time": 1515207707009, "rating": 1.0, "text": "Bought washer/dryer have had problems with both from day one. Warranty expired washer leaking 2 days later.", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "112852713392388316083", "name": "Queen Harvey", "time": 1580512489011, "rating": 4.0, "text": "Great sales", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "100748487656610917715", "name": "That Guy", "time": 1577015478319, "rating": 4.0, "text": "Affordable price", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "101073236501133249447", "name": "ALVIN GILCHRIST", "time": 1495886985701, "rating": 5.0, "text": "New and Used appliances with warranty 💯", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "104968122571447060956", "name": "Tamalieta Moore", "time": 1548595664951, "rating": 1.0, "text": "Parts prices was outrageous", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "111638904942945577539", "name": "robert ma", "time": 1483467290032, "rating": 5.0, "text": "The appliances are cheap as hell", "pics": null, "resp": null, "gmap_id": "0x888e80f4d70d4503:0x791007cfaee3a66"}
{"user_id": "113862108449082692283", "name": "Zeke H", "time": 1543861537306, "rating": 5.0, "text": "Great telephone service for a part and service of my Oreck XL 21.", "pics": null, "resp": null, "gmap_id": "0x8862132cffff0d09:0xadc85972586fd9bf"}
{"user_id": "116248527415330924364", "name": "Jeffery Gilliam-Swaggerty", "time": 1471095599062, "rating": 3.0, "text": "Wish that Orek would build another store in Huntsville (University Drive/Madison )so that  the purchase of cleaning supplies wouldn't be so far to get.", "pics": null, "resp": null, "gmap_id": "0x8862132cffff0d09:0xadc85972586fd9bf"}
{"user_id": "117536577158849244270", "name": "Grover Sheffield", "time": 1575057426006, "rating": 5.0, "text": "I bought a vacuum here several years ago and I recommend the owner highly.  I particularly appreciated his experience, and willingness to talk about the reliability and pros and cons of different types of vacuum cleaners.  I ultimately choose a Panasonic upright with extension hoses, and have been very pleased with the vacuum and subsequent service.  Excellent job, sir!", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "118385163742005534060", "name": "Bryan Jackson", "time": 1545899524385, "rating": 5.0, "text": "When your the BEST what else is there to say.......\nHe Sales the BEST, and does the BEST work period. When you say I want my Vacuum Serviced not only does he take it COMPLETELY apart and Service it CORRECTLY he makes it look New again.\nGO A1 VACUUMS!!!!\nBEST IN THE USA!!!!!\nWe buy ALL of our Vacuums from him, now my carpet looks new again BECAUSE HIS VACUUMS THAT HE SALES CLEANS THE CARPETS, unlike other vacuums you buy in stores etc.", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "108268984991778493321", "name": "Francis Magilluctti", "time": 1531033589071, "rating": 5.0, "text": "When Mr. Cox Serviced my Panasonic 583 when I went to pick it up it looked like the day I bought it and it's 14 years old and I Vacuum everyday, he TRULY SERVICES VACUUMS. I use to take my Vacuum(s) to another shop in Birmingham and I was told by a very sweet person to take it to Mr. Cox's store at A1 Vacuum and he would do a True Service on it and he did FAR BEYOND any expatiation!!!! I WILL ALWAYS BUY AND GET MY VACUUMS SERVICED THERE!!!!! Oh and by the way I LOVE THE BAGGED VACUUMS LIKE HE SALES THEY ARE THE BEST!!!! Thank you again A1 Vacuum and to Mr. Cox. Since I vacuum everyday I know that BAGGED VACUUMS ARE THE BEST!!!!!", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "101266799637235887571", "name": "Vincent Principi", "time": 1596400092051, "rating": 5.0, "text": "Great service expert at his work", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "107338792070765031247", "name": "Barbara Peachtree", "time": 1551108109948, "rating": 5.0, "text": "Best PLACE IN THE USA!!! I bought my Electrolux (Perfect) from him because my friend Jim said to do so and when your talking to the King of Clean that's Jimbo. Love my vacuum I use it everyday, been 6 years ago and it's still chirping right along in my 8,400 sq ft house. I definitely recommend Mr. Phillip Cox to everyone. I took my Beach Vacuum which is a Panasonic to him for a Complete Service when I got it back I thought he was giving me a New Vacuum Cleaner, it worked like and cleaned like a new one just as he said it would.", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "101654142465052196200", "name": "Jim McCollum", "time": 1533279493171, "rating": 5.0, "text": "Best Vacuum Cleaner Reapir and Sales Man in the USA. He Repairs all makes and models of Vacuums and he only sells the Best Vacuums. We love all of our Vacuums that we have Purchased from him, they never break down and I vacuum everyday. His repair work is very reasonable and he Does beyond a FANTASTIC Service Job on our Vacuums, when we get them back they Look and Work just like new again. He also fixed our Central Vacuum and did an Outstanding Job on it as usual.", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "103836554642736273898", "name": "Lisa Elder", "time": 1554446351933, "rating": 5.0, "text": "Learned a great deal, even my non fixable equipment worked when I left.  Very pleasant service to finish the deal!", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "105431993750057876623", "name": "Scott Trammell", "time": 1544638606675, "rating": 5.0, "text": "Great service at reasonable prices. Honest owner!", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "112543364680042954346", "name": "Glena Trammell", "time": 1490988219216, "rating": 5.0, "text": "I've purchased from Philip for sales and repair for over 30 years when he was in Vestavia and now in Chalkville. Reasonable on price and very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "103743108142008723144", "name": "Susan Moore", "time": 1550869250576, "rating": 3.0, "text": "Nice, reasonable prices", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "111453089006036179163", "name": "Jeremy Wren", "time": 1520735804086, "rating": 5.0, "text": "The guy at the place waited around on me when he didn't have to and said if I didn't make it by the time he had to leave he would leave to vacuum cleaner belts outside for me to have and just pay for them when I could", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "108769903534620940174", "name": "Sam Iam", "time": 1477341177525, "rating": 5.0, "text": "Very good honest customer service", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "108546735890325370073", "name": "Kevin Russell", "time": 1617809054938, "rating": 5.0, "text": "Took in an old commercial upright that has not worked in 3 years and David was able to repair it reasonably, effectively and quickly.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4174164bcc35:0x1b10a6ea57aed73f"}
{"user_id": "103519241622540885259", "name": "F Lambert", "time": 1621605234021, "rating": 5.0, "text": "The guy who runs the one on 64 is so helpful", "pics": null, "resp": null, "gmap_id": "0x889a4174164bcc35:0x1b10a6ea57aed73f"}
{"user_id": "113960904610871362886", "name": "Ellen Felts", "time": 1595025069381, "rating": 5.0, "text": "Went to A & A Vacuum to have my handheld Dyson repaired. Unfortunately due to age, cost more to fix then it is worth. Tony did a great job explaining all options. He showed me what he had available (great selection with several top brands)  asked questions to understand what was best for us and explained differences in vacuums. Even gave me a full demonstration of each vacuum - no rushing and no high pressure!! Matches popular online shopping pricing!!!! Many benefits of buying local = personal service, 3 yr warranty, annual service/tune-up, support outstanding local business and deal local with any service needed. Love my Simplicity cordless stick vac!!!  Thank you Tony!!", "pics": null, "resp": null, "gmap_id": "0x889a4174164bcc35:0x1b10a6ea57aed73f"}
{"user_id": "114651100871195150240", "name": "karen page", "time": 1574881916086, "rating": 5.0, "text": "This place is the best. I called yesterday about bringing in a vacuum for routine maintenance. Was told he would have time the next day and would have it ready by the end of the day. I actually ended up taking two vacuums in first thing this morning and both were completely ready for pick up in 2 hours!  One of the vacuums I had actually purchased there just a year ago. They are very low pressure and very helpful and friendly. I would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4174164bcc35:0x1b10a6ea57aed73f"}
{"user_id": "109481013717744272408", "name": "susan young", "time": 1571257537677, "rating": 1.0, "text": "Extremely rude!! Took my vacuum told me it would be a week! Almost 2 weeks later he got angry because I called!! Told me I was taking up his time by calling! This guy should be shut down! Who is his boss?? Then hung up on me!\nHe wasted my time as I should have taken it to a professional!!! Do not use this god awful place !!", "pics": null, "resp": null, "gmap_id": "0x889a4174164bcc35:0x1b10a6ea57aed73f"}
{"user_id": "106224282144636184029", "name": "Paul McLain", "time": 1566587615150, "rating": 5.0, "text": "The only place to go for your vacuum needs. Very competitively priced and extremely knowledgeable. Always support locally owned businesses whenever possible.  Good people.", "pics": null, "resp": null, "gmap_id": "0x889a4174164bcc35:0x1b10a6ea57aed73f"}
{"user_id": "111229041261073238714", "name": "Jayme Bartshe", "time": 1491353592630, "rating": 5.0, "text": "AWESOME PLACE! I brought my Kirby vacuum in for repair. The worker was very nice, super knowledgeable, and took the time to honestly answer all my questions. He was very kind and knew exactly what he he was talking about. Prices were great, overall I had a great experience! I will definitely buy my next vacuum here.", "pics": null, "resp": null, "gmap_id": "0x889a4174164bcc35:0x1b10a6ea57aed73f"}
{"user_id": "101458251339815711653", "name": "Samantha Barton", "time": 1437880134998, "rating": 5.0, "text": "Very professional and they take the time to answer all of your questions. The customer is never pressured to buy something they do not want. They offer the best yearly maintenance for the model vacuum I purchased. I was so impressed I even brought my mother 2 hours to purchase the exact same vacuum.", "pics": null, "resp": null, "gmap_id": "0x889a4174164bcc35:0x1b10a6ea57aed73f"}
{"user_id": "110673574318322551186", "name": "Jeff M", "time": 1548641204191, "rating": 5.0, "text": "Very Knowledgeable and excellent advice and options.", "pics": null, "resp": null, "gmap_id": "0x889a4174164bcc35:0x1b10a6ea57aed73f"}
{"user_id": "109682229566574769652", "name": "walter cook", "time": 1469539102350, "rating": 5.0, "text": "Great store. Great folks!", "pics": null, "resp": null, "gmap_id": "0x889a4174164bcc35:0x1b10a6ea57aed73f"}
{"user_id": "115494962407722638431", "name": "Kristin Fulda", "time": 1624115445303, "rating": 5.0, "text": "Always providing quick, professional, quality service.  Brought my Miele canister in for a tube up and I got it back much faster than expected.  Big thanks to Joe and to the crew at S&R! I won’t go anywhere else in Huntsville :)", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "114312672470248189072", "name": "mlplong1", "time": 1595007599822, "rating": 4.0, "text": "Nice", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOQdmJGILyLONlwrrYPaTjKjIj2clXBTNVX_Sy0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNparNKPbVlmCFzjDfn1jwuXyWOisO1vtcQOaEF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMo6QEoKuy4uZixvKC-0CB3ltErPQ1q2C93OMln=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "112223533162377122258", "name": "Tabitha Riley", "time": 1623248540241, "rating": 5.0, "text": "I love coming to this place to buy my vinyl. These young beautiful spirit young lady Meredith always helping me. ♥ She has been a great help everytime I come to make a purchase.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "104584068516654672520", "name": "Kaye Diener", "time": 1622213905602, "rating": 5.0, "text": "Meredith was very helpful in demonstrating the Baby Lock Verve to me and my daughter. I was so pleased that I purchased it. Sorry I couldn't purchase it from her because I don't live in her area. But I did purchase it from a dealer closer to my home. I was visiting my daughter in Alabama and I live in ohio. Meredith was very courteous and knowledgeable about many of the machines on the showroom floor. I appreciated her ability to explain many aspects of the Verve to me and also compare a couple of the others to it. Thank you Meredith.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "100047381970804355703", "name": "Alexandria Peterson", "time": 1623959783259, "rating": 5.0, "text": "This is my go to place!!!! I am always taken care of, and they are always helpful! Meredith has been so kind to help with all of my big orders!! So happy to have S&R here!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "102847794702248060586", "name": "Morrison Monogramming", "time": 1622412058143, "rating": 5.0, "text": "Kathie Hodges taught me all about appliqué almost 10 years ago!  She has stuck by my side through endless questions.  She is always helpful and friendly!  Love my new Jubilant sewing machines!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "100522257591946168994", "name": "Keira Williams", "time": 1623789995302, "rating": 5.0, "text": "S&R is my new favorite place to get my vinyl. Meredith is always so sweet and willing to help however she can!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "113567770233965103598", "name": "Katrina Coleman", "time": 1623127693359, "rating": 5.0, "text": "Meredith was knowledgeable on the spare part I needed for my machine. It was well worth the drive from Madison. Thank you and yes that part did work perfectly.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "101844339713732112715", "name": "Skin Attack Tattoos", "time": 1622651099732, "rating": 5.0, "text": "I love this place everyone in there is very nice and helpful also Meredith is very polite and gives a good welcoming when I walkinn thank you for y’all hard work 😎", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "114236227882163433906", "name": "Cynthia Curry", "time": 1622217122088, "rating": 5.0, "text": "Thank you S &R Sewing for a job well done.  And a special thanks to Meredith for all your  help. I will be coming back.  Thank you again.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "112767496498590109474", "name": "Destiny Leslie", "time": 1622212541980, "rating": 5.0, "text": "Meridith and Randy are awesome!!! Every time I come in they always are very helpful and sweet! Will continue to shop here!!🥰🥰", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "112175299347401865738", "name": "Sonja Howell", "time": 1622297309386, "rating": 5.0, "text": "I was so pleased for the help I got from Meredith about my new machine. She knew exactly what I needed and helped so much!! Thanks Meredith!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "101850725980983275647", "name": "Wayne Estes", "time": 1621403837732, "rating": 5.0, "text": "All mom wanted for her 94th B-Day was her sewing machine fixed. Tony & the S&R team made it happen!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "116168659734848182304", "name": "Karen T", "time": 1594060895002, "rating": 5.0, "text": "S&R Sewing Center is the best.  I was having issues with my embroidery machine and Tony offered assistance over the phone.  I tried what he said and ended up taking it into the store.  He resolved my problem in a matter of 10 minutes.  Amazing what a small thread or lint will do to a machine.  Tony was AWESOME in getting my machine working again.  Love that store.  Well worth the 45 minute drive over for excellent service.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "103852628416128551903", "name": "Sarah Fulks", "time": 1603479142236, "rating": 5.0, "text": "I recently bought a new machine at S & R in Huntsville. They were very helpful, friendly, and patient allowing me to spend as much time as I needed using the floor model before deciding to buy. The machine I bought was on back order, so I wasn’t able to take one home that same day. When the machine did arrive, my husband ended up going to pick it up for me. I gave him a list of extra accessories to buy, but I was a little worried he wouldn’t get it right as he knows NOTHING about sewing. At the store he was able to show them the list, and they went and got everything on the list for him rather than just telling him where to look. I’m definitely happy with the service I’ve received there so far!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "106189417952408608413", "name": "Elizabeth Bero", "time": 1622674074683, "rating": 5.0, "text": "Thanks to Meredith for helping me replace the missing part!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "111457034627434133095", "name": "Tim Klassen", "time": 1622759620279, "rating": 4.0, "text": "Ok place but a little unprofessional for a business in 2021 ...I love to see a place thriving and going places .....needs management", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "112178915886030363471", "name": "Jay Potter", "time": 1622667516187, "rating": 5.0, "text": "Always have a great experience shopping here.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "105538520921879395715", "name": "keysha stinnett", "time": 1623180937996, "rating": 5.0, "text": "Meredith was very professional and a great help.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "106404878315649302876", "name": "Carlisha Landers", "time": 1603415115418, "rating": 5.0, "text": "This will now be my go to spot for HTV! The customer service here was beyond excellent as well as the prices! They have a great selection of vinyl and even a rewards program! I will definitely be back soon!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "110439111129278939053", "name": "Kelsey Sales", "time": 1595870010179, "rating": 5.0, "text": "They were very friendly.. I had a minor problem with my sewing machine and Randi was very big help. I was in and out. Plus if you need a sewing machine they have some on hand( they’re sold out everywhere). Will definitely be shopping here😊", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "111848978150331770877", "name": "Clara McLemore", "time": 1592938480623, "rating": 2.0, "text": "the first time I went to this place I would have given him five stars they fix my vacuum for free. This time they told me it would be 2 to 3 weeks when I called vacuum world he said he had one customer ahead of me and he could have my vacuum back today", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "110742299278952794502", "name": "Dorothy Scott", "time": 1586381725309, "rating": 5.0, "text": "This place and the people who work here are great!! Very knowledgeable and very helpful and friendly. Give them a try. You won’t be disappointed!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "113683511749580001321", "name": "jackie kelly", "time": 1597764360843, "rating": 5.0, "text": "Great prices and nice people; always helpful", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "103860329018681141675", "name": "nyisha vance", "time": 1591459615249, "rating": 5.0, "text": "The staff here are always so friendly and helpful!! Thank you for the great service you provide SandR sewing!!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "101088546311408811445", "name": "Vicki Baggette", "time": 1554664386866, "rating": 5.0, "text": "Took a sewing class yesterday on making an oval rug from jelly roll fabric.  Randi was a patient instructor and I came away with a cute product.  A good lunch and plenty of snacks were provided during a long day of sewing.  It was a full class with plenty of space to set up.  The other ladies were also very nice.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "114761695550363157987", "name": "Renew1874 Salon", "time": 1581518040076, "rating": 5.0, "text": "I’ve visited the store several times to purchase htv for shirts . The staff is Always friendly and  helpful.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "103526049789013094981", "name": "Michele Olney", "time": 1520439163099, "rating": 5.0, "text": "I had an over 30 year old sewing machine.  I decided to buy a new one.  Ms. Gay was very friendly and helpful and showed me a couple of machines.  They have material at ever machine so that you can try them out.  I purchased a new Baby Lock sewing machine from S&R.  I love the sewing machine but even more I love that they had a 3 session sewing class that let me get to know my new Baby Lock.  The instructor is very knowledgeable and the class was amazing.  I thoroughly enjoyed this class and will be back for more classes.  I would recommend this store to anyone and everyone.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "102160578642376149698", "name": "Robert Owens", "time": 1544835201255, "rating": 5.0, "text": "I went by to get my Dyson repaired. I called first and they said 3-4 days before they could repair after I dropped it off. I said no problem. I went by around lunchtime and upon walking in the door I was approached by a gentleman who knew I needed my accompanying vacuum repaired. I explained my issue. He began to work on it immediately thinking it may just be a belt. Within five minutes I was fixed up and at a very, very reasonable price. I will visit again, and will bring my sewing people with me. Truly exceptional service, with a smile.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "105630597204938778169", "name": "K A S H MOODIE", "time": 1555259329617, "rating": 5.0, "text": "Paul was very nice and knew what he was doing. He was very honest about the issues that my vacuum cleaner had and fixed it immediately. I’m grateful for him because I was two seconds away from tossing the whole thing.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "109646113784033320833", "name": "Scott Seeley", "time": 1572118292331, "rating": 5.0, "text": "Helpful and kind ( rare these days ) people helped get our seldom used sewing machine back in ready to use every day condition. Thanjs! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "102285950805395175341", "name": "Barry Owen", "time": 1594767236943, "rating": 1.0, "text": "Bad business They will charge you whether they work on your stuff or not. Read the BBB report and their Facebook reviews. I’m\nNot the only one to say this.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "112822865322716350390", "name": "Bobbie King", "time": 1551926409417, "rating": 5.0, "text": "Thank goodness for these folks, I got my machine fixed in a reasonable time & good price. They also carry used machines,new machines,both sewing,sergers and embroidery machines. Fabrics & quilt patterns too.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "106545203787994498854", "name": "Darla Suggs", "time": 1532030719689, "rating": 5.0, "text": "Excellent! Easy to work with...fair prices. Took a vacuum in for repair...ended up buying s new one. Will use the repair unit as a spare. Paul Fischer helped us with the repair and the new unit. He's very knowledgeable and easy to work with!!", "pics": null, "resp": {"time": 1532032932726, "text": "Thank you Darla! Paul is an exceptional employee and we appreciate his dedication to his job. Thank you for your review!"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "105879620567829939976", "name": "Alana Knight", "time": 1551988615963, "rating": 5.0, "text": "Randi helped me tremendously with my Alliance baby lock. She answers questions almost immediately with all the right answers! Amazing customer service 😊", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "103481848678167688349", "name": "Karen Rich", "time": 1531237196077, "rating": 1.0, "text": "I have taken several carpet cleaners to be repaired every time he takes weeks up to 3. I call them I call and they still don't know what they're doing. the last carpet shampooer I brought took again 3 weeks this was 2 weeks ago the machine worked well when I dropped it off all it needed was a belt and a cover piece on the front of the machine and I believe I might have got the belt or not??when I went to use it today for the first time it would not even turn on. This kind of thing happens every time I have used this so called service. They have lost a very good customer. I want to add I was not charged for the last visit ,and I am always treated kindly by the repairman but what good is a machine that comes  back worse than It had arrived.", "pics": null, "resp": {"time": 1532032837312, "text": "I'm very sorry that you have an issue. I only have 1 transaction for you this year. looks like we could not get a part for your your Hoover steam cleaner. Then you purchased a Bissell steam cleaner earlier in the year. But, I do not see there was ever a long time period the machine was here. Please give me a call at 256-536-5696 and ask for Tony so we can see what the problem is since this is the first I've known of a problem. Thank you."}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "111241122733184527829", "name": "Pam atthewillows", "time": 1458228364300, "rating": 5.0, "text": "I have shopped at this store for over 10 years. Even when it was at the first store.  Tony, Gay and Kristy have been the best to work with.  I come from Tennessee to shop there just because of the customer service. No I am not related to anyone in the store.\nThe opportunity to learn about the products I purchase is the greatest, Kathy, one of the teachers for Silhouette, is an extremely good teacher, especially for beginners.\nTheir service department is the most curtious  I have ever dealt with . Mark and Scott are very knowledgeable, very well trained.", "pics": null, "resp": {"time": 1508464664288, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "117740970427978280948", "name": "Claudia Rhen", "time": 1545499603309, "rating": 5.0, "text": "Great service! Thought my old vacuum was ready for dumpster and prepared to buy new one. S&R restored my old, reliable to practically brand new!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "105818997187476570120", "name": "David Jones", "time": 1549314995975, "rating": 5.0, "text": "Randi is top notch any questions or concerns you have she will take the time to answer them, and as well offers classes to help you learn your equipment!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "109700691216826725997", "name": "Dan Kish", "time": 1537199477052, "rating": 5.0, "text": "S&R Sewing helped us get a couple of older sewing machines back up and running and ready for action!  Excellent service and great people!  Can't recommend them enough!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "111241122733184527829", "name": "Pam atthewillows", "time": 1458228364300, "rating": 5.0, "text": "I have shopped at this store for over 10 years. Even when it was at the first store.  Tony, Gay and Kristy have been the best to work with.  I come from Tennessee to shop there just because of the customer service. No I am not related to anyone in the store.\nThe opportunity to learn about the products I purchase is the greatest, Kathy, one of the teachers for Silhouette, is an extremely good teacher, especially for beginners.\nTheir service department is the most curtious  I have ever dealt with . Mark and Scott are very knowledgeable, very well trained.", "pics": null, "resp": {"time": 1508464664288, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "117740970427978280948", "name": "Claudia Rhen", "time": 1545499603309, "rating": 5.0, "text": "Great service! Thought my old vacuum was ready for dumpster and prepared to buy new one. S&R restored my old, reliable to practically brand new!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "104116847371305558435", "name": "PixieDarlingCreations By Terry Duke", "time": 1507573854772, "rating": 5.0, "text": "S&R employees are family and they treat you like you are part of theirs! They are also very thorough and quite reasonable with their pricing which I greatly appreciate! — And are open Columbus Day!!!", "pics": null, "resp": {"time": 1508464413172, "text": "Thank you for your business  we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "104901088201734957752", "name": "matthew bowles", "time": 1543681506938, "rating": 5.0, "text": "Tony is a hands on owner and tries to help his customers as best as he can. I bought a machine online and it was damaged. Tony and his staff fixed it right up.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "109863153695068394834", "name": "Mark Pepper", "time": 1522025595320, "rating": 5.0, "text": "I got a Dyson vacuum cleaner repaired. The service was quick and efficient; Paul cleaned the vacuum and it looks and works good as new. Would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "117335978332155154153", "name": "Ruby Winkles", "time": 1548704458536, "rating": 5.0, "text": "Very nice people n they did a great job working on my sewing machine", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "113182082035413818039", "name": "Jeremy R", "time": 1420492832932, "rating": 1.0, "text": "I stopped in before Christmas to look for a sewing/embroidery machine. Tony (the owner) was very friendly at the time. The next week, we ran across a good deal on a used Brother machine from another local retailer in the area. S&R carries BabyLock which is made by Brother. I needed some accessories so I thought I would give S&R a chance. I called and asked Tony if he had the accessory that I was looking for. He said yes. When I asked the price, he asked where I wound up buying my machine. I told him that I'd found a used machine at a store down the street. His response was \"You need to call them\" and then HUNG UP THE PHONE.\n\nPeople buy accessories and notions much more often than machines, therefore I thought that a retailer would be happy to have that business; not S&R.\n\nI like supporting small businesses, especially when they have a service to offer (i.e. repairs, advice, etc.). There are other sewing machine centers in Huntsville that want your business no matter who you are, what you have, or where you got it. I will support them.\n\nOtherwise, I will buy online before I do business with S&R again.", "pics": null, "resp": {"time": 1426095706731, "text": "We do our very best to give the highest level of customer service to each customer that comes in the door or calls on the phone. but the rest of this story is a little different than what was told. When you purchase a sewing machine from S&R Sewing & Vacuum ctr you do get unlimited support and classes but This however dose not apply to machines not purchased from S&R Sewing I simply told Jeremy R. that after spending more than an hour with him trying to get the best machine for him and his wife that he should go back to where he purchased his machine and they could help with his questions."}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "100572122474098402214", "name": "Compton Owens", "time": 1524481150849, "rating": 5.0, "text": "We purchased a Miele CX-1 canister vacuum cleaner and could not be more pleased.  The vacuum cleaner is a beast of a machine! Our salesman, Paul Fischer, was very knowledgeable, patient, and NOT at all pushy.  He was very helpful, and even offered to let us take a vacuum cleaner home for a test drive over the weekend.\n\nIt am convinced that S&R Sewing and Vacuum Center stands behind the products they sell.  They offer onsite service and repairs as necessary, and that’s a big deal to me. Prices are competitive , and comforting to know that I have a local dealer who cares about their customers after the sale.\n\nI highly recommend S&R!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "110055945727927103380", "name": "Same Asiteverwas", "time": 1555117000654, "rating": 5.0, "text": "Paul was very knowledgeable and helpful. I recommend S&R for all your vacuum cleaner issues.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "113504361303553101669", "name": "Gracie Dean", "time": 1549725152925, "rating": 5.0, "text": "Randy is the best! She has taken the time to give me embroidery lessons on her time and answers any questions sent via message almost immediately.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "113887777837081537906", "name": "Beverly Bogle", "time": 1538157406284, "rating": 5.0, "text": "Love the people there very nice and very good. Have been a customer for yrs yrs, lol ainta saying how many will reveal my age. 😆", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "109288679376735555122", "name": "Becky Orr", "time": 1471725348420, "rating": 5.0, "text": "Had a ball at the Anita Goodesign Embroidery Party this weekend! . S & R did an excellent job hosting and serving wonderful generous lunches.  Can't wait for more classes.", "pics": null, "resp": {"time": 1508464682185, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "114607331198771035257", "name": "Fae Fae", "time": 1566253252761, "rating": 5.0, "text": "The only place to buy Kirby vacuum bags", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "115615865282520100090", "name": "Louise Cherry", "time": 1483663334434, "rating": 5.0, "text": "Attending a serger class, the teacher and class is great, the service is absolutely the best, good lunches as well as snacks and drinks all day. They take the time to ask us if we need anything special.  Wish that my classes from work were held at such a nice place, where you treated very good. Highly recommend them for buying sewing machines/embroidery machines and sergers as well as whatever kind of thread you need.  If they don't have it, they will order it.  Won't buy a machine from anyone else.", "pics": null, "resp": {"time": 1508464568180, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "113661489674888527872", "name": "Jacqueline Rogers", "time": 1516225930218, "rating": 5.0, "text": "I'd add another star if I could.  My vacuum cleaner looks brand new. If you want courteous service; THOROUGH, KNOWLEDGEABLE AND PROFESSIONAL workmanship , please bring your vacuum cleaner here. I will from now on!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "114303695431492589419", "name": "Kim Galkowski", "time": 1543700611620, "rating": 1.0, "text": "I bought a six needle before a Florian I event and was told by Christi I would get the same promo as they had at the event. At the event she did not give me the same promo and when I spoke to her later at the store instead of paying the difference for the cost incurred at the event (that was supposed to be covered) she gave me a store credit requiring me to spend more at the store. Another time I went to another event and ordered a hoop for my machine, Christi ordered the wrong hoop and when I realized it she offered to order me the correct one (this was in early October) approximately 8 months later with all kinds of stories from Christi telling me it was backordered I call the company directly and was told it was never on backorder during that time and if I returned it to the store I could get it directly from them. When I went to the store to return the hoop, bubba found one sitting on the counter that was the correct one, needless to say, I won’t step foot in this store again. Bubba is a good man but I feel that Christi does not care about her customers and lies. I have found another store in town that knows how to treat their customers.", "pics": null, "resp": {"time": 1544500712845, "text": "Kim we do not have a Christie that works for us and Buba works for Huntsville Sew and Vac not affiliated with my store I feel that you may have gotten us mistaken for them but if I can help  you with a hoop or anything else please let me know you may call us at 2565365696 also if you don't mind please retract your negative feedback from S&R Sewing and Vacuum Center as it will bring our rating down since we are not at fault.\nThanks Tony Coulson"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "111230477092020096016", "name": "Sherman Wiggin", "time": 1443541821353, "rating": 5.0, "text": "We have an older Designer 1 that has had various problems over the years.  The owners went out of their way each time to fix the problem - even sending it back to the manufacturer for one issue.  They upgraded the system from a 3.5 floppy to USB kit, replaced various small components that have broken effecting needle and bobbin functions.  Each time they explain the problem and have looked for the most economical way to repair the machine.  Its time to take it back in for another issue today (this is not a reflection on the machine - we have really used and demanded a lot of this machine).", "pics": null, "resp": {"time": 1508464644823, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "107042091822029636297", "name": "Jeannette Owens", "time": 1483723408912, "rating": 5.0, "text": "Took my first class this week, Server Davy Retreat. Absolutely phenomenal staff, large classroom, outstanding instructor...This certainly will not be my last class :)", "pics": null, "resp": {"time": 1508464544805, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "107042091822029636297", "name": "Jeannette Owens", "time": 1483723408912, "rating": 5.0, "text": "Took my first class this week, Server Davy Retreat. Absolutely phenomenal staff, large classroom, outstanding instructor...This certainly will not be my last class :)", "pics": null, "resp": {"time": 1508464544805, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "113441302325391505213", "name": "jim Porter", "time": 1573006492304, "rating": 1.0, "text": "When you take something in for repair , they say they will call you and never do. Went buy to check on it and said” the owner was going to get in touch with Electrolux to see if ugh e could get a overheat sensor and would be in touch with me Monday. That was 2 months ago1", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "100723406381135483366", "name": "Tawnia Marceau", "time": 1503066360163, "rating": 5.0, "text": "S & R Sewing has been my saving grace when I've need HTV! Customer Service is Awesome! Love S & R!!!", "pics": null, "resp": {"time": 1508464490826, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "115588180287615959934", "name": "Kellen Cade", "time": 1502814641683, "rating": 5.0, "text": "Great store,  the staff was WONDERFUL.  They didn't have what I needed, but they took the time to find another store that did have what I needed.", "pics": null, "resp": {"time": 1508464518467, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "109671830376852275741", "name": "Eddie Ethridge Jr", "time": 1541800079045, "rating": 4.0, "text": "Call to get pricing for vacuum repair, took it in and Paul took care of me in less than three days even with him having alot of repairs. Thanks alot.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "110567077731241561876", "name": "Amanda Moreland", "time": 1415055420397, "rating": 1.0, "text": "Horrible horrible customer service. Don't waste your time or money here. worse mistake ever to buy my embroidery machine from them. its suppose to be covered under a warranty for 1yr. but yet they don't fix it, or its not covered. my husband was hung up on, put on hold for long periods of time. Always told someone will call but no one ever does. we are still waiting after a month for a .25 cent part, and no fix on the usb program To run the  machine.  They have lost our business for sure. we will go else where to upgrade to a 6 needle machine. im very disappointed with this company.", "pics": null, "resp": {"time": 1426100636413, "text": "Amanda the problem with your machine is not a .25 cent part as  for your usb stick i did  replace it  with a new one that we were able to get from the factory  at no charge to you. I do not know how or why the program on your usb stick had gotten erased. As for the warranty it did have a year on it and you were not charged for any labor and i do not show any records for parts. I am sorry that you feel that we did not do enough to make you happy with the machine that you purchased from us."}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "106224263963143068193", "name": "Barbara Biles", "time": 1472069340163, "rating": 5.0, "text": "Had a great time at Anita Goodesign event-great food, good location and tremendous deals on machines, embroidery designs, luggage carriers- Best teachers and staff always available", "pics": null, "resp": {"time": 1508464703825, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "101317642930389247402", "name": "Tracy Maples", "time": 1471963557338, "rating": 5.0, "text": "Attended the Anita Goodesign event this weekend August 19 & 20, everything was excellent.", "pics": null, "resp": {"time": 1508464720411, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "113591640306589303872", "name": "Debbie Ragsdale", "time": 1479227191294, "rating": 4.0, "text": "Love the new location!  Good people and very friendly!!", "pics": null, "resp": {"time": 1508464590407, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "115159472213295440936", "name": "Brian Beaty", "time": 1506910043740, "rating": 5.0, "text": "Excellent customer service and great prices!", "pics": null, "resp": {"time": 1508464464161, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "108788954581169984668", "name": "Barbara Hubbert", "time": 1471794791356, "rating": 5.0, "text": "Great fun at the Anita Goodesign embroidery party this week!", "pics": null, "resp": {"time": 1508464740582, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "115312614398961920151", "name": "Chondra Craig", "time": 1513834233183, "rating": 5.0, "text": "Excellent service! Fixed the problem in a reasonable amount of time!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "112322163650790614756", "name": "Donna Stepp", "time": 1476402118403, "rating": 5.0, "text": "Love this place and the people.❤️❤️❤️ Service department is awesome.", "pics": null, "resp": {"time": 1508464616155, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "104214839164536282580", "name": "Pam Mann", "time": 1471725854349, "rating": 5.0, "text": "Had a blast at Anita Goodesign party on Aug 2016", "pics": null, "resp": {"time": 1508464766744, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "118130877917130475670", "name": "Chrissyart creations", "time": 1618938945606, "rating": 1.0, "text": "??????? Never went there", "pics": null, "resp": {"time": 1619789975064, "text": "i am not sure why you left me a 1 star review could you explain"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "100178126477131518678", "name": "Computer World", "time": 1531503155093, "rating": 5.0, "text": "#1 vacuum repair in huntsville", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "108828030460322612477", "name": "Mindle Hoffamitz", "time": 1503441442993, "rating": 1.0, "text": "What a joke for a vacuum cleaner service center. Took me over 4 weeks to get a part for my vacuum cleaner and then I come to find out the part doesn't even go to my vacuum cleaner. Avoid this place at ALL COSTS.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "111048244008421608792", "name": "Lauren Hellems", "time": 1619016886121, "rating": 5.0, "text": "Stewart is extremely knowledgeable and efficient! They ARE NOT CLOSED!!! Google had it listed wrong.", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "110160714343164158149", "name": "Rosanne Anderson", "time": 1612020611921, "rating": 4.0, "text": "I was very surprised.  Sales person was very honest & not in the least pushy.  Would recommend them.", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "106244805807226889147", "name": "Rosemary Cannon", "time": 1615421560920, "rating": 5.0, "text": "Nicest elderly gentleman helped us with our carpet cleaner. We certainly will use him again!", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "113121288336562451163", "name": "Lynda Smith", "time": 1591402039677, "rating": 5.0, "text": "The owner of the shop was absolutely wonderful! Very pleasant, educated us on how to maintain our Dyson vacuum. I really expected to have to leave it there for a. Of time, hey repaired it within an hour he was awesome!! I will never go anywhere else but here!", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "111100398976914108701", "name": "Curtis Price", "time": 1599149837329, "rating": 5.0, "text": "Excellent service, good prices - plus owner is a character who tells interesting and colorful stories.", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "102251622497064287345", "name": "James Ray", "time": 1581643935661, "rating": 5.0, "text": "Very nice lady she was close but i needed a vac bag she let me in", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "110194846518595606934", "name": "bryan johnson", "time": 1623493718781, "rating": 4.0, "text": "Very nice man. And knows his vacuums.", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "105308698676791092274", "name": "MJ Dil", "time": 1557417581690, "rating": 3.0, "text": "Good work & reasonable but don't follow through on when they will have an estimate or when it will be done.", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "112464396975137580129", "name": "Phil Penny", "time": 1495305151764, "rating": 5.0, "text": "My gosh, they so surpassed my expectations!  They replaced a broken part for me (under warranty) but they did much more.  My piece was filthy and they totally restored it to new.  Even cleaned the roller brushes and put a new bag in.  Plus, it was ready so quickly.  Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "103801147274290491623", "name": "Jackie Cline", "time": 1530912379101, "rating": 5.0, "text": "They are excellent at customer Service, if they don't have it they will either order for you or let you know where to get it...💞", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "105002267555376169896", "name": "Daniel Sabia", "time": 1568832532343, "rating": 5.0, "text": "Grrat repairs at a reasonable price", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "112921050963779811743", "name": "Jennifer Elliott", "time": 1541601468262, "rating": 5.0, "text": "Always done good work for yrs for me thank u", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "109658268793321533471", "name": "Tony Posey", "time": 1561144505680, "rating": 5.0, "text": "Went in with my vacuum not picking up. He cleaned and cyclone parts . Very very helpful and courteous.", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "109609616256795952437", "name": "valerie bryson", "time": 1527104010366, "rating": 5.0, "text": "Great! Customer Svc Experience... I've been doing business with Vacuum World for 5+ years.", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "103026927169268668533", "name": "FJ B", "time": 1524232416976, "rating": 5.0, "text": "Great place for repairing and buying vacuum cleaner.", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "103214027701430464392", "name": "top4874", "time": 1537573025520, "rating": 5.0, "text": "Very knowledgeable and helpful staff. Good pricing and selection.", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "118033948649453860683", "name": "Andy C.", "time": 1435361580487, "rating": 5.0, "text": "Quick, honest, friendly, and they know their stuff. Priced about the same as big box for similar things, but they carry higher end machines as well.", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "108447805934048176339", "name": "Jonathan “Jonboy” Ray", "time": 1604985328629, "rating": 1.0, "text": "Never been", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "106809765292723510113", "name": "Oscar Ross Jr", "time": 1560786195218, "rating": 5.0, "text": "Will fix all vacuums..", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "113163707834552345041", "name": "Joseph Konold", "time": 1566855451424, "rating": 5.0, "text": "Very helpful!", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "102074297871911128284", "name": "Utopia Hinton", "time": 1543593601111, "rating": 5.0, "text": "Always helpful and friendly", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "110485517186629354580", "name": "Patricia Fernandez", "time": 1502061767723, "rating": 5.0, "text": "Always has what i need for my vacuums", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "100852465651351899604", "name": "Eddie Dufour", "time": 1410617755951, "rating": 5.0, "text": "Very friendly and helpful. Thanks", "pics": null, "resp": null, "gmap_id": "0x88626b84dc4d8f25:0xcfff6830a3832c72"}
{"user_id": "114635200786689339640", "name": "Jackie Hayes", "time": 1622909665513, "rating": 5.0, "text": "Today I completed another transaction to purchase a sewing machine from Ken's with the help of Amanda. She was extremely helpful, knowledgeable and patient as I had a couple delays. I've purchased other machines, accessories and notions from Ken's and had technical assistance as well. Every contact with them has been 'over top the top'. The prices are always the best, service and communication always very helpful. They are my go-to business for all things sewing.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "114531665312118860163", "name": "M P", "time": 1623783435700, "rating": 5.0, "text": "I had placed an online order about a week or so ago (customer service when calling with inquires was excellent), something came up and I needed to cancel. No questions asked, and they already issued a refund. What great service.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "110173586688807120212", "name": "Kevin A.", "time": 1589938079373, "rating": 5.0, "text": "I have had only great service and help with Ken's\n\nDuring the Covid-19 lock down in both AL & NC I was sure I couldn't get anything done. I was wrong, I sent emails to several places and only Ken's responded. I was able to talk to Jeremy about that I needed to fill in for what I already have.\n\nJeremy listened to the fact that I have a heavy duty machine that I can sew from 7/8\" thick of 6oz stacked leather to heavy upholstery. I needed to fill in the gap to do smaller. I wanted a machine that would hold up and I had support for. I bought a Janome 6600 PRO that I love. I ordered it on Friday and received it on Monday to Western NC.\n\nI can now sew from silk to saddles\n\nI called in after the machine arrived with a couple of questions about the machine and its options. Every time I called Jeremy took my call and answered them with the best intentions. I never felt that I was up sold or under appreciated.\n\nGood Job (Jeremy) and Ken's sewing", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOA3FGY6e_Soe7Wc2DCVNCHMQDI0AYerRFgl4Rm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNdI9Wm1X-hEpcuGYJRyZ0rPPzJKNVEMINZJAYK=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "112338610222067135615", "name": "Julia Bowden", "time": 1619636934321, "rating": 5.0, "text": "I have ordered a Brother Embroidery machine online and have been dealing with Amanda Allen. She has gone above and beyond to make sure I have been happy. And while I have never met Amanda I feel that I’ve known her forever! Now just waiting for my machine! Thanks for your patience Amanda!!!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "115867771515865525176", "name": "Cathyanne Raper", "time": 1553714097331, "rating": 5.0, "text": "Great Place to get all sewing  Notions. And sewing machines.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP6ugvn3nXW-ocCtcmBOYfQnoQzWNsv4GeObqQ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "113837426448187918789", "name": "Tere", "time": 1618927345317, "rating": 5.0, "text": "I've ordered embroidery/quilting machines from them by phone a few times and I've always received great customer service. Kevin is very helpful and great to work with. Shipping to AZ went great with no problems. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "110140233105306526601", "name": "Ann Chastain", "time": 1618094803347, "rating": 1.0, "text": "I used to like Ken's.  My current experience with service is absolutely terrible.  5 months, no repair, no phone calls, none of my calls returned.  And I was lied to when I picked up a still unrepaired machine.  Totally unforgivable.  I have recommended Ken's in the past,  never again.\nEdited to add that I confirmed that the machine they said was mine is most definitely not.   The power cord/foot control I have will not fit .  I took in a machine for a small repair and now have a $500 doorstop.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "116334313624792450526", "name": "Addison Carter", "time": 1616960967147, "rating": 5.0, "text": "Ordered a new Brother SE1900 embroidery machine (with free shipping) and received it in two days. I was skeptical of ordering from here at first, but let me tell you, I will be ordering from them exclusively for my sewing / embroidery needs in the future. I got a call an hour after placing my order to confirm my shipping address. I received in my order TWO DAYS - incredible service!!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "117832529790563008183", "name": "INFP McGee", "time": 1616606701153, "rating": 5.0, "text": "I have not been to your store, but i had to tell you how much I appreciate how clear your website is on what products you carry and how much each item cost. I live outside of Augusta, GA and the shops around here like to use car sales tactics to get people in the door. It really upsets me.\nI will be favoring your website and will be back.\nThank you for being a source of actual information and honesty.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "106558680083303704539", "name": "Carolyn Dehner", "time": 1609250044356, "rating": 5.0, "text": "Amazing customer service. Bought a sewing machine from them via Amazon, but had to suddenly leave town and wasn't home for delivery (requiring signature). They were very responsive whenever I sent a message, and when the machine was mistakenly returned to them, they sent another one asap. Very competent and cooperative. Thank you!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "109253406916593467289", "name": "Regenia Greenhill", "time": 1623171097553, "rating": 5.0, "text": "I love this store - it’s my go to place😇", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "116136863232232488690", "name": "Debra Bisacchi", "time": 1611235429287, "rating": 5.0, "text": "WOW!  Buying a sewing machine online can be risky, but their customer service was better than any I have received from local sewing shops, and when I had problems with my new machine they asked if I want to swap it for a new one.   I did.  No problem. I will do more business with Ken’s Sewing Center.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "106182074295400241013", "name": "Ashlee J. Pryor-Pitluk", "time": 1600459426015, "rating": 5.0, "text": "Ken's is INCREDIBLE! I placed an online order with them late Tuesday night, received a call to verify my shipping address (in Texas) early Wednesday morning, received my shipping information 15 minutes later and had my order delivered early Friday afternoon. Free shipping with processing & delivery in less than one week! Unreal!!!\n\nNot only did I get my coverstitch machine for significantly less than I would have if I purchased from Amazon BUT the customer service and shipping exceeded my expectations AND I was able to support a small business. I can't recommend Ken's enough for all your sewing needs!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "101917396695834539970", "name": "Nikki Arko", "time": 1603727535379, "rating": 5.0, "text": "From start to finish the customer service was amazing. The staff took time to answer all my questions. The layaway plan was so convenient. I live several states away but received my machine in a few days. I will definitely order from them again.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "102742314384837586417", "name": "Cheryl Holloway", "time": 1602687470607, "rating": 5.0, "text": "The customer service is outstanding! I had an issue with a certain machine I had ordered and Kevin and Amanda took care of what needed. I would recommend this company over and over and if I could give more than 5 stars I would!!!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "102640026330552905792", "name": "Neal Martin", "time": 1608571238497, "rating": 5.0, "text": "Very friendly and helpful staff. Good location. Wide range of equipment and supplies.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "105826856832385971888", "name": "mitzi fitz", "time": 1599003766189, "rating": 5.0, "text": "Their customer service is above and beyond. I can't believe how helpful and nice they were even when things with my order got complicated. Great products and selection too. But buy from them because they are great people who will help make everything right.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "116817170001394258512", "name": "Dennis Cunningham", "time": 1601936037729, "rating": 5.0, "text": "My family and I have had a great experience with Ken's Sewing Center. Questions and concerns were addressed promptly and professionally.  We highly recommend the company!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "100403540381759412405", "name": "Connie Owensby", "time": 1583586770031, "rating": 5.0, "text": "Their customer service absolutely cannot be beat. They are all very helpful from the lady who answers the telephone to all the other employees. Kevin has always helped me with a question or an issue immediately. I'm a customer forever. I've been using them for over 14 years and purchased several things from them. I couldn't be more pleased. Even though I live several states away, they are eager to satisfy my sewing needs and expedite my orders. I appreciate good service.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "102646667538399890177", "name": "Les Haffner", "time": 1620927670736, "rating": 5.0, "text": "If you need service or advice Jeremy is the man. Been working with him for years now.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "116495582448902771195", "name": "Margaret Woody", "time": 1604710975161, "rating": 1.0, "text": "I ordered the Janome BE1000, I had problems with the bobbin getting jammed right away, I returned It within the thirty day, however I had a pay then back the shipping cost they paid to ship it to me, I was going to buy the janome 3000 or 5000 and pay the difference, I quickly changed my mind because of having to pay them back the shipping cost they paid to ship my janome BE 1000. It was not my fault the bobbin was jamming, I followed all the instructions on threading the machine and threading the bobbin. It was a bad machine.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "106538685066996442447", "name": "Rick B", "time": 1588262065982, "rating": 5.0, "text": "Great place! The machine I ordered was not in stock, but they sent me an even better model at no extra cost. Great communication. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "106567292853853708099", "name": "Steve Flesher", "time": 1589610568332, "rating": 5.0, "text": "Excellent customer service and huge selection. My wife and I own a small handmade apparel company  and were able to purchase equipment and supplies  from Ken's very quickly and easily, even during the quarantine. We then purchased an embroidery machine by Janome and have had a blast experimenting and playing around with a new part of our business. Ken's was able to set us up with a huge assortment of thread as a starter kit for our machine and the colors they selected for us was awesome!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "115231248172154356601", "name": "Susan Pedersen", "time": 1590720748059, "rating": 1.0, "text": "I sent 3 email inquiries looking for some legitimate advice while researching sewing machines to purchase. I contacted them both through their website and through Amazon. No advice offered, they just said, “yes we have lots of machines”. I could’ve found that out myself. If you aren’t going to help customers via email then you should not advertise the feature on your website and invite people to email you. I guess they don’t need the business. I understand everyone is looking for sewing supplies right now but if you don’t treat customers right every day you don’t deserve five star reviews. You shouldn’t treat people poorly just because you’re busy during a pandemic.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "105885165432777422487", "name": "Jaki M.", "time": 1600462138934, "rating": 1.0, "text": "i have called 5 times , left 4 voicemails in 1 day and no one is calling me back. I simply want to buy an item and have a question.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "105354381337215387074", "name": "Sharon Willmering", "time": 1599341098293, "rating": 5.0, "text": "Great people. They processed an upgrade to a sewing machine. Really helped me get the choice right.  Thank you.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "114210199741497893844", "name": "Erik Harris", "time": 1602959391830, "rating": 5.0, "text": "My wife states that this is an honest, ethical business with great customer service, and great servicing and repairs.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "102549592096234532786", "name": "Lori Witham", "time": 1586539945690, "rating": 1.0, "text": "I purchased a sewing machine online last weekend.  On Monday I received an email from Fed Ex saying that the shipping label had been created.  I said to myself, \"Wow, what a great company they're right on top of shipping purchases!\"  Two days later my sewing machine is still sitting in Alabama and has not moved an inch.  So on Thursday I call & speak with Brad who says he'll find out what's going on & to call him back in a half an hour.  I do & it takes over an hour before somebody answers the phone, that person says Brad will call me back...which never happens. Late in the day (after repeated no answers) I get Brad on the phone & he says he can't find where my sewing is but in the morning he'll try to find out & if he's unable he'll print a new label and ship another machine to me but call him back at 11 a.m.  I've now been calling every few minutes for the past half hour and nobody is answering the phone.  It's remarkable how they are right on top of taking the money from your bank account, but shipping your purchase, finding an answer, or even answering the phone falls low on the priority list. I feel like I'm being conned by this place.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "108552529157981794886", "name": "Heather Helton", "time": 1595090372193, "rating": 5.0, "text": "I've bought my first embroidery machine here and I couldn't get any better service anywhere nice friendly people and great service for purchasing a sewing, embroidery or quilting machine they fixed my sewing machine I had gotten from my mother-in-law when she passed away and loved this place ever since..Keep up the great service thanks!!!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "108966931541383264657", "name": "Jean Richmond", "time": 1574869745834, "rating": 4.0, "text": "The greatest service I've received in customer service in a long time. Found they had a return of a Janome 6650, which I decided I wanted, but before I made my final decision, it was sold. Tina worked her magic and got me a new one at a great price and the rest is history. It's on it's way. Merry Christmas to me! Thanks, Tina!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "100436595432675040114", "name": "Kiara Colon", "time": 1596288588701, "rating": 1.0, "text": "I placed an order on 7/7/20 for a Brother 1034D Serger. I specifically called my order in due to website saying “Advance Order” in other terminology a “pre order”. I was completely fine ordering the machine on a pre-order basis since everywhere else is completely sold out.\n\nWhen placing my phone order, a women named Pam took my order. Pam reassured me the sergers would go out for shipping on 7/27/2020. That’s why I felt so confident in making the purchase.\n\nToday, 08/01/2020 I called to check the status of my order as I haven’t received any updating emails of phone calls. The person who answered my phone call took my order number and proceeded to tell me, “ma’am I cannot give you a date on that. You’ll need to call back on Monday and speak to Pam” ...\n\nWhy do I need to call back on Monday and speak to Pam? It should all be centralized system! The same information Pam types into a computer should be the same effort another employee puts into finding the details of my order. I ended up complying with calling back on Monday which is 2 days from now but I am livid.\n\nI have a business to run, customers needs that need to be fulfilled and crafted and I’m yet again being pushed back on development dates of my apparel collection because now I have no idea when my machine is going to arrive AFTER being told they were to go out for delivery on 7/27/2020.\n\nIf I do not have further information on Monday I will be forced to ask for a refund because this is not the customer service any customer deserves.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "109109134353469504226", "name": "Anonymous Anonymous", "time": 1595473283698, "rating": 1.0, "text": "I ordered Back in March a  Juki mo 1000 from this people Through Amazon after a month of using the knife broke and the wasn’t shutting off anymore so I told Kevin the issue with the machine he told will take like 3 days and I shipped it back to them after two weeks I called to follow up and they were still working on it I reminded him about the door a week passed by then I got a call from Kevin to collect the money for the shipping so when I got the machine I noticed right away that the door was still misaligned I sent an email and he responded back 3\nDays later he responded by the time I called the warranty company with amazon and I placed a claim with them so now I’m still waiting for the door to be fix because the warranty has to send it back to the factory, this is very bad business and wasted time. I will never order anything again from this people.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "105623301431150581243", "name": "Corrie Leber", "time": 1586755545949, "rating": 5.0, "text": "Absolutely fantastic customer service!  Thank you so much for your help.  I would recommend Ken's Sewing Center to anyone.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "101162077087613628786", "name": "Glenda n Ron Monterusso", "time": 1580749690488, "rating": 1.0, "text": "They had my embroidery machine  since  September 2019 never got a call from them  I have had to call every time .  Was told over and over they will be calling me.  Today Feb 3 2020 I call once again to be told they cant fix it and I should have been told  Really the people there are the worst.  Don't recommend them  very sorry place.   But did find better deals online, so look else where before wasting your time at Kens sewing", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "109064033206466498921", "name": "les haffner", "time": 1565455136965, "rating": 5.0, "text": "I would like to take a second to say what awesome customer service Ken's has. I'm talking 3 years after the sale Brad with the service dept. is helping me as if I purchased today. We have purchased 2 multi-needle machines from Ken's and will continue as long as they are around. If you want top notch service and support and a friendly staff with great prices look no further. AAA++++", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "102402777542175932013", "name": "Rachael Erfurdt", "time": 1589586870859, "rating": 5.0, "text": "I live in Missouri and had an issue with one order I had placed. I called, the lady on the phone was super helpful and she immediately got it taken care of!! I will be ordering from them again in the future!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "116770188015077750757", "name": "Alvin Vega", "time": 1587419771058, "rating": 5.0, "text": "I ordered a Bernette Sew & Go 1 for the first time from here and the communication and service was too notch. I received the sewing machine in only 3 days and was exactly as described. I give Ken's Sewing Center an A+++++. I highly recommend to all and I will definitely do business with them in the future.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "107091360503184493274", "name": "Amy", "time": 1590538068745, "rating": 5.0, "text": "Wonderful service. Agent Tina was very kind and helpful. Thank you!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "113228353144198406738", "name": "The masters of everything", "time": 1592515102867, "rating": 1.0, "text": "About 3 weeks ago I researched which machine I wanted to buy my wife, we found the exact machine we wanted and the Jenome 3000 was out of stock, everywhere, including Ken's Sewing center website, it clearly read OUT OF STOCK.  I continued to check on it day after day and about a week later when I googled the Jenome 3000 Ken's Sewing center changed it from \"out of stock\" to \"IN STOCK\" I immediately added it to my cart and checked out. 2 weeks pass and I called to check my order status and the lady in the phone says \"sir, this was a pre-order\" I argued and told her I would never have bought it if it was a pre-order. She says yes sir it clearly says pre-order. I checked my receipt, and no where did it specify that this was a pre-order. I googled Jenome 3000 and again it clearly says \"IN STOCK\". So I called again to speak with a manager and the secretary tells me he's busy and she could help me, I explained the story and she tells me, \"yes sir, it does say IN STOCK, but if you scroll down to the details it does say it's a pre-order, and she was right. BUT THIS IS CLEARLY A BAIT AND SWITCH CON. I didn't scroll down because I already researched the machine and the website allowed me to purchase the machine from start to finish, including my receipt, without EVER clearly stating it was a pre-order. The status said \"processing\" not \"pre-order. No where other than the details did it specify that the machine was on back order and now they tell me it will ship JULY 27. Thats a 2 month processing time and they're trying to trick people by changing the status to \"IN STOCK\". That's false advertising and now they put me 2 weeks behind getting another machine for my wife's business. Completely unprofessional and tricky. I don't care if your website doesn't allow for the status to only read \"in stock\" or \"out of stock\" They should leave it \"OUT OF STOCK\" and put in the details that customers can call for a PRE-ORDER.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "102364442420093270069", "name": "Barry King", "time": 1576410750354, "rating": 5.0, "text": "They are  a big green egg dealer and they are very nice will help you\nOut with any of your needs , questions.   prices are good  I would recommend\nAnyone that wants to get a green egg  go see them  friendly service", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "106716868812789469024", "name": "Vee Honea", "time": 1587228144908, "rating": 5.0, "text": "Absolutely the best customer service! They go above and beyond.  Great prices on the brands I love.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "115782803980196409601", "name": "Herbert Bloomer Jr.", "time": 1590873502708, "rating": 5.0, "text": "Bought a new Brother Pacesetter Inno-ís PS500 sewing machine a couple weeks ago and could not get it to sew as it was knotting up the thread near the bobbin. We went in, asked Brad if he could figure out what the machine or user was doing wrong. He set it up and right away noticed one area that was threaded wrong. Brad had it purring like a kitten in 5 minutes! (It was the user, not the brand new Brother Pacesetter Inno-ís PS500!). We will definitely be using Ken's Sewing exclusively for our sewing needs! And one day, The Big Green Egg BBQ too!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "104608208471154780324", "name": "Amanda Mcdaniel", "time": 1587243439215, "rating": 5.0, "text": "Ordered a machine online.  The customer service that I received was amazing and I love the machine.   Couldn't recommend Ken's enough.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "113097251418619578950", "name": "monika", "time": 1571855989166, "rating": 5.0, "text": "I LOVE Ken Sewing center, it is my to go place online. They ship promptly, they take orders over the phone...very helpful, and their customer service is outstanding. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "112455372804669525109", "name": "linda williams", "time": 1577637086913, "rating": 5.0, "text": "Always helpful I just love this place I’ve only ordered online but plan on making a trip there. Their staff is always willing to answer any and all questions.  No other place to shop ladies", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "109430413709581729067", "name": "Steven Grabosky", "time": 1588018412815, "rating": 5.0, "text": "Amazing customer service, processing, stock, availability, and shipping. Couldn't be happier. Fantastic!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "105756961573392994697", "name": "Rebecca Elliott", "time": 1587675864250, "rating": 5.0, "text": "Wow!   Fast service.  Ordered a sewing machine and it was on my doorstep in a few days.  :)", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "112728290376019458917", "name": "Jeanette Nichols", "time": 1577370056762, "rating": 5.0, "text": "So happy with the customer service I received buying a used serger over the phone.\nTop-notch expertise and warm, friendly, knowledgeable service!!!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "116146273199997193254", "name": "Eric Helal", "time": 1589690075663, "rating": 4.0, "text": "After an initially poor experience, Kevin resolved all of my issues and made my experience positive.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "117213067481546135113", "name": "Joe Rivera", "time": 1595465565859, "rating": 1.0, "text": "Tues morning price for machine was $399. Tues afternoon price for same machine was $479 when they were down to only two machines left in stock. Can’t help but feeling they are taking advantage of customers when stock is low.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "113251478622582933772", "name": "Lynne Brown", "time": 1577072595158, "rating": 1.0, "text": "Ordered the wrong size sewing machine cover. Have to pay return shipping,which is fine, BUT, I also get to pay a restocking fee, AND their shipping to me, which was supposed to be free when I ordered the cover. Not worth it! Stay away from these scammers.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "101838667420461590413", "name": "Carol Rode", "time": 1567898438732, "rating": 5.0, "text": "Super happy with my Janome Cover Pro 1000 CPX that I ordered from Ken's Sewing Center. Shipment came super fast, machine worked great right out of the box. Only glitch was they forgot to ship my bonus kit, but I called right away and they shipped it to me the next day. It wasn't supposed to arrive until Monday next week, but it was delivered today on Saturday.  Thanks everyone at Ken's.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "109486328879304271125", "name": "Therese Connell", "time": 1572627074268, "rating": 5.0, "text": "I ordered a refurbished Bernette b37 from Ken’s.  When the machine came, I couldn’t believe that I had been upgraded to a Bernette 38.  Perhaps they were short on my requested machine, but I know I will be purchasing any needed products from Ken’s from now on.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "105344775554338276852", "name": "Ju H", "time": 1545328469087, "rating": 5.0, "text": "So far so good., I do not have any Dealers near me , I am disabled and can not get to one.  I tried the dealers within 100 miles of me.  Both were a tad shady.  One wanted to charge me extra to use my CC.  They said it was same as financing and Only could get the lower amount I I paid Cash.  The other in Duluth Ga.  really didn't want to talk to me since I told him I would not be the one to pick it up.  So I was recommended Kens from a Facebook Group .  I talked to Jeremy that first day.  He didn't try to over sell me anything.  He listened to what I wanted.   I ended up getting just what I needed and nothing more.  He didn't over sell anything. I bought a re-manufactured machine , that he said came with full warranty as a new one  which gave me the extra to purchase the upgrade kit to expand.   Maybe I can get basic software at later date.\n\nSince I am out of state ( which makes me a bit nervous about getting service) which after 30 days, I am responsible for all shipping charges.   He had my choice in here in 2 days  and I didn't receive all the goodies some talk about such as starter packs or basic software but I did receive 4 spools of thread which I do like the quality.  Plus he added the upgrade for me which I paid extra for but was kind enough to do it before he sent it. .  My experience was a pleasant one.  But the first couple I called made me want to forget about sizing up and forget dealing with any dealers.\n\nHopefully I will get the same service each time I call that I got the first few days that I was purchasing the machine..", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "112648432895173774151", "name": "Matthew Richardson", "time": 1614795803784, "rating": 5.0, "text": "Ken's sewing is awesome!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "108690298509920028822", "name": "Kaye Wise", "time": 1583520953382, "rating": 5.0, "text": "Wouldn’t even consider buying a machine from anyone else even though it is a 100 mile trip one way. Customer service is excellent and Brad and Will are the best!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "115860137207325290931", "name": "Pat Hines", "time": 1436280505493, "rating": 5.0, "text": "This place rocks!  Donna has been so very patient with me purchasing and learning my Brother PE-770 over the last 3 years.  They go the 3rd and 4th mile to be helpful.  Their prices are the very best.  Fast shipping, too.  They know that I live in Moore, OK in tornado alley and they show genuine concern for me in the spring!  Also, Jeremy in the technical department treats me like he has all the time in the world.  More than fair and helpful.  It seems to me that they believe in \"doing unto others as you would have others do unto you\"!  I keep threatening them that when I go to see family in Huntsville, Alabama, I am going to come see them and give them a hug for ALL their help.  And I will surprise them with a visit!  I highly, highly recommend Ken's for all your machine embroidery needs!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "115956290267738750272", "name": "Sue K", "time": 1488670840037, "rating": 5.0, "text": "I purchased my second machine from Ken's Sewing Center two days ago. Once again, it was a wonderful experience. The staff was very friendly, helpful and delightful to work with. They are very fair in their dealings. I have also ordered from Ken's online and every time things went smoothly and they shipped very quickly. I highly recommend purchasing from them.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "104296843312231254304", "name": "Jane Wong", "time": 1525550298430, "rating": 5.0, "text": "Kevin and his brother are amazingly helpful and knowledgeable. They provided our large group with great service. They don't stock fabric because much of the store is devoted to every kind of machine you could want, but we all went away with scissors, rulers, and a wide range of other items.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "104048007002636649670", "name": "Mindy Roeske", "time": 1557978818360, "rating": 5.0, "text": "Absolutely THE BEST business...SERVICE, HELPFUL IN EVERY DEPARTMENT, EXCELLENT PRODUCTS... (Love my two Janome's & the accessories and support on care and service).  From Kansas City, I THANK YOU ☆☆☆☆☆☆☆☆☆☆!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "111678396399020102416", "name": "James Clark", "time": 1504699458580, "rating": 5.0, "text": "I am in the process of buying my third embroidery machine from them. The staff is super and so friendly and very helpful. You can't beat their prices and all the help they give you.\nFrenchie", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "112919861429530895028", "name": "Gaynor Mueller", "time": 1504115471035, "rating": 5.0, "text": "I had the BEST customer service from Donna at Ken's Sewing Center.  Called me about a product as promised, and no pressure when I said my purchase would have to wait a couple weeks.  Called back to place the order and still received super friendly and fast service.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "116225602460093583333", "name": "Dell Richards", "time": 1535142555528, "rating": 5.0, "text": "My Janome 14000 was delivered yesterday exactly as Kevin said it would be!  I am thrilled with the customer service I received from Kevin and his team at Ken's Sewing!  I deliberated for several months before deciding on this machine.  I am positive I made the right decision!\n\nThank you!!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "109096375503300293697", "name": "Elisabeth Zillinger", "time": 1545154297703, "rating": 5.0, "text": "I found Ken’s Sewing Center through a google search and I’m so happy I found them. Keith gave great advice and I’m very happy with the serger I ordered from them. I also got my coverstitch machine fixed and it works great again and it was for a great price.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "102724412796523567834", "name": "Haley Knight", "time": 1524949978532, "rating": 5.0, "text": "They are all great great guys! Friendly helpful service. And great prices for all your sewing needs!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "108222363842158700696", "name": "Ashley Portwood", "time": 1494249660962, "rating": 5.0, "text": "I just purchased a Pr-655 here. Ken's saved me $1,000.00's. The retailer here in my local area gave me a price on the same machine that was about $5,000.00 more. Brad was great to work with! I am a forever customer!!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "113249367372555430085", "name": "S Smith", "time": 1591295228104, "rating": 1.0, "text": "Wouldn’t buy from here if it was the last sewing place on earth. They’ve say “we will call ya back”  each time I’ve called (which has been a few times) in which they never call me back. They sent me an incorrect item that does me no good. I would steer clear.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "114619967498945019367", "name": "Charlie C", "time": 1523296579283, "rating": 5.0, "text": "Great place, good ppl. Plenty of equipment to choose from and a great staff that will let you know what you're looking at buying. They will explain the differences between the machines and help you make a good selection.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "113075772446458313467", "name": "Sherry Hill", "time": 1506403149511, "rating": 5.0, "text": "I am a new quilter,  so I had to order a machine foot in order to begin.   They had exactly what I needed.  Plus I ordered gold plated seamstresses scissors that were darling!  The part to brag about?  It came in two days!  Thank you Ken's!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "113134109234028643453", "name": "Bonita Moore", "time": 1544743026796, "rating": 5.0, "text": "Very nice and attentive folks to do business with ! Look forward for years to come in dealing with them all !", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "109500966579147782235", "name": "Cathy H", "time": 1504213854625, "rating": 1.0, "text": "THEFT-So frustrating!  I ordered two feet for my Janome MC9900 and after waiting for several weeks, I phoned the company to find out the status of my order. I was told that one of the feet wasn't in stock and they were waiting for the second one to come in so they could ship together.  They assured me that they would send it right out and the second one when it arrived at their business.  I didn't receive the shipment, so out of desperation I drove to the local shop and purchased the one foot they had in stock and ordered the other foot and purchased it a week later.   They finally sent the first foot- after I purchased and used the one I bought locally.  I didn't think much about it and over a YEAR LATER, I still hadn't received the second foot that I had paid for.  I called them, AGAIN, and she  located my order and saw that the second foot had NEVER BEEN SENT. She said the 'Billing' person wasn't in, but she assured me that she would have them issue me a refund, in the form of a check.  It's now been another 5 MONTHS and I still have NOT RECEIVED the foot or the refund check!   This is FRAUD and BAD BUSINESS practice.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "116214481785863993524", "name": "Margie Tumlin", "time": 1554308928721, "rating": 5.0, "text": "My experience with Ken's has been stellar. In the past few years have purchased 4 machines and other accessories from them.  Purchased a Janome  9400,what a sweet machine and three other Janomes, two as gifts for my neices. They are as pleased as I am. Am partial to Janomes always reliable and easy to use. At the ripe old age of 78,decided to learn to quilt. Fortunately I am about 70 mi. From Ken's. Needed some assistance with setting up and learning about free motion quilting on my 9400.. Jeremy patiently assisted me and I am having a grand time learning now. Highly recommend Ken's .", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "112572082161556132719", "name": "Rhonda Baldwin", "time": 1530140827596, "rating": 5.0, "text": "Great place to do business. Very friendly.  Well worth the drive.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "103307792317084153352", "name": "Al Dockery", "time": 1516751596398, "rating": 5.0, "text": "Ordered an OTT light late Friday afternoon. arrived in Little Rock Tuesday morning in great shape. Very efficient.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "117394819063424392670", "name": "cheryl Simmons", "time": 1481822977896, "rating": 5.0, "text": "I love this place!  Kevin is the best!!! I ordered my Janome 15000 from them and I love it.  Since then I've started ordering ALL of my embroidery supplies.\nThanks so much for helping this beginner!!!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "113084237014544647958", "name": "Dora Alicia Rivera", "time": 1532708331863, "rating": 1.0, "text": "They sold me a very expensive machine to not only be told that I need a \"straight\" stitch plate in order for it to stop messing up. I said okay then it gets delayed and several days out I still can not use my machine. Buyer be ware.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "105446497573578478118", "name": "Samantha Smith", "time": 1494131970049, "rating": 5.0, "text": "I love Ken's! ALWAYS helpful. As soon as I open the door someone is asking me if I need help which helps when I'm in a hurry.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "107793978738470725438", "name": "Rebecca Taus", "time": 1545402695209, "rating": 5.0, "text": "They've been very helpful each time I've called. And, I'll be calling again I'm sure.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "107703937091636141725", "name": "Christine McClantoc", "time": 1584460902645, "rating": 5.0, "text": "They do good work", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "117082924213132685884", "name": "Laura Neal", "time": 1539019981924, "rating": 5.0, "text": "Bought Juki 2200qvp long arm and it is fantastic! Brad is wonderful in service and advice!  Thank you!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "101160148452896415722", "name": "Ed Martin", "time": 1484695564042, "rating": 5.0, "text": "We recently ordered a new Janome sewing machine through Ken's via their Amazon Marketplace store (we felt like we needed the Amazon security blanket since we'd never dealt with Ken's before). What I didn't notice is that the listing on Ken's website included some extra feet that were not in the Amazon listing - this was MY mistake. Kind of makes sense, since Ken's needs to pay Amazon a commission.\n\nMy wife called to inquire, and the woman at Ken's who answered the phone (no phone menu, no transfer, no \"I need to ask my manager\") quickly said that she understood how we could have misunderstood the listing difference, and that she would send the extra feet free of charge. They just arrived today, 3 business days later.\n\nI'm kind of impressed that Ken's made us whole on something that after all, was our mistake. Next time, I will definitely deal directly with Ken's and cut out the (Amazon) middleman. I'm really impressed and would recommend Ken's to anyone out there.\n\nEd", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "114481083464521091687", "name": "Jessica Skibicki", "time": 1362510251121, "rating": 5.0, "text": "WONDERFUL!!!\n\nI have bought over 7 machines from this store and they are amazing! Donna is the SWEETEST person you could ever imagine working with! I would recommend them to everyone! You can't beat Kens!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "115845137423912469802", "name": "Carol Williams", "time": 1551833708576, "rating": 1.0, "text": "I sent my Janome 12000 to Ken's last year around November. Something happened to the pressure foot.  They tried and tried and tried to fix it always promising it wouldn't be long and would be  returned to me good as new.   5 months went by and finally they gave up and sent it to the manufacturer.  Even when they received my machine, I still had to call them to find out where was my machine and what was happening with it. After 6 months I finally received my machine back with broken  pieces and missing parts.  I called numerous times to get them to send my missing parts and broken pieces and to this day no one has returned my call, or email. Where is the customer service. If this is how they treat their customers then shame on them. There service dept suck big time. This is the short version because there's not enough space to tell  everything that happened.  i am thoroughly disgusted with them. So I'm stuck with a machine that I can't even use.  Buyers beware!!", "pics": null, "resp": {"time": 1556717309052, "text": "I am sorry you have had a problem.  We will be happy to assist you.  Please do call our toll free number from the website and ask for our service department.  We will be happy to correct this for you immediately."}, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "113874232882744507555", "name": "maryann thomas", "time": 1531336765610, "rating": 5.0, "text": "They are always so helpful and their service department is first rate!!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "113705419990716253547", "name": "Yumi Cos", "time": 1385016844255, "rating": 1.0, "text": "I wish I could give them negative stars. Stay away from this store. The website says it has excellent service, but Donna and Kevin (owner?) are really unprofessional. Long story short, I received two defective machines and now they have everything back and don't want to give me my money back. The way Donna handles \"customer service\" is to hang up the phone on you and tell everyone to not answer your calls and not respond to emails. When she does decide to respond via email after writing many times, she doesn't solve the problem, she just causes more and doesn't sign off. The way Kevin \"solves problems\" is to lie and make up whatever is convenient for him. Have him email you so he cannot go back on his words.\n\nupdate: RELUCTANTLY, they sent me a third machine that I did NOT want. YES, I had to pay for shipping. The second one was broken within a month and I have email proof that I informed them at that time. I tried to save them money and have them send me a piece and change that to see it that is what was broken. Of course it was over a month by then and hard to contact them so they wanted me to pay for shipping. I had no choice b/c they wouldn't give me a refund for the broken machines they sent me. This was after months of them not refunding me my money & having possession of their machine. Donna was extremely unprofessional and childish. To expand on what I wrote above, she would hang up the phone on you and then when I try to call numerous times, she wouldn't pick up. I would then call with a different phone and then, wah-lah, she is magically answering the phone again. Who does that? Then Kevin gets the phone and has the nerve to tell me I hung up the phone. If I hung up, why would I have tried calling back several times to no avail? Kevin kept giving me the run around and wouldn't let me talk to the owner. I asked him NUMEROUS times to give me the same order when he shipped it, yet when I received it, the threads I had chosen were not included. The ugliest colors they could find were thrown into the package they sent me. I am so tired of dealing with them, I didn't even bother to contact them.\n\nBuyer beware! Do not shop here!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "105077051057386330609", "name": "Robin Lazenby", "time": 1494257511239, "rating": 4.0, "text": "Only place in the Shoals to get your sewing machine repaired. They have a good selection of pre-owned machines also.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "110750003289876487382", "name": "Diana Kosty", "time": 1445948905191, "rating": 5.0, "text": "I FIRST CALLED 1 YEAR AND 6 MONTHS AGO. I NEEDED NEED A SEWING TABLE. A Horn of America 5280 Super Quilter's Dream Sewing Cabinet. I CALLED 5 OTHER PLACES AND COMPARED PRICES AND THEY HAD THE BEST OVER ALL PRICES THAN ANYONE. NOW FOR THE TIME SHE(DONNA) PUT INTO THE SETTING UP AND DELIVERY OF THIS VERY LARGE PURCHASE WAS REALLY EXCELLENT SERVICE AND VERY PATIENCE WITH ME FOR I AM JUST LEARNING. . GOING INTO DETAIL AND GIVING ME HER UNDIVIDED TIME.. LOOK THE PROBLEM IS NO CUSTOMER SERVICE IN TODAY'S WORLD!!!. SHE HAS WONDERFUL KNOWLEDGE AND CUSTOMER SERVICE...\nWHAT SOLD ME ON EVEN BUYING IT FROM THEM WAS DONNA. IT WAS MOST EXCELLENT CUSTOMER SERVICE EVEN RIGHT DOWN TO DOING WHAT EVER IT TOOK TO GET IT TO ME!!!! AS A CUSTOMER WHO DON'T EVEN LIVE IN ALABAMA. I LIVE IN FLORIDA.I COULD HAVE GONE RIGHT IN THE NEXT CITY OVER AND DID GO THERE, THEY WERE RUDE AND NOT WILLING TO HELP ME. THEY FIGURED  I WOULD NOT GO THRU WITH THE DEAL. THEN ONE WOULD NOT EVEN BRING IT OUT TO MY HOUSE FOR A DELIVERY. IT WAS 800 POUNDS WITH SHIPPING MATERIALS WRAPPED AROUND IT. THEN I NEEDED SOFT WARE FOR ANYONE WHO REALLY WANTS TO READ THE TRUTH ABOUT MY EXPERANCE:FOR MY MACHINE TO DO MANY OTHER DESIGNS TO MAKE WHAT I WANTED ON IT. SHE GUIDED ME TO THE BEST ONE. I CAN NOT DESCRIBE THE SMALL THINGS SHE AND THE OWNER WERE ABLE TO DO SO I CAN HAVE A GREAT DAY ON MY MACHINE.\nFIVE STARS JUST DON'T CUT IT I GIVE MANY THANKS AND YES, I BOUGHT STUFF SCENE THAT TIME AND SHE WILL TAKE THE TIME TO GO OVER MY QUESTIONS AND HELP ME GET THE RIGHT PRODUCTS. I HAVE ALWAYS BELIEVED IF YOUR HONEST WITH SOMEONE AND KIND THE SAME WILL COME BACK TO YOU. LIKE NOW I CAN'T BELIEVE SOME OF THE TWO REVIEWS I HAVE READ BECAUSE THEY OR ANYONE THERE HAS NEVER BEEN RUDE OR UGLY TO ME OR MY HUSBAND EVER........  \"MANY THANKS TO YOU AND YOUR STAFF KEN AND DONNA\"\nTO THIS DAY, I HAVE NEVER BEEN IN THEIR STORE, JUST DUE TO THE DISTANCE AND MY DISABILITY TO DRIVE NOW....I WOULD LOVE TO HUG HER AND PERSONALLY SAY THANK YOU.MABY ONE DAY I WILL GET TO GO TO THE STORE.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "111860066371253083331", "name": "Erica Cummins", "time": 1359916578890, "rating": 2.0, "text": "Do not buy from Ken's!! I ordered a walking foot for my sewing machine a week ago and my order still says 'processing' even though their website claims that all orders ship in 2-3 or 3-4 days. Of course I've already paid $50 for the walking foot and I'm apparently not going to get it...or at least not any time soon.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "108222185108168306049", "name": "Tim Elam", "time": 1459967664733, "rating": 5.0, "text": "Outstanding service and selection. The staff are wonderful, friendly, and helpful. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "117285915628973900207", "name": "DJL", "time": 1520280837655, "rating": 5.0, "text": "I was told by a sewing center in My area that my Janome MC  compulock 888 serger couldn't be repaired because the tension board was out. I almost just left it there for parts! I was so disappointed. He had it for several months and never let me know the situation. I started to shop for a new serger. I didn't find anything I really wanted that was affordable. I called Kens sewing Center after seeing them on Amazon and e-bay in the past and asked to speak with someone who knows serger. I spoke to Jeremy I believe who works on them. He asked what I currently used and explained the situation. He said he had not heard of a tension board on that machine. He said if you are willing to send it to us I will look at your machine and if I can't fix it all you are out is the shipping. I decided to go for it. I shipped it and it was repaired and returned within about 10 days!!! These folks rock!!! I highly recommend them! If you have a Janome Compulock serger Jeremy is the man to work on them! It was almost a year ago it works like a charm to this day!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "108618712206554836429", "name": "Stephen Bluma", "time": 1549381410548, "rating": 5.0, "text": "Very helpful very knowable up front", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "106073400922531369863", "name": "Barbara Jarchow", "time": 1504112847072, "rating": 5.0, "text": "Excellent, friendly staff!\nWill buy from again.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "105578773314729158406", "name": "Linda West", "time": 1484415434664, "rating": 5.0, "text": "Great place for sewing and embroidery machines, very helpful and informative", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "111560874720018085518", "name": "Brian Embry", "time": 1529011210030, "rating": 5.0, "text": "Great people and great service", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "104003920821279839582", "name": "Single-Dad Two-Sons", "time": 1513035987535, "rating": 5.0, "text": "I did business with this company for the first time and ordered a brother 1634d serger.", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "105414955380802395896", "name": "Melanie Harrison", "time": 1444874953375, "rating": 1.0, "text": "THEY ARE CROOKS!!!!!! They claim they fix your machine but they don't and if you are \"paying for new parts\" they never order them! That's coming from a former employee!! I used to use them now I drive 2 hours to have someone fix my stuff because I know it will be quality but NOT KENS! THEY ARE CROOKS!!!!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x887d48cec32d1629:0x37e6ea59d2d2ff03"}
{"user_id": "102650428948421916818", "name": "Danny Niblett", "time": 1621980075825, "rating": 5.0, "text": "They were very helpful and knowledgeable about what I needed", "pics": null, "resp": null, "gmap_id": "0x88891bb6db2e8057:0x920682fa4c688406"}
{"user_id": "114786981027734290996", "name": "Chan Cleveland", "time": 1610028402371, "rating": 5.0, "text": "I have been put on the mape as a Vidal carpet cleaning company  in Birmingham Alabama  because  of the orders and the things I have be able  to purchase American osment is a company  that is a good fiber and is stimulating  the growth in Birmingham Alabama", "pics": null, "resp": {"time": 1609942330538, "text": "Thank you for your great review, Chan! We appreciate your business & support."}, "gmap_id": "0x88891bb6db2e8057:0x920682fa4c688406"}
{"user_id": "107751514165006506973", "name": "Dimitar Manov", "time": 1621543382180, "rating": 5.0, "text": "Delivery.In 11.30am. ,out 12.30 pm .It is very narrow to go to the ramp.No overnight parking.", "pics": null, "resp": null, "gmap_id": "0x88891bb6db2e8057:0x920682fa4c688406"}
{"user_id": "103046918379835151235", "name": "Lillian Ellis", "time": 1601921063544, "rating": 5.0, "text": "Helpful and accommodating", "pics": null, "resp": {"time": 1601929334209, "text": "Lillian, thank you for your kind words. We appreciate your business very much."}, "gmap_id": "0x88891bb6db2e8057:0x920682fa4c688406"}
{"user_id": "102920788094065491525", "name": "Robert Wells", "time": 1477847865964, "rating": 1.0, "text": "bought hoover,in 2 months brush roller quit operating.overload reset did't work.will not purchase another hoover.", "pics": null, "resp": null, "gmap_id": "0x889a0e49deec7edb:0xe2f6d4d0819386eb"}
{"user_id": "109457970813210221498", "name": "Holly Macintire", "time": 1622125771795, "rating": 5.0, "text": "Nice family owned business. Eddie and Rita are very helpful. Great customer service. I bought a Consew Industrial sewing machine and they were very accommodating in helping me learn to use it. Plus they offer multiple sewing classes!", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "115647794896744620453", "name": "Laurah Casper", "time": 1602396917214, "rating": 4.0, "text": "The staff is super nice. They're very knowledgeable as well. I bought my machine from here because they include a three year warranty, in- store repairs, free cleanings, and free lessons which is way cheaper than online or in box chain stores. Other stores charge extra for the extended warranty and repairs are sent out, not in-store. Plus, I'm supporting my local community! I love my machine and am constantly learning new sewing techniques. I do wish they had a bigger store with more fabric but they have beautiful fabric and so much more. They also have remnants which I'm unable to find these days anywhere else. I drive an hour to shop this store and speak with the staff. It's definetly worth it!", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "101553088462861512485", "name": "Stephen Hickok", "time": 1600096788754, "rating": 5.0, "text": "Better deal than you will find online. Helpful personal service. Fully understood the machine before purchasing and got not only a better price than online, but they threw in some extras. Also, free classes and training with the purchase.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "109403927389214201675", "name": "Lisa Holmes", "time": 1613533752159, "rating": 5.0, "text": "First time in the store; walked out with the Brother SE1900.  Very pleased with my experience.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "108528069135898792125", "name": "juanita shupe", "time": 1608760084530, "rating": 5.0, "text": "Was really pleased with the service and the things you carry. I will go back and talk to my sewing friends.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "101880293369472046650", "name": "Angela Waldon", "time": 1610136176680, "rating": 5.0, "text": "Best place to purchase a Sewing Machine, Embroidery Machine and vinyl!", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "114450289951952171996", "name": "Teresa B", "time": 1612263359241, "rating": 5.0, "text": "Another great class.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "115259713192844154535", "name": "Daryl Bledsoe", "time": 1603328945687, "rating": 5.0, "text": "Best place in town for all your sewing needs", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "109837291653998469754", "name": "Gloria Culpepper", "time": 1611071203849, "rating": 5.0, "text": "Very friendly dependable", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "115567314879375945220", "name": "Sarah Partin-Laws", "time": 1578971336784, "rating": 5.0, "text": "I love these folks! They usually have whatever I need, or can order it for me. AND they fixed my sewing machines!", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "108478451603845663750", "name": "Lisa DeWitt", "time": 1565892791951, "rating": 5.0, "text": "Great place for all you sewing needs. Service is great. Fabrics can be expensive so shop the sale corner.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "117472897350907971213", "name": "ThePhotogirly", "time": 1560587562762, "rating": 5.0, "text": "Very nice people and very knowledgeable. They repaired my sewing machine quickly and also helped me pick out and learn how to use some accessories for it.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "117229871301670955371", "name": "Dana Spurlin", "time": 1572821564708, "rating": 5.0, "text": "The staff is so helpful and nice.  I really like going there.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "117085952880290068780", "name": "Jacqueline Graves", "time": 1559434573433, "rating": 5.0, "text": "Fabulous shop staffed by super knowledgeable, helpful people. If they dont have what you are looking for, they can order. They sell new and used machines.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "105143510987769177158", "name": "Cathy Vancour", "time": 1578611081488, "rating": 5.0, "text": "Wonderful people, always so helpful.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "103274034972904538663", "name": "Latina Hughes", "time": 1551738195461, "rating": 5.0, "text": "Love, love love it. Wonderful Christian people, great atmosphere and a great place to buy almost any sewing supplies from thread to sewing machines, to vacuums.😍", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "112360623235928638030", "name": "Marcelene Collins", "time": 1549405448176, "rating": 5.0, "text": "Great place to learn about your machine. Everyone is really nice.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "109814045405402723877", "name": "ctr4smflkresandinnov", "time": 1503106701884, "rating": 4.0, "text": "This is a small little shop that Harkens back to a Time much unlike which you will find in the big box stores. The staff are unbelievably knowledgeable and gifted in what they do and they are very nice as well. Their selection of quilting Fabrics is extremely limited and that is my main disappointment with the shop otherwise a much larger chunk of my monthly paycheck would be going to their business. I don't find any classes to my liking yet but I signed up for monthly notifications. They do a great deal there and so you'll see a very eclectic environment inside. I have no doubt that this will remain a staple organization in the community", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "112360623235928638030", "name": "Marcelene Collins", "time": 1549405448176, "rating": 5.0, "text": "Great place to learn about your machine. Everyone is really nice.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "113371796477404352140", "name": "Jerry and Linda Deal", "time": 1540824128090, "rating": 5.0, "text": "If you are in any way interested in sewing or machine embroidery, then this is the place to go to. The very best in customer service and sales.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "111742052761997286210", "name": "Maegan Beard", "time": 1495117313928, "rating": 5.0, "text": "My local go-to place for almost any kind of sewing notion. Usually cheaper than Walmart (especially for zippers!), and if they don't have it, they will order it for you! The entire staff is very helpful and willing to answer the most random sewing questions or help you figure out a better method if you're stuck on a project. They have a sewing machine repair service that is reasonably priced and will give you a demonstration of any machine they sell. They only carry high end machinery and even have financing. I love supporting local businesses, and this one is a real gem! I hope they stick around for another 20+ years!", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "118374198437179887582", "name": "Leslie Hahn", "time": 1560560986323, "rating": 5.0, "text": "Best service I have ever had for swing machines. Thank you!", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "104778947224889496560", "name": "Vickie Arnold", "time": 1546534693387, "rating": 5.0, "text": "Friendly staff. Very helpful with ALL my questions.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "114269165243457032972", "name": "Lorrie Mathews", "time": 1552954108332, "rating": 5.0, "text": "The owners Rita & Eddie are great.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "100810807763339919559", "name": "Marise Shotts", "time": 1519170707747, "rating": 5.0, "text": "Mrs. Rita took lots of time showing me an exciting new machine.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "111816466939631641868", "name": "Don Cluck", "time": 1520171067773, "rating": 5.0, "text": "Well stocked family owned business with very friendly, helpful and knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "101104246188748423177", "name": "Elizabeth Bowerman", "time": 1522966808264, "rating": 5.0, "text": "Lots of fabric, notions, vinyl, machines both embroidery and sewing. Helpful customer service always.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "103467478406819983361", "name": "Gabby Kulkarni", "time": 1489444500166, "rating": 5.0, "text": "Great store, but the fabric is limited! Great selection of thread and some patterns.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "111933522776512392241", "name": "Richard Bailey", "time": 1514947843469, "rating": 5.0, "text": "very knowledgeable staff and good selection of fabrics and sewing machines", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "116259056475968913904", "name": "Suzanne Lowery", "time": 1514595342988, "rating": 5.0, "text": "Wonderful people who always are willing to go above and beyond to help.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "100808836209896823011", "name": "jimisuz1", "time": 1554236066957, "rating": 5.0, "text": "Nice friendly knoweldgable people", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "103467478406819983361", "name": "Gabby Kulkarni", "time": 1489444500166, "rating": 5.0, "text": "Great store, but the fabric is limited! Great selection of thread and some patterns.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "103887962344732909542", "name": "David Cupp", "time": 1487446064374, "rating": 5.0, "text": "Fantastic store for sewing needs. Limited selection of fabric is offset by the quality.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "114345465828955602011", "name": "Lakisha Haynes", "time": 1575664530940, "rating": 5.0, "text": "This is my vinyl go-to spot!", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "117929190760894898688", "name": "Hester Adamson", "time": 1491392858913, "rating": 5.0, "text": "They are so very friendly and are helpful and knowledgeable. I live over 40 miles away but I will travel to the store for certain things that I can't find anywhere else.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "113500831587023361999", "name": "Betty Sandlin", "time": 1520611240430, "rating": 5.0, "text": "The ladies here are very nice and caring", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "110859032404969993885", "name": "Michael Sanders", "time": 1497960056611, "rating": 5.0, "text": "Great place for all of your sewing needs.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "107966104560033075222", "name": "Pat Schroer", "time": 1571241431295, "rating": 5.0, "text": "Wonderful service!", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "101359943290523098262", "name": "Ken Jackson", "time": 1526433677807, "rating": 5.0, "text": "Friendly atmosphere and staff, wide selection.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "110321243925191447977", "name": "Linda Thomas", "time": 1600894065682, "rating": 5.0, "text": "Very nice, friendly and helpful staff.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "106205178597156107814", "name": "Becky Looser", "time": 1561480997844, "rating": 5.0, "text": "Always excellent!", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "109132225409089839032", "name": "Mary Garrison", "time": 1595293991914, "rating": 4.0, "text": "Friendly", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "116800927846832948433", "name": "April Griffin", "time": 1581116401157, "rating": 5.0, "text": "Very friendly employees", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "104598906217523004533", "name": "Hunter Bonner", "time": 1518644440553, "rating": 5.0, "text": "Very friendly and helpful staff", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "109962620287195907309", "name": "kenneth poteet", "time": 1501605163030, "rating": 5.0, "text": "Awesome very helpful", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "101961223558236914470", "name": "Adrienne gates", "time": 1524137119660, "rating": 4.0, "text": "Variety of materials, friendly staff", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "113051249182686221512", "name": "Tabitha Prestridge", "time": 1531145172517, "rating": 5.0, "text": "Friendly and knowledgeable people", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "118294903640154898340", "name": "Mechele Gullatte", "time": 1501860215666, "rating": 5.0, "text": "Friends", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
{"user_id": "109151423642354616227", "name": "Mariah Gullatte", "time": 1518843911294, "rating": 5.0, "text": "Very friendly people! They have more sewing equipment than fabric choices.", "pics": null, "resp": null, "gmap_id": "0x888ced4d58c89ddb:0x7f719a9cb4d1a2da"}
