{"user_id": "115385233505495464188", "name": "Donna Creel", "time": 1627103386457, "rating": 5.0, "text": "Great service wonderful selection.  5 star\nI have bought 3 embroidery machines here and have enjoyed excellent instruction and service.\nHighly recommend", "pics": null, "resp": null, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "107088506254364168918", "name": "Elizabeth Witherington", "time": 1590465820561, "rating": 5.0, "text": "I have bought an embroidery machine and a quilting machine here. I love the owners, always helpful and honest, never pushy about sales. She helps me get the machines I need for what I want to do. Highly recommend American Sew and Vac for your sewing machine needs.", "pics": null, "resp": {"time": 1590500667684, "text": "Thank you we truly try to help out our customers and I always appreciate that they bought from us"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "105448489379222785316", "name": "King Ghidorah", "time": 1591526508929, "rating": 1.0, "text": "Waited over 5 mins before I was asked what can they help me with. Then in the mist of helping me, another customer walks in and just began to ask questions about a product and the employee just stop helping me and started helping the other customer. No excuse me from either one of them. I guess my money wasn’t good enough. Needless to say I change my mind about shopping there. Never again!", "pics": null, "resp": {"time": 1591537300476, "text": "Well you obviously have not been to Walmart or places such as that getting help and waiting over 5 minutes 5 minutes is a short time and you got help in person.\nAnd helping someone else as well at the same time that is what multi- tasking.\nAnd I don’t need any customers that need coddling.\nbecause they are impatient and they with my blessing can leave and never come back!!!\nOver enhanced value you place on your self as a customer is your problem not mine you got help in person not dealing with waiting on hold on a phone or online.\nYou got help in person!!!\nYou waited 5 minutes!!!!\n\nGo to a box store and spend your money!!!!\n\nI have no problem at all with you not coming back. That’s what American is all about if you don’t like something you can go somewhere else and you’re free to do so with my blessing."}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "112781907859449301380", "name": "diane brookerd", "time": 1597203862113, "rating": 3.0, "text": "I called last Friday and spoke to a super nice man. I described my problem and he assured me he could fix it. I told him I worked quite a ways away so I'd drop it off in the morning (which was a Saturday). He said \"thats fine but I won't be here. I'll look at it when I come back\". I agreed and we hung up. So I went on Saturday around 1130 am (the man said they opened at 10 am) and the lights were off and door was locked. So I called a few times with no answer. Fast forward to the following Tuesday (I worked from home that day) I went to the store to drop it off....it was about 2 PM. The door was locked and lights were on. Another lady (probably in her 70s) was standing there with me and we were discussing the fact the door was locked and why. So I put my face to the glass and saw someone so I knocked. A young man came to the door and mouthed something about an errand (we couldn't hear him thru the glass). After a few times of yelling \"WHAT, WE CANT HEAR YOU\" I yelled \"CAN YOU CRACK THE DOOR OPEN AND TELL US WHAT YOU ARE SAYING?\" well...he didn't...he yelled thru the door louder that it would be 25 or 30 minutes til someone came back. Not really sure why HE couldn't open the door so we could leave our vacs but she and I looked at each other and said to each other as we left that we won't be back. For me it was about a 20 minute drive to get there from my house. The ONLY reason they get a star is because of the super nice man on the phone. I ended up taking it to Fairhope (I work in Daphne) and they were nice and open!\n\n**thank you for such a nice response. I'm sorry it didn't work out this time. I will definitely keep you in mind in the future. All your son had to do was open the door and tell us what he was trying to say. The nite he was pointing to said \"will return by 1130\". When I questioned him about it he said it was an old note. Also there are sooooo many notes on the door its hard to know what is what. Maybe clean it up a bit. No one will stop to read all that. I'm glad you got your vehicle repaired, that is more important than my vac. i edited my post to 3 stars. Stay blessed!", "pics": null, "resp": {"time": 1597197643584, "text": "We are slow on Saturday and I am the only one who works on Saturday and I had to get the van to the repair shop and to get the transmission fixed. And I had an opportunity to arrange it Saturday and It has to be repaired and they were nice and said if I could get it to them by Saturday they would work on it this week and the truck air conditioning doesn’t work and the vans does. The truck air conditioning part wasn’t coming in until the 21st and it came in Yesterday and so it was able to be fixed today but when it was ready at 2:00 I put a sign on the door and locked it because the vacuum man and I are the only ones that run the store during the week and if I didn’t get him to take me to get my truck I wouldn’t have any vehicles or a way home I had no customers and the trip to pick it up is about 30 minutes. I have tried leaving the store open with my 15 year old and my husband who cannot get around but it doesn’t work I get 50 phone calls because someone needs something they can’t find or a software question if it was only repair machines to be dealt with I would not mind it but it never is so I told my son leave the door locked I will be back in 30 minutes. I had to get my truck and if I waited I would not have any one to take me to pick it up. You picked the two days that I had to make a decision to fix and pick up vehicles I apologize for your inconvenience but it was a bad situation either way so I left locked the door put a note with my number and my van is not fixed but my truck after a month of waiting on a part I have a vehicle with air conditioning. I apologize for the situation but it is what it is and I would rather be at the store instead of dealing with 2 vehicles and repairs this week but no matter how you feel I after a month I have air conditioning in the truck and it’s wonderful and my van is still in the shop"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "102349168727065123974", "name": "Alexandrea Blackwell", "time": 1580336909063, "rating": 1.0, "text": "I only called to ask if they sold parts I was looking for. When I told the lady on the phone what I was looking for on what type of sewing machine she was quick to cut me off. She told me she did not sell those part because it is a cheap sewing machine (understandable). However what bothered me is her lack of customer service skills. I asked her if she knew anybody who sold the parts. She said no because it's a cheap sewing machine that's only a 150. I get that it's a 150 but not everybody has a 150 laying around. I have only had the sewing machine for 6 months and it accidentally fell of my work table and broke a few pieces. I would rather fix it then go spend 150 I don't have. Mind you I know how to fix my machines so I dont have to pay for labor.", "pics": null, "resp": {"time": 1580394195672, "text": "A $150.00 sewing machine that fell off a table and busted its plastic bobbin winder off is not worth fixing the customer is likely to totally ruin the machine by taking it apart herself and then not work at all I told her to go to Joanns or Walmart and buy a separate bobbin winder for about $30.00 and be done a $150.00 machine with broken off parts is not worth fixing but if the bobbin winder was the issue buy a separate bobbin winder and be done those machines were not built to have those parts replaced they aren’t worth it"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "117708720406267256893", "name": "Sonya Miller", "time": 1559261117491, "rating": 5.0, "text": "Mike and the folks at American Sew and Vac are honest and professional. He could have told me anything about my machine and I would not have known the difference. How often does the actual cost of services turn out to be LOWER than the estimate? It happened to me at American Sew and Vac. And by the way my machine is working perfectly. Thanks, guys! Highly recommended.", "pics": null, "resp": {"time": 1559263253161, "text": "Thank you"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "112187464182160008355", "name": "Moto Moya", "time": 1550604679092, "rating": 5.0, "text": "This is a very nice place for people to save their $$.\nLet's say your vacuum has a problem or sewing machine ain't working, I recommend you that this is the place to seek for help.\nThey fix tools and always have some for sale.\nIf you need spare parts, they do have some too or incase they don't have any, I believe they do order replacements for their customers. ..\nIt's a family owned business.\nThe lady and her husband are my favorite people in the area.\nThey treat customers so good.", "pics": null, "resp": {"time": 1550288244523, "text": "Thank you"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "111100797873159312963", "name": "Robert Brown", "time": 1596240493867, "rating": 1.0, "text": "Great products. Rude staff.", "pics": null, "resp": {"time": 1596246587846, "text": "Rude is what you make of a situation that’s how your opinion feels however one customer feeling that is rudeness another it is not everyone is entitled to their own opinion"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "105224457692289388971", "name": "Patricia Porter", "time": 1580759617701, "rating": 1.0, "text": "I've been in the shop two times both time I went in the customer service was aweful. They were so rude and neither time I went in did I find what I needed and didn't give me any clue where I could the part. In matter of fact the man that was rude today. Told me he didn't work with sewing machines, he worked with vacuums. So I know I want be going back", "pics": null, "resp": {"time": 1580763489812, "text": "Parts are not as easy to find as customers make them out to be a lot of parts are no longer available so you try to find what you can some simply are not sold Rude goes both ways in a service relationship so opinions are what you make of them Customers come to find parts here but you try to find what you can but success is never a guarantee."}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "116179281197022738537", "name": "K Butts", "time": 1490962374384, "rating": 1.0, "text": "Rude and condescending to customers. Owners are rude and argue in front of customers.  Misrepresentation of products. This has happened on several occasions. Bought machine 15 years ago there. Because I like my machine, I broke a promise to myself recently and returned to shop for upgrade.  Same story/same page!  I'm still in market for new machine and software.  High on my list of needs is customer service.  I have yet to find it at American See & Vac!  Absolutely will not trade w them again.", "pics": null, "resp": {"time": 1534565582247, "text": "Some times customer service is what you choose to make of it how people perceive each other is subject to interpretation it is all about feelings in business making everyone feel how they think they should feel when they shop here.\nMisrepresentation is also about how one feels something should or should not be represented a belief of the person verses how someone else portrays the product often is simply a different opinion or view neither way is right or wrong it is all in the eyes of the individual view life is full of all types of people and things sometimes what works for one person doesn’t satisfy another that is everyday life in all businesses."}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "117243104773044614855", "name": "Elizabethann Moore", "time": 1519862466114, "rating": 5.0, "text": "I have had my machine worked on here several times, and the support team has been extremely helpful answering all my questions. I drive from Fairhope to have my Baby Lock serviced, and learn new things about the machine each time. One day I was running late and they kept their shop open until I arrived. I cannot say enough good things about this shop and the employees! I highly recommend them and only wish they were in Fairhope!! You will love their friendliness and professionalism !", "pics": null, "resp": {"time": 1521438055227, "text": "Thank you"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "102458696156402885000", "name": "Tammy Jones", "time": 1588182222796, "rating": 5.0, "text": "Took a older sewing  machine in to get a cord for it, not only did they find a cord they also oiled the machine, getting ready to upgrade my embroidery machine and I’ll go here first to see if they have what I’m looking for and in my price range.", "pics": null, "resp": {"time": 1588190180436, "text": "Thank you I appreciate it and I try to take care of my customers and I am glad you are happy be safe and have fun making Masks"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "105274187926064325072", "name": "Ben Martin", "time": 1354387764856, "rating": 5.0, "text": "I don't understand how previous posts could be negative. We purchased an embroidery machine from them 15+ years ago and have since moved out of state. They were extremely nice when we purchased the machine so we called them in hopes they could help us with a service question. Our local dealer wanted $75 just to look at the machine and couldn't advise us about how to troubleshoot it to see if it was even worth the effort since it was an electronic issue (calibration problem). They could only tell us a new board would be around $600. When we called American Appliance, the service technician and another staff person were eager to help us over the phone and guided us through the steps on how to reset the calibration on the screen. We mixed up the steps- our fault- which led to 4 more short return calls and each time they were still very willing to get us back on track and help us. In less than 30 minutes, we were up and running with perfect calibration- and it saved us $675. They could have taken the easy route on a busy Saturday morning and told us to go to the local dealer or buy a new screen but they were genuinely interested in helping us and their extra service efforts are very much appreciated!", "pics": null, "resp": {"time": 1534565815783, "text": "Thank you"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "115529216062481844793", "name": "Neil Cater", "time": 1493584839898, "rating": 4.0, "text": "Always have what I need in stock. Long time Oreck fan and since Mobile's Oreck store closed they've kept my favorite vac supplied with bags, belts, and whatever else I might need to keep my OCD self happy!", "pics": null, "resp": {"time": 1534447478636, "text": "Thank you"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "118295797813694006292", "name": "Stephanie Bassenger", "time": 1440426634355, "rating": 1.0, "text": "I wouldn't even check off a star if I could avoid it.  American Sew and Vac has disappointed me for the last time.  Four months ago I went to a serger class, that was a good class, but during this class I discovered I needed a fabric guide for my serger.  I requested the part to be ordered that very night.  I have since called and requested this part 4 more times, once even going back to the shop to do so.  Each time I'm told that they just got inventory in and to let them check, then I never get a call back.  I have decided it will be quicker to ride over to Mississippi to another Babylock dealer to get my service and parts.  I would never recommend this dealer, however, they are the nearest to me for quite a few miles.  Sad.", "pics": null, "resp": {"time": 1534552313225, "text": "Sometimes life happens you had a good class and that’s what you wanted and obviously the teacher showed you new accessories for your serger fabric guides despite ordering we often back ordered items which I have no control over the dealer in Mississippi just had not sold all of their seam guides out and had to reorder or they would had the same problem with getting one as well You had a good Class and learned that is what is important not something we were out of stock on and it was back ordered that is called life"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "102473883313570209642", "name": "Arnold Singleton", "time": 1556719785688, "rating": 5.0, "text": "(×××××)to God be glory A_S_&_V )", "pics": null, "resp": {"time": 1556721017184, "text": "Thank you"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "111376613262740025218", "name": "Fairhope Sewing School Fairhope, AL", "time": 1492787793939, "rating": 5.0, "text": "Always been very fair, helpful and gone beyond what others have done.  Would recommend them to anyone.", "pics": null, "resp": {"time": 1534447489785, "text": "Thank you"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "113825371196513834377", "name": "Debbie Hudgens", "time": 1539720902470, "rating": 5.0, "text": "Always so helpful, knowledgeable, and friendly!", "pics": null, "resp": {"time": 1539756317190, "text": "Thank you"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "109432662914474956355", "name": "Peggy Stone", "time": 1450104431540, "rating": 1.0, "text": "I first purchased my machine 25 years ago. Took it in during the summer for full service, when I picked it up only oiled and oil was coating every service. $50 for this.\nThe only reason I bought from them to begin with was they were the only Bernina dealer.", "pics": null, "resp": {"time": 1534565804264, "text": "Oil is a necessary part of older mechanical machines we do our best to clean any excess oil up and sometimes after cleaning up a machine if it sits for a while sometimes oil will settle on something. I apologize for any excess oil we try to do our best."}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "105896723410149121465", "name": "paula dixon", "time": 1546958921846, "rating": 3.0, "text": "Dont know nothing about this store", "pics": null, "resp": {"time": 1546959665621, "text": "Ok, well we sell and fix sewing machines and vacuum cleaners and supplies for both but thank you for your review"}, "gmap_id": "0x889a527e86a298c1:0xc35dac5cfcaea79"}
{"user_id": "117536577158849244270", "name": "Grover Sheffield", "time": 1575057426006, "rating": 5.0, "text": "I bought a vacuum here several years ago and I recommend the owner highly.  I particularly appreciated his experience, and willingness to talk about the reliability and pros and cons of different types of vacuum cleaners.  I ultimately choose a Panasonic upright with extension hoses, and have been very pleased with the vacuum and subsequent service.  Excellent job, sir!", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "118385163742005534060", "name": "Bryan Jackson", "time": 1545899524385, "rating": 5.0, "text": "When your the BEST what else is there to say.......\nHe Sales the BEST, and does the BEST work period. When you say I want my Vacuum Serviced not only does he take it COMPLETELY apart and Service it CORRECTLY he makes it look New again.\nGO A1 VACUUMS!!!!\nBEST IN THE USA!!!!!\nWe buy ALL of our Vacuums from him, now my carpet looks new again BECAUSE HIS VACUUMS THAT HE SALES CLEANS THE CARPETS, unlike other vacuums you buy in stores etc.", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "108268984991778493321", "name": "Francis Magilluctti", "time": 1531033589071, "rating": 5.0, "text": "When Mr. Cox Serviced my Panasonic 583 when I went to pick it up it looked like the day I bought it and it's 14 years old and I Vacuum everyday, he TRULY SERVICES VACUUMS. I use to take my Vacuum(s) to another shop in Birmingham and I was told by a very sweet person to take it to Mr. Cox's store at A1 Vacuum and he would do a True Service on it and he did FAR BEYOND any expatiation!!!! I WILL ALWAYS BUY AND GET MY VACUUMS SERVICED THERE!!!!! Oh and by the way I LOVE THE BAGGED VACUUMS LIKE HE SALES THEY ARE THE BEST!!!! Thank you again A1 Vacuum and to Mr. Cox. Since I vacuum everyday I know that BAGGED VACUUMS ARE THE BEST!!!!!", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "101266799637235887571", "name": "Vincent Principi", "time": 1596400092051, "rating": 5.0, "text": "Great service expert at his work", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "107338792070765031247", "name": "Barbara Peachtree", "time": 1551108109948, "rating": 5.0, "text": "Best PLACE IN THE USA!!! I bought my Electrolux (Perfect) from him because my friend Jim said to do so and when your talking to the King of Clean that's Jimbo. Love my vacuum I use it everyday, been 6 years ago and it's still chirping right along in my 8,400 sq ft house. I definitely recommend Mr. Phillip Cox to everyone. I took my Beach Vacuum which is a Panasonic to him for a Complete Service when I got it back I thought he was giving me a New Vacuum Cleaner, it worked like and cleaned like a new one just as he said it would.", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "101654142465052196200", "name": "Jim McCollum", "time": 1533279493171, "rating": 5.0, "text": "Best Vacuum Cleaner Reapir and Sales Man in the USA. He Repairs all makes and models of Vacuums and he only sells the Best Vacuums. We love all of our Vacuums that we have Purchased from him, they never break down and I vacuum everyday. His repair work is very reasonable and he Does beyond a FANTASTIC Service Job on our Vacuums, when we get them back they Look and Work just like new again. He also fixed our Central Vacuum and did an Outstanding Job on it as usual.", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "103836554642736273898", "name": "Lisa Elder", "time": 1554446351933, "rating": 5.0, "text": "Learned a great deal, even my non fixable equipment worked when I left.  Very pleasant service to finish the deal!", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "105431993750057876623", "name": "Scott Trammell", "time": 1544638606675, "rating": 5.0, "text": "Great service at reasonable prices. Honest owner!", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "112543364680042954346", "name": "Glena Trammell", "time": 1490988219216, "rating": 5.0, "text": "I've purchased from Philip for sales and repair for over 30 years when he was in Vestavia and now in Chalkville. Reasonable on price and very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "103743108142008723144", "name": "Susan Moore", "time": 1550869250576, "rating": 3.0, "text": "Nice, reasonable prices", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "111453089006036179163", "name": "Jeremy Wren", "time": 1520735804086, "rating": 5.0, "text": "The guy at the place waited around on me when he didn't have to and said if I didn't make it by the time he had to leave he would leave to vacuum cleaner belts outside for me to have and just pay for them when I could", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "108769903534620940174", "name": "Sam Iam", "time": 1477341177525, "rating": 5.0, "text": "Very good honest customer service", "pics": null, "resp": null, "gmap_id": "0x88890c0e584d0957:0xa936d0c4cf0b7ee5"}
{"user_id": "103520693613177132330", "name": "Pure Bliss", "time": 1596518381002, "rating": 5.0, "text": "They have the absolute best staff. They are friendly and professional. I got my pressure washer serviced. Mike was very knowledgeable. The turnaround time was very quick. This made me happy that my pressure washing business did not have to lose any money. This company is highly recommended.", "pics": null, "resp": {"time": 1596547402560, "text": "Thank you very much for your review. It's our pleasure to help you."}, "gmap_id": "0x88891bb402411fbd:0x24dbeaf4af62df77"}
{"user_id": "111216200368422880565", "name": "lectricdave", "time": 1478727931489, "rating": 5.0, "text": "they have top of the line pressure washers and floor scrubbers for sale and rent", "pics": null, "resp": null, "gmap_id": "0x88891bb402411fbd:0x24dbeaf4af62df77"}
{"user_id": "115494962407722638431", "name": "Kristin Fulda", "time": 1624115445303, "rating": 5.0, "text": "Always providing quick, professional, quality service.  Brought my Miele canister in for a tube up and I got it back much faster than expected.  Big thanks to Joe and to the crew at S&R! I won’t go anywhere else in Huntsville :)", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "114312672470248189072", "name": "mlplong1", "time": 1595007599822, "rating": 4.0, "text": "Nice", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOQdmJGILyLONlwrrYPaTjKjIj2clXBTNVX_Sy0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNparNKPbVlmCFzjDfn1jwuXyWOisO1vtcQOaEF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMo6QEoKuy4uZixvKC-0CB3ltErPQ1q2C93OMln=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "112223533162377122258", "name": "Tabitha Riley", "time": 1623248540241, "rating": 5.0, "text": "I love coming to this place to buy my vinyl. These young beautiful spirit young lady Meredith always helping me. ♥ She has been a great help everytime I come to make a purchase.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "104584068516654672520", "name": "Kaye Diener", "time": 1622213905602, "rating": 5.0, "text": "Meredith was very helpful in demonstrating the Baby Lock Verve to me and my daughter. I was so pleased that I purchased it. Sorry I couldn't purchase it from her because I don't live in her area. But I did purchase it from a dealer closer to my home. I was visiting my daughter in Alabama and I live in ohio. Meredith was very courteous and knowledgeable about many of the machines on the showroom floor. I appreciated her ability to explain many aspects of the Verve to me and also compare a couple of the others to it. Thank you Meredith.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "100047381970804355703", "name": "Alexandria Peterson", "time": 1623959783259, "rating": 5.0, "text": "This is my go to place!!!! I am always taken care of, and they are always helpful! Meredith has been so kind to help with all of my big orders!! So happy to have S&R here!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "102847794702248060586", "name": "Morrison Monogramming", "time": 1622412058143, "rating": 5.0, "text": "Kathie Hodges taught me all about appliqué almost 10 years ago!  She has stuck by my side through endless questions.  She is always helpful and friendly!  Love my new Jubilant sewing machines!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "100522257591946168994", "name": "Keira Williams", "time": 1623789995302, "rating": 5.0, "text": "S&R is my new favorite place to get my vinyl. Meredith is always so sweet and willing to help however she can!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "113567770233965103598", "name": "Katrina Coleman", "time": 1623127693359, "rating": 5.0, "text": "Meredith was knowledgeable on the spare part I needed for my machine. It was well worth the drive from Madison. Thank you and yes that part did work perfectly.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "101844339713732112715", "name": "Skin Attack Tattoos", "time": 1622651099732, "rating": 5.0, "text": "I love this place everyone in there is very nice and helpful also Meredith is very polite and gives a good welcoming when I walkinn thank you for y’all hard work 😎", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "114236227882163433906", "name": "Cynthia Curry", "time": 1622217122088, "rating": 5.0, "text": "Thank you S &R Sewing for a job well done.  And a special thanks to Meredith for all your  help. I will be coming back.  Thank you again.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "112767496498590109474", "name": "Destiny Leslie", "time": 1622212541980, "rating": 5.0, "text": "Meridith and Randy are awesome!!! Every time I come in they always are very helpful and sweet! Will continue to shop here!!🥰🥰", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "112175299347401865738", "name": "Sonja Howell", "time": 1622297309386, "rating": 5.0, "text": "I was so pleased for the help I got from Meredith about my new machine. She knew exactly what I needed and helped so much!! Thanks Meredith!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "101850725980983275647", "name": "Wayne Estes", "time": 1621403837732, "rating": 5.0, "text": "All mom wanted for her 94th B-Day was her sewing machine fixed. Tony & the S&R team made it happen!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "116168659734848182304", "name": "Karen T", "time": 1594060895002, "rating": 5.0, "text": "S&R Sewing Center is the best.  I was having issues with my embroidery machine and Tony offered assistance over the phone.  I tried what he said and ended up taking it into the store.  He resolved my problem in a matter of 10 minutes.  Amazing what a small thread or lint will do to a machine.  Tony was AWESOME in getting my machine working again.  Love that store.  Well worth the 45 minute drive over for excellent service.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "103852628416128551903", "name": "Sarah Fulks", "time": 1603479142236, "rating": 5.0, "text": "I recently bought a new machine at S & R in Huntsville. They were very helpful, friendly, and patient allowing me to spend as much time as I needed using the floor model before deciding to buy. The machine I bought was on back order, so I wasn’t able to take one home that same day. When the machine did arrive, my husband ended up going to pick it up for me. I gave him a list of extra accessories to buy, but I was a little worried he wouldn’t get it right as he knows NOTHING about sewing. At the store he was able to show them the list, and they went and got everything on the list for him rather than just telling him where to look. I’m definitely happy with the service I’ve received there so far!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "106189417952408608413", "name": "Elizabeth Bero", "time": 1622674074683, "rating": 5.0, "text": "Thanks to Meredith for helping me replace the missing part!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "111457034627434133095", "name": "Tim Klassen", "time": 1622759620279, "rating": 4.0, "text": "Ok place but a little unprofessional for a business in 2021 ...I love to see a place thriving and going places .....needs management", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "112178915886030363471", "name": "Jay Potter", "time": 1622667516187, "rating": 5.0, "text": "Always have a great experience shopping here.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "105538520921879395715", "name": "keysha stinnett", "time": 1623180937996, "rating": 5.0, "text": "Meredith was very professional and a great help.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "106404878315649302876", "name": "Carlisha Landers", "time": 1603415115418, "rating": 5.0, "text": "This will now be my go to spot for HTV! The customer service here was beyond excellent as well as the prices! They have a great selection of vinyl and even a rewards program! I will definitely be back soon!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "110439111129278939053", "name": "Kelsey Sales", "time": 1595870010179, "rating": 5.0, "text": "They were very friendly.. I had a minor problem with my sewing machine and Randi was very big help. I was in and out. Plus if you need a sewing machine they have some on hand( they’re sold out everywhere). Will definitely be shopping here😊", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "111848978150331770877", "name": "Clara McLemore", "time": 1592938480623, "rating": 2.0, "text": "the first time I went to this place I would have given him five stars they fix my vacuum for free. This time they told me it would be 2 to 3 weeks when I called vacuum world he said he had one customer ahead of me and he could have my vacuum back today", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "110742299278952794502", "name": "Dorothy Scott", "time": 1586381725309, "rating": 5.0, "text": "This place and the people who work here are great!! Very knowledgeable and very helpful and friendly. Give them a try. You won’t be disappointed!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "113683511749580001321", "name": "jackie kelly", "time": 1597764360843, "rating": 5.0, "text": "Great prices and nice people; always helpful", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "103860329018681141675", "name": "nyisha vance", "time": 1591459615249, "rating": 5.0, "text": "The staff here are always so friendly and helpful!! Thank you for the great service you provide SandR sewing!!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "101088546311408811445", "name": "Vicki Baggette", "time": 1554664386866, "rating": 5.0, "text": "Took a sewing class yesterday on making an oval rug from jelly roll fabric.  Randi was a patient instructor and I came away with a cute product.  A good lunch and plenty of snacks were provided during a long day of sewing.  It was a full class with plenty of space to set up.  The other ladies were also very nice.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "114761695550363157987", "name": "Renew1874 Salon", "time": 1581518040076, "rating": 5.0, "text": "I’ve visited the store several times to purchase htv for shirts . The staff is Always friendly and  helpful.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "103526049789013094981", "name": "Michele Olney", "time": 1520439163099, "rating": 5.0, "text": "I had an over 30 year old sewing machine.  I decided to buy a new one.  Ms. Gay was very friendly and helpful and showed me a couple of machines.  They have material at ever machine so that you can try them out.  I purchased a new Baby Lock sewing machine from S&R.  I love the sewing machine but even more I love that they had a 3 session sewing class that let me get to know my new Baby Lock.  The instructor is very knowledgeable and the class was amazing.  I thoroughly enjoyed this class and will be back for more classes.  I would recommend this store to anyone and everyone.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "102160578642376149698", "name": "Robert Owens", "time": 1544835201255, "rating": 5.0, "text": "I went by to get my Dyson repaired. I called first and they said 3-4 days before they could repair after I dropped it off. I said no problem. I went by around lunchtime and upon walking in the door I was approached by a gentleman who knew I needed my accompanying vacuum repaired. I explained my issue. He began to work on it immediately thinking it may just be a belt. Within five minutes I was fixed up and at a very, very reasonable price. I will visit again, and will bring my sewing people with me. Truly exceptional service, with a smile.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "105630597204938778169", "name": "K A S H MOODIE", "time": 1555259329617, "rating": 5.0, "text": "Paul was very nice and knew what he was doing. He was very honest about the issues that my vacuum cleaner had and fixed it immediately. I’m grateful for him because I was two seconds away from tossing the whole thing.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "109646113784033320833", "name": "Scott Seeley", "time": 1572118292331, "rating": 5.0, "text": "Helpful and kind ( rare these days ) people helped get our seldom used sewing machine back in ready to use every day condition. Thanjs! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "102285950805395175341", "name": "Barry Owen", "time": 1594767236943, "rating": 1.0, "text": "Bad business They will charge you whether they work on your stuff or not. Read the BBB report and their Facebook reviews. I’m\nNot the only one to say this.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "112822865322716350390", "name": "Bobbie King", "time": 1551926409417, "rating": 5.0, "text": "Thank goodness for these folks, I got my machine fixed in a reasonable time & good price. They also carry used machines,new machines,both sewing,sergers and embroidery machines. Fabrics & quilt patterns too.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "106545203787994498854", "name": "Darla Suggs", "time": 1532030719689, "rating": 5.0, "text": "Excellent! Easy to work with...fair prices. Took a vacuum in for repair...ended up buying s new one. Will use the repair unit as a spare. Paul Fischer helped us with the repair and the new unit. He's very knowledgeable and easy to work with!!", "pics": null, "resp": {"time": 1532032932726, "text": "Thank you Darla! Paul is an exceptional employee and we appreciate his dedication to his job. Thank you for your review!"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "105879620567829939976", "name": "Alana Knight", "time": 1551988615963, "rating": 5.0, "text": "Randi helped me tremendously with my Alliance baby lock. She answers questions almost immediately with all the right answers! Amazing customer service 😊", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "103481848678167688349", "name": "Karen Rich", "time": 1531237196077, "rating": 1.0, "text": "I have taken several carpet cleaners to be repaired every time he takes weeks up to 3. I call them I call and they still don't know what they're doing. the last carpet shampooer I brought took again 3 weeks this was 2 weeks ago the machine worked well when I dropped it off all it needed was a belt and a cover piece on the front of the machine and I believe I might have got the belt or not??when I went to use it today for the first time it would not even turn on. This kind of thing happens every time I have used this so called service. They have lost a very good customer. I want to add I was not charged for the last visit ,and I am always treated kindly by the repairman but what good is a machine that comes  back worse than It had arrived.", "pics": null, "resp": {"time": 1532032837312, "text": "I'm very sorry that you have an issue. I only have 1 transaction for you this year. looks like we could not get a part for your your Hoover steam cleaner. Then you purchased a Bissell steam cleaner earlier in the year. But, I do not see there was ever a long time period the machine was here. Please give me a call at 256-536-5696 and ask for Tony so we can see what the problem is since this is the first I've known of a problem. Thank you."}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "111241122733184527829", "name": "Pam atthewillows", "time": 1458228364300, "rating": 5.0, "text": "I have shopped at this store for over 10 years. Even when it was at the first store.  Tony, Gay and Kristy have been the best to work with.  I come from Tennessee to shop there just because of the customer service. No I am not related to anyone in the store.\nThe opportunity to learn about the products I purchase is the greatest, Kathy, one of the teachers for Silhouette, is an extremely good teacher, especially for beginners.\nTheir service department is the most curtious  I have ever dealt with . Mark and Scott are very knowledgeable, very well trained.", "pics": null, "resp": {"time": 1508464664288, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "117740970427978280948", "name": "Claudia Rhen", "time": 1545499603309, "rating": 5.0, "text": "Great service! Thought my old vacuum was ready for dumpster and prepared to buy new one. S&R restored my old, reliable to practically brand new!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "105818997187476570120", "name": "David Jones", "time": 1549314995975, "rating": 5.0, "text": "Randi is top notch any questions or concerns you have she will take the time to answer them, and as well offers classes to help you learn your equipment!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "109700691216826725997", "name": "Dan Kish", "time": 1537199477052, "rating": 5.0, "text": "S&R Sewing helped us get a couple of older sewing machines back up and running and ready for action!  Excellent service and great people!  Can't recommend them enough!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "111241122733184527829", "name": "Pam atthewillows", "time": 1458228364300, "rating": 5.0, "text": "I have shopped at this store for over 10 years. Even when it was at the first store.  Tony, Gay and Kristy have been the best to work with.  I come from Tennessee to shop there just because of the customer service. No I am not related to anyone in the store.\nThe opportunity to learn about the products I purchase is the greatest, Kathy, one of the teachers for Silhouette, is an extremely good teacher, especially for beginners.\nTheir service department is the most curtious  I have ever dealt with . Mark and Scott are very knowledgeable, very well trained.", "pics": null, "resp": {"time": 1508464664288, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "117740970427978280948", "name": "Claudia Rhen", "time": 1545499603309, "rating": 5.0, "text": "Great service! Thought my old vacuum was ready for dumpster and prepared to buy new one. S&R restored my old, reliable to practically brand new!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "104116847371305558435", "name": "PixieDarlingCreations By Terry Duke", "time": 1507573854772, "rating": 5.0, "text": "S&R employees are family and they treat you like you are part of theirs! They are also very thorough and quite reasonable with their pricing which I greatly appreciate! — And are open Columbus Day!!!", "pics": null, "resp": {"time": 1508464413172, "text": "Thank you for your business  we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "104901088201734957752", "name": "matthew bowles", "time": 1543681506938, "rating": 5.0, "text": "Tony is a hands on owner and tries to help his customers as best as he can. I bought a machine online and it was damaged. Tony and his staff fixed it right up.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "109863153695068394834", "name": "Mark Pepper", "time": 1522025595320, "rating": 5.0, "text": "I got a Dyson vacuum cleaner repaired. The service was quick and efficient; Paul cleaned the vacuum and it looks and works good as new. Would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "117335978332155154153", "name": "Ruby Winkles", "time": 1548704458536, "rating": 5.0, "text": "Very nice people n they did a great job working on my sewing machine", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "113182082035413818039", "name": "Jeremy R", "time": 1420492832932, "rating": 1.0, "text": "I stopped in before Christmas to look for a sewing/embroidery machine. Tony (the owner) was very friendly at the time. The next week, we ran across a good deal on a used Brother machine from another local retailer in the area. S&R carries BabyLock which is made by Brother. I needed some accessories so I thought I would give S&R a chance. I called and asked Tony if he had the accessory that I was looking for. He said yes. When I asked the price, he asked where I wound up buying my machine. I told him that I'd found a used machine at a store down the street. His response was \"You need to call them\" and then HUNG UP THE PHONE.\n\nPeople buy accessories and notions much more often than machines, therefore I thought that a retailer would be happy to have that business; not S&R.\n\nI like supporting small businesses, especially when they have a service to offer (i.e. repairs, advice, etc.). There are other sewing machine centers in Huntsville that want your business no matter who you are, what you have, or where you got it. I will support them.\n\nOtherwise, I will buy online before I do business with S&R again.", "pics": null, "resp": {"time": 1426095706731, "text": "We do our very best to give the highest level of customer service to each customer that comes in the door or calls on the phone. but the rest of this story is a little different than what was told. When you purchase a sewing machine from S&R Sewing & Vacuum ctr you do get unlimited support and classes but This however dose not apply to machines not purchased from S&R Sewing I simply told Jeremy R. that after spending more than an hour with him trying to get the best machine for him and his wife that he should go back to where he purchased his machine and they could help with his questions."}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "100572122474098402214", "name": "Compton Owens", "time": 1524481150849, "rating": 5.0, "text": "We purchased a Miele CX-1 canister vacuum cleaner and could not be more pleased.  The vacuum cleaner is a beast of a machine! Our salesman, Paul Fischer, was very knowledgeable, patient, and NOT at all pushy.  He was very helpful, and even offered to let us take a vacuum cleaner home for a test drive over the weekend.\n\nIt am convinced that S&R Sewing and Vacuum Center stands behind the products they sell.  They offer onsite service and repairs as necessary, and that’s a big deal to me. Prices are competitive , and comforting to know that I have a local dealer who cares about their customers after the sale.\n\nI highly recommend S&R!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "110055945727927103380", "name": "Same Asiteverwas", "time": 1555117000654, "rating": 5.0, "text": "Paul was very knowledgeable and helpful. I recommend S&R for all your vacuum cleaner issues.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "113504361303553101669", "name": "Gracie Dean", "time": 1549725152925, "rating": 5.0, "text": "Randy is the best! She has taken the time to give me embroidery lessons on her time and answers any questions sent via message almost immediately.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "113887777837081537906", "name": "Beverly Bogle", "time": 1538157406284, "rating": 5.0, "text": "Love the people there very nice and very good. Have been a customer for yrs yrs, lol ainta saying how many will reveal my age. 😆", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "109288679376735555122", "name": "Becky Orr", "time": 1471725348420, "rating": 5.0, "text": "Had a ball at the Anita Goodesign Embroidery Party this weekend! . S & R did an excellent job hosting and serving wonderful generous lunches.  Can't wait for more classes.", "pics": null, "resp": {"time": 1508464682185, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "114607331198771035257", "name": "Fae Fae", "time": 1566253252761, "rating": 5.0, "text": "The only place to buy Kirby vacuum bags", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "115615865282520100090", "name": "Louise Cherry", "time": 1483663334434, "rating": 5.0, "text": "Attending a serger class, the teacher and class is great, the service is absolutely the best, good lunches as well as snacks and drinks all day. They take the time to ask us if we need anything special.  Wish that my classes from work were held at such a nice place, where you treated very good. Highly recommend them for buying sewing machines/embroidery machines and sergers as well as whatever kind of thread you need.  If they don't have it, they will order it.  Won't buy a machine from anyone else.", "pics": null, "resp": {"time": 1508464568180, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "113661489674888527872", "name": "Jacqueline Rogers", "time": 1516225930218, "rating": 5.0, "text": "I'd add another star if I could.  My vacuum cleaner looks brand new. If you want courteous service; THOROUGH, KNOWLEDGEABLE AND PROFESSIONAL workmanship , please bring your vacuum cleaner here. I will from now on!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "114303695431492589419", "name": "Kim Galkowski", "time": 1543700611620, "rating": 1.0, "text": "I bought a six needle before a Florian I event and was told by Christi I would get the same promo as they had at the event. At the event she did not give me the same promo and when I spoke to her later at the store instead of paying the difference for the cost incurred at the event (that was supposed to be covered) she gave me a store credit requiring me to spend more at the store. Another time I went to another event and ordered a hoop for my machine, Christi ordered the wrong hoop and when I realized it she offered to order me the correct one (this was in early October) approximately 8 months later with all kinds of stories from Christi telling me it was backordered I call the company directly and was told it was never on backorder during that time and if I returned it to the store I could get it directly from them. When I went to the store to return the hoop, bubba found one sitting on the counter that was the correct one, needless to say, I won’t step foot in this store again. Bubba is a good man but I feel that Christi does not care about her customers and lies. I have found another store in town that knows how to treat their customers.", "pics": null, "resp": {"time": 1544500712845, "text": "Kim we do not have a Christie that works for us and Buba works for Huntsville Sew and Vac not affiliated with my store I feel that you may have gotten us mistaken for them but if I can help  you with a hoop or anything else please let me know you may call us at 2565365696 also if you don't mind please retract your negative feedback from S&R Sewing and Vacuum Center as it will bring our rating down since we are not at fault.\nThanks Tony Coulson"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "111230477092020096016", "name": "Sherman Wiggin", "time": 1443541821353, "rating": 5.0, "text": "We have an older Designer 1 that has had various problems over the years.  The owners went out of their way each time to fix the problem - even sending it back to the manufacturer for one issue.  They upgraded the system from a 3.5 floppy to USB kit, replaced various small components that have broken effecting needle and bobbin functions.  Each time they explain the problem and have looked for the most economical way to repair the machine.  Its time to take it back in for another issue today (this is not a reflection on the machine - we have really used and demanded a lot of this machine).", "pics": null, "resp": {"time": 1508464644823, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "107042091822029636297", "name": "Jeannette Owens", "time": 1483723408912, "rating": 5.0, "text": "Took my first class this week, Server Davy Retreat. Absolutely phenomenal staff, large classroom, outstanding instructor...This certainly will not be my last class :)", "pics": null, "resp": {"time": 1508464544805, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "107042091822029636297", "name": "Jeannette Owens", "time": 1483723408912, "rating": 5.0, "text": "Took my first class this week, Server Davy Retreat. Absolutely phenomenal staff, large classroom, outstanding instructor...This certainly will not be my last class :)", "pics": null, "resp": {"time": 1508464544805, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "113441302325391505213", "name": "jim Porter", "time": 1573006492304, "rating": 1.0, "text": "When you take something in for repair , they say they will call you and never do. Went buy to check on it and said” the owner was going to get in touch with Electrolux to see if ugh e could get a overheat sensor and would be in touch with me Monday. That was 2 months ago1", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "100723406381135483366", "name": "Tawnia Marceau", "time": 1503066360163, "rating": 5.0, "text": "S & R Sewing has been my saving grace when I've need HTV! Customer Service is Awesome! Love S & R!!!", "pics": null, "resp": {"time": 1508464490826, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "115588180287615959934", "name": "Kellen Cade", "time": 1502814641683, "rating": 5.0, "text": "Great store,  the staff was WONDERFUL.  They didn't have what I needed, but they took the time to find another store that did have what I needed.", "pics": null, "resp": {"time": 1508464518467, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "109671830376852275741", "name": "Eddie Ethridge Jr", "time": 1541800079045, "rating": 4.0, "text": "Call to get pricing for vacuum repair, took it in and Paul took care of me in less than three days even with him having alot of repairs. Thanks alot.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "110567077731241561876", "name": "Amanda Moreland", "time": 1415055420397, "rating": 1.0, "text": "Horrible horrible customer service. Don't waste your time or money here. worse mistake ever to buy my embroidery machine from them. its suppose to be covered under a warranty for 1yr. but yet they don't fix it, or its not covered. my husband was hung up on, put on hold for long periods of time. Always told someone will call but no one ever does. we are still waiting after a month for a .25 cent part, and no fix on the usb program To run the  machine.  They have lost our business for sure. we will go else where to upgrade to a 6 needle machine. im very disappointed with this company.", "pics": null, "resp": {"time": 1426100636413, "text": "Amanda the problem with your machine is not a .25 cent part as  for your usb stick i did  replace it  with a new one that we were able to get from the factory  at no charge to you. I do not know how or why the program on your usb stick had gotten erased. As for the warranty it did have a year on it and you were not charged for any labor and i do not show any records for parts. I am sorry that you feel that we did not do enough to make you happy with the machine that you purchased from us."}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "106224263963143068193", "name": "Barbara Biles", "time": 1472069340163, "rating": 5.0, "text": "Had a great time at Anita Goodesign event-great food, good location and tremendous deals on machines, embroidery designs, luggage carriers- Best teachers and staff always available", "pics": null, "resp": {"time": 1508464703825, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "101317642930389247402", "name": "Tracy Maples", "time": 1471963557338, "rating": 5.0, "text": "Attended the Anita Goodesign event this weekend August 19 & 20, everything was excellent.", "pics": null, "resp": {"time": 1508464720411, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "113591640306589303872", "name": "Debbie Ragsdale", "time": 1479227191294, "rating": 4.0, "text": "Love the new location!  Good people and very friendly!!", "pics": null, "resp": {"time": 1508464590407, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "115159472213295440936", "name": "Brian Beaty", "time": 1506910043740, "rating": 5.0, "text": "Excellent customer service and great prices!", "pics": null, "resp": {"time": 1508464464161, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "108788954581169984668", "name": "Barbara Hubbert", "time": 1471794791356, "rating": 5.0, "text": "Great fun at the Anita Goodesign embroidery party this week!", "pics": null, "resp": {"time": 1508464740582, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "115312614398961920151", "name": "Chondra Craig", "time": 1513834233183, "rating": 5.0, "text": "Excellent service! Fixed the problem in a reasonable amount of time!", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "112322163650790614756", "name": "Donna Stepp", "time": 1476402118403, "rating": 5.0, "text": "Love this place and the people.❤️❤️❤️ Service department is awesome.", "pics": null, "resp": {"time": 1508464616155, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "104214839164536282580", "name": "Pam Mann", "time": 1471725854349, "rating": 5.0, "text": "Had a blast at Anita Goodesign party on Aug 2016", "pics": null, "resp": {"time": 1508464766744, "text": "Thank you for your business we look forward to seeing you again"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "118130877917130475670", "name": "Chrissyart creations", "time": 1618938945606, "rating": 1.0, "text": "??????? Never went there", "pics": null, "resp": {"time": 1619789975064, "text": "i am not sure why you left me a 1 star review could you explain"}, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "100178126477131518678", "name": "Computer World", "time": 1531503155093, "rating": 5.0, "text": "#1 vacuum repair in huntsville", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
{"user_id": "108828030460322612477", "name": "Mindle Hoffamitz", "time": 1503441442993, "rating": 1.0, "text": "What a joke for a vacuum cleaner service center. Took me over 4 weeks to get a part for my vacuum cleaner and then I come to find out the part doesn't even go to my vacuum cleaner. Avoid this place at ALL COSTS.", "pics": null, "resp": null, "gmap_id": "0x88626b4046969afd:0xf89f0b5e5423d63f"}
