{"user_id": "108958813949269889240", "name": "Shelia Stokes", "time": 1600962162839, "rating": 5.0, "text": "Dr Redd did surgery on my husband 3 years ago and was wonderful to our family.  So, when I needed a vascular surgeon, I wanted him.  He is so kind and compassionate and covers all the bases to give you the best care possible!", "pics": null, "resp": null, "gmap_id": "0x888e803e83d830e9:0xecf561712b301dd6"}
{"user_id": "111641064947962483286", "name": "Wilma Wilson", "time": 1544033269629, "rating": 5.0, "text": "Dr. Redd is one of the best surgeon in America. He saved my mother’s leg from being amputated. She was 80 years old with a bad heart. And was involved in a car accident. After visiting other doctors. Her leg had turned gangrene. But Dr. Redd operated on her and she fully recovered. Thank you Dr. Redd for a wonderful job.", "pics": null, "resp": null, "gmap_id": "0x888e803e83d830e9:0xecf561712b301dd6"}
{"user_id": "108527212279465593920", "name": "Michelle Williams", "time": 1522811252046, "rating": 5.0, "text": "Greatest Doctor ,Dr R.Redd", "pics": null, "resp": null, "gmap_id": "0x888e803e83d830e9:0xecf561712b301dd6"}
{"user_id": "110047527267582388745", "name": "carole cook", "time": 1625005667634, "rating": 5.0, "text": "The Center for Vein Restoration, located in Dothan Alabama, is a very efficient, well-run clinic that gently walks you through each phase of your medical procedure.  The staff is very friendly, supportive, and personable.  Dr. Schul was flawless in his application, and made the whole experience painless and effortless. I was very pleased with my entire visit, and look forward to the rest of my scheduled appointments.  I highly recommend this facility to anyone who needs medical attention regarding vascular issues.", "pics": null, "resp": {"time": 1625075580278, "text": "Thanks for taking the time to review! The CVR Dothan team works hard to meet the needs of our patients."}, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "105539510607219284560", "name": "Donna Hunsberger", "time": 1620535220448, "rating": 5.0, "text": "One of the most pleasant experiences at a doctor’s office I have ever had.\nLovely building and the lobby (not your run of the mill waiting area) made you feel welcomed.\nBut the true value is in the care and attentiveness that they give their patients, from the receptionist when you first to come, in to the staff that conducts your interview and procedures, to the doctor who completes your examination and evaluation.\nThe Center for Vein Restoration takes the meaning of professionalism combined with compassion to a very high level.", "pics": null, "resp": {"time": 1620667592139, "text": "Thank you so much for your kind words. The team here at CVR is delighted to hear your feedback! Our patients and their safety and satisfaction are our top priorities."}, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "106673835427944825453", "name": "Tracie Eiland", "time": 1624978467510, "rating": 5.0, "text": "I had a really nice visit. I was very comfortable the entire time.  Each person was extremely nice.", "pics": null, "resp": {"time": 1624983339410, "text": "Thank you for taking the time to review our practice!"}, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "110434176350499678153", "name": "Emily Leavins-Sketo", "time": 1624600489541, "rating": 5.0, "text": "Awesome staff!  Dr. Schul is an excellent doctor and is extremely personable.  You will love everyone at this office!", "pics": null, "resp": {"time": 1624824509084, "text": "Thank you for taking the time to review our practice!"}, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "103170478988730595436", "name": "Michelle Rabe", "time": 1620663292576, "rating": 5.0, "text": "The consolation and treatment plan were just what I needed and answered all my concerns. The doctor and staff were confident, knowledgable and friendly. So glad I made an appointment.", "pics": null, "resp": {"time": 1620667616838, "text": "We appreciate you taking the time to share your great experience!"}, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "113095504581934799767", "name": "Marsha Bergan", "time": 1615347894865, "rating": 5.0, "text": "Very professional! Everyone made me feel at ease. I was embarrassed showing my legs because I knew how bad they were. Last summer was the first time I wore shorts in over 20 years. Would definitely recommend anyone to go and seek help for those pesky veins. They don't give up until you are happy, legs don't hurt any more and the veins are gone. Thank you!", "pics": null, "resp": {"time": 1616715000650, "text": "We appreciate you taking the time to share your great experience!"}, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "115664977609954510782", "name": "Vicki Meissner", "time": 1615809560652, "rating": 5.0, "text": "A genuinely kind and enjoyable staff.   The staff was very knowledgeable, it was easy to tell each one of them knew what to do and loved doing it.  Wonderful Team!", "pics": null, "resp": {"time": 1616714913529, "text": "Thank you for sharing!"}, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "114190892673641438018", "name": "amy lecroy", "time": 1615755788298, "rating": 5.0, "text": "Doctors were great! Staff friendly and helpful! My legs feel so much better!", "pics": null, "resp": {"time": 1616714949384, "text": "Thank you so much for reviewing our practice!"}, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "106312635445949122212", "name": "Nikki Crum", "time": 1615993151517, "rating": 5.0, "text": "Great experience with an outstanding staff! Very prompt and friendly!", "pics": null, "resp": {"time": 1616714752614, "text": "Thank you for your kind words – we truly appreciate it!"}, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "102514654745121193654", "name": "CAnn Bradford", "time": 1590010303272, "rating": 5.0, "text": "Both  my doctor and staff were all a welcomed change than found in some medical practices. My doctor was just wonderful, he took the time to examine my legs, feet, and actually talked to/with me explaining my test results, asking if I had any questions, and went on to answer them, still asking if I had any other questions or concerns. Do you realize how unique that is!?!? An ACTUAL caring and concerned doctor!!! I could go on but you get the point...", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "108517587034613037756", "name": "Charlotte Palmer", "time": 1600993100488, "rating": 5.0, "text": "They were very polite and helped me all through my visit.  I would recommend anyone with vein problems to talk to these doctors.  Thank you for your help.😄😁🎯", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "107446289932418907511", "name": "Mina Toole", "time": 1592056223503, "rating": 5.0, "text": "The staff are professional. They make you feel at ease and explain everything being done and the results.", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "113091548046146840508", "name": "Star Thorson", "time": 1584230272111, "rating": 5.0, "text": "I was very comfortable with the staff  and Doctor.  They assured me if I have any issues or questions don't hesitate to contact them.", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "105622981339658579251", "name": "Peggy LaBonte", "time": 1553081904215, "rating": 5.0, "text": "Love the staff and Dr. Todd is outstanding.  would recommend to anyone needing this service.  The service is fabulous and the staff is wonderful.  Will work with you on scheduling and any thing else you need.", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "103578557273313999906", "name": "Terry Morse", "time": 1627387189915, "rating": 4.0, "text": "Very professional and friendly.", "pics": null, "resp": {"time": 1627479763710, "text": "We are always seeking feedback and are so grateful you took a moment to review our practice."}, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "109082583496791209472", "name": "Brian Tew", "time": 1582464470132, "rating": 4.0, "text": "overall excellent. very impressed with the careful exacting scanning by tech.\nDr. decided my veins would not benefit from their proceedures. This is  medicine at its best.\nIt is so hard for medical folks to leave things alone when appropriate.\nof course they want to help.\nquibble: i wanted my results emailed to me.\nthere needs to be an exception in hippa laws to loosen security when the patient requests.\nGet a signature. maybe there is such an exception already.\nquibble: Lay off the \"how'd we do emails.\"\nyou're so vein.", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "114367427661324260664", "name": "Priscilla Bird", "time": 1567266205702, "rating": 5.0, "text": "I didnt have to wait very long.  They were very thorough in their testing and then i talked to the doctor for the results.  Impressed with facility and employees.", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "111213528956899382769", "name": "Kirk Crosby", "time": 1525292178851, "rating": 5.0, "text": "I had venous reflux brought on by genetics. The varicose veins & spider veins that accompanied the reflux were one of the things I hated most. I stopped wearing shorts & sandals. Going to see these guys was one of the best things I’ve ever done. And one of the best experiences I’ve ever had. Amazing professional staff that make you feel like family. I’ll always recommend these guys & will always go to them first for any vein issues. Just wish I’d had it done sooner. Can’t wait to wear all my new shorts & sandals. Bring on the summer!", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "111597539824493205320", "name": "Michael Fletcher", "time": 1576545797216, "rating": 5.0, "text": "First time visiting this office and the staff and doctors are amazing.   They were very good and explained everything that I was there for.", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "101526434447536988772", "name": "Daisy Oliver", "time": 1575047688349, "rating": 5.0, "text": "I was very satisfied with my treatment. The doctor and staff were great!", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "103360468136754554847", "name": "Joretta Parker", "time": 1529673167620, "rating": 5.0, "text": "I am really happy with all the people at CVR.. I have had trouble with my legs for years. After this procedure the numbness and pain have vanished from my leg. Best decision I have ever made. I highly recommend these people. Kudos to Dr. Todd and staff!", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "113108792912015043676", "name": "Regina Merritt", "time": 1564858424326, "rating": 3.0, "text": "I hesitated on posting  this but felt like it might help someone. Very nice people! I’ve had  vein surgery and it went well. Results were great. I’ve also had cosmetic sclerotherapy (expensive) that had great results in the past.  Although the last two times I received sclerotherapy in the same spot I had zero results. They even repeated the service again with no extra charge. But still no difference in the broken veins.  This is extremely disappointing being it’s a very expensive procedure. This I believe is due to the change in the person performing the procedure. I will not pay for a procedure so expensive without having results again. This has been very disappointing. I am seeking to find another office that will perform better results on sclerotherapy.", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "117697379183675940799", "name": "Mary Lamm", "time": 1569503275404, "rating": 5.0, "text": "Early appointments. On time for appointment. Professional staff. Definitely thumbs up.", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "101250678849631007157", "name": "Brandi Shelley", "time": 1558003163532, "rating": 5.0, "text": "Great group! Always friendly and informative. Great flexible hours. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "113764818796500575170", "name": "Greg Waltz", "time": 1591365343110, "rating": 5.0, "text": "Very detailed, everything well explained, laid out a plan", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "115805161911550985993", "name": "Cliff Allen", "time": 1536122532936, "rating": 5.0, "text": "The people were professional and extremely pleasant. Doctors were knowledgeable and willing to answer my questions. Great experience.", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "105934926024519793008", "name": "Cathy Solis", "time": 1560199054709, "rating": 5.0, "text": "I had been experiencing leg pain, swelling, throbbing, itching and difficulty sleeping due to the enlargement of the veins & lack of proper blood flow in both my feet and legs.\nI put off doing anything about it in hope that it would stop on it's own. When it became unbearable, I visited Dr. Kenneth L Todd at The Center for Vein Restoration in Dothan, Alabama.\n\nAfter an evaluation, it was determined that I have Venous Disease. A vein ablation treatment was discussed in regards to my particular problem. My right leg was treated first. There was a certain degree of pain involved in the procedures which began in November of 2018.\n\nExactly one week after the first procedure, the swelling in my right leg decreased. I had more freedom of movement in this knee than I had felt in a long time. The difference in the feeling between the two legs may be described as that the untreated leg still felt as though a heavy sandbag was attached to it.\n\nAs of June, 2019 both leg procedures have been accompished. I no longer have any of the aforementioned pain related problems. The blood flow in both legs has improved dramatically. I now sleep soundly as the veins in both my feet & legs have greatly reduced in size.\n\nThe amount of pain involved in the procedures vs the results do in fact warrant having the procedures performed.\nYes, it's worth it. 👍\n\nI highly recommend Dr. Kenneth L Todd and his TRULY GREAT STAFF for anyone who desires an evaluation and/or subsequent treatment for vein problems.", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "107215908805150890019", "name": "Bob Whitney", "time": 1575040882491, "rating": 5.0, "text": "Friendly, Professional staff from the time you enter and are checked in.  Really appreciate the time taken to explain the findings and options.  Bob", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "111302425841782213506", "name": "Lynn Andrews", "time": 1569277428811, "rating": 5.0, "text": "From the receptionist to the nurses to the doctor, everyone was very nice and professional. I would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "109889684822867697393", "name": "mary clark", "time": 1529632553801, "rating": 5.0, "text": "Friendly and efficient staff, no waiting time, and good results. Would highly recommend to anyone needing this service", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "112587962063968464238", "name": "Robert Simpkins", "time": 1577305389637, "rating": 5.0, "text": "The service of doctors, nurses and support staff are of the highest professionalism.", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "116796291888097809410", "name": "Gwenn Dillard", "time": 1579386221229, "rating": 5.0, "text": "They were very through and better honest.", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "100275482409407709817", "name": "Keke Newman", "time": 1578063672035, "rating": 5.0, "text": "Very nice and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "115779411046539862769", "name": "Libby Harper", "time": 1526483099913, "rating": 5.0, "text": "Very polite and friendly. They knew there stuff.", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "102369794679858183808", "name": "Al Equi", "time": 1572207951979, "rating": 5.0, "text": "Very efficient and professional.", "pics": null, "resp": null, "gmap_id": "0x8892927a3a417219:0x734fe3cd0d3bbfca"}
{"user_id": "115685405202919629648", "name": "Chef Shomari", "time": 1594165841528, "rating": 5.0, "text": "Had surgery today professional Doctor & Staff. Clean office. Pleasant atmosphere!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0x859ed3afc9300851"}
{"user_id": "112367960400567230362", "name": "Walt Sanders", "time": 1568053091610, "rating": 5.0, "text": "One of the finest Docs I have had in a long time.  Knowledgeable, kind and great bedside manner.\nFollow his directions and recovery will be fast with minimal pain.  The Bham area should be honored for a physician of his caliber.  His staff are far above the rest I have used elsewhere.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0x859ed3afc9300851"}
{"user_id": "110833875744159587145", "name": "Dawn Monaco", "time": 1558492679943, "rating": 5.0, "text": "I had my first appointment with him today. The office was very clean and everyone was very friendly and knowledgeable.  I am shocked that Dr Hunt took over a hour to sit and talk to me. You don’t have many Doctors that do that anymore.  He knows his work and I’m grateful my wound Dr set up the appointment for me. I know that with Dr Hunt I will finally be on the road to recovery.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0x859ed3afc9300851"}
{"user_id": "100642319796048559304", "name": "Beverly Nelson", "time": 1582649964193, "rating": 5.0, "text": "Best Surgeon,  Best care, Extremely clean, Helpful & knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0x859ed3afc9300851"}
{"user_id": "114749075745481045817", "name": "James Hall", "time": 1605234018587, "rating": 5.0, "text": "Dr. Jain and his wonderful nurse Keysha are the very best medical team I have ever been to see.  They are very caring, supportive, and of course knowledgeable.  They inspire and motivate me to try hard and live a healthy life style.", "pics": null, "resp": {"time": 1611256304984, "text": "Hello, Mr. Hall. Thank you so much for your review and for taking the time to share your experience! We work hard at Huntsville Hospital Heart Center to exceed expectations and are happy to hear we hit the mark. We will make sure that Dr. Jain and nurse Keysha see your nice comments."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "107244352355207326625", "name": "Rosemary O Gracia", "time": 1623851764285, "rating": 1.0, "text": "Dr. Green is terrific and the scheduling is terrible I called the nurse twice and she assured me that the department will call me back she said that department was full she assured me that I have the stress test so I can have my revision knee replacement it's painful everytime I walk it's painful ice pack can only do so much as soon the stress test is done I have my surgery", "pics": null, "resp": {"time": 1623869235308, "text": "Hello, Rosemary. We are very sorry to hear that you have had trouble scheduling an appointment with Dr. Green. Please call (256) 801-6804 so our Service Excellence Coordinator can assist you."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "112792796621473737833", "name": "Brandy Thomas", "time": 1600472299227, "rating": 5.0, "text": "Absolute LOVE Dr Kanitkar!   He goes above and beyond and he found a congenital Heart defect after my first visit,  that no other cardiologist had found and I had gone to the other cardiologist for years! He has shown he genuinely cares about my overall health!", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "100214528143883045960", "name": "Vickie Simmons", "time": 1613598822733, "rating": 5.0, "text": "Very nice clean place employees great helpful caring", "pics": null, "resp": {"time": 1613659523913, "text": "Hello, Ms. Simmons. Our team strives to be helpful and caring, and we are glad to know we hit the mark during your visit. Thank you for allowing us to care for you."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "103119265035026812389", "name": "Melissa Hardenbrook", "time": 1604948711825, "rating": 1.0, "text": "I had to take m 87 year old grandmother to see Dr. Kahn today (11/9/20)@1pm. Me and my uncle are my grandmothers caretakers. Dr. Kahn’s nurse called us last week to make sure that she brought family members  with her cause she was getting some results that weren’t good. The nurse that took our temp on 1st floor was super nice. But the nurse that was by elevators on the 2nd floor was really rude and she cussed at me and my daughter. There was no sense in her behavior. So you need to check your nurses attitude toward ppl. I have already contacted higher management. I know this COVID is really really serious but that’s no reason to be so rude and disrespectful. I work on the frontline too during this pandemic. Get your ppl in check!!!", "pics": null, "resp": {"time": 1611256130881, "text": "Hello, Ms. Hardenbrook. We are so sorry to hear that one of our nurses acted unprofessionally. We expect our staff to treat patients and family members with respect at all times and will share your comments with our leadership. If you would like to talk about this further, please call the Patient Advocate at (256) 265-9449."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "106961502216609819265", "name": "Carolyn Taranto", "time": 1600453711584, "rating": 5.0, "text": "Moving to Huntsville,Alabama and needed to get a heart doctor for my husband and Susan was so kind to me on phone...\nHelping me set up an appointment and she got his information and gave me the fax number to give to his heart office so they can get his information to her ..\nThank you,", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "100378358238515040887", "name": "Sadie Lynch", "time": 1603122523578, "rating": 5.0, "text": "Had a appointment with dr Mann today from the moment I walked in to temperature check and check in upstairs everyone was so welcoming the nurse who did my ekg was wonderful the nurse who assist dr Mann she was wonderful and also save the best for last dr Mann was fantastic she explained everything so that I could understand definitely deserve 5 stars", "pics": null, "resp": {"time": 1611249867771, "text": "Hi, Ms. Lynch. Thank you very much for such a great review! We work hard to make sure that we are offering the best patient experience. So happy to hear that our commitment was clear with you! We'll make sure Dr. Mann sees your wonderful comments."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "103447123858050165479", "name": "Barbara Watson", "time": 1597678075577, "rating": 5.0, "text": "I had Hiatal Hernia surgery. My doctor was Dr. Speicher. He's the best. I would highly recommend him to anyone.", "pics": null, "resp": {"time": 1597854969747, "text": "That's great to hear, Ms. Watson! We appreciate the great review and will make sure Dr. Speicher knows how pleased you are with your surgery outcome."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "113287989392336901469", "name": "Rick Barger", "time": 1614011663250, "rating": 1.0, "text": "1 week to get a refill on Coumadin this is unacceptable", "pics": null, "resp": {"time": 1614117490375, "text": "Hello, Mr. Barger. We apologize for the delay and want to make sure you have the medications you need. Please call our administrative office at your earliest convenience, (256) 801-6804."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "114144310138776799172", "name": "Alan Montgomery", "time": 1565727959441, "rating": 5.0, "text": "Caring and attentive, very well run and maintained facility.  Excel medical staff.  Very happy with the.  They LISTENED to my concerns, addressed them in a manner I could understand.  Overall a great experience", "pics": null, "resp": {"time": 1565980336858, "text": "We're glad to hear that you had a five-star experience, Mr. Montgomery. Thank you for taking the time to leave a review. We'll make sure our staff sees your comments."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "118251920215843217847", "name": "Amy Smith", "time": 1556289298787, "rating": 5.0, "text": "Registration and check in were fast and timely.  I didn't have to wait very long at all for my appointment.  The tech who did my EKG was efficient, kind,  and competent.   Dr. Mann was thoughtful - she took the time to listen to my questions and answered them all.  Her nurse made sure that I understood follow up instructions and was clear that I could call if I needed more information.", "pics": null, "resp": {"time": 1556546191197, "text": "Thank you for taking the time to let others know about your visit, Ms. Smith. We're so pleased to hear that you had a five-star experience -- that's our goal for every patient. We'll make sure Dr. Mann and the rest of the team see your very sweet comments."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "107908817226408029282", "name": "Janette Perry", "time": 1549297798572, "rating": 3.0, "text": "The doctor we see is wonderful. But this is the poorest run Dr. Office we go to. My aged Mother has had cancer and has heart problems so we see several Doctors. This office will tell us that they will contact us when it is closer to time for the next visit. This visit is due in Feb. and it is now Feb. I have called for an apt. I have not heard back. She is now running out of her medication and again I have called for it but have not gotten a call back. In the past I have had to call several times with no return calls. I would just expect that a office connected to Huntsville Hospital would be better run. The last time after several calls I finally went in and parked myself in their office until I could get confirmation that her medication would be called in. It took over an hour of waiting.  Another thing I have had problems with in the past was getting in when my Mother felt her heart was again out of rhythm. I know they are busy but you hate to go to the hospital to find out if she is in trouble. This Heart center has people that run a heart Cardiogram every time we go in so why can't they have a room set up for people that just need to make sure they are ok if they feel they are having problem? Most people would rather have a Doctor visit bill as apposed to a hospital bill just to get a Cardiogram run. There are a lot of people out there that can't afford the hospital bill, but with insurance could get to the Doctor.\nAgain we love the Doctor we see but feel the heart center needs better management.", "pics": null, "resp": {"time": 1549475511718, "text": "Thank you for taking the time to bring this to our attention, Ms. Perry. We're very sorry that you have had trouble getting your mother's appointments scheduled. We have shared your comments with our practice administrator, and she is more than happy to discuss this with you. Please call (256) 801-6804 at your convenience."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "114418940694340652947", "name": "jacqueline so sad to hear this patterson", "time": 1594315484580, "rating": 5.0, "text": "Dr Thomas Wright has been an amazing  Dr for us", "pics": null, "resp": {"time": 1594659299446, "text": "Thank you for the 5-star review! We appreciate your continued trust in Dr. Wright and the rest of our Heart Center team."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "111183495630817208317", "name": "Addie Sanderson", "time": 1601652339749, "rating": 5.0, "text": "Dr. Mann is one of the best of the best.", "pics": null, "resp": {"time": 1611248610094, "text": "Hi, Ms. Sanderson. Thank you so much for the positive rating and for taking the time to post. We truly appreciate our patients and work hard to earn positive feedback from great folks like you!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "107600049092636768387", "name": "Ray Claborn", "time": 1504114499760, "rating": 5.0, "text": "I was with my wife yesterday while she visited Dr. Mann. I was highly impressed and amazed at the efficiency from the time we walked in the door. From sign-in to heading toward the examining rooms took about 3 minutes, the nurses doing the test while another was taking more information, followed immediately by Dr. Mann coming in. She quickly and completely\ninformed my wife of test results, sat on a stool and within minutes  sat a date and time for an out-patient procedure, followed by check-out. Just fantastic.", "pics": null, "resp": {"time": 1504215838483, "text": "Thank you for contacting us, Mr. Claborn. It’s our pleasure to care for your wife. We will be sure to pass along your kind words to Heart Center leadership."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "109985196974167968210", "name": "Sherry Lathan", "time": 1578152324763, "rating": 5.0, "text": "I had 2 stints placed yesterday by Dr. Ridner at the cath lab. From the moment I was taken thru that door I was made to feel cared about.  Every nurse and patient care tech that came in contact with us made sure I understood and was ok with everything they did. No one was rushing thru their jobs and everyone was helping each other learn their way of doing things. I have had multiple surgeries at different places such as MMCS, MMCN, UAB and Huntsville Hospital but the care not only me but also my husband received yesterday went way above any other place we have ever been. I would recomend the Heart Center cath lab staff and Dr. Ridner to anyone! Thank y'all for making my procedure not so scary and for taking care of me!", "pics": null, "resp": {"time": 1578324772910, "text": "Wow, what a fantastic testimonial! Thank you, Ms. Lathan, for taking the time to let others know about your experience with Dr. Ridner and the rest of our Cath Lab team. We're so pleased to know that your visit met and perhaps even exceeded your expectations. That is our goal for every patient."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "115131734841478230625", "name": "khris anderson", "time": 1514913002679, "rating": 1.0, "text": "My son was asked to wear the heart- monitor.  It broke within the first couple of days and  he returned it,  Although he had never worn it - he received a letter saying that his test was complete and showed not issues.  The doctor he had seen a few years earlier hadn't bothered to read his chart before our visit.  If you go to any doctor in Huntsville Hospital's system you take your very life in your hands.  They are NOT patient-centered, but are focused ONLY on the bottom line.", "pics": null, "resp": {"time": 1515004757722, "text": "Hello, Mr. Anderson. We strive to provide quality care and service to every patient, and when we fall short we want to hear about it. To ensure proper follow up, please ask your son to follow up with our Customer Service Representative at (256) 801-6682."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "101727864550161963403", "name": "Lana Dempsey", "time": 1488812602021, "rating": 5.0, "text": "The Heart Center was a life saving experience for our dad. He received treatment for over 5 years from St. Thomas hospital in Nashville & we never saw positive results. Numerous times we asked why a certain treatment wasn't used and were given bogus answers. Dad's first visit to the Heart Center & being under the care of Dr. Cash was truly a blessing. Dr. Cash immediately identified dad's need to have a pacemaker. Surgery was scheduled, completed, and sucessful. Sadly, several years after receiving his pacemaker dad was diagnosed with Stage IV metastasized lung cancer. Dad had issues of panic/anxiety attacks which were originally thought to have been heart related. After visits and test with Dr. Cash, he diagnosed him with anxiety attacks, just from the shear stress of being a cancer patient. Dr. Cash went above and beyond to care and treat our dad. He prayed with our family and was genuinely concerned for dad as well as our family. We are very grateful to Dr. Cash and his office.\nWe HIGHLY recommend The Heart Center.", "pics": null, "resp": {"time": 1488821750280, "text": "Hello Mrs. Dempsey. We really appreciate your heartfelt review and will be sure to share it with Dr. Cash."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "116520667598806409384", "name": "Steven Holliday", "time": 1449723838811, "rating": 5.0, "text": "I have been a patient of Heart Center Inc for over a year now and every experience I have had has been excellent. My first time there I was having problems and the doctor got me in right away and ended up admitting me to the hospital to run test so that he could find out what was causing my symptoms. I have never had to wait very long to get an appointment scheduled, nor have I had to wait very long in the lobby or exam room. This is one of the most efficient and smooth running office I have been in. Every staff I have come in contact with, whether it was the front desk, scheduling, techs, nurses, or doctors, they have been extremely friendly and courteous. I would highly recommend anyone that needs to see a cardiologist to use this office, you won’t be disappointed", "pics": null, "resp": {"time": 1449763590498, "text": "Thank you for sharing your experience. We appreciate the feedback."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "117383354075285854391", "name": "Mary Holliday", "time": 1449695102456, "rating": 5.0, "text": "My Grandfather was a patient of Heart Center Inc before he passed away. He had been treated by another cardiologist office prior to changing to Heart Center Inc. His experience with HCI was a much better, more enjoyable experience than what he had experienced at the other office. All the staff are very courteous and professional. It is a well organized and managed office. I would highly recommend all my friends and family to use Heart Center Inc.", "pics": null, "resp": {"time": 1449698570151, "text": "Thank you for taking the time to review the Heart Center. We appreciate your feedback."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "102194964391544037331", "name": "Tricia Eakes", "time": 1449723274946, "rating": 5.0, "text": "Much appreciation and gratitude to the Physicians, Nurses and staff. There is always a helping hand no matter where you are in this facility. Everyone is very helpful and understanding from registration to point of care. It's really nice to know we have such a great facility in our home town!", "pics": null, "resp": {"time": 1449763545864, "text": "Thank you for the kind words."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "112712146897383160237", "name": "Sadie Mae", "time": 1557273225813, "rating": 5.0, "text": "I come here to the coumadin clinic on the top floor. This is the NICEST group of people I've ever encountered in the medical field. From the ladies to the desks to the nurses to the NPs. They're so helpful and concerned about my health. I don't feel rushed at all. They really helped me ease through my transition onto coumadin and calmed my fears a lot.", "pics": null, "resp": {"time": 1557419938283, "text": "Hi, Sadie! Thank you for taking the time to share your impressions of our clinic. We're glad to hear that our staff is giving you such great care -- and doing it in a way that's helped ease your fears. We will make sure the entire Coumadin Clinic team sees your sweet message."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "118064058086264183761", "name": "Regina Mcgee", "time": 1449694679952, "rating": 5.0, "text": "I have been a or at the heart center for over a decade.  I Have always had phenomenal care!   Both my parents are patients as well.  We are VERY fortunate to have this level of care right here at home.", "pics": null, "resp": {"time": 1449698523271, "text": "Hi Regina,\n\nThank you for your feedback."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "115771906824899048318", "name": "Edna Neisler", "time": 1478287281458, "rating": 5.0, "text": "I have been a patient of the heart center since 2002. I have a wonderful doctor,his name is Philip Laney. He is a doctor that I can trust. He has saved my life more than once. Every person in the practice is so good to me and my husband. I also am a patient of Dr Jennings. He put a CRT-D device in my chest. A difulater/pacemaker device. He is a great surgeon who took time with myself and my husband. I highly recommend the Heart Center to any one who has heart problems.", "pics": null, "resp": {"time": 1478295192797, "text": "Thank you for your feedback. It's a privilege to care for you and your family. Your kind comments will be shared with the appropriate staff and Heart Center leadership."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "112088480529644877118", "name": "Union Grove Veterans Thrift Store", "time": 1570812435524, "rating": 5.0, "text": "They real have great doctors.", "pics": null, "resp": {"time": 1571068629025, "text": "Thank you for the five-star review!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "110027092306180186089", "name": "Marc Lewis", "time": 1515343167812, "rating": 5.0, "text": "This is one of the best cardiology teams in the southern United States. Up-to-date facility.", "pics": null, "resp": {"time": 1515685651435, "text": "We appreciate the rating and your nice comments Mr. Lewis!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "100949081674993101622", "name": "Nicole Weston", "time": 1466110310081, "rating": 5.0, "text": "Hi my name is sherry Baez I have been a pt. At the heart center since 2006.that is ten years.I have always need treated great.when ever I have a question they are always happy to answer or find the answer for me.I love my Dr.there. he is always making jokes. I love my pace maker Dr too and now the vein drs.I thank gods everyday for the special hands he gave the drs at the heart center...", "pics": null, "resp": {"time": 1466456292146, "text": "Thank you for your kind words Sherry. We appreciate you taking time to review our practice and provide feedback."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "115338680088504229959", "name": "Barbara Peeler", "time": 1521484135892, "rating": 5.0, "text": "The heart center is a very nice place they make you feel so comfortable I love Dr McGraw and his staff", "pics": null, "resp": {"time": 1522156333036, "text": "Thank you for your kind words, Ms. Peeler. We appreciate you taking the time to leave a review for us!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "116763624525163633749", "name": "Matthew Goodwin", "time": 1549296104733, "rating": 4.0, "text": "Dr.Valtose is a very good down to earth Cardiologist that I Trust", "pics": null, "resp": {"time": 1549310872380, "text": "Thank you for taking the time to leave a review, Mr. Goodwin. Dr. Valtos has certainly been a great addition to our practice and to the community. We will make sure he sees your very nice comments."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "110201958691129601342", "name": "paw waw", "time": 1517972144776, "rating": 1.0, "text": "My mom just left this place in tears. She was told by her primary that she needed to have a stress test and echogram done. This is why he was sending her here. Dr. valtos didn't do any of this. Instead he took the results of some tests she had 3 months ago and, decided she needed to be on 3 different medications. She's done everything she could these last 3 months to avoid taking medications and, she was hoping these test results would reflect that. However THERE WERE NO TESTS done by Dr Valtos! This blows my mind. We just wasted money for him to tell her what she already knew? Not to mention the way he treated her was ridiculous. He didn't believe anything she told him. It seems to me that he was just to quick to judge and wanted nothing more than to push pills down her throat. Literally. I'm very disgusted with the way she was treated and, I will definitely make sure everyone I know knows how she was treated.", "pics": null, "resp": {"time": 1518473570010, "text": "Hello, Ms. Malenfant. We are sorry to hear that your mom's visit left you both upset. To help us further address your concerns, please reach out to our Customer Service Representative at (256) 801-6682."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "105469224814122336222", "name": "Charles Wildman", "time": 1450693790414, "rating": 5.0, "text": "Dr. Ridner has been my Cardiologist for more than 10 years. The more compliant I am with his advise the better my health is. Dr. Soliman installed my stint in 2005 and it has done very well for me. I couldn't ask for a better group of people to look after me from the schedulers to the nursing staff and of course the Physicians.", "pics": null, "resp": {"time": 1450711142189, "text": "Thank you for your feedback Charles!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "106201192621476795619", "name": "cheryl strickland", "time": 1435168154264, "rating": 2.0, "text": "Huntsville Hospital is a FOR PROFIT, PRIVATELY OWNED hospital who has to answer to stock holders. Therefore their profit margin is much more important than patient care and treatment.  Some of their policies reflect that also. For instance, if you go to the ER needing surgery, if there is not a DR. to do that surgery on duty, you will have to wait until one is scheduled if it \"probably\" won't kill you to wait.  My husband waited 3 days for an orthopedic surgeon for a spiral break in his femur, which is a very dangerous bone to break. It's where our blood supply is made and when broken, releases air bubbles and clots into the blood stream so he was kept on blood thinners for 3 days before major surgery.  Now, not only did the hospital get to charge us for those 3 extra days and all his normal medications, because you are NOT allowed to take your own from home, but they did NOT have to pay a surgeon overtime or vacation pay to come in when off duty, so we are cash cows to that hospital.  The nurses are horribly underpaid and badly treated, but with Huntsville Hosp. owning all hospitals for 8 counties, they really don't have a lot of choices. Most of the nurses were wonderful, however the Dr.'s, especially Dr. Wright, made us feel like our health was secondary to profit, pushing hard for procedures we are very hesitant about and offering no real evidence they would even help. In fact he told us straight out that it probably would not help, but it just might.  Just be aware the Dr.'s are Huntsville Hospitals life blood money and do your research, ask lots of questions, ask about safety and recalls for any hardware they want to implant. In our case the Defibrillator manufacturer was being sued in a class action suit because the leads were corroding and impaling the arteries, but they were still using these defibs and when we asked about them Dr. Wright's answer was, and I quote \"they all have problems\". Now that's not exactly comforting.  We told him we wanted to do some research and think about it, but that did not stop his office from calling us EVERYDAY for 3 weeks until I asked them not to call us ever again, we would call them if we changed our minds. Then we were told it was their job to \"recruit 12 to 18 surgeries PER DAY\".  Yes after 35 years of marriage, it is an \"us\" decision.  We both feel very uncomfortable with it all. We are going for a second opinion at Vanderbilt. I'll update and post what they tell us.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "107721292155397117795", "name": "Sky Queen Ce", "time": 1517958574402, "rating": 1.0, "text": "Jeanna in Scheduling needs a different departments other answering the phones. I called for help several times and she just sends me on a run around. To the last time I told her that I really needed help about getting my appointment schedule. She sends me to a dead end then I can't call back cuz it's after 5. Of course all this is because she just want to go home. Started this process today at 2 p.m. I call back at 4:30 only to get basically get the run around for 30 mins and hung up on.  Please pull the tapes. February 6th 2018. Not happy.", "pics": null, "resp": {"time": 1518473526085, "text": "We'd like to offer our apologizes that you didn't get the help you were seeking. If you need further assistance or would like to speak with someone about your experience our Customer Service Representative is available at (256) 801-6682 or customerservice@theheartcenter.md."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "107274309179293285132", "name": "Jim Gordon", "time": 1450020134482, "rating": 5.0, "text": "The Heart Center (THC) is responsible for some of the highest-quality medical care I've ever had.  From the scheduling, to the support staff, to the physicians, their care and professionalism have been uniformly excellent.  A few years ago, after experiencing \"the bends\" on a scuba trip to the Caribbean, I was tested at THC the day after returning to Huntsville.  After an ultrasound test, I was diagnosed with a \"patent foramen ovale\", or a hole in my heart.  Within a few days, surgery was scheduled, the hole was repaired, and I was home, feeling great.  I've had several other tests at THC, including a very successful cardiac catheterization.  I would heartily recommend THC to anyone who has, or suspects any cardiac issues.", "pics": null, "resp": {"time": 1450105223384, "text": "Hi Jim,\nThank you so much for sharing your experience. We appreciate your kind words."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "111386931083582009127", "name": "Juzt Kandi", "time": 1471537172541, "rating": 1.0, "text": "I called to schedule an appointment however once i got someone on the line she was clueless so she transferred to someone else ( FINE UNDERSTANDABLE ) Once i was transferred the lady answered my questions but she had an attitude then transferred me back to scheduling to make the appointment...As im in mid statement i just hear music playing the lady obviously didnt care i was talking so she transferred me to someone else...Needless to say i told the person how i had just been treated and i would be taking my money else where. Just plain RUDE !! Hope thats not an indication on their usual  behavior !! Would never ever ever go to this place !!", "pics": null, "resp": {"time": 1471546719177, "text": "We sincerely apologize that you were unhappy with your experience. Thank you for contacting us. The information you shared above will be passed along to our Customer Service Representative and management team. If you prefer to contact Heart Center Customer Service yourself, you may call (256) 508-5711 or email customerservice@theheartcenter.md."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "117360967572212065566", "name": "Lindsey Frost", "time": 1403034880182, "rating": 1.0, "text": "I was told that I would have to wait 2 and a half weeks for an appointment for a pulse that was above 120 for 2 days straight and horrible chest pains. I had called at noon and was told I just needed to wait and got called back at 4:56 and was told there was nothing they could do cause they were about to close. They said they would call me the next day, 5 days later still have not heard anything. I found another cardiologist at another facility that worked me in immediately given my symptoms and age. I got my meds changed and got a heart monitor. I was more than disappointed in the staff at The Heart Center, and will tell everyone I know. I was only given attitude when I stressed how important this was, like they could care less if I had a heart attack or not. And when I said I may just have to go back to the hospital they said \"well then you just do that then\", which needless to say did not help my pulse rate problem at all.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "111317365255479011101", "name": "Ashley Drewes", "time": 1449602655499, "rating": 1.0, "text": "STAY AWAY! The heart center is full of racist employees. I witnessed the white workers in this place mistreat their non-white employees using racial slurs and making verbally abusive comments to the employees. I should note I am considered \"white\" myself and found this very tacky and unprofessional behavior. I especially noticed one person, by the name of Tiffany,  making condescending remarks to one employee in particular who was not of the white race. Very disappointed in what I witnessed and would advise all to not do business here. I got up and left and never returned after that.", "pics": null, "resp": {"time": 1449604799769, "text": "Thank you for bringing this to our attention. The Heart Center's Customer Service Representative has requested that you call at your earliest convenience to ensure proper follow up: (256) 508-5711. For reference you may also email customerservice@theheartcenter.md."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "118006053628201249416", "name": "Kathy Sanders", "time": 1393964969787, "rating": 2.0, "text": "My Mother is a patience at the heart center and to date it has been a very unpleasant experience.  I am sure that the doctors there are great at their job.  I think Mother has had ok care.\nAfter several calls and no return calls back, we have managed to get the job done.  My Mother was in the hospital in January and ended up on a ventilator, the day she was released from the hospital the heart center was to come down and review her medication.  Never showed, but we had an appointment with her Doctor in a week so thought all would be good, but that appointment was changed, and then changed again.  Yesterday she went into see the dr and he had no idea what meds she was taking and what milligrams, are you kidding me, your nurse practitioner never showed up to review medications.  She is on coreg which needs to be taken two times a day, but the orders said one.  They changed her meds to hydralazine along with the coreg, the hydralazine is to be taken three times a day, but again the orders said once a day. Yesterday they took her blood pressure in the office and said it was 120/70, and my sister said that is strange. It has been running high, and she snapped back well not today.  Then the dr took it and it was 200/94, really.  On the way home from work last night my sister stopped to pick up meds and only one was there, a water pill, not the increased dosage of coreg or hydralazine.  Either this office is very incompetent or they have way to many patience.  Our Mother is very precious to us, and she has been through hell and back.  She deserves better treatment than this .", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "104257493432478120295", "name": "Tracy Schloss", "time": 1449682955264, "rating": 5.0, "text": "All of my experiences have been outstanding.", "pics": null, "resp": {"time": 1449698420198, "text": "Thank you for reviewing the Heart Center!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "104038490408778865800", "name": "Charli Hillis", "time": 1449682420577, "rating": 5.0, "text": "Dr. Allison always takes time and listens to me. Will definately be back!", "pics": null, "resp": {"time": 1449698389309, "text": "Thank you for the rating!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "114005382676703010048", "name": "James Gray", "time": 1511658343735, "rating": 5.0, "text": "A place where the staff actually CARE about the patients more than the almighty dollar!", "pics": null, "resp": {"time": 1511798128134, "text": "Hello, Mr. Gray. Thank you for the compliment and the great rating! We appreciate the opportunity to care for those in our community."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "111972857104421072908", "name": "C Witty", "time": 1507040038273, "rating": 5.0, "text": "Great doctor! Great staff!  Best I've ever been too in Alabama!!!!!!!!!!!!", "pics": null, "resp": {"time": 1507125331451, "text": "Thank you for choosing the Heart Center to care for you. We appreciate your kind words!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "107321204915505753498", "name": "David Milhollin", "time": 1428418473568, "rating": 4.0, "text": "These guys found a problem in my stress test - got me through some additional tests and then over to the hospital for a heart stint -- thank you", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "106200839604197640006", "name": "Trudy Johnson", "time": 1617653895075, "rating": 5.0, "text": "I’ve just had my first appointment and am so pleased to be a part of this practice. The staff is caring, professional, friendly, helpful, and attentive. Dr. Hunt’s training and experience is impressive as is his down-to-earth conversation. I highly recommend them to anyone with one of the multiple issues that treat!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "101324317680946162676", "name": "Albert Partridge", "time": 1626265426353, "rating": 5.0, "text": "Everyone at Alabama Vein Center were very professional and caring. I cannot say enough good things about Dr Hunt and his entire staff!!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "105711799448024933142", "name": "Joanna Garcia", "time": 1614293350674, "rating": 5.0, "text": "5 stars is not enough to properly rate the level of care I received here. I went today for my second surgery and still have 1 more to go. I do not tolerate pain very well yet I was surprised it was minimal. The facility is clean, comfortable and beautiful. Dr Hart is knowledge, professional and caring. The best part was my nurse Jodi. I panic when having anything done end she had a way of making me feel safe and secure that I can’t quite explain. I’m beyond for her and Kimberly both who cared for me going above and beyond.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "101658865086248834545", "name": "Sharon Bailey", "time": 1623272539719, "rating": 5.0, "text": "Whatever your needs are you will receive the best treatment.\nFrom the time you enter the office until you leave you will get the best care!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "106669368820977373250", "name": "Jamie Rosser", "time": 1622676621434, "rating": 5.0, "text": "It's not just Hormone  Therapy. It is very personalized. Changed my life.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "103532461030057149837", "name": "Amanda Bizjack", "time": 1619652227286, "rating": 5.0, "text": "Christina Hunt is an absolute artist. She microbladed my eyebrows and I couldn't be happier with the results. She step by step walks you through how she outlines them and makes sure you're comfortable. She is meticulous and will not let you leave without being absolutely satisfied. I've completed my touchup appointment and she was nothing but amazing during my second visit. I was very nervous to even get the procedure but she eased my nerves and reassured me throughout the entire process. If you're looking for the best, then look no further than Christina. I traveled in from Atlanta and would absolutely say she blows everyone out of the water with her quality of work. 10/10 recommend!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "105141586675944517075", "name": "Donna Rasmussen", "time": 1616823934521, "rating": 5.0, "text": "I have always had a very positive experience with each visit here & each surgical procedure. Also I continue to have great results from these procedures. I highly recommend Dr. Hunt & his team.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "105601949175141223241", "name": "Reagan Ray", "time": 1614346245459, "rating": 5.0, "text": "This is a top-notch group, in every way. All of the staff, and Dr. Hunt, is the best. I have been both a vein patient and a med spa client for the past 6 years. So glad to have found them!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "100271950319094953865", "name": "Emily Huffman", "time": 1614792937406, "rating": 5.0, "text": "Everyone that works in the Hoover office are so nice and welcoming. I have always received great care at this location and recommend Dr. Hunt and his practitioners!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "110812074562915901598", "name": "Becky Smithson", "time": 1616782196158, "rating": 5.0, "text": "The office staff was very pleasant and helpful. Visit was efficient and thorough!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "111397116533458745332", "name": "Nancy Smith", "time": 1608060100302, "rating": 5.0, "text": "I have used Alabama Vein for as long as I can remember to keep my legs looking good enough to wear shorts and skirts all summer. Everybody there is friendly, professional and very knowledgeable. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "112596110347375276550", "name": "lilmama 44", "time": 1614293705276, "rating": 5.0, "text": "Dr. Hunt and his Staff are wonderful! I was referred to him for venous insufficiency by my primary doctor. I am in the process of getting treatment for the venous insufficiency which has been Fantastic so far. I am also very Happy that Dr. Hunt and his Staff are so knowledgeable about hormones and other health issues; they have set me up with a health plan that will eventually help me with some terrible hypothyroid & menopause symptoms. I am ecstatic that Dr. Hunt understands how important it is for thyroid patients to have optimal levels to feel better. I am overjoyed that my primary physician referred me to Dr. Hunt, I feel like he & his staff are not only are helping me with venous insufficiency issues but also my thyroid and other hormone issues are being addressed and will eventually be at the optimal levels.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "108065336658340240157", "name": "Tabatha Ross", "time": 1617187665888, "rating": 5.0, "text": "Dr. Hunt was very knowledgeable about my varicose veins and treatment options. I will give another review after I have the procedures.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "107650869474000934472", "name": "Kirk Price", "time": 1611682999578, "rating": 5.0, "text": "Always very engaged and willing to take time to answer questions and make solid recommendations.  I love how they follow up after as well, great folks!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "115221557343781851959", "name": "D J", "time": 1614165676090, "rating": 5.0, "text": "Very well looked after and feel comfortable even if you feel uncomfortable.  Staff are very sweet.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "117915260957584789707", "name": "Carolyn C Clark", "time": 1601763766926, "rating": 5.0, "text": "The staff was very friendly and helpful. Dr. Hunt and the nurse did an exceptional job of answering my questions and explaining the procedure used to treat varicose veins. I feel very encouraged to expect relief from the pain in my legs! I wish I had gone to see them sooner.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "108128325221267660858", "name": "Chris Duncan", "time": 1611334458787, "rating": 5.0, "text": "Very thorough evaluation on needs and worked fast to get things moving.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "107800048562624731299", "name": "Rachael Ray", "time": 1622573402588, "rating": 5.0, "text": "Love jamey! I recommend her to everyone", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "108107360857881280632", "name": "Sharon Repp", "time": 1594318635646, "rating": 5.0, "text": "I have had 2 varicose vein surgeries on my legs and will have another next week.  Everyone is kind, efficient, and very clear with instructions.  The operating room is state-of-the art.  No complications or really much pain -- I'm doing great!  I highly recommend AL Vein & Restoration Medspa for varicose vein treatment.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "110549283949063962917", "name": "Joanne Williamson", "time": 1608509336862, "rating": 5.0, "text": "Beautiful facility. Everything was handled well and very satisfied with procedure to get spider veins under control.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "100178466934180738267", "name": "Terri Connor", "time": 1596040479174, "rating": 5.0, "text": "I got a facial from Jamie and she did AMAZING. The best facial I’ve ever had. So relaxing. Highly recommend and she will be doing all of my facials from now on. Love her!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "107308218053032005281", "name": "Crystal Newton", "time": 1611173334773, "rating": 5.0, "text": "The staff at the Vein Clinic are so nice and friendly! They called and checked on me after my surgery. I have had a great experience there. Dr Hunt is great as well as all of the staff. I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "115577112453150740074", "name": "madeline bromley", "time": 1614272217114, "rating": 4.0, "text": "I couldn’t ask for better care and nicer people. I recommend them to everyone I know. The entire staff makes you feel at ease. They are the BEST!!!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "105047235379873872120", "name": "Linda Penland", "time": 1608440014973, "rating": 5.0, "text": "Dr. Hunt is terrific, He took very good care of me and his staff is amazing.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "107537936859975131700", "name": "Sandy Gann", "time": 1611273797501, "rating": 5.0, "text": "Everyone from the front desk to the people in the procedure room are especially nice and polite. I felt very comfortable the whole time I was there which is not usually the case when having a procedure done. Will definitely recommend to anyone", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "103844552175301342789", "name": "Jimmy E.Webb", "time": 1600361094099, "rating": 5.0, "text": "The staff was kind and courteous. The medical procedure was efficient and effective. I have no complaints.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "108741914854811587095", "name": "Sharon Bell", "time": 1583259661248, "rating": 5.0, "text": "Dr. Hunt and his staff are awesome and their facility is outstanding!  All are extremely professional and at the same time they couldn't be more pleasant and accommodating.  After two years of swollen legs and feet I was referred to Dr. Hunt who diagnosed me with with Venous Reflux and after several procedures I am well on my way to a complete recovery. At my initial  visit, Dr. Hunt took a lot of time to fully explain my condition and exactly how  it would be treated.  On top of that, Dr. Hunt sent a personal detailed email to me fully explaining Venous Reflux and its treatment. Visit their website to see all the services they offer.  I highly recommend Alabama Vein & Restoration Medspa!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "100260878372620779189", "name": "Asia Alfred", "time": 1593201913940, "rating": 5.0, "text": "If I could recommend a million times, I would!! Everyone was so kind, from the two ladies at the front desk to Jamie who did my chemical peel! Jamie was very knowledgeable and kept me informed throughout the entire process and made sure I was comfortable.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "106065404484771682727", "name": "Lorrie Lewis", "time": 1603479380913, "rating": 5.0, "text": "Everyone always makes me feel so welcome and the new facility is absolutely beautiful.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "109967519583356109638", "name": "Charlotte Bridwell", "time": 1577985645468, "rating": 5.0, "text": "Dr. Hunt is amazing!! he has the most amazing staff, as well!! I have never been to a doctors office, where ALL staff members was extremely nice, caring and helpful. Everytime I had a procedure done, a staff member would call the following day to check on me. If I ever had a question or issue, and had to call them, they handled it right then, and I wasn't left wondering. I would HIGHLY recommend Dr. Charles Hunt. The facility was so neat and clean!!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "106867596217962041164", "name": "Roy Snead", "time": 1605209663411, "rating": 5.0, "text": "Great experience with Dr. Hunt.  Staff is very friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "103700177554304793139", "name": "Eddie Battles", "time": 1614617840536, "rating": 5.0, "text": "I am an old man. An honorably discharged disabled vet of the Vietnam era. The V.A. has repeatedly refused to repair my damaged legs. I've been in the system since 1981. They always tell me I have to live with it. But, the crew at the Alabama Vein Center explained everything, and were very nice in the process. I am looking forward to being pain free. Thanks to Doctor Hunt and his able, caring staff.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "101077425534812453414", "name": "Twyla Jones", "time": 1611687813593, "rating": 5.0, "text": "Jamie was responsive to my questions and concerns following a procedure. Thank you!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "116984058651247472646", "name": "Donna Layton", "time": 1614274566992, "rating": 5.0, "text": "Went in for a consultation for my varicose veins. Was very satisfied with the attentiveness of the staff and explanation given by my nurse and Dr. Hunt.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "113844227285186777774", "name": "Leslie Cude", "time": 1578762861266, "rating": 5.0, "text": "After having a horrific experience with vein ablation elsewhere, I swore I would never have it done on my other leg even though it really needed it. My experience with Dr. Hunt and his staff was the complete opposite of my previous experience. They genuinely care about their patients’ comfort and experience. They put you to sleep for the procedure so that the worst part is having to skip breakfast that morning. I cannot recommend them highly enough. I would not hesitate to do this again if needed.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "109628453146854203118", "name": "Danielle Morgan", "time": 1617038405784, "rating": 5.0, "text": "Very friendly and welcoming!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "118029557311565104201", "name": "jason b", "time": 1567622163218, "rating": 5.0, "text": "If I could give six stars I would.  The office and staff are absolutely  terrific, little to no wait, great people and nice atmosphere.  Sylvia is very knowledgeable and polite.  Never felt rushed or unimportant.  If you want to feel better about yourself, or healthier in general make an appointment.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "104493924032410127984", "name": "AMANDA ATCHLEY", "time": 1593014167546, "rating": 5.0, "text": "What a beautiful place to handle your skin care needs! The office staff and nurses were very friendly. I was very pleased with my service and look forward to my next visit!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "102767624872417703469", "name": "Kari Denard", "time": 1577815405426, "rating": 5.0, "text": "Just had my third vein treatment on my legs and I’ve been very pleased with my services so far. The staff have been superior in all areas! Can’t wait to see my results once I’ve healed in a couple of months!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "114268745748609937649", "name": "George Mathews", "time": 1596821418079, "rating": 5.0, "text": "Great Doctor and Staff, very knowledgeable and explained the next step procedures very well", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "112088396764353586080", "name": "Diane Darnell", "time": 1593093346691, "rating": 5.0, "text": "Dr. Hunt and his staff are top notch! They are all knowledgeable, caring, and compassionate.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "108564494261605875655", "name": "Barbara Hale", "time": 1589992427137, "rating": 3.0, "text": "Basically good. Had left leg done the week before. Came in to have the right leg done and the nurse started cleaning my left leg. I told her I had left leg done last week and was here fo do the right leg. If I hadn't spoken up no telling what could have happened. Scary.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "103053064663960465726", "name": "Bonnie Workman", "time": 1555081942716, "rating": 5.0, "text": "Christina has been helping me maintain my skin and my eyebrows for several years.  She strives to give me the very best outcome.  She is talented, professional and personable.  She takes the time to know me as a person, to analyze what I need and to apply her craft in an exacting manner.  She holds herself to a high standard and as a client I reap the benefits.  She has always gone above and beyond what I expect which keeps me coming back for her services even though it's a 3 hour round trip - well worth it!  Thanks, Christina", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "106388302407035016702", "name": "Brannon Lockhart", "time": 1574533670904, "rating": 5.0, "text": "Dr. Hunt and his staff are truly amazing.Dr. Hunt has always took the time to sit down and explained to me in details what I was experiencing. He is compassionate and cares about people something that is very rare these days!!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "105655260503816858338", "name": "Kim Jones", "time": 1611293185324, "rating": 5.0, "text": "excellent service and friendly staff", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "101432368018870374356", "name": "Wren Manners", "time": 1626214077082, "rating": 5.0, "text": "Dr Hunt and his staff were wonderful. I would not go anywhere else.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "110535220948421084050", "name": "Nikita Patel", "time": 1574530260312, "rating": 5.0, "text": "The staff at Alabama Vein & Restoration Medspa are super courteous & friendly.  They go above and beyond to accommodate the needs of their patients.  I highly recommend visiting them for any of your restorative needs!!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "101200595266270795868", "name": "Maryann Cash", "time": 1553099463234, "rating": 5.0, "text": "The staff is incredibly professional. Appointments were always on time. Each appointment had a follow-up call to check on me and they were very responsive about how to alleviate side effects of the vein treatments. They provide a great deal of information with each treatment to educate the patient. Overall, I've been very pleased!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "100506352306542799755", "name": "Karla Williams", "time": 1612151431154, "rating": 5.0, "text": "I've been seeing Dr. Hunt for almost a year now due to vein issues in both my legs. He has helped me so much. He doesn't just do surgery and send you on your way he continues to treat the issues to help you get back your life. Anyone with problems of swelling and pain in their legs knows what I'm talking about.   He and his staff are very professional and friendly.  They make me feel like part of their family and they care about me and my health.  I HIGHLY recommend them.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "106083691432584371030", "name": "Skip Smithwick", "time": 1608513778025, "rating": 5.0, "text": "Great doctor, staff and excellent results", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "109949949260948567065", "name": "Melissa Aultman", "time": 1522899441437, "rating": 5.0, "text": "Awesome group of medical staff! Professional and informative. Always make you feel comfortable and at ease. Dr Hunt is amazing! I have had both legs done with great success and quick recovery. They called to check on me the next day after surgery. Best decision ever!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "110587808177516953051", "name": "Keith W", "time": 1622229788880, "rating": 5.0, "text": "My mom was the patient at Alabama Vein & Restoration Medspa at the Prattville, AL location. Dr. Hunt and his staff were excellent! Everyone was friendly and explained what they were doing with my mom. They worked her in for an appointment because she had an emergency due to an accident. We were very impressed with the entire staff from the office to Dr. Hunt. We highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "100463288931774006141", "name": "Gina Durham", "time": 1578764023371, "rating": 5.0, "text": "As usual everyone was very sweet. I had very little wait time for my appointment. Jamie laughs at me when I say ouch before she injects my veins and  she  doesn't comment on my singing during the procedure.It was well worth my 2 1/2  hour drive.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "118234814181711772336", "name": "Cathy Cook", "time": 1558024911710, "rating": 5.0, "text": "I had my eyebrows microbladed last week and it was a great experience! Christina spent a lot of time going over all the details, explaining the ins and outs, and making sure I understood everything and was comfortable with proceeding. It was a wonderful experience and I highly recommend it! I have gotten lots of compliments on my eyebrows, too!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "112599088581083356766", "name": "Cassandra Harris", "time": 1563557011418, "rating": 4.0, "text": "I had vein surgery and everything went well, but the time that they give you to recuperate isn't good.  They say you can go back to work or they give you 1 week to recuperate, and you have to ice and heating pad, how can that be effective when, how is it possible to do that at work. I think the down time should be as long as you have to wear the compression hoses.  Walking can be done at home.  Also dis-appointed that the compression hose can't be purchased throw the office with insurance, because insurance does pay for it...", "pics": null, "resp": {"time": 1563812917203, "text": "I'm pleased you were happy with your procedure, however, I'm disappointed you were dissatisfied with the other aspects you mentioned.  Customarily post procedure, most everyone returns to work and daily activities the very next day or two at the latest.  We understand not everyone recovers the same, additional time to to feel back to normal may be warranted.  We would have been more than happy to extend your time off with a work excuse...not a problem at all.  If you experience post procedure discomfort, you are welcome to try heat or ice to the area that is bothering you.  Yes, this would be difficult while at work, this is intended to be done while resting at home.  Compression hose is to be worn for 2 weeks following the ablation procedure.  We want you to resume walking and regular day to day activities within the next day or two at the latest while wearing the compression hose, just not strenuous exercise or running for 2 weeks.  This will aid in your recovery and prevent post procedure swelling plus minimize the risk even further for blood clots.  We don't want you to sit around not moving for 2 weeks, that will only prolong the recovery process.   Compression hose is covered by only 1 of the 50+ insurance companies that we accept....and only on a case by case basis with that one carrier....after we submit your medical records for review by the insurance investigator.  The majority of the time this charge is denied.  We charge the patient for the compression hose up front, if insurance happens to reimburse us for the hose, we will refund the purchase price to the patient immediately.  Unfortunately, this happens only 3-4 times a year.  Some patients attempt to recover the charge on their own by submitting the charge....they are sometimes successful, however, it is only with the one insurance company.  I promise you will receive a reimbursement for the hose if we receive a reimbursement from the insurance company.  Again, I'm terribly sorry you are disappointed.....we would be delighted to meet with you in the office to discuss your concerns.  I appreciate you taking the time to review us....we strive to be a dedicated center of excellence.  Reviews help us improve our patient care and office policy. If we can be of further assistance, please do not hesitate to reach out to us at 205.823.0151 or to me directly at the info below.  Have a great day.\n\nZeke Eldridge\nPractice Administrator\nzeke@alabamaveincenter.com\ndirect: 205.716.6050"}, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "114095932800333369698", "name": "Brandi Bishop", "time": 1522780444672, "rating": 5.0, "text": "The staff is extremely knowledgeable and their bedside manner is excellent.  I had 3 vein procedures and each time i was taken back with in 5 minutes of my arrival and was on my way home an hour or so later.  They also gave me a follow up call the next day to check on me which is not uncommon but impressed me given it was on a Saturday. I have been pleased with the results and would recommend Dr. Hunt and his staff to anyone.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "109393228882042011805", "name": "Caleb Halstead", "time": 1553201195236, "rating": 5.0, "text": "Everything from and at the Alabama Vein & Restoration Medspa was handled efficiently, effectively and to my complete satisfaction.  This was the second time I have had to have procedures performed on varicose veins in my legs.  The first time was handled less than effectively at a different provider.  Dr. Hunt and his staff are totally professional and effective.  The pleasant atmosphere only increases the relaxed and comfortable environment.  I have nothing but good things to say about my experience while in their care.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "113519977381980619742", "name": "Chryssa Payne", "time": 1530311948466, "rating": 5.0, "text": "Sylvia makes the visit so much easier! Great personality & is wonderful at her job. This is ,by far ,the best experience I have had with the procedure I had done.   The entire staff is great from check in to check out. I would highly recommended this beautiful office.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "103504668677897579182", "name": "Pam Bruner", "time": 1594385350999, "rating": 5.0, "text": "All of the staff front the ladies up front to the ones that actually did the procedure were kind, pleasant and professional. I had a good experience and recommend them and will go back if needed.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "112380150823745899329", "name": "dawnm61767", "time": 1559297172146, "rating": 5.0, "text": "My first visit went well. They all are extremely professional and curtious.  The Dr knew exactly what is going on with me and how it needs to be treated. 10 months I have been going through a living nightmare. This seems to be the beginning of the end of it. I’m so grateful. I would highly recommend them to everyone.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "117224750851251647035", "name": "Joyce Reid", "time": 1530367052465, "rating": 5.0, "text": "I have used the services at Alabama Vein Center three times. The office staff are very helpful, patient, and courteous. From the technician, nurses, Dr. Hunt, the process of testing, surgery, and recovery were handled with confidentiality, dignity, and complete comfort. Dr. Hunt is very professional, yet has a great bed-side-manner. He throughly explained the complete process, was not rushed, and answered any  questions, or concerns. I could not ask for better treatment, and highly recommend their service.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "101355381774069330425", "name": "Rebecca Duncan", "time": 1553129885541, "rating": 5.0, "text": "I received a lash lift & tint from Jamie, and I LOVE the results!! I will definitely be back to keep up the look. Jamie was great—she took time to answer all of my questions and put me at ease!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "114789441287849661374", "name": "Sandra Flummer", "time": 1626552717208, "rating": 5.0, "text": "I’m was treated with care and professionally.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "108530924117877233276", "name": "Michael Janowiak", "time": 1538427014380, "rating": 5.0, "text": "My overall experience with Dr. Hunt and staff was great! In April, I arrived at his office with 50 plus varicose veins in need of ablation. I am an active person and suffered from frequent leg pain, swelling, soreness, etc. Throughout the process and multiple procedures, I was well taken care of and appreciated the professionalism of the staff. Four months after the procedure, I completed a 65 mile  and 102.3 mile bike race without any leg pain. My legs feel and look fantastic and I can’t thank Dr. Hunt enough for the difference he made in my quality of life.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "117788216127644379554", "name": "Nancy Crumpton", "time": 1530310635273, "rating": 5.0, "text": "I have had multiple surgeries by Dr. Hunt at the AL Vein Center  over the course of about eight years. I have recommended him to a good many friends through the years who have needed procedures or surgery, and all have told me how much they appreciated having the referral. Everyone at the practice is professional and patient-centered. Dr. Hunt is a 'stellar' surgeon and one of the most caring I have known. Five stars for sure!!!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "115651597083206045132", "name": "Martha Smith", "time": 1583514124746, "rating": 5.0, "text": "I’ve been very pleased with all procedures at AV&V.  I’ve had skin pin on my face and neck, and IPL on face and neck, hands and forearms. I’ve had wonderful facials with dermaplane,  and have had great results from Voluma, Juvéderm, Volbella, and Botox.  Christina Hunt and Dr. Hunt work together on this and I have complete confidence in both of them.\nI think the biggest step for me was Microblading my brows. It’s made a real difference in my appearance.  Christina is a true artist and a kind and supportive professional. She makes suggestions, knows what we don’t, and her work is beautiful.\nMost of my life, I didn’t have resources or time to pay attention to my skin.  Now that I’m 72 years old and Christina has been working with me the last four years, my skin is much improved.  No matter what your age or skin problems, Christina can make it better!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "101801125832927241403", "name": "Candice Traffanstedt", "time": 1530304474263, "rating": 5.0, "text": "Having vein surgery was the first surgery I've ever had. While I was a nervous wreck, Dr. Hunt and his staff has been absolutely AMAZING and very calming. They are all super sweet, well mannered and make you feel at home and at ease. I love this staff and I will recommend everyone I know to them!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "116687361708613586362", "name": "Laura Salter", "time": 1547150462476, "rating": 5.0, "text": "I think Dr.Hunt is fantastic he has to be one of the best doctor I’ve ever used! Most doctors these days treat people like a number.  I recommend him to everyone.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "110843161321161936924", "name": "Libby Taylor", "time": 1608661690848, "rating": 5.0, "text": "One of the most efficient well run doctor's office's I have ever been to.  The staff are very friendly and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "103469283256904234423", "name": "Brittany Patterson", "time": 1522798836277, "rating": 5.0, "text": "I loved Alabama Vein Center. I went there for Schlerotherapy for spider veins. I had a very pleasant experience. The staff was very kind and professional. I loved Sylvia Eldridge. She did a great job and made me feel very comfortable. I would definitely recommend this place to others.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "110046270665323296095", "name": "Heather Neighbors", "time": 1596316048879, "rating": 5.0, "text": "Excellent care as always! The providers and staff are kind and professional.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "117736885448862782159", "name": "Ed Willcoxon", "time": 1522771525276, "rating": 5.0, "text": "I am very thankful for Alabama Vein Center. I had very successful leg surgeries with minimal pain. Dr. Hunt and his staff were very friendly and knowledgeable about my condition and the procedure. My legs are now back to normal and feel better than ever!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "106828982828475041596", "name": "Lavora Phillips", "time": 1590090809676, "rating": 5.0, "text": "My legs hurt almost every day until I had vein therapy done. Now my legs hardly ever hurt\nIs such a relief!!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "111431523859423106816", "name": "Happy Lady", "time": 1614573503655, "rating": 5.0, "text": "They are the best", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "111374411983399422207", "name": "ray burns", "time": 1573409322224, "rating": 5.0, "text": "Very informative, very knowledgeable, the staff is always very polite. They are willing to work on the patient’s schedule.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "117000775345227616668", "name": "Roxie Lee", "time": 1513363943354, "rating": 5.0, "text": "From the first phone call to the final exam to make sure I had healed correctly I felt I was receiving top notch quality treatment from caring people. Everyone was knowledgeable and answered any and all questions I had. Treatment was smooth and pretty painless. I would recommend them to friends and family!!!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "111411467651646198335", "name": "Elaine Price", "time": 1522847042557, "rating": 5.0, "text": "Wonderful, wonderful, wonderful! I’ve had 3 procedures here and would not go anywhere else. After my family moved to NW Alabama, I still drive back to Birmingham to have my veins checked. I recommend them to family, friends, and random people all the time!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "106146140350326147042", "name": "Charlie Williams", "time": 1573499831925, "rating": 5.0, "text": "Everybody was so kind & generous with their time. Very Happy with this Clinic", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "100249628318381692614", "name": "Mary Park", "time": 1547141976673, "rating": 5.0, "text": "My husband and I always receive the best of care at Alabama Vein Center.  Dr. Hunt and the entire staff always go out of their way to help in any way possible.  We highly recommend Dr. Hunt for any needs in his speciality expertise knowledge.  God bless you.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "103026592376042535963", "name": "Jessica", "time": 1530324640151, "rating": 5.0, "text": "After having a truly nightmare of a surgery and being in traumatic pain with no help, I reached out to Alabama Vein Center and for a second opinion and was seen the same day! The staff was very kind, hugged me through my tears, reassured me numerous times they were there to help me any way possible. Dr Hunt has been the most down to earth, friendly and genuinely concerned doctor. He has never rushed me, he explains things until I completely understand the process and my health conditions. Dr Hunt shared personal experiences and stories with me. He presents himself as a Christian and extremely knowledgeable physician and surgeon. He took over my care after a flawed surgery with another surgeon, showed GREAT compassion and concern and is correcting my health issues. I could not ask for ask for a better doctor or staff. They have made time to speak to me each time I've called, they call to check on me, they even gave me their personal cell phone numbers! I HIGHLY recommend Dr Hunt and his staff!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "117607385803643637260", "name": "Terri Perkins", "time": 1573382782010, "rating": 5.0, "text": "Great staff! The whole experience was 5 star", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "105476243039648584153", "name": "Mike Mason", "time": 1559232232040, "rating": 5.0, "text": "Thoroughly professional, caring and efficient. Very pleased with the care I've received over the last 3 years.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "101493240918127124140", "name": "vallery Austin", "time": 1564272441909, "rating": 4.0, "text": "It was the best thing I can truly say the results from my surgery was successful very courteous and polite", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "110262378495154996221", "name": "Charlotte. Smith", "time": 1529617338845, "rating": 5.0, "text": "My husband had his second surgery recently.  He is beyond happy with the results so far. We have noticed his legs are not as swollen and color (blood flow) is returning. Staff and physician  are truly caring and assessible. We have had bad experiences  from previous  facilities  so we want you to know these people  are the best!!!!!!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "110920321562011135814", "name": "Adam Needham", "time": 1522774579132, "rating": 5.0, "text": "Dr. Hint and his team treated me with the up most respect. I had to have Vein Surgery. I fill great after all the surgery. I thank God for finding someone to care for me the way He and his team did. Thank you Dr. Hint and thank you great team.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "112398987599389376803", "name": "DeeDeeFresh1986", "time": 1522777659774, "rating": 5.0, "text": "I love AVC !! I had permanent eyebrows done. Christina is the absolute best. She is so intelligent, beautiful and talented. My brows are SEXY !!! While receiving my brows, Christina noticed dark marks on my ankles. She asked me some questions about my legs. And we soon found out I was having some blood flow problems in my legs. I am very thankful to know my vein issues can be repaired, and the surgery can be done in-office. Going to AVC is one of the best decisions I have ever made.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "105255082741833091174", "name": "Peggy Patey", "time": 1530312265385, "rating": 5.0, "text": "I have truly enjoyed my experience with both the staff and Dr Hunt!! They are very professional and are really concerned about their patients. I still have a little way to go but not much to have the issues completed but I can not tell you how much better my veins are! I'm so glad that I chose them for my needs and would gladly do it again ♥️", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "107866715675056139487", "name": "C Porter", "time": 1562087394124, "rating": 5.0, "text": "Brand new facility .", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNtuT2H7H7i_e5au6MS1NXTDTOPzQHPVvcjMs5A=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNeKRLRSRx9GPWXzXP36nREZzGQmngG0CoMggpq=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "115096433939259514095", "name": "Shelia McCluskey", "time": 1556492561657, "rating": 5.0, "text": "The staff at Alabama Vein Center has been a pleasure to deal with.  They do a great job explaining the procedures each time.  Very pleased!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "108163864651852078267", "name": "Chitra Desai", "time": 1579847319521, "rating": 5.0, "text": "Dr, Hunt was excellent in explaining the treatment.\nFriendly staff .", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "104187522346321344462", "name": "Robin Darby", "time": 1530580687141, "rating": 5.0, "text": "The staff at the Alabama Vein center are professional and friendly.  Dr. Hunt preformed three surgeries on my legs and I am very satisfied with the outcome.  I would highly recommend Dr. Hunt at the Alabama Vein Center.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "105767775570639088535", "name": "Rhoda Scott", "time": 1522809479554, "rating": 5.0, "text": "I was in today.  I met Dr. HUNT and several other people.  Everyone was very kind and answered many questions that I had.  I am looking forward for my legs to feel so much better after treatment,  Thank you.Happy Birthday to", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "114831318817405449503", "name": "Katherine Houston", "time": 1617072296042, "rating": 5.0, "text": "Everyone was very accommodating and made my experience all I had hoped for.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "109934228560295247413", "name": "molly roberts", "time": 1562526023989, "rating": 5.0, "text": "I travel three hours for Christina Hunt to work on my eyebrows. She is incredibly knowledgable and her work is perfection.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "105951483979973375057", "name": "Kenny H", "time": 1530307161362, "rating": 5.0, "text": "The staff is courteous and professional. Dr. Hunt is very knowledgeable and will probably tell you more than you care to know. ☺", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "100943197408532676505", "name": "Patricia “Patti” Long", "time": 1562172851730, "rating": 5.0, "text": "Dr. Hunt is a very compassionate doctor who knows his field. I would highly recommend him to anyone who has problems with their veins or lymphedema.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "106566765308577047753", "name": "james brogden", "time": 1444673081631, "rating": 5.0, "text": "I had my vein surgery here with Dr. Hunt. He was exceptionally knowledgeable and explained the procedure very well. He is extremely nice and his staff is so helpful and nice. They really took their time with me and made me feel very comfortable.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "109759712195467246433", "name": "Alonzo Cutler", "time": 1590097904459, "rating": 5.0, "text": "Professional, friendly & caring service.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "113971093247050671204", "name": "William Cook", "time": 1605546495041, "rating": 5.0, "text": "Dr. Hunt's staff is always great to work with.  They care about your time and always so nice.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "113521484325180072173", "name": "Tami Folio", "time": 1553191438925, "rating": 5.0, "text": "Made you feel comfortable and did a very fantastic job.legs look and feel tremendously grest.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "101995046772524765537", "name": "jimmy shiver", "time": 1542578361364, "rating": 5.0, "text": "I have used Dr. Hunt numerous times and I am very pleased with the results  and really appreciate the staff. I travel from Dothan and use the facility in Prattville.The trip is well worth it. Jimmy Shiver", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "112236459317024448707", "name": "Debbie Nations", "time": 1530304397434, "rating": 5.0, "text": "Professional, caring and told me what to expect.   I felt very well taken care of and all questions were answered.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "107336616720173869680", "name": "Michael Pearson", "time": 1576161647126, "rating": 5.0, "text": "Great group of professional people.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "111668250074694011688", "name": "icebychefdave", "time": 1583165130792, "rating": 5.0, "text": "Great staff and care.  Thank you!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "101912935954607535454", "name": "Mary Stewart-Aiken", "time": 1530632146056, "rating": 5.0, "text": "I had the most pleasant experience at AVC!  Their professionalism and expertise are wonderful.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "102938180601649805306", "name": "Diane Freeman", "time": 1530314854750, "rating": 5.0, "text": "Everyone was very nice, did not have a long wait.  Very good visit", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "109947341587555504903", "name": "Sandra Lafferty", "time": 1522770760089, "rating": 5.0, "text": "This is a very professional office with well-trained staff. Always enjoy a visit with these people.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "115736351612092887682", "name": "Barbara Leis", "time": 1530315910945, "rating": 5.0, "text": "All of the staff,  and Dr. Hunt were very cordial, professional, and yet at the same time, very friendly and personal about you and your needs.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "100881427194891941132", "name": "Letecia Boyd-Walton", "time": 1522780139281, "rating": 5.0, "text": "Dr. Hunt and his team are excellent and wonderful people. I had a bad experience with another vein \"doctor\" and Dr. Hunt and his team has helped me a long way. I am grateful for their services.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "113270457239171065141", "name": "Linda Dunaway", "time": 1530312618875, "rating": 5.0, "text": "I am getting ready to have my 3 procedure done on july 3 the staff is awesome and friendly and doctor hunt is amazing . thanks so much Linda dunawAy", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "117551307095897650470", "name": "Michael Burks", "time": 1522772038143, "rating": 5.0, "text": "I have been treated twice for spider vein treatment and they did an awesome job.  Such a friendly group of people!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "118438327797507936666", "name": "Donna Stoner", "time": 1544019139338, "rating": 5.0, "text": "Very considerate, courteous, efficient personnel!  Have had two ablations; have one procedure to go.  All this as a result of a DVT in my left saphenous vein & three PEs in early February.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "115485457839395146628", "name": "yvonne moore", "time": 1522781911940, "rating": 5.0, "text": "It was a great experience him and his staff was very kind and friendly, I would recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "107958650213270106473", "name": "Sherry Bambarger", "time": 1530763278738, "rating": 5.0, "text": "I had my procedure done about 2 years ago, I'm very happy with results and the friendly staff", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "105698436569394295108", "name": "CDA McElroy", "time": 1530450240387, "rating": 5.0, "text": "Have had spider veins treated for many years - was so happy with my visit to the Ala Vein Center - all of the folks were so kind and professional. My daughter is next!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "105057625881228940793", "name": "Sherry Amison-Ross", "time": 1522810298994, "rating": 5.0, "text": "My experience was Great !!! Awesome service staff members are really great, nice, in very friendly very warm welcoming...", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "103610777712575692006", "name": "Owen Stayner/ThisWorkplace360", "time": 1557959235477, "rating": 5.0, "text": "Excellent employees here in a beautiful setting!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "110023397156022105183", "name": "Breanna Cox", "time": 1547143757185, "rating": 5.0, "text": "I could not be happier with the treatment I have had on my legs over the past three years.  Absolutely amazed with the results.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "100459339354904351294", "name": "Felicia Pace", "time": 1553378401723, "rating": 5.0, "text": "Dr Hunt and his staff are the best!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "115630548076316303996", "name": "Vicky Hopson", "time": 1565368183286, "rating": 5.0, "text": "Every one was friendly, told me exactly what was being done, what will be done.  This was my first time at the Prattville Office", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "112625105897587039501", "name": "Leonda Hardy", "time": 1522783222843, "rating": 5.0, "text": "Dr. Hunt and Staff were wonderful Durning my visit.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "111109119406665403944", "name": "Mark Smith", "time": 1578143187648, "rating": 5.0, "text": "Everyone was first rate and did what they promised!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "113383257452736616910", "name": "mf law", "time": 1530316114619, "rating": 5.0, "text": "I had a vein procedure at the Alabama Vein Center it was a pleasant experience and I am glad to say it took care of my problem and pricing is very reasonable.", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "102689010306080980945", "name": "Ashley Bryant", "time": 1530318657979, "rating": 5.0, "text": "I had my vericose vein removed and I am extremely pleased with my results. Friendly staff!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "109641883837853113469", "name": "Mark Stribling", "time": 1556297986957, "rating": 5.0, "text": "Professional, A good experience", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "116820298652401585254", "name": "Vicky Cardullo", "time": 1530305301441, "rating": 5.0, "text": "Awesome facility!", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "116676276923293113681", "name": "Dale Daniel", "time": 1542504307112, "rating": 5.0, "text": "Punctual, efficient, informative", "pics": null, "resp": null, "gmap_id": "0x8889191cc43fbc3d:0xd4bfca5804e058ad"}
{"user_id": "103067280062003932732", "name": "Chad kiper", "time": 1614896606082, "rating": 5.0, "text": "Hands down the most friendly office I've visited. Dr. Lyons was great. His staff were super awesome? A+", "pics": null, "resp": null, "gmap_id": "0x889a4e06a68bf3bb:0x3e6a609f70c4d881"}
{"user_id": "114666535871615942799", "name": "Helen Nixon", "time": 1475587150006, "rating": 5.0, "text": "To be told you need to see a vascular surgeon is a scary thing, even for someone in the medical profession.  Dr Rose (as well as the other doctors I have interacted with as a RN) and her staff CTVSA were very kind and reassuring to my wife and myself. They made sure we understood what was happening and what the next step was to be. Dr Rose and Molly made things much easier for me.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO3RAhBX_2I7C2zKIj57mGmOqqd3a5qkSHTmc3W=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4e06a68bf3bb:0x3e6a609f70c4d881"}
{"user_id": "108009525173876670185", "name": "Anil Vashi", "time": 1620676710872, "rating": 1.0, "text": "Beware about those hidden costs. Before my procedure i  did ask Dr Melanie Rose to get this procedure approved by my carrier without any surprise since i am on Medicare  and fixed income thus i got billed for another $195 needless to say ultrasound costs charged twice since the results were conflicting due to the outdated and unreliable equipment and also the pain associated with this. To supplement this the dressing broke loose before i got home due to the nurse incompetency. All my complaints left ignored by the staff in the meantime Mobile Infirmary is also to blame for this unacceptable behavior", "pics": null, "resp": null, "gmap_id": "0x889a4e06a68bf3bb:0x3e6a609f70c4d881"}
{"user_id": "114350199714594267479", "name": "Addie Brockly", "time": 1615233989935, "rating": 5.0, "text": "DR McGee saved my life no doubts about it. I thank God I was sent to him very perfectional and kind caring Doctor.", "pics": null, "resp": null, "gmap_id": "0x889a4e06a68bf3bb:0x3e6a609f70c4d881"}
{"user_id": "109259726657896942541", "name": "Ashley Fleming", "time": 1593121111840, "rating": 5.0, "text": "Dr. Daniel's performed absolutely fantastic on my  right pneumonectomy. The fact that I am still here 7 years later attest to the fact that he went far above his already high standards to preserve my life. I would very highly reccomend  him to anyone!!!", "pics": null, "resp": null, "gmap_id": "0x889a4e06a68bf3bb:0x3e6a609f70c4d881"}
{"user_id": "108147189318488233761", "name": "Chuck Purcell", "time": 1582894915670, "rating": 2.0, "text": "Just make sure if he mentions lung cancer, Get A Second Opinion. It seems that not to many can tell the difference from lung cancer and pneumonia until you are missing a piece of your lung or all of it. I went from a supposed health issue to a real health issue since I now have been diagnosed with COPD since part of my lung was removed.", "pics": null, "resp": null, "gmap_id": "0x889a4e06a68bf3bb:0x3e6a609f70c4d881"}
{"user_id": "112024404093509722998", "name": "Melinda Boggs", "time": 1606160690866, "rating": 5.0, "text": "I couldn't have asked for better care than what Dr. Johnson gave me. I'm alive today because of that man.", "pics": null, "resp": null, "gmap_id": "0x889a4e06a68bf3bb:0x3e6a609f70c4d881"}
{"user_id": "107957238482742987977", "name": "teresa boggs", "time": 1471977313114, "rating": 1.0, "text": "This group has the absolute worst patient care I have ever experienced. They are slow and unresponsive. Surgery was adequate but patient care was nonexistent.", "pics": null, "resp": null, "gmap_id": "0x889a4e06a68bf3bb:0x3e6a609f70c4d881"}
{"user_id": "104952598529365204288", "name": "Tammy Brewer", "time": 1618021652296, "rating": 5.0, "text": "My husband was really knocking on deaths doors. With Dr. Sapkota he has him almost as good as he was before his problems occurred. I owe him and his staff a big thank you. I know without them I would of had a long hard road ahead of me. Thanks you Doctor Sapkota and Doctor Khan that is also in the same office.", "pics": null, "resp": null, "gmap_id": "0x887d49db0790c6af:0xf5fc8d034db846c9"}
{"user_id": "102807919571195909151", "name": "The Mad Splattr", "time": 1608652263767, "rating": 1.0, "text": "Turned away at the door for being more than 15 minutes late, even though we called ahead and spent about 20 minutes looking for a wheelchair that we were assured were by the entrance (they were not). We drove over an hour to get there only to be turned away, despite us having called ahead to discuss the situation. My grandmother is practically bed bound, yet we managed to get her out.", "pics": null, "resp": null, "gmap_id": "0x887d49db0790c6af:0xf5fc8d034db846c9"}
{"user_id": "104545197305935424730", "name": "Tim Baldwin", "time": 1605387048234, "rating": 5.0, "text": "Good experience he cares about his patience health", "pics": null, "resp": null, "gmap_id": "0x887d49db0790c6af:0xf5fc8d034db846c9"}
