{"user_id": "105118998872393597884", "name": "Jessica Tadlock", "time": 1622321391807, "rating": 5.0, "text": "Very beautiful grounds!  Dad seemed well taken care of.", "pics": null, "resp": null, "gmap_id": "0x889a61f6cf3e7db1:0x2da9ff810190d4ae"}
{"user_id": "103835412286812319627", "name": "Jennifer Terrell", "time": 1628727250405, "rating": 5.0, "text": "It's a GREAT place to worked.", "pics": null, "resp": null, "gmap_id": "0x889a61f6cf3e7db1:0x2da9ff810190d4ae"}
{"user_id": "103353267942057530049", "name": "Kenneth Bishop", "time": 1628197876424, "rating": 4.0, "text": "Visit we my dad it was great", "pics": null, "resp": null, "gmap_id": "0x889a61f6cf3e7db1:0x2da9ff810190d4ae"}
{"user_id": "111554096339011373604", "name": "MrsLDC1", "time": 1597772170697, "rating": 5.0, "text": "🗣They are very cordial and welcoming. They take awesome care of my father in law, He resides there. KEEP UP THE GREAT WORK TO ALL THAT WORK THERE!! 👍👍💞", "pics": null, "resp": null, "gmap_id": "0x889a61f6cf3e7db1:0x2da9ff810190d4ae"}
{"user_id": "105385539837273140967", "name": "Charlie Welch", "time": 1604435272412, "rating": 5.0, "text": "Had a good visit with my Dad! The facility looks great!", "pics": null, "resp": null, "gmap_id": "0x889a61f6cf3e7db1:0x2da9ff810190d4ae"}
{"user_id": "114580444778943350034", "name": "Cheryl Hatter", "time": 1575757203567, "rating": 5.0, "text": "If I could give this wonderful place 10 Stars I would!! Our dad, well, he is my father in law, is in the most caring hand anywhere❤️ Pops is a very fine gentleman, and he loves his nurses and friends there. They share stories, they eat together in the dinning room, there is a chapel, gardens and more. It warms our heart to know that Pops is here and happy. The entire place is clean and very well managed.\nGOOD JOB W.F. Green❤️👍", "pics": null, "resp": null, "gmap_id": "0x889a61f6cf3e7db1:0x2da9ff810190d4ae"}
{"user_id": "105141386053490751835", "name": "Jim Waters", "time": 1594500296432, "rating": 5.0, "text": "Today's world is different than it was 6 months ago but I still rank the care that my father receives is  great.\n\nBrian and Kathy are fantastic in guiding the care and well bein of the residents", "pics": null, "resp": null, "gmap_id": "0x889a61f6cf3e7db1:0x2da9ff810190d4ae"}
{"user_id": "115853470607710304132", "name": "Hornaday quickfire", "time": 1596599882380, "rating": 5.0, "text": "This is one of four Alabama veteran's homes. This by facility has a caring staff that provides excellent care.", "pics": null, "resp": null, "gmap_id": "0x889a61f6cf3e7db1:0x2da9ff810190d4ae"}
{"user_id": "102645050826364427351", "name": "Wanda Saunier", "time": 1502826370909, "rating": 2.0, "text": "Still have my concerns; everyone seems to be great but I don't understand why my father has been given medicine that he wasn't to have & put him in the hospital, or how long would he have gone w/out eating if family had been there to feed him then later another member by phone knew he was in trouble? ?? How long had it been going on &off to where this time it was not the easiest nor short term fix. I'm not putting anyone there down,  but perhaps Mr. PRESIDENT,  you will allow sufficient funds for those who have served this country only to have so many promises already broken to them.", "pics": null, "resp": null, "gmap_id": "0x889a61f6cf3e7db1:0x2da9ff810190d4ae"}
{"user_id": "116853977435792432519", "name": "Concerned Employee", "time": 1537521576342, "rating": 1.0, "text": "As a former nurse at this establishment. I've seen a lot going on that we nurses aren't told to talk about. From improper training, to the ungodly amount of gossip from every wing to leaving the paitents continuing to wait even after they signal help. This place is also heavily booked and understaffed.. You have wings that literally have one helper to 30+ppl.  The CNA's sit on their phones unsupervised even sleep during the night. The security there have no authority what so ever, they scrub chairs and check temperatures leaving our cars unprotected. Even if they do their rounds they're forced to do some other meaningless task bestowed upon them because of Gossip. Meaningless tasks that doesn't help anything. CNA's can clean chairs.. If they have time to sleep and play on their phones they can do this tasks. Overall i am disgusted with this place and i am thoroughly done.", "pics": null, "resp": null, "gmap_id": "0x889a61f6cf3e7db1:0x2da9ff810190d4ae"}
{"user_id": "104163659374804275164", "name": "Chasity Powe", "time": 1519917107239, "rating": 5.0, "text": "The facility is odor free!!!", "pics": null, "resp": null, "gmap_id": "0x889a61f6cf3e7db1:0x2da9ff810190d4ae"}
{"user_id": "111871879382734220122", "name": "casonya portis", "time": 1529873480473, "rating": 3.0, "text": "It just okay.", "pics": null, "resp": null, "gmap_id": "0x889a61f6cf3e7db1:0x2da9ff810190d4ae"}
{"user_id": "107141752167952365720", "name": "toni mcmillan", "time": 1547754094598, "rating": 5.0, "text": "21 years of employment", "pics": null, "resp": null, "gmap_id": "0x889a61f6cf3e7db1:0x2da9ff810190d4ae"}
{"user_id": "110614043025173186001", "name": "sean schofield", "time": 1545336202834, "rating": 1.0, "text": "One star, I hate this place and the attitude that I don't matter and if I don't like this free thing I get there, then I can just go somewhere else. Between one place saying one thing and sending you to a complete different place, only to have that place tell you you don't have any business they can help you with.\nHow about having receptionists that look at you like work? Or a hasstle because you don't want anything easy?\nIt's a never ending sea of disappointment and dissatisfaction that I drown in every time I have to see them about a health issue. I'm 100% and have no job, no other option, that's why I hate this place so much, I'm stuck with it, and they know it.", "pics": null, "resp": null, "gmap_id": "0x88891bc796392567:0xa94def91c21e0f18"}
{"user_id": "104459988960881174782", "name": "GTA Gaming", "time": 1569175225714, "rating": 4.0, "text": "Quick service", "pics": null, "resp": null, "gmap_id": "0x88891bc796392567:0xa94def91c21e0f18"}
{"user_id": "104072589808373335119", "name": "Jerry Walton", "time": 1568574059751, "rating": 3.0, "text": "Ok service.", "pics": null, "resp": null, "gmap_id": "0x88891bc796392567:0xa94def91c21e0f18"}
{"user_id": "107952455304011822705", "name": "Matt F", "time": 1614276704941, "rating": 4.0, "text": "The VA has changed a lot over the past 10 years. I have had no issues in resolving anything I’ve brought to them. I always treat everyone the way I expect to be treated and have had no issues with any staff members that couldn’t be resolved on the spot.The four stars is based on the organization’s scheduling abilities. The one way they could improve customer experience is by helping customers understand the process. It’s not a state health facility where you just show up and treatment happens. There’s a process for everything and that can be frustrating. Thank you for what you do!", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20845ac5:0xd85db0ae4450fc10"}
{"user_id": "107013053090850750961", "name": "Keith Oates", "time": 1621871269905, "rating": 1.0, "text": "PATIENTS DESERVING THE HIGHEST CARE POSSIBLE,GETTING THE HELP FROM THE BOTTOM OF THE BARREL STAFF!!!! WELCOME TO Government hiring!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20845ac5:0xd85db0ae4450fc10"}
{"user_id": "109198318479708529445", "name": "Keith Cole", "time": 1623445637854, "rating": 5.0, "text": "Excellent customer service with claim rep...", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20845ac5:0xd85db0ae4450fc10"}
{"user_id": "106973122936720000616", "name": "David Williams", "time": 1602128670229, "rating": 3.0, "text": "I will give this office 3 stars, but when compared to Baltimore Regional Office they are 5 stars. First VBA and VHA are different. The VHA side seems to very rude all the time. The social worker side is better. The VBA side is good and they try to do their job and get vets ratings. 370 k vets are in Alabama and 95k are disabled, so that's a 30% chance of getting your rating approved which is lower in other states.", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20845ac5:0xd85db0ae4450fc10"}
{"user_id": "102646245974267393162", "name": "Honey Hatcher", "time": 1586654468124, "rating": 1.0, "text": "This is the worst VA hospital ever. I took my father to the ED after his stroke and they had 4 guys load him into my truck and told me they could not do anything for him and to call the fire dept when i got home, even after i told them i do not live in Alabama. Recently the Chief of Social work dept refused to look into a program for veterans that has already been approved. This program would help ALL Vets with an extra budget for care, not the caregiver program and not the Aid and Attendance or homebound but a program with the Area Agency on Aging. Montgomery VA does not care about vets, they only care about their paychecks\n\nTHE VBA IS SEPARATE FROM THE VA - THE VBA HAS BEEN GREAT! Very helpful most times and the hold great Veterans Resource Fairs to help the vets with claims and other VA benefits.", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20845ac5:0xd85db0ae4450fc10"}
{"user_id": "107240952430923387638", "name": "Chris Bowden", "time": 1571936867994, "rating": 1.0, "text": "8 out of 10 representatives are extremely unprofessional, uncourteous, and most do NOT attempt to resolve issues. Veterans are treated as if it’s a waste of the representatives’ time. Sadly, when you ask to speak to a supervisor, you are prompted that there will be a 24-48 hour wait for a call back. My father has been dead for 14 months, and my mother has yet to receive a spousal death benefit payment. It’s nauseating that our veterans must deal with such inconveniences and constant delays - especially when each one willingly provided service to our country.", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20845ac5:0xd85db0ae4450fc10"}
{"user_id": "114668241339511690507", "name": "Marshall Vandeusen", "time": 1575755211420, "rating": 5.0, "text": "One of the few va's I went to in this country where things ran real smooth", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20845ac5:0xd85db0ae4450fc10"}
{"user_id": "108031348864353302400", "name": "Daffney Legston", "time": 1552494172009, "rating": 1.0, "text": "This is a horrible facility for Veterans to get help . My husband had questions and he didn’t get a good understanding, so I went back in with him for clarification from the Veteran representative and she was very unprofessional and she had a horrible attitude. The Govt. should hire people that want jobs, no Veteran should feel like they are a burden when asking for help. I will never forget the lady’s name.", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20845ac5:0xd85db0ae4450fc10"}
{"user_id": "104439824413307682783", "name": "Tamika Ashford", "time": 1475533804360, "rating": 1.0, "text": "I don't know where to begin. They have been screwing me over since 2012. They saw that I was going to be receiving 100% and deferred my mental disabled. Then turned around and claimed it was a mistake so both my percentages could be averaged. Which screwed me out of 100%. They don't do there jobs. I've seen them sitting around joking and leaving work, while documents pile up on there desks. When I finally got my mental diagnosis correct, a secondary mental disability was added. Again, I was screwed out of my rating on the secondary condition. Which I am still trying to get corrected. This regional office is horrible and unprofessional. If you can move and find a place with a better va system that will actually help you and get your benefits, DO IT! Do not waste your time here!", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20845ac5:0xd85db0ae4450fc10"}
{"user_id": "110909296862426360450", "name": "Ben Flowers", "time": 1524175401050, "rating": 5.0, "text": "Had a Vasectomy with, Dr. O'Donell, the best best VA doctor I've had the pleasure of being cut on by in a long time. Best visit to date.", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20845ac5:0xd85db0ae4450fc10"}
{"user_id": "102632774999082811768", "name": "Patrick Lindsey", "time": 1540929621532, "rating": 5.0, "text": "This place and these people take excellent care of me.  Zero complaints here!", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20845ac5:0xd85db0ae4450fc10"}
{"user_id": "103080974185716842675", "name": "C. Daniel Mobley", "time": 1497266045783, "rating": 1.0, "text": "They take forever to get anything done. And when they finally do get around to doing their jobs it's usually wrong.", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20845ac5:0xd85db0ae4450fc10"}
{"user_id": "117241069527178228728", "name": "Mark Berry", "time": 1538491605412, "rating": 5.0, "text": "I work there", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20845ac5:0xd85db0ae4450fc10"}
{"user_id": "115495309557898973331", "name": "Willie Berry", "time": 1545518357029, "rating": 5.0, "text": "Veterans getting help", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20845ac5:0xd85db0ae4450fc10"}
{"user_id": "105699082188121562212", "name": "Christopher Cordell", "time": 1525890581738, "rating": 1.0, "text": "They're a joke", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20845ac5:0xd85db0ae4450fc10"}
{"user_id": "117967570134732914822", "name": "Harry Bolt", "time": 1477336322613, "rating": 1.0, "text": "No help whatever.", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20845ac5:0xd85db0ae4450fc10"}
{"user_id": "110618535789500189324", "name": "King Floyd#15", "time": 1456515217451, "rating": 4.0, "text": "They get it done.", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20845ac5:0xd85db0ae4450fc10"}
{"user_id": "106477647751717152282", "name": "Patrick Kirby", "time": 1399473079430, "rating": 5.0, "text": "Found it", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20845ac5:0xd85db0ae4450fc10"}
