{"user_id": "102493029303697136676", "name": "Donald Leisure", "time": 1628010417736, "rating": 5.0, "text": "Hands down, best VA I’ve ever been to. Great staff who are trained and excellent care.", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "105133911243022222954", "name": "J Smitty", "time": 1615222123958, "rating": 3.0, "text": "The phone system has serious issues. The hold times can go on for over an hour. Or, until you assume nobody will take your call. A medical center as big as this one should at least be able to answer the phone in a reasonable amount of time.", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "106782831980567740541", "name": "Rocky Redding", "time": 1608064527527, "rating": 5.0, "text": "Dr Boyd and Adam are awesome. I'm a new patient as of yesterday and they already have set up appointments for me. Very friendly on team 8.", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "112154179519992619574", "name": "RTS", "time": 1612813381058, "rating": 2.0, "text": "Was referred  by Community Care to University Orthopedic in Northport with Dr. Thompson. My appointment was at 8:30 am and got there s little early to fill out paperwork. Ive been waiting 2 hours and he haven't called me back to be seen. This is ridiculous. Other patients in waiting room said their appointment scheduled at 8:30 too. How can he see all these patients at 8:30. I asked how much longer is the wait/ receptionist said all his rooms are full. I seeing patients that got there after me see same doctor going ahead of me. VA needs to stop using this doctor and facility for there patients. Discrimination its called.\n\nHad an appointment today  with my psch MH nurse practitioner. Was given email for VVC appointment. I was waiting on her to contact me and she never did. I call through the link and she was there typing in computer and didn't acknowledge me so I hung up. Called the clinic and MSA said provider was waiting for me to call her through email link. I have quite a few appointment at this location and Birmingham location. I have NEVER called my providers either the provider or the nurse contacts me first for my VVC appointment. Why is this particular clinic so different and why is there inconsistencies. MSA tried to tell me each dr is different. No its only in this clinic. I canceled my appointment because we way past appointment time. Now why if I come to VA in person I don't just walk in there office at my scheduled time. They or nurse come to get me when provider is ready. Why is it different through VVC. I believe these MH NP don't want to do a damn thing anyway and use this Covid 19 as an excuse to not do there jobs. Its always Black women. Why???", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "105908661569543728381", "name": "Dareece Santos (Reece)", "time": 1615416926215, "rating": 1.0, "text": "I’m a patient advocate and caregiver... my client drove 3+hrs for their scheduled appointment only to find out it wasn’t scheduled. You treat veterans like trash and should be ashamed.", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "102104296626247984629", "name": "nora rice", "time": 1606577576222, "rating": 5.0, "text": "I work here and love working with the Vets and staff.", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "107345194563210794936", "name": "James Lashley", "time": 1620096538484, "rating": 5.0, "text": "No complaints, very good Staff , !!!", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "108476477632255861268", "name": "Gman75ufla", "time": 1584377478533, "rating": 4.0, "text": "Only complaints are that the telephone system can be challenging. My care team never suggested that my diabetes, type 2  & neuropathy could be a disability benefit. I had to learn about this from other vets hanging around the coffee machine. They referred me to local DAV which was fabulous. Got approved in 8 months.\nMy care teams have been excellent, respond quickly to secure messaging, Community Care is improving, and is faster than Choice. I highly recommend this facility.", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "103746423743577718720", "name": "jerry blaylock", "time": 1607040590611, "rating": 5.0, "text": "Got my eyes cked. Got my back acupuncture.", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "111718649201861896858", "name": "Heather L Gregory", "time": 1600999494633, "rating": 1.0, "text": "Red dots. Genetic testing. No humans", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "106257083690489872770", "name": "Rick Johnson", "time": 1582479715173, "rating": 5.0, "text": "What a great VA staff. I was treated with an amazing level of dignity and respect from every person at the facility.", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "106191405533973779728", "name": "Avis", "time": 1554997256119, "rating": 5.0, "text": "The staff I have are very tentative to me. I greatly appreciate them all. No complaints just thankful I have people that cares about me.", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "117608126766910919895", "name": "Blake Aasgaard", "time": 1489079143629, "rating": 5.0, "text": "I went to the Tuscaloosa VAMC after returning from the Iraq invasion in 2004. As I approached the main facility, I was heartened to see the surrounding grounds to be manicured, in the exact fashion of the Army I knew in the 1970's. The fine, old building has been very well cared for, and that, only happens in the presence of deep respect. When I went inside the building, it was exactly the same, with very close attention to every detail, and I fully expected to see the hospital's Command Sergeant Major to be personally monitoring the conduct of each person I encountered, for any hint of policy, or AR-670-1 infraction. When a command is this sharp in every place you look, It's a good bet that the command is that sharp in the other places as well.\n\nWell Done, Tuscaloosa.", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "108331587843774340387", "name": "Timothy Denning", "time": 1559658876541, "rating": 1.0, "text": "Unhelpful uncaring staff doctors have God complexes and are completely ok with letting their patients suffer. Takes so long to get anything done that permanent damage has been done. Facility needs thorough investigation and restaffing", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "105294056642847398819", "name": "Larry Conner", "time": 1445111803246, "rating": 5.0, "text": "I have received excellent care at this facility. I was also in-patient at Valor Center for rehabilitation recently. Instead of projected 30 days I was out in 10 days.\nThey pushed me to meet my goal's.\nThanks to all the staff for helping me accomplish my goals.", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "106683344234038927083", "name": "Randy Poole", "time": 1548452922316, "rating": 4.0, "text": "The VA Hospital in Tuscaloosa is the best around they treat you like your a person and not a number I have enjoyed my care from this facility and the doctors are second to none I hope to have many more years of care.", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "111597024962801022963", "name": "YOLANDA LEE", "time": 1519606611968, "rating": 5.0, "text": "The Tuscaloosa VA is an Awesome hospital to work at. Everyone works together to assure that our Veterans receive top notch care. We work with Excellence in mind. How can we make a Difference in the lives of our Veterans. From the Director and everyone else, we are committed to assist the Veterans in every way.", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "118225675005029244876", "name": "Dusty Whitt", "time": 1548731052889, "rating": 5.0, "text": "Great VA has all the resources that a Veteran needs thank you and God bless", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "104985598915375289134", "name": "Josh Miller", "time": 1542746842067, "rating": 1.0, "text": "Very unhelpful staff. When trying to figure out information was constantly told “I don’t know” then constantly transferred to numbers without voicemails or people that don’t answer. Left several voicemails for people in several departments and was never onced called back. How do they expect veterans to get help if nobody there knows what’s going on?", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "109779740264281649021", "name": "J Z", "time": 1539899151125, "rating": 5.0, "text": "This facility is greatly improving with the mental health department.  Many veterans come here for rehabilitation", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "114763844546014895312", "name": "Hal Headd", "time": 1492557997538, "rating": 5.0, "text": "Great place!  The amazing staff there really care about we veterans.", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "106160990161397893599", "name": "Rico Webster", "time": 1420911992323, "rating": 5.0, "text": "It a great hospital with a good group of employees that make you feel like you are with family and not just a patient", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "107025953470990036794", "name": "Kristy Corey", "time": 1492275123113, "rating": 5.0, "text": "Lifesaving accessible quality care, compassion, dedication of every single employee, complete and total EXCELLENCE!!!!", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "103709968574586450313", "name": "mmou fasi", "time": 1477077048077, "rating": 5.0, "text": "This is trhe best VA I have experience.  Everone is concern about the patient welfare.  EVERYONE IS ALWAYS NICE,  I WAS VERY SICK WHEN I STARTED  VISITING THIS VA,   I am 300 percent better now,  I am so happy I switched to this VA.  Dr Meggs is my provider and she has help me tremendously.  I am so glad that she is as knowledgeble and unstanding as she is.  This VA is always clean and it mnakes me feel very comfortable with the services that i am receiving.   I highly recommend this VA.", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "105591804472242550472", "name": "LaTonya Payne", "time": 1503321755917, "rating": 5.0, "text": "Nice staff as well as helpful.", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "103438101703450805232", "name": "James Taylor", "time": 1426015125728, "rating": 5.0, "text": "I love this place", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "117300306086828061631", "name": "cecil harris", "time": 1525701223525, "rating": 5.0, "text": "Excellent staff.", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "112433327184467286271", "name": "James Taylor", "time": 1536202948399, "rating": 5.0, "text": "I'm there all the time", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "108053467417089059786", "name": "Jamaine Jones-bey", "time": 1515215052709, "rating": 5.0, "text": "Laminica crews want", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "111657465927505717750", "name": "James Taylor", "time": 1437661087521, "rating": 5.0, "text": "Love this place.😃😃😃😃", "pics": null, "resp": null, "gmap_id": "0x8888a8e24b2973f7:0x88d9234adb3f920b"}
{"user_id": "106585088584921164573", "name": "Carol Roberts", "time": 1533924426250, "rating": 3.0, "text": "My husband has been a patient here on several occasions. I know people generally talk badly about the VA, but we found the medical center to be clean, prompt and we'll organized. The wait for appointments and procedures can be long, and they never seem to be able to get our paperwork from other VA branches, but the care is fine.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPVMOMvyhmMWDIGno4dWLuGR4S-cGXT0MrFExcU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOXKRYqyg_-hFsOox3CCQqPxL7a4aByctfJiB1z=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO-Ffai3WoOraL-mugRioj6tvKSkg_lYQaqKkGN=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "102116270126982964097", "name": "A. Fabian Portela", "time": 1615676690953, "rating": 1.0, "text": "I've dealt with the VA prior in El paso and they were great.I requested the community care and I received it.I got a primary doctor through the community care and shortly thereafter, I was able to see specialists for different ailments that I have. Central Alabama VA does not care about veterans. They are very lazy, incompetent and dreadful. I moved here in August, I requested to see a primary doctor in September. I waited and I waited and I waited. I filed two complaints and then finally I get a primary doctor in January. Yes you read that right January. I see my primary doctor, and I request to see a specialty doctor. He puts in the console and I'm waiting and waiting to to no aveil. I called up Community Care (you have to call them as soon as they open,or else you'll never get a chance to talk to anybody.) I told them it's been a long time since my doctor put in the referrals. Why hasn't anything happen? They said it was kicksd back because of an error. I asked him why didn't they inform me or the doctor?they said it was because it was a doctor's fault. Which I know it was totally their fault. That's another thing they don't take responsibility for nothing. I almost forgot to mention prior to that, when I was trying to get my primary doctor they couldn't even do the most simplest things like send the referral to the doctors. They told me that they did it but in actuality they didn't. They are so full of themselves and they're very unapologetic. They just don't care, and nothing ever happens to them. They never get in trouble. They're telling me that I need to check up to see if I get my referrals. That is absurd, I've never called community Care in El Paso once to see when my referrals have been approved and I was waiting on it the doctor. In El Paso I dealt with TriWest. I don't even know what we deal with here. By next week if I don't hear anything, I'm calling to make a complaint once again", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "111921858731454746961", "name": "T Potts", "time": 1513800026132, "rating": 4.0, "text": "Wait times here seen long. Much prefer the Tuskegee campus. Adding some pics from the Chapel on 3rd floor", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM4EFQ1R3WZQcNsnkIf39erZudl_ELxt6WIw3I=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNSyZAC1ufUN3ZHrVqOO5j0NldUNVr_GEkWEhI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP12OZoCvWKEj4lTWnmxoRt8H64Zb9cjN4O_r4=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "110174008939218112910", "name": "David Whitehead", "time": 1580746129207, "rating": 5.0, "text": "First time visit this year.  AWESOME.  Wasn't familiar with facility so asked a Staff member in the parking lot for directions.  They were on their way to lunch but took time to walk me all the way to my appointment.  Along the route all the Staff we saw were very friendly and greeted us.  I only had to wait a very short period for my appointment.  Dr. Thompson, audiology, was extremely helpful and knowledgeable.  Had gone for a hearing test a couple months prior to a civilian practice.  The results were the same and Dr. Thompson was more than willing to explain things and answer any questions I had.  Very enjoyable experience.  Thank you all.", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "103471330688001787086", "name": "Edward Spaulding", "time": 1582469835738, "rating": 5.0, "text": "This was the best experience, I ever had at a VA Medical Center!! The ER Doctor and nursing staff were awesome!! They did not make feel like a number. They were compassion and concern for me.\nKudos to the Montgomery VA ER Department!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "106407239975206507935", "name": "Christopher Stitcher", "time": 1593095603354, "rating": 1.0, "text": "Man I could write a book from the past 4 years I've attended this place for medical care. Coming from a veteran who does not complain about much this place is horrible from the staff to the doctors. I have met a single hand full of people that are helpful here IN 4 YEARS, only 5 people I can think of. I have tried getting a new PCM, with no luck. Tried reaching out to the Mental Health Dept. to get assistance with PTSD and anxiety and was told the next appointment was 3 months away, which was today. After waiting for 30 minutes for the Psychiatrist to call me, since we are doing Covid procedures it's a phone call instead of face to face, little to my surprise there is no phone call. AFTER WAITING 3 MONTHS FOR HELP... If I could give less than 1 star I would. I've used the Perry Hill location and Chantilly with the same results.", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "105562578376247828206", "name": "Barb", "time": 1572676877373, "rating": 5.0, "text": "Greatly appreciated the care and immediate attention! Night & day shift were very polite and ensured I was & felt properly cared. They treated sudden acute pain and wrote a note for work. Treatment plan is currently working. I had a bad experience many years ago and it took extreme pain for me to go back. I'm glad I did! Highly recommend night shift! We shall see about day shift as I hope to transition back to VA from private practice I've been paying $$ to see.\n\nFollow up: still doing great!", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "102172977136484273688", "name": "Jimmie Landers", "time": 1475269469807, "rating": 1.0, "text": "This VA really sucks.... They drag ass to get to people. They would rather be talking all on their phones and talking and walking around rather than getting to their patients. If you are a vet and need to go to the emergency room I believe I would go to a regular hospital than going to this place. You will be seen a lot quicker there than having to wait 3 or 4 hours to be seen at this VA. And I wouldn't give them a whole star but that's the lowest I can give them...", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "111981099534457467868", "name": "Pandora Pearl", "time": 1501195632841, "rating": 5.0, "text": "This Five-Star review is specifically for the Patient Adovate, Mr. Jeff Flowers. If you need help, this man is the best. He truly cares about Veterans and their care! God bless 🇺🇸", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "102705386675102025896", "name": "Walter", "time": 1569198083653, "rating": 2.0, "text": "Horrible experience in a week of inpatient care.  Nurses joking around loudly all night, not allowing you to sleep.  Doctors are rarely available.  However, some nurses are really good.  It's a shame they keep the bad ones.", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "105425743368126994685", "name": "dc “dcwolt” wolt", "time": 1582287170233, "rating": 4.0, "text": "Appointment was on time, respectful and treated well.", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "105699082188121562212", "name": "Christopher Cordell", "time": 1532026573451, "rating": 1.0, "text": "Went to the er just to have the Dr tell me I needed blue cross so I didn't have to deal with the va. They need to just close it down. I'd rather go to a real hospital", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "108419042015635973580", "name": "Chris Lucier", "time": 1494853230745, "rating": 1.0, "text": "By far the worst VA system I've had the displeasure of dealing with. Including Chantily Clinic and Tuskegee. Need to vet those who don't want to do the job and put those in who do. Shame on you CAVHCS... You need to model yourself after successful VA systems.... Or just close it down and let us go private sector....", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "104439824413307682783", "name": "Tamika Ashford", "time": 1475534195357, "rating": 2.0, "text": "It's sad that there is only a hand count of people that work here that actually wants to help you. The rest of them are rude and unprofessional.  They half ass diagnose you and you have to make them correct their mess. Alabama VA system is horribly operated.", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "113067951341090195408", "name": "Michael Neal", "time": 1447163271013, "rating": 4.0, "text": "Checked in and was seen within 20 minutes. Had a professional screening for increase in benefits and was sent to x-ray room and was seen there within 20 minutes. The staff attitudes were nice and the facilities seemed clean for the age of the place. As usual bring your own paperwork though, as I loaded mine into Ebenfits months ago and the lady still couldn't acess them and had to lok at mine.", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "111098850442768625686", "name": "DCM7734", "time": 1469201025375, "rating": 1.0, "text": "Horrible service.\nI've come to the ER 3 times in less than 2 months for the same issue, and each time there I'm told that there is nothing they can do because they don't do MRIs from the ER. They don't care that I'm screaming in pain, that I can't sit still because I have severe nerve damage.\nAnd I'm too scared that if I go to a Civilian WR to get fixed, that the VA will choose npt to cover the bill, since I can't afford Civilian Health Care.\n\nAvoid this place at all cost.", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "100871556427389314503", "name": "Patricia Price", "time": 1542219111953, "rating": 5.0, "text": "Excellent doctors and staff, clean environment, wonderful experience,.", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "101772787742588647525", "name": "Cecil Dewey", "time": 1484666694537, "rating": 1.0, "text": "My doctor is a nurse practice. She is not caring at all. I would rate her at a minius 3.", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "101073285299326065284", "name": "Luis Ojeda", "time": 1501646018612, "rating": 1.0, "text": "I'm not sure why I had to wait 4 hours to be seen with only 3 people there. I was in agony.", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "103498200868346771606", "name": "Kimberly Shaffer", "time": 1573585983857, "rating": 1.0, "text": "Needs a lot of improvement for our veterans!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
{"user_id": "118375208540681691132", "name": "Tony Dinkins", "time": 1469569698108, "rating": 5.0, "text": "Very helpful! !!", "pics": null, "resp": null, "gmap_id": "0x888c2a0e20be6bf1:0xb817f9e66898777f"}
