{"user_id": "114202600638391906208", "name": "Elena Kulpa", "time": 1624545266333, "rating": 5.0, "text": "Changing States and starting my career back up in Real Estate meant also changing my entire team, choosing the \"right\" photographer is vital in this industry.  I was referred at least 5 photographers and Joe was the first to answer my call.  His adaptability and getting your vision in the first shot is impressive!  Pixel Joe is \"TOP NOTCH\" and is why he is my ONLY choice for photographer in North Alabama. Like they say \" if it's not broke why fix it.\" Give him a call, you won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "104131304197496737316", "name": "Steven Payne", "time": 1624461173930, "rating": 5.0, "text": "Fun and educational! Much appreciated!", "pics": null, "resp": {"time": 1624510833125, "text": "Thanks for coming Steve!"}, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "110220400279779925575", "name": "christina hall", "time": 1622943504536, "rating": 5.0, "text": "Absolutely the best place for any venue needs!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "103803003022946061253", "name": "Thomas Lawless", "time": 1603760874439, "rating": 5.0, "text": "This dude took exactly what I had in my head for my business and made it happen. I couldn’t be more happy with the quality and appearance of the photos I needed.\n\nAbsolutely phenomenal", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "104143428204887567216", "name": "Steven L Payne", "time": 1624510184769, "rating": 5.0, "text": "Super nice setup!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "109102795672237195901", "name": "KAavalon", "time": 1569680089254, "rating": 5.0, "text": "My husband and I hired Joe for our wedding 8/31 to do a highlight video. Joe was AMAZING!!! He assisted us through the whole process helping us select the moments we wanted to capture. He gave us a beautiful video while staying within our budget. He is professional and personable. We had our DJ drop out at the last minute and he assisted us with finding a new one, DJ Scott Blakely was AWESOME!  I highly recommend Joe and Scott and I would definitely hire them again!!! Thank you both so much for helping us make our wedding a party and helping create a beautiful keepsake!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "114884731954220746471", "name": "Kimberly Holmes", "time": 1518198801133, "rating": 5.0, "text": "Joe was Fantastic and easy to work with. Never once got frustrated with us and always had a smile. You can definitely tell Joe is passionate about his work. He did a Fabulous job with our whole team!! I would definitely recommend him.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "114854941382840784237", "name": "Nadine Wormsbacher", "time": 1532815473298, "rating": 5.0, "text": "Joe is a gifted photographer and videographer. He thinks  outside the typical box to create videos and images that are unique and memorable. He created a beautiful video of my horses and farm; he used his drone and the camera that lets him move with the horses and not jiggle. He’s very professional and easy to work with. Although I’d recommend him for anything image related, after seeing my video, I think he would be especially great for outdoor weddings or events.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "113882969702963035749", "name": "John Wood", "time": 1517184820924, "rating": 5.0, "text": "Joe took some headshots for myself and my staff that came out great! Joe had a lot of great tips for posing and took care to always get the best shots he could. Joe's studio was top notch as well as his professionalism and his abilities! Highly recommend!", "pics": null, "resp": {"time": 1517239829093, "text": "Thanks John I enjoyed it. You have an amazing staff and I know you guys will be an amazing all state branch! If anyone needs insurance call these guys!"}, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "107012675560021782345", "name": "Tye Watson", "time": 1505707424106, "rating": 5.0, "text": "Highly creative photos- he can add any theme to create a magical scene. His videos are above the top. Love his work. Would highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "106718618561893959853", "name": "ABC Cleaning and Restoration", "time": 1533649441699, "rating": 5.0, "text": "Joe is the doctor of photography.  He has an eye for the picture and knows the camera like nobody!  Whether it's a headshot, sports action shot or wedding I highly recommend using his vision!  He is also great at making movies so if you'd like to watch that game or wedding over and over he can make it happen!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "111515713004282244226", "name": "Katy Murphy", "time": 1532729877812, "rating": 5.0, "text": "Joe Bullock is an excellent photographer! From headshots to engagement photos to promotional videos, Joe's work is top notch. He is professional and gives 200% to everything he does 📸🎥", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "100096560547750047679", "name": "Brandon Saraceni", "time": 1503714516052, "rating": 5.0, "text": "Joe took some photographs via his drone for me on a roof inspection. He was on time and very professional. I will definitely hire him again. Thanks Joe.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "117225640691016339924", "name": "Lauren Schippers", "time": 1505675033074, "rating": 5.0, "text": "Joe is very professional and took some amazing photos for a friend of mines engagement announcements. They turned out beautiful!!!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "110793175651707402605", "name": "ERICA PRICE", "time": 1508082460020, "rating": 5.0, "text": "Pixel Joe's photography did a great job for us and I will definitely hire him again! Thanks so much pixel Joe!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "108934058374010077336", "name": "Rachel Harchanko", "time": 1532907622867, "rating": 5.0, "text": "Pixel Joe did my head shots for me. Joe was an absolute pleasure to deal with. I was so thrilled with the finished photos.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "100468113882323669988", "name": "Kayla Bullock", "time": 1506294828302, "rating": 5.0, "text": "Joe did a great job with our family pictures and getting 3 wild boys to smile!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "103217788467077880933", "name": "Bill Armistead", "time": 1604716468891, "rating": 5.0, "text": "Image Hive did an outstanding job of transferring over 100 super eight videos onto a thumb drive with outstanding quality. And, they are right here in Birmingham. So there is no need to box up your videos and ship them off to another state to have them transferred. I could not be more pleased!  I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "110914903018948010338", "name": "Theodore Campbell", "time": 1614076726838, "rating": 5.0, "text": "Great quality in and out I no time fast service will use again", "pics": null, "resp": {"time": 1614135354397, "text": "Thank you, glad we could help."}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107947153725319859167", "name": "D. Seibert", "time": 1579375895579, "rating": 5.0, "text": "The staff at Image Hive are incredible to work with!  So far, they have done script prep, teleprompter, studio shooting and final editing of over 30 of my online course videos and are now working on a new course with me.  I just love working with Steven, Dimi, Kat and the others there, that are most professional and caring about me and my projects.  They go overboard and I would strongly recommend them if you have a video project.", "pics": null, "resp": {"time": 1579544761841, "text": "Dear Don, thank you so much for your kind words. You are a great client to work with too. We hope your goal for many more people quit smoking be very successful."}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "104356530368415532220", "name": "Barbara Franklin", "time": 1558556091270, "rating": 5.0, "text": "I prepared a video history for my organization and had Image Hive to reproduce it for me.  Kat was so helpful.  She converted the format, added chapters, assisted me with the cover graphics and produced my requested copies very quickly.  She provided superb service and helped us provide an amateur video that looked professional.  Everyone was pleased.  She was great and very professional.  Thanks, Kat.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "112946115069474444206", "name": "CLIFF STROUT", "time": 1559082988847, "rating": 5.0, "text": "When my mother in law passed away, I took her old 8mm Home movies to these people. They went above and beyond cleaning the dust, adding shots of film titles in her handwriting. They made a wonderful movie for us as a family keepsake. Everyone loved it.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "115173656244661117081", "name": "Jacob delaRosa", "time": 1547494097918, "rating": 5.0, "text": "Image Hive is my go-to choice for studio rental when I need an indoor location for my clients. They offer all the lighting equipment and backdrops you could ask for. Their enormous cyc wall is just amazing! You can comfortably shoot anything from products, large groups of people and even vehicles in their space. They also offer film scanning services for old home movies on VHS and super 8 film. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "114437570016322460272", "name": "Jeff Nelson", "time": 1558466826083, "rating": 5.0, "text": "We had several old 8mm movie reels that we needed transferred to digital and DVD formats.  The results were great and we were very happy.  I would recommend your services to anyone with a similar need.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "101039468108346282478", "name": "Micah Wade", "time": 1547315488676, "rating": 5.0, "text": "The folks at Image Hive have been helping me secure my family’s memories for over three years now. Steven, Mark, and their staff are professional and helpful. As a mom, I was so stressed out about saving videos of my children, since I didn’t have the time or skills to do it on my own. Someone referred me to Image Hive and I’ve been so relieved ever since. They also run regular specials! 5 STARS, Image Hive!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "113249054387056761263", "name": "Hilda Johnson", "time": 1558613663049, "rating": 5.0, "text": "Great job on my videos and great people to work with. Very quick return getting my videos back. Very pleased and anxious to have more done.\nHilda Johnson", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "109268273710875462007", "name": "Lee Winnige", "time": 1558462254581, "rating": 5.0, "text": "These guys did a great job of scanning my old family photos. Great service and friendly staff. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "111309645251360108410", "name": "Richard Schlinkert", "time": 1578065424867, "rating": 2.0, "text": "I took in about thirty 35mm slides to transfer to digital, and while they turned the order around quickly, the slides had dust and lint in them and were very low resolution for the cost, which is about twice what the mail-in services charge for twice the resolution.  Unless you are in a hurry, look elsewhere", "pics": null, "resp": {"time": 1578078597457, "text": "Thank you for sharing your experience with us.  We're sorry that the final results of your scanning order did not meet your expectations.  We pride ourselves on giving each order personal attention and all of the work we do is done in our Birmingham location (in the historic Avondale neighborhood).\nWe recall your order very clearly.  You chose our PROOF quality (700 ppi) for your slide scanning order, which our lowest resolution (and lowest priced).  We also offer ARCHIVE quality scans (1700 ppi) at a slighlty higher cost.  Our scanning service, whether Proof or Archive level, includes the utilization of dust removal software, which can remove superficial debris and blemishes on the scanned images.\nOur technician specifically noted the high concentration of dust on your slides before scanning your slides.  Prior to scanning your order, our tech  attempted to manually clean each of your slides by hand to remove the dust and lint you described.  Unfortunately, dust and lint are often stuck to the film itself and may not be removed except by rewashing or physically wiping the film with a chemical solution.\nWe are generally unwilling to do such aggressive cleaning, out of fear we might damage our clients irreplaceable originals.  More often, if the condition of the originals is so bad that our usual cleaning and post-production are insufficient, we can do restorastion to the scanned images.  This digital retouching is not inexpensive, but for extremely valuable or badly deteriorated images, it is often the best option.\nAgain, we're sorry to hear you were not completely satisfied with our service.  We would welcome the opportunity to regain your confidence."}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "103333855802638099393", "name": "Floyde Young", "time": 1607305734144, "rating": 5.0, "text": "Nice spot for photography", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "117818375670235475378", "name": "Dave Loftin", "time": 1558476871063, "rating": 5.0, "text": "Image Hive did a great job transferring some old video tapes for me. Awesome folks to deal with.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "110791981266546984577", "name": "Lisa Wienhold", "time": 1546988468648, "rating": 5.0, "text": "Hive did a great job with a bunch of old family photos.  I was very pleased.   Fast great service !", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "109031672118015331782", "name": "Robin Anderson", "time": 1572474512907, "rating": 5.0, "text": "Very helpful staff, she did a great job, this is a good place!", "pics": null, "resp": {"time": 1572478428230, "text": "Thank you! Cat is wonderful, glad to hear from happy customers!"}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "111820436179064136417", "name": "tania mendoza", "time": 1476826841000, "rating": 5.0, "text": "I rented the photography studio at Image Hive recently to see if I could get a professional-looking profile pic for my CV, having a friend to take the picture instead of hiring a professional photographer. It turned out way better than I'd imagined. I'm so glad we did it ourselves! The place has a very creative vibe about it and the people there were very encouraging and helpful, without being intrusive. I also discovered that they convert all kinds of old media, like vhs tapes, film reels, and slides to digital. So, I'll be making a return trip after I go through my closets!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "103003612105934390320", "name": "Linda Bryant", "time": 1533832827361, "rating": 5.0, "text": "Great studio rental price. The people at Image Hive are experanced and helpful. Overall perfect shoot.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107842547183007232002", "name": "Tyler Kemp", "time": 1533753591342, "rating": 5.0, "text": "Great and experanced staff. Great studio for everything I needed. They also do film and tape transfers!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107842547183007232002", "name": "Tyler Kemp", "time": 1533753591342, "rating": 5.0, "text": "Great and experanced staff. Great studio for everything I needed. They also do film and tape transfers!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "117513114308618465022", "name": "Jennifer Ralph", "time": 1546893925000, "rating": 5.0, "text": "Image Hive converted some of my old VHS tapes to DVD's and computer files, and I was very pleased with the service and results!", "pics": null, "resp": {"time": 1546896244992, "text": "Great, thank you so much for great review! We are so happy we were able to help!"}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107479741111646750395", "name": "Lee Walthall", "time": 1558562213953, "rating": 5.0, "text": "Image Hive has helped me convert old video recordings to digital files and duplicate CDs on several occasions and I was extremely pleased with their timely high quality service and reasonable price", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "101134386956469162515", "name": "elizabeth cypher", "time": 1559081570094, "rating": 5.0, "text": "Staff very knowledgeable and efficient. Prompt and just what I needed!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107237744589396884880", "name": "Collin Balentine", "time": 1533740724101, "rating": 5.0, "text": "Had a great studio perfect for shooting photography and video.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "114529658832792709921", "name": "Dima Ant", "time": 1464723079142, "rating": 5.0, "text": "Service is great and fast. Everything was done to my specifications. Great people in general.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "108459037081760182904", "name": "Cameron Balentine", "time": 1533143191604, "rating": 5.0, "text": "Can restore and duplicate and enlarge old photos..check them out! Great poster size made at a great price!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "111647182964218600487", "name": "Mike Bryant", "time": 1533753306192, "rating": 5.0, "text": "Had a great set-up and knowledgeable staff. Also flexiable with time.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "101888309380030128580", "name": "Norman Virciglio", "time": 1491255009466, "rating": 5.0, "text": "Great Job on transferring 50 year old 8mm to digital.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "114415659727939822690", "name": "Christen Henry", "time": 1606581050983, "rating": 5.0, "text": "Happy to help anytime I can.", "pics": null, "resp": {"time": 1606580352311, "text": "Thanks Chris! Thanks for all of your help over the years."}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "103476431782733421308", "name": "Steven Antselevich", "time": 1598535119714, "rating": 5.0, "text": "Great and easy company to deal with. Wide variety of all things technology.", "pics": null, "resp": {"time": 1606580287572, "text": "Thanks Steven! We love partnering with you. Let us know if you need anything."}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "116401516662615409053", "name": "MV SS", "time": 1521991299698, "rating": 5.0, "text": "Holt Audio and Visual is well known to me personally. I worked in the legal field in Birmingham for over 42 years as a legal secretary, legal assistant and paralegal and first learned of Holt AV's services while on the job. However, over the years, I have personally used their services on a number of occasions to obtain duplicates of and share videos and recordings that were taken on vacation and during get togethers with family and friends. One tape in particular was very old, but the staff at Holt AV did an extraordinarily important job for me in duplicating a recorded conversation with my mom made many, many years before her death. I felt they took great interest in and were attentive in doing an excellent job in delivering something that has become very precious and invaluable to me and my family. Thanks, Holt AV - wishing you well for another 60 years and beyond!", "pics": null, "resp": {"time": 1522071411392, "text": "Thanks for the kind words! Hope we can be of help in the future!"}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "101980969016605177617", "name": "Marshall Mooney", "time": 1527514496364, "rating": 5.0, "text": "Customer service at it's finest. They go out of their way to make sure you have what you need when you need it.", "pics": null, "resp": {"time": 1527599902330, "text": "Thanks for your comment! We love making our customers look their best."}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
