{"user_id": "110264734283440023695", "name": "Britt Maxwell", "time": 1606580178591, "rating": 5.0, "text": "Kyle did an amazing job with my videos. He’s Full service; he does the shoot, edits, ads stock footage as needed, and in the end comes up with a really terrific product. Great value and great to work with, I am absolutely going to work with him again!", "pics": null, "resp": {"time": 1606581164939, "text": "Thank you, Britt! This was such a fun project. When our son is older we'll definitely be looking into an Epic Starfish gift."}, "gmap_id": "0x88640a2ecca31c5f:0xed06e3fb7ee4e66f"}
{"user_id": "113699944153296844060", "name": "Derek Altom", "time": 1600821432066, "rating": 5.0, "text": "NowTech Productions is a \"top of the line\" company.  Kyle Saunders is excellent at what he does and I am continually amazed at what he can do with a video camera!  NowTech Productions has made our organization better by helping us produce high quality videos and content that will assist us in completing the mission of our organization.  Again, we could not do this without NowTech Productions and Kyle Saunders.  No matter what crazy idea we have or how quickly we need something done, Kyle is always there to help and to give the best possible solution while maintaining the highest quality.  You and your organization would be well-served to hire NowTech Productions for all your video producing needs.", "pics": null, "resp": {"time": 1606581312545, "text": "Thank you, Derek! I enjoy working with you and the team on projects. I appreciate your insights before, during, and after each video. I look forward to our next video together."}, "gmap_id": "0x88640a2ecca31c5f:0xed06e3fb7ee4e66f"}
{"user_id": "101779931952478273377", "name": "Jimmy Patrick", "time": 1603844307825, "rating": 5.0, "text": "The best video production company out there. They have done two videos for my company and both were amazing!  I would recommend their services to anyone.", "pics": null, "resp": {"time": 1603913371657, "text": "Thank you, Jimmy! We enjoy getting to help spread the word about LTA in Murfreesboro."}, "gmap_id": "0x88640a2ecca31c5f:0xed06e3fb7ee4e66f"}
{"user_id": "117146049374171087962", "name": "NAFWB", "time": 1600783653925, "rating": 5.0, "text": "Kyle has met and and exceeded our expectations in every project. He listened to our needs, understood our objectives and wishes, and then added his creative expertise for top-notch productions. His efforts went well beyond just a familiarity with the particular project, as he worked to understand our goals as an organization so he could weave those into the videos he produced.", "pics": null, "resp": {"time": 1600792796533, "text": "We appreciate your trust throughout these projects and we look forward to more in the future. Thank you!"}, "gmap_id": "0x88640a2ecca31c5f:0xed06e3fb7ee4e66f"}
{"user_id": "117747050382607590229", "name": "Amber Keisling", "time": 1590076509100, "rating": 5.0, "text": "Kyle and NowTech Productions did an amazing job. The customer service was top notch. They communicated with us throughout the entire process and made sure that we got all of the shots we wanted. The price was very reasonable. I would recommend them to anyone.", "pics": null, "resp": {"time": 1590081704382, "text": "Thank you so much, Amber! We really enjoyed getting to be a small part in the special surprise."}, "gmap_id": "0x88640a2ecca31c5f:0xed06e3fb7ee4e66f"}
{"user_id": "104246275272787316072", "name": "Dean Heasley", "time": 1594239590402, "rating": 5.0, "text": "I so appreciate Kyle and his ability to produce videos so well. He shot a full day event and he was a true professional the whole day. He was on top of everything. The videos he produced came out so well!", "pics": null, "resp": {"time": 1595620778143, "text": "Thanks, Dean!"}, "gmap_id": "0x88640a2ecca31c5f:0xed06e3fb7ee4e66f"}
{"user_id": "108411275927521280805", "name": "Daniel Webster", "time": 1600806430429, "rating": 5.0, "text": "NowTech has been great for us! Highly recommend Kyle and his team.", "pics": null, "resp": {"time": 1606581388666, "text": "Thank you, Daniel. You have a wealth of ideas, and I enjoy getting to help make those ideas come to life when it involves video production. I look forward to some upcoming projects in the spring."}, "gmap_id": "0x88640a2ecca31c5f:0xed06e3fb7ee4e66f"}
{"user_id": "117920354574863831025", "name": "jeremy lee", "time": 1591207065131, "rating": 5.0, "text": "Kyle is personal and professional.  He has amazing gear that he uses to create high quality video.  From production to editing, Kyle is easily one of the best in town!", "pics": null, "resp": {"time": 1591216010382, "text": "Thank you, Jeremy! I love getting to work on projects in which you are a part of the team. You stay focused and grounded even when obstacles arise."}, "gmap_id": "0x88640a2ecca31c5f:0xed06e3fb7ee4e66f"}
{"user_id": "114202600638391906208", "name": "Elena Kulpa", "time": 1624545266333, "rating": 5.0, "text": "Changing States and starting my career back up in Real Estate meant also changing my entire team, choosing the \"right\" photographer is vital in this industry.  I was referred at least 5 photographers and Joe was the first to answer my call.  His adaptability and getting your vision in the first shot is impressive!  Pixel Joe is \"TOP NOTCH\" and is why he is my ONLY choice for photographer in North Alabama. Like they say \" if it's not broke why fix it.\" Give him a call, you won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "104131304197496737316", "name": "Steven Payne", "time": 1624461173930, "rating": 5.0, "text": "Fun and educational! Much appreciated!", "pics": null, "resp": {"time": 1624510833125, "text": "Thanks for coming Steve!"}, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "110220400279779925575", "name": "christina hall", "time": 1622943504536, "rating": 5.0, "text": "Absolutely the best place for any venue needs!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "103803003022946061253", "name": "Thomas Lawless", "time": 1603760874439, "rating": 5.0, "text": "This dude took exactly what I had in my head for my business and made it happen. I couldn’t be more happy with the quality and appearance of the photos I needed.\n\nAbsolutely phenomenal", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "104143428204887567216", "name": "Steven L Payne", "time": 1624510184769, "rating": 5.0, "text": "Super nice setup!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "109102795672237195901", "name": "KAavalon", "time": 1569680089254, "rating": 5.0, "text": "My husband and I hired Joe for our wedding 8/31 to do a highlight video. Joe was AMAZING!!! He assisted us through the whole process helping us select the moments we wanted to capture. He gave us a beautiful video while staying within our budget. He is professional and personable. We had our DJ drop out at the last minute and he assisted us with finding a new one, DJ Scott Blakely was AWESOME!  I highly recommend Joe and Scott and I would definitely hire them again!!! Thank you both so much for helping us make our wedding a party and helping create a beautiful keepsake!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "114884731954220746471", "name": "Kimberly Holmes", "time": 1518198801133, "rating": 5.0, "text": "Joe was Fantastic and easy to work with. Never once got frustrated with us and always had a smile. You can definitely tell Joe is passionate about his work. He did a Fabulous job with our whole team!! I would definitely recommend him.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "114854941382840784237", "name": "Nadine Wormsbacher", "time": 1532815473298, "rating": 5.0, "text": "Joe is a gifted photographer and videographer. He thinks  outside the typical box to create videos and images that are unique and memorable. He created a beautiful video of my horses and farm; he used his drone and the camera that lets him move with the horses and not jiggle. He’s very professional and easy to work with. Although I’d recommend him for anything image related, after seeing my video, I think he would be especially great for outdoor weddings or events.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "113882969702963035749", "name": "John Wood", "time": 1517184820924, "rating": 5.0, "text": "Joe took some headshots for myself and my staff that came out great! Joe had a lot of great tips for posing and took care to always get the best shots he could. Joe's studio was top notch as well as his professionalism and his abilities! Highly recommend!", "pics": null, "resp": {"time": 1517239829093, "text": "Thanks John I enjoyed it. You have an amazing staff and I know you guys will be an amazing all state branch! If anyone needs insurance call these guys!"}, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "107012675560021782345", "name": "Tye Watson", "time": 1505707424106, "rating": 5.0, "text": "Highly creative photos- he can add any theme to create a magical scene. His videos are above the top. Love his work. Would highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "106718618561893959853", "name": "ABC Cleaning and Restoration", "time": 1533649441699, "rating": 5.0, "text": "Joe is the doctor of photography.  He has an eye for the picture and knows the camera like nobody!  Whether it's a headshot, sports action shot or wedding I highly recommend using his vision!  He is also great at making movies so if you'd like to watch that game or wedding over and over he can make it happen!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "111515713004282244226", "name": "Katy Murphy", "time": 1532729877812, "rating": 5.0, "text": "Joe Bullock is an excellent photographer! From headshots to engagement photos to promotional videos, Joe's work is top notch. He is professional and gives 200% to everything he does 📸🎥", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "100096560547750047679", "name": "Brandon Saraceni", "time": 1503714516052, "rating": 5.0, "text": "Joe took some photographs via his drone for me on a roof inspection. He was on time and very professional. I will definitely hire him again. Thanks Joe.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "117225640691016339924", "name": "Lauren Schippers", "time": 1505675033074, "rating": 5.0, "text": "Joe is very professional and took some amazing photos for a friend of mines engagement announcements. They turned out beautiful!!!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "110793175651707402605", "name": "ERICA PRICE", "time": 1508082460020, "rating": 5.0, "text": "Pixel Joe's photography did a great job for us and I will definitely hire him again! Thanks so much pixel Joe!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "108934058374010077336", "name": "Rachel Harchanko", "time": 1532907622867, "rating": 5.0, "text": "Pixel Joe did my head shots for me. Joe was an absolute pleasure to deal with. I was so thrilled with the finished photos.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "100468113882323669988", "name": "Kayla Bullock", "time": 1506294828302, "rating": 5.0, "text": "Joe did a great job with our family pictures and getting 3 wild boys to smile!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "102787019948847241298", "name": "Curtis Tarver", "time": 1516201047089, "rating": 3.0, "text": "Okay", "pics": null, "resp": null, "gmap_id": "0x889288c99e6bb249:0xc76fe141c088fb19"}
