{"user_id": "107910109855333961865", "name": "Bis Office Systems", "time": 1596048837868, "rating": 5.0, "text": "Nothing but praise for the prompt and responsive service we receive from ADS. Dan is always accessible anytime I have called. We get better, more personalized service doing business with this local company.", "pics": null, "resp": {"time": 1596059280750, "text": "Thank you very much!\nWe always strive for excellent customer service.\nI will pass this on to our team!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "115783318236429783371", "name": "Spectrum Collision", "time": 1576277764595, "rating": 5.0, "text": "5 stars for the excellent work and customer service performed by Advanced Detection Security of Mobile. This company has taken care of our security systems for nearly 15 years. Flawless performance, quick service, and an excellent team of Christian people. Phone calls are always returned in a timely manner, and repair service is always very prompt, so you are never left unprotected.", "pics": null, "resp": {"time": 1576347588004, "text": "Thank you!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "117651966845211373822", "name": "Allen Huth", "time": 1582307868065, "rating": 5.0, "text": "ADS has kept my property safe and secure for about 20 years.  No problems with the system and great immediate response from the monitoring system when we trip the alarm.. ADS is dependable and customer focused. They have been around for 30 years because they serve us well!", "pics": null, "resp": null, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "113069128401939237896", "name": "Laveral Graf", "time": 1597254990061, "rating": 5.0, "text": "The people of ADS are always quick to pick up the phone, willing to help, friendly, and polite. Ashley and Thomas are very helpful over the phone.", "pics": null, "resp": {"time": 1597260548294, "text": "Thank you!\nOur Team strives for excellence in customer service every day!\nPlease let us know how we can do better."}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "115046851075976501832", "name": "Sandy Cooley", "time": 1586813972463, "rating": 5.0, "text": "I am the jail administrator @ Washington County Jail and we recently had ADS install new cameras. We were extremely pleased with the prompt service, efficiency and willingness to work with us. We highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "105737169638011377297", "name": "Jimmy Starr", "time": 1577669216207, "rating": 5.0, "text": "I have personally known Dan McDaniel for 35 years who is the president of ADS of mobile. And by the quality of his work and the performance he does with follow up with his customers is unmatched in the security industry. He’s an expert in fire alarm, security cameras, alarm systems and access control.He serves on the Alabama alarm association and it has been president in the past. He does a complete free appraisal of your home or business and gives a fair price for installing a security system and his monitoring is excellent.", "pics": null, "resp": {"time": 1577674984205, "text": "Thank you Mr. Starr!\nI am very  honored and humbled by your comments!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "109256222902771596307", "name": "Doug Simpson", "time": 1587671616503, "rating": 5.0, "text": "I had ADS come out and install the alarm and camera system at one of our buildings.\nThe install was professional and completed ahead f schedule.\nWe were so pleased that we have four buildings covered by ADS.\nI would highly recommend ADS for your security and video needs.", "pics": null, "resp": null, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "110759036940519179000", "name": "Claris Feibelman", "time": 1598903682140, "rating": 5.0, "text": "Been customer with ADS for over 30 years\nVery good and reliable service", "pics": null, "resp": null, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "108655195737571347994", "name": "Ell A May Absher", "time": 1559331074218, "rating": 5.0, "text": "I love this company. I work for another alarm company and Advanced Detection Security of Mobile, Inc. does some of our sub-contracting work. Kristen, their scheduler, always makes me feel like a priority. She is quick to respond and very efficient! I work with many many other alarm companies but Kristen is THE one I can depend on, not only to schedule quickly but to keep me updated as to delays, rescheduling, parts needed, etc. Keep up the great work Advanced Detection Security of Mobile, Inc.! You make my job so much easier. You and your team rock!\nLorna A, Customer Care Representative with SSS", "pics": null, "resp": {"time": 1576347720833, "text": "Thank you!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "117911848695015372526", "name": "sam sinclair", "time": 1590103461893, "rating": 5.0, "text": "They did a great job installing a security camera system for our church. Very pleased with both the process and the product.", "pics": null, "resp": {"time": 1590539543161, "text": "Thank you Sam!\nWe look forward to serving you and your church.\nADS  Video • Fire • Security  Team"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "109136506989125288807", "name": "James W. Lyon", "time": 1561069335036, "rating": 5.0, "text": "I highly recommend Dan McDaniel and the Advanced Detection Fire, Security and Video Company (ADS).  They have protected my home and office for 20 years without incident.  In today's world, you can never be sure of your safety but ADS gives my wife and I peace of mind!", "pics": null, "resp": {"time": 1576347736912, "text": "Thank you!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "105123704507768856444", "name": "Nildee Herrera", "time": 1562616613153, "rating": 5.0, "text": "We have used ADS of Mobile for several local services. They have always been very professional and skilled for what we have needed. Today, we had an emergency service and asked them to help us, Kristen Lane jumped and made sure we were taken care of. Thank you! Thank you for allowing us to have a face in Mobile!", "pics": null, "resp": {"time": 1576347797975, "text": "Thank you!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "112247053110098419346", "name": "John Thompson", "time": 1545407098732, "rating": 5.0, "text": "My company, Thompson Wealth Management & Life Planning, recently purchased a new building,. Dan McDaniel, a personal friend and business associate for over 20 years personally, came out and drew up the right  security plan and hardware that fit my needs. They worked hard and  got the job done fast. I was extremely pleased with the costs and customer service i received and continue to receive. I would highly recommend ADS for your business or personals security needs.", "pics": null, "resp": {"time": 1545662857939, "text": "Thank you Mr. Thompson.\nOur team looks forward to serving your security technology needs for a long time!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "109385235557165000065", "name": "Mark Jones", "time": 1543449989642, "rating": 5.0, "text": "I am a business owner with 8 locations and have used ADS of Mobile for over 20 years for my burglar alarm and video surveillance needs. In all of that time, I have always had the piece of mind that my facilities were protected from crime.  I would sincerely recommend Dan McDaniel and ADS of Mobile because of their good products, professional installations and integrity. ADS of Mobile truly helps me sleep well at night!\n\nMark Jones\nMaster Cleaners", "pics": null, "resp": {"time": 1576347716576, "text": "Thank you!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "102033005987100391048", "name": "pamela farmer", "time": 1597265651761, "rating": 5.0, "text": "Wonderful, fast service. Highly professional", "pics": null, "resp": null, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "111979773914764911659", "name": "Shulanda Norwood", "time": 1557841057757, "rating": 5.0, "text": "I have contracted ADS now for 4 years.  Their customer service has always been professional and prompt.  I enjoy each time talking with Mr. Dan McDaniel he is very concerned about his client and I will definitely recommend ADS service to any client that is in need of quality good service. ADS Security will satisfy your needs.", "pics": null, "resp": {"time": 1557849299182, "text": "Wow!\nThank you so much Shulanda.\nAfter nearly 30 years in business we have learned that Customer Service is the MOST  important thing we can do! Please call me anytime I can help!\nDan McDaniel"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "112320245542721095999", "name": "Eric Burroughs", "time": 1554808076033, "rating": 5.0, "text": "I work with contractors all over the country, often onsite personally. Mal from ADS is one of the best I have ever come across. He is extremely detail oriented and actually cares! Don't even second guess working with these guys, They are solid!", "pics": null, "resp": {"time": 1576347718795, "text": "Thank you!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "102885234234637377522", "name": "Jacob Reynolds", "time": 1561752840237, "rating": 5.0, "text": "Their security systems and customer service is top notch! I would recommend this company to anyone whose looking for a high quality security system with great customer service!", "pics": null, "resp": null, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "112085571235596953363", "name": "Richard Wyatt", "time": 1624330190716, "rating": 4.0, "text": "I called, talked to them. They seemed very knowledgeable aboit my issue. The feed back i recieved in my opinion was very helpful.", "pics": null, "resp": null, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "113588660936539901820", "name": "S B", "time": 1621879169551, "rating": 1.0, "text": "Changed his price to give a quote 3 different times after showing up based on a 4th price he initially gave over the phone.\n\nWanted to charge double to receive a written estimate.\n\nAvoid this place like the plague.\n\nDishonest and unfriendly.  Read the reviews. The angry guy has 3 stars for a reason.\n\nWas willing to pay for the estimate UP FRONT (as that’s standard) as he said on the phone it was $25 for an estimate.\n\nOnce arrived he said $50. Then it became $75.  Then when I again asked that he would provide a written estimate (instead of just verbal) he said, “written estimates are $100”.\n\nNot saying this place is a scam but it is unprofessional and quite revealing they don’t do written estimates without paying double and the price changed multiple times.\n\nSad he would lie claiming I was unwilling to pay up front for the estimate.\n\nI wasn’t willing to pay 4x his initial quote for an estimate from a rag tag dinky store.", "pics": null, "resp": {"time": 1621877921955, "text": "what a dork. He wanted a estimate but did not have any money and does not tell me until he got here. He said he would bring tv back after he got some money from insurance company. The tv was 75 inches and weighed 100 pounds."}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "107283024857351187311", "name": "Mr T", "time": 1622082798263, "rating": 1.0, "text": "Would rather leave my tv with the butcher shop at the other end of the complex than with this store.  If the owner told me it was raining outside and I was getting wet, I wouldn’t trust him.", "pics": null, "resp": {"time": 1622651094004, "text": "Consider the source. My intelligent customers are happy, been here 25 years."}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "111329650365730546180", "name": "Blaxxjefe", "time": 1613758416811, "rating": 1.0, "text": "Store associate was rude on phone and just hung up in my face", "pics": null, "resp": {"time": 1614011979073, "text": "he was very very rude and my anger got to me. i texted him apologized\nand offered him a tv for 40 that works   he was upset because he destroyed his tv  at least this was a real customer  usually it is someone i have never heard of   google has kept the same worst revue from a year ago on the title page  they wanted 4000 dollars to tidy everything up     a month     4.3 angies list"}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "101106683831566814721", "name": "Kim Scott", "time": 1575658316619, "rating": 5.0, "text": "I called that morning and serviceman came and repaired within in 6 hours. I originally called Geek Squad at Best Buy and they wouldn't come unless I paid a $200 up front service agreement and then pay almost another $200 for repairs. I will use Bluff Park TV again if ever needed. :)", "pics": null, "resp": {"time": 1576254538623, "text": "Thank you for the good review."}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "114848461696426807613", "name": "Davina Morris", "time": 1620866293562, "rating": 4.0, "text": "Very helpful", "pics": null, "resp": {"time": 1621878230520, "text": "I try to be. thanks for the review."}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "109845138179570751657", "name": "Ward Lachman", "time": 1593469904957, "rating": 5.0, "text": "He couldn't fix my TV but he was honest about it and didn't charge me anything. He fixed my last TV at a reasonable rate.", "pics": null, "resp": null, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "112408472990539074610", "name": "Scott Naugher", "time": 1567482299950, "rating": 5.0, "text": "The owner/technician is great.  He repaired a fuel pump control module for my 1982 280zx turbo. Replacement part could not be found.", "pics": null, "resp": {"time": 1569332286675, "text": "thanks boss"}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "110440993876602175793", "name": "Jason Black", "time": 1515714844712, "rating": 5.0, "text": "Took my 55” TV on Saturday and he fixed it and had it back to me the following week on Thursday, he had to order parts and wait for them to come in. Very happy with his work, also gave me a warranty on the work. Priced very fair and does a great job. Super nice guy. Absolutely recommend Bluff Park TV repair to anyone.", "pics": null, "resp": {"time": 1566416064358, "text": "thanks good buddy"}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "107270600278861809394", "name": "Robert Franks", "time": 1614150953832, "rating": 5.0, "text": "They had what I needed", "pics": null, "resp": null, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "105068459115935866911", "name": "Kenneth Searcy", "time": 1569094136746, "rating": 1.0, "text": "Man came and got my tv. All packaged up in the original stuff.  Brought it. Ack to me in the back of a pick up on a mattress.  Telling me at delivery wasnt in the box.\nReceipt clearly says packaged in the box.  Now he wont bring my tv back. .", "pics": null, "resp": {"time": 1569332252040, "text": "this man lied about everything his 65 inch curved tv was lighting hit needed every single part i estimated 610 it cost me 600 in parts but i stuck to it i delivered on mattress in back of colorado he said good but only had 400 i hate boxes anyone want a 65 curved 500 ninety day warranty"}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "106158298723527562757", "name": "Jonathan Scarborough", "time": 1566075066878, "rating": 1.0, "text": "Charged me 150.00 to fix a tv.  The first time I plugged it in there was no power, he wouldn’t honor it, and wanted to charge me again.  Told me he had plenty of work if I didn’t want to pay him again.  You are better off buying a new TV than dealing with this guy.", "pics": null, "resp": {"time": 1566415719342, "text": "the warranty was on the back it was 2 months out of warranty but when he told me he wasnt going to spend that kind of money again i told him to hit the road I was working without ac and felt terrible right after he walked off . when I fix something  it stays fixed and the last 2 returns came after 2 months both customers said doing same thing turning on and off tried to leave I said wait both had broken screens they were trying to stick me with.I am glad you wrote me up I deserved this one. Bring it back and I look at it for free even though it is 2 months out of warranty and put the results on line. I apologize."}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "113237385029274391979", "name": "Gina Pearson", "time": 1504203704218, "rating": 5.0, "text": "Excellent experience in terms of timely and VERY reasonably priced repair. You will not find a better deal in town.  Saved me tons of money based on quotes from other service companies and Best Buy. Highly recommend!", "pics": null, "resp": {"time": 1566416091951, "text": "thanks good buddy"}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "116607495553174762229", "name": "Michael Brown", "time": 1501354941222, "rating": 5.0, "text": "I read some of the strange Google reviews and still gave him a shot. He treated me fair, called when he said he would, and took good care of me. I'd recommend him to anyone.\nHe's old school, cash or check only.", "pics": null, "resp": {"time": 1566416145114, "text": "thanks good buddy"}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "113268754548980251437", "name": "Angela Gaines", "time": 1579504318416, "rating": 5.0, "text": "The food was great n the server  was wonderful", "pics": null, "resp": {"time": 1581711633340, "text": "thanks google wants to keep my worst review up front even though I have had 10 reviews that are 5 star since I appreciate all the help I can get"}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "100189469325746297702", "name": "Avory Morgan", "time": 1544738709663, "rating": 5.0, "text": "I bought a tv from him and the LED light went out. He made sure my issue was resolved. Please make sure you are within your six months and he will take care of you. I would go back to him.", "pics": null, "resp": {"time": 1550016756002, "text": "thank you google does not like me because I wont pay them so they keep making things look bad as they can by putting the worst reviews up front .I won't feed the monster.Most of their bad reviews are from people I have never seen maybe called in. thank you again"}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "101732726475614434618", "name": "Chase Bowers", "time": 1527878239785, "rating": 1.0, "text": "Very weird and unprofessional experience overall. I think the guy I worked with may be good at repairing TVs but I’ll never know. He contacted me and said that my TV was uncommon and parts couldn’t be found for it. It was a new Samsung TV. I am a software developer and work on the Internet everyday and suggested that I could help with finding the parts he needed so he could repair it and then it turned a little weird. He quickly said that would never happen and that he didn’t need me to help at all. It was more of how he talked to me, like I wanted to steal his secrets and fix it myself. It was unprofessional and made me want to leave a bad review which I don’t do often. Anyway, you may luck out and not have to have much interaction with him but if you do, be warned. Hopefully my experience is the exception though.", "pics": null, "resp": {"time": 1530114858095, "text": "I THINK YOUR TV PROBABLY NEEDED  LEDS.SAMSUNG WANTS YOU TO BUY A NEW TV. I BUY THEM BLACK MARKET AND OTHER PLACES.SOME OF THE SAMSUNGS ARE SO JUNKY THAT NO ONE WANTS TO REPLICATE THEM.THERE ARE BRAND NEW SAMSUNGS THAT ARE SO MUCH PROBLEM THEY WONT SELL ANY PARTS FOR THEM. USUALLY PANEL PROBLEMS. ONE THING YOU CAN BE SURE OF IF I CAN'T FIX IT IT CAN'T BE FIXED. ."}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "101700831136375647921", "name": "ann b", "time": 1467934007371, "rating": 5.0, "text": "He did a great job, reasonable price and fast service. You will not be disappointed! Great customer service!", "pics": null, "resp": {"time": 1566416216910, "text": "thanks good buddy"}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "102756560675171489434", "name": "Spencer S", "time": 1512605074616, "rating": 3.0, "text": "Weird experience, i tried to offer him business to repair a specific circuit on my TV I believe is damaged. He wasn't interested except to say bring it in and it's $20 to diagnose. I don't want a diagnosis, I just want to roll the dice and see if this works.", "pics": null, "resp": {"time": 1514572763216, "text": "this guy told me i had to solder a part on his circuit board that he had troubleshot it and knew what is wrong sorry dude but if you were good enough to troubleshoot it you could solder in your sleep. another narcissistic dummy."}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "109372330498668244922", "name": "Shondricka Williams", "time": 1552702134896, "rating": 5.0, "text": "I need my tv repaired. It’s a 65 vizo the screen of a cracked at the bottom. Can I fix it?", "pics": null, "resp": {"time": 1566415780093, "text": "thanks"}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "102845821373913731498", "name": "Layla Hening", "time": 1462213146112, "rating": 5.0, "text": "AMAZING, very confused by these weird reviews, he fixed two tv's for 90$ and 150$ which is 1200$ less than What we paid for both of them. They got hit by lightening and 2 other people told me it would be 75$ each to look at them..just to look at them. He charges 20 to look at them and if he can fix it it goes towards the fix price. I am so confused by these horrible reviews? We almost threw these away, and he fixed them.", "pics": null, "resp": {"time": 1576254614849, "text": "Thank you for the positive review."}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "110923428597189434853", "name": "david harrison", "time": 1487890032246, "rating": 5.0, "text": "I was told by another place that my power board as well as my led's were bad but I did not have much faith in that diagnosis so I took it to Bluff Park TV and it was just the power board, he showed prices on the board and repaired it for $180. I would recommend this place", "pics": null, "resp": {"time": 1566416171338, "text": "thanks good buddy"}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "107312579036670262853", "name": "Fe Lane", "time": 1511035335240, "rating": 1.0, "text": "Late & rude. Sound intoxicated.  My app. Was at 12 noon. I called to see if something had changed. Owner as he claimed to be speech was slurred & not making complete sentences.  I told him the app. Time he said yeah im running late it was already 1:00 an hour later. He then begin to go over the prices. I said that's fine, but I should get a discount. Yr a hour late & didnt call to say otherwise. He said he didn't have to cause he's the manager. & he said I couldn't get mad because he wouldn't give me a discount & do I want him to come & fix, my tv or not. R u kidding me u rude POS. Im not paying u a dime. I'll take my business else where. I had a good experience from them a while back, thats y I used them again. Never again. ... rude & unprofessional.  I told him that, he says I dont care what u think. Smh... not my hard earned money", "pics": null, "resp": {"time": 1511547414162, "text": "I AM SORRY YOU HAD A BAD EXPERIENCE THIS TIME AND A GOOD ONE LAST TIME. I APOLOGIZE. BUT I WAS EXTREMELY BUSY AND YOU STARTED GETTING MELODRAMATIC WANTING A DISCOUNT ECT. ON A LAMP JOB. THEN WE DISCOVERED THAT THIS WAS OLD STYLE BIG SCREEN 15 YEARS OLD AND YOU DID NOT WANT TO PUT 300 IN TO IT AND I RECOMMENDED PUT THE MONEY TOWARD A NEW STYLE TV. IT WAS YOU INSISTING ON A DISCOUNT WHEN I WAS UP TO MY NECK IN PAYING CUSTOMERS THAT SET ME OFF AND I APOLOGIZE. NO I DON'T DRINK YOU WERE MELODRAMATIC."}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "107435673327961549008", "name": "Iostream Header", "time": 1414523314905, "rating": 1.0, "text": "Owner keeps items for long periods, calls and says he doesn't have time or wants to deal with it to come get your stuff, then refuses to return the diagnostic fee because 'he diagnosed it' but refuses to provide any additional information.\n\nShameless, blatant thief.", "pics": null, "resp": {"time": 1451946245497, "text": "I THINK YOU NEED A MEMORY PILL BECAUSE I HAVE TO GET THE JUNKERS OUT OF MY WAY.I HAVE AN A PLUS WITH THE BBB. THEY DON'T LIE LIKE YOU DO."}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "115458202860151392882", "name": "Spencer Corn", "time": 1446934701315, "rating": 1.0, "text": "Tv was working fine but the speakers weren't working. Then called back a day later bc he said it would be done and he told me my TV was unrepairabe and the tv was SMOKING. my TV have never smoked before. Then he told me that if I don't pick up my TV by wedsnday he was going to junk it. It's a $1600 tv.\n\nTHIS GUY IS A SCAM ARTIST. I BELIEVE HE TAKES WHAT HE WANTS FROM TVS AND THEN TELLS U IF THEY ARE FIXABLE THEY ARE WAYYYYY OVERPRICED. A COMPLETE SCAM!!!", "pics": null, "resp": {"time": 1451946010628, "text": "IF I AM A SCAM ARTIST I AM NOT VERY GOOD AT IT CAUSE I MAKE ALL MY MONEY THE OLD FASHION WAY , HARD WORK. MANY PEOPLE TEAR THEIR TV 'S UP ON THE WAY HERE.BE CAREFUL NEXT TIME OR WE,LL PICK IT UP AND BRING IT BACK FOR 35 DOLLARS. I HAVE A A PLUS WITH THE BBB DUMMIE."}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "108549289213398465344", "name": "Eric Harris", "time": 1517263835022, "rating": 1.0, "text": "Called to ask about a part for me tv, and was told he don't sell parts to help someone else fix their TV. Then laughed and hung up. Rude jackass.", "pics": null, "resp": {"time": 1530201467268, "text": "SORRY BUT I DIDN'T LAUGH ASS HOLE"}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "104880920792756124907", "name": "Tyler Thompson", "time": 1518874818622, "rating": 5.0, "text": "Quality service and great prices", "pics": null, "resp": {"time": 1566416035950, "text": "thanks good buddy"}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "103318118506860045311", "name": "jason kitchens", "time": 1497828987760, "rating": 1.0, "text": "After reading the owners responses calling customers Dummies and threatening a street fight.....I sure as Hell would NEVER use this place.", "pics": null, "resp": {"time": 1499108557416, "text": "I DON'T KNOW WHAT YOU ARE TALKING ABOUT. I HAVE NOT BEEN IN A FIGHT IN 30 YEARS."}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "112060055402049155466", "name": "Omosefe Edosomwan", "time": 1473454332160, "rating": 5.0, "text": "Great", "pics": null, "resp": {"time": 1566416193316, "text": "thanks good buddy"}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "102366986259542170173", "name": "Caitlin Capstickdale", "time": 1405474136953, "rating": 1.0, "text": "This guy will rob you!!!!!!!!!!! Stay away..This guy took my tv and told me it would be 1 week. It took 3 weeks for him to give me an answer and I finally got tired of his BS and picked my tv up and nothing had been done", "pics": null, "resp": {"time": 1451947094493, "text": "I MAKE 7000 A MONTH TO RUN THIS PLACE OFF 20 DOLLAR ESTIMATES ,NOT.     I AM  TIRED 0F YOUR BS.COME BY AND WE'LL SETTLE THIS  LIKE MEN NOT TATTLE TALES.NEXT TIME SPEND 80 DOLLARS AT MY COMPETITORS.ANY ONE WHO CALLS ME AND SAYS THEY ARE IN A HURRY I WILL LOOK AT FIRST EVEN IN LIGHNING SEASON,DUMMIE.."}, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
{"user_id": "104161303775314868577", "name": "Elaine S", "time": 1625091958198, "rating": 5.0, "text": "This is a genuine TV repair shop. The owner is very knowledgeable, thorough, honest, and timely. Very good prices. He tells you like it is. I am very pleased with my tv repair.", "pics": null, "resp": null, "gmap_id": "0x88891f6cabaa2e59:0x57df8a84566860d6"}
