{"user_id": "107339957173018340897", "name": "Hoyt Middleton", "time": 1615524814972, "rating": 5.0, "text": "Very knowledgeable and had some amazing new gadgets.", "pics": null, "resp": {"time": 1619054545851, "text": "Thank you for the great review!"}, "gmap_id": "0x888e8ffbf4c65e57:0x800b94a84a3eb6f1"}
{"user_id": "114415659727939822690", "name": "Christen Henry", "time": 1606581050983, "rating": 5.0, "text": "Happy to help anytime I can.", "pics": null, "resp": {"time": 1606580352311, "text": "Thanks Chris! Thanks for all of your help over the years."}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "103476431782733421308", "name": "Steven Antselevich", "time": 1598535119714, "rating": 5.0, "text": "Great and easy company to deal with. Wide variety of all things technology.", "pics": null, "resp": {"time": 1606580287572, "text": "Thanks Steven! We love partnering with you. Let us know if you need anything."}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "116401516662615409053", "name": "MV SS", "time": 1521991299698, "rating": 5.0, "text": "Holt Audio and Visual is well known to me personally. I worked in the legal field in Birmingham for over 42 years as a legal secretary, legal assistant and paralegal and first learned of Holt AV's services while on the job. However, over the years, I have personally used their services on a number of occasions to obtain duplicates of and share videos and recordings that were taken on vacation and during get togethers with family and friends. One tape in particular was very old, but the staff at Holt AV did an extraordinarily important job for me in duplicating a recorded conversation with my mom made many, many years before her death. I felt they took great interest in and were attentive in doing an excellent job in delivering something that has become very precious and invaluable to me and my family. Thanks, Holt AV - wishing you well for another 60 years and beyond!", "pics": null, "resp": {"time": 1522071411392, "text": "Thanks for the kind words! Hope we can be of help in the future!"}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "101980969016605177617", "name": "Marshall Mooney", "time": 1527514496364, "rating": 5.0, "text": "Customer service at it's finest. They go out of their way to make sure you have what you need when you need it.", "pics": null, "resp": {"time": 1527599902330, "text": "Thanks for your comment! We love making our customers look their best."}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
