{"user_id": "103945014105860299405", "name": "Takezo", "time": 1590703762786, "rating": 5.0, "text": "Great service and qaulity with fast results!", "pics": null, "resp": null, "gmap_id": "0x888bc8fe57630e67:0x7b0addb1ef022ff9"}
{"user_id": "108856614970536543100", "name": "Michelle Baker", "time": 1527307459373, "rating": 1.0, "text": "Not sure", "pics": null, "resp": null, "gmap_id": "0x888bc8fe57630e67:0x7b0addb1ef022ff9"}
{"user_id": "112095737453807214268", "name": "Wyatt Lockhart", "time": 1567533723781, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x888e820b5e78a13f:0xd66e90a702006337"}
{"user_id": "108771538073309643058", "name": "Courtney Williams", "time": 1507253371050, "rating": 2.0, "text": "A lot of flaws in the fiinish product. The wrap started to peel within 24hrs.", "pics": null, "resp": null, "gmap_id": "0x888e820b5e78a13f:0xd66e90a702006337"}
{"user_id": "117615268457714159703", "name": "Chase Henson", "time": 1565613864221, "rating": 3.0, "text": "Decent food", "pics": null, "resp": null, "gmap_id": "0x888e820b5e78a13f:0xd66e90a702006337"}
{"user_id": "108005459835332504341", "name": "Brandon McCray", "time": 1597765781714, "rating": 5.0, "text": "One of the premiere production company's not only in Birmingham, but the State of Alabama.", "pics": null, "resp": null, "gmap_id": "0x88891bbcf78916e1:0x9af721405b44a700"}
{"user_id": "103445300453480876864", "name": "Amanda Hickman", "time": 1619582942142, "rating": 5.0, "text": "From he time I first spoke to him he was very personable and helpful. He answered every phone call helped me out from the time I hired him until the wedding was over he was there for me. I most definitely recommend Jeff and Timothy their amazing and down to earth.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "113059907300348675839", "name": "Wendy Miller", "time": 1622478051500, "rating": 5.0, "text": "Great job today with music and sound system at our Memorial Day ceremony. Your professionalism is 5 star!!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "106046820848664602419", "name": "Thomas Byrd", "time": 1620252444143, "rating": 5.0, "text": "Music Man Productions provides the best live sound and DJ services in the Wiregrass. He was able to work with me to come up with a package/price that was perfect for our event. Will be using again!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "105984295892714510125", "name": "Angelina Kitts", "time": 1623563534373, "rating": 5.0, "text": "Jeff was so professional and sweet and just wonderful!! He made the day perfect and I would absolutely recommend him!!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "116748653853346189234", "name": "Andy Sibley", "time": 1610137692679, "rating": 5.0, "text": "Jeff and his team did a great job. Very professionally and easy to work with. I highly recommend to hire them for all of your sound needs.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "108594849853367810529", "name": "Karen Golden", "time": 1584387456905, "rating": 5.0, "text": "Jeff Strickland is simply the best in his field. I am a gospel singer and I like to take Jeff with me when I sing at different churches. He is totally professional. He knows exactly how to blend my music and also is very easy to work with. He listens to what you want and works with you to fine tune the sound. I would highly recommend Jeff for church services, for soloists of all genres,\nweddings, reunions, parties or any and all kinds of music. Jeff is also extremely dependable!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "103784772270702534144", "name": "Headland Area Chamber of Commerce", "time": 1585336989530, "rating": 5.0, "text": "Jeff and his crew always show up early and stay with us until the job is beyond done. He provides professional, quality sound and has become part of the team for the Headland Area Chamber of Commerce. Great service and has a big heart.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "104239653481270127059", "name": "Brenda Fulford", "time": 1584312785949, "rating": 5.0, "text": "If you need music for an event of any kind Jeff Strickland is the man to call.  He has great equipment,  lights and  the type of music you prefer.  He is professional and has reasonable pricing. Always a great experience.\n\nTed and Brenda", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "101805305790946548798", "name": "Tammy Martin", "time": 1583970486184, "rating": 5.0, "text": "Have hired the Musicman several times and he is always very professional. He offers music for all occasions. Dancing and Karaoke. I give him 5 stars.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "104168710113112894887", "name": "Ronnie Bush", "time": 1584317714489, "rating": 5.0, "text": "He is very professional and knowledgeable about music and equipment. I have led  the music at church for over 35 years and our sound has never been this good.I don't know what I would do without him", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "107687923502063312996", "name": "Melvin Williams", "time": 1569640541959, "rating": 5.0, "text": "Top notch sound and lights.Great equipment,and always a great mix.Great guys to work with.He's got my vote!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "107713093748506115468", "name": "chris wortz", "time": 1583949889032, "rating": 5.0, "text": "Great equipment,  great personality,  he does a great job!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "112947858006965496584", "name": "Donnia Rambin", "time": 1583940843929, "rating": 5.0, "text": "Jeff is very professional. He does a great job and is a delight to work with.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "112100372596557505411", "name": "Shane Corbin", "time": 1568846456888, "rating": 5.0, "text": "Was very personable, we had a great time with the music selection.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "110759091560651205262", "name": "Una Taylor", "time": 1569088588845, "rating": 5.0, "text": "A Joy!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "109298565385829908994", "name": "Brittney Malone", "time": 1588388544141, "rating": 5.0, "text": "Working with Nick and his team is always an amazing experience! Nick has created amazing promo videos for my business and also captured many special moments for my family! I never have to worry what the end result will be because he always takes my crazy ideas and turns them into the perfect work of art! You will not be disappointed choosing Nick Frontiero Productions to capture all the specials moments!", "pics": null, "resp": {"time": 1589486084547, "text": "We have loved getting to be there for your business journey and through your family growing! You are family! We love you and are so thankful for you!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "101433340818095207307", "name": "Danielle Vannoy", "time": 1497495001647, "rating": 5.0, "text": "Nick Frontiero is an extremely talented photographer and it truly shows when he is in the zone searching for the perfect light and angle so that he can capture special moments. He and his wonderful team, Jenna, Susan, and Shannon, made our wedding day fun and turned what could be monotonous photos into an artistic and enjoyable experience. They were extremely professional and friendly and could make even the most camera shy person feel comfortable. We appreciate their hard work and dedication and could not imagine having anyone else shoot our special day! Our pictures turned out so amazing! Nick takes time to meticulously pick the best photos from your special day and edit them to perfection. If you want a way to preserve your wedding day so that you can share it with your family and friends for years to come, then he's your guy. My husband and I opted to not get a videographer, and after getting our photos back from Nick, I know that we didn't make a mistake in doing so because he made sure to capture everything! NFP is the bomb!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNIoAOi4BiFwtwCk93jHJB-v_VodVr4Ti6ZMDVC=w150-h150-k-no-p"]}], "resp": {"time": 1590691090404, "text": "Thank you so much Danielle!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "106407239975206507935", "name": "Christopher Stitcher", "time": 1607187070375, "rating": 5.0, "text": "Best photographer in the river region and beyond! Great team and always a fantastic product!", "pics": null, "resp": {"time": 1607359013553, "text": "Thanks so much Chris 🙏 It was great getting to see you and the family this past Saturday! Can’t wait to share your portraits with Santa!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "116709788052479615166", "name": "Lauren Williams", "time": 1588384252140, "rating": 5.0, "text": "Nick and Kayla were so wonderful to work with! They were SO patient with my 2week old for newborn pictures and our family portrays as well! Nick has such a creative eye and has such a talent for capturing the most special moments.", "pics": null, "resp": {"time": 1589486011920, "text": "We are so thankful we got to work with you and your sweet family! Thank you so much Lauren!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "109787875678780773216", "name": "Sarah Bryan", "time": 1497548634989, "rating": 5.0, "text": "Nick Frontiero is such a wonderful photographer truly devoted to his passion for art. He brought to life every aspect of our wedding day and then some. I could not have asked for better quality photos. I am still in awe that he captured some of the most personal and sacred moments of the day in such a wonderful light. We will cherish these photos forever. What I loved most about Nick's photos are the \"in the moment\" pictures that he captures. Looking back through our photos, we were able to completely relive the day and look at moments we did not see on our wedding day. We received so many photos I had no idea were taken and we are so thankful to have them. He is incredibly professional and has many options for packages. I was pleased with his work from beginning to end as he went above and beyond. I highly encourage any bride to book Nick ASAP! You will not regret it! I truly do not have enough words to describe how grateful I am for Nick Frontiero Productions. Absolutely amazing!", "pics": null, "resp": {"time": 1590691360466, "text": "It was such a pleasure! Thanks so much for having me capture that special moment in your life!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "115071144720415604565", "name": "Lyndsey J.", "time": 1499135436967, "rating": 5.0, "text": "It's difficult to put into words what an incredible experience we had with Nick and his team throughout our wedding journey. From our first meeting up to our wedding day, Nick was more than we could have asked for in a photographer. Having beautiful images that not only captured our special day but would be forever keepsakes was incredibly important and a big factor in why we selected Nick Frontiero Photography. Nick and his team captured the fine arts style I had been dreaming of while still incorporating those classic, traditional shots. Their amazing skill set is displayed in all of our wedding day images. We were blown away by the attention to detail, creativity, and the little mementos included from our special day. Not to mention, Nick's use of film along with digital really gave the unique styling we had been looking for in a photographer.\n\nA big THANK YOU to Nick, Jenna, and Shannon for helping make our wedding day truly magical and something we will remember for a lifetime.", "pics": null, "resp": {"time": 1590690609374, "text": "We are so grateful you chose us to capture such a special time in your life! It truly means the world to us."}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "116166918661193739883", "name": "Lance Mauldin", "time": 1499807614831, "rating": 5.0, "text": "Nick and his staff were incredible to work with to capture all the images for our special day.  My wife and I were blown away by the quality of the pictures and Nick's unique ability to capture special moments that we will treasure for a lifetime.  I would highly recommend Nick to anyone looking for someone that will work with you, help put you at ease, and capture the most brilliant images you could imagine.  We appreciate everything Nick did for us, and will be using him in the future for any other photography needs.", "pics": null, "resp": {"time": 1590690562944, "text": "So glad I could be part of your special day! It truly means the world to me to capture such special moments for your family!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "104521342252243684277", "name": "Stephanie Sims", "time": 1497531391862, "rating": 5.0, "text": "Leading up to my wedding I searched & searched for photographers. I wanted one that would think outside the box & be able to capture the most memorable moments on my special day, however I found SO MUCH MORE with Nick! He was professional, a ton of fun to work with & he need little to no direction. He created a vision for me took the lead and my now husband & I followed. Our engagement & wedding photos are beyond amazing to say the least! I remember the day I received my wedding album, I cried as I turned detailed page after page.\n\nI was completely blown away at how he took that one day & transformed it into a piece of art!!! I appreciated how hard he & his team members worked on the day of the wedding. When you hire someone to do a job & after they have completed the job you find it hard to put in words how satisfied & pleased you are with that individual, that's when you know you made the right decision!!!!", "pics": null, "resp": {"time": 1590691392319, "text": "I'm so glad you loved it so much! I appreciate you so much!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "109645526839109944854", "name": "Keeper58 Bibb", "time": 1498336287616, "rating": 5.0, "text": "Nick is absolutely amazing. He is very creative and always get the best shots. Him and his staff captured the best moments in our wedding. I look forward to working with him on other projects. By the way, our engagement photos were amazing and we are still getting compliments on them.", "pics": null, "resp": {"time": 1590691220786, "text": "Thanks so much!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "114062734109470476802", "name": "Courtland Bibb", "time": 1604419116592, "rating": 5.0, "text": "The staff is helpful and great", "pics": null, "resp": {"time": 1605895121621, "text": "Thanks so much Courtl Bi for the review! Serving people with the highest excellence is definitely our aim! So glad you had a great experience!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "107945904108671241724", "name": "Skyler Shirley", "time": 1497535775139, "rating": 5.0, "text": "Nick is an awesome photographer! He was my photographer for my wedding and it was the best decision I made. He takes time to learn exactly what it is you want and goes above and beyond to meet those expectations. I recommend him to anyone who ask me about a photographer for any occasion. He is the best!!", "pics": null, "resp": {"time": 1590702302369, "text": "It was truly an incredible day! I was honored you chose me to capture that special moment in your life!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "111890651726256002920", "name": "Casey Stephenson", "time": 1497497770093, "rating": 5.0, "text": "Nick is the absolute BEST in his field! He becomes personally involved in your session and is sure to capture your individuality. Nick will always be my photographer, and I can promise you won't regret using him to capture your special occasions !", "pics": null, "resp": {"time": 1590691075864, "text": "Thanks so much Casey!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "113876076560476358105", "name": "Chantal Hopkins", "time": 1497562357092, "rating": 5.0, "text": "Our experience working with Nick was beyond OUTSTANDING!  Nick is very professional and personable.  He made our engagement session so much fun!!  He also captured every single moment our of wedding day and the quality of our photos are the absolute best.", "pics": null, "resp": {"time": 1590691321424, "text": "Thanks so much!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "112955100617682591642", "name": "Jillian Ziemanski", "time": 1497620968651, "rating": 5.0, "text": "Nick and his team were perfectly professional while still maintaining a relaxed atmosphere. They captured every moment of our wedding day flawlessly! Our photos tell a beautiful story, and we're so thankful that we chose Nick as our photographer!", "pics": null, "resp": {"time": 1590691242311, "text": "Thanks so much Jillian! It was a pleasure!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "116403716739192401006", "name": "Chase Watford", "time": 1497531959584, "rating": 5.0, "text": "There are absolutely not enough words to describe how thankful I am to have chosen Nick Frontiero Productions and his team to capture our day. I had a friend who used Nick and knew immediately i wanted to use him for our wedding day. Not only are his pictures absolutely gorgeous , but he goes above and beyond to give his brides exactly what they ask for. We did not know eachother before the wedding process, but now Nick and his wife Jackie are some of my most cherished friends. Nick brings a full team to shoot on the wedding day and i seriously felt like a celebrity with an entourage. There is not one moment of our day that they did not capture. I am forever grateful for this guy and his insanely cool photography skills. You will NOT regret booking Nick Frontiero Productions for your event. I can't wait to use him again for maternity and family photos one day!\nMuch Love,\nLindsey Watford", "pics": null, "resp": {"time": 1590691414566, "text": "It was such a pleasure! Thanks so much!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "116968254954101198083", "name": "Lauren Hoepfner", "time": 1503093568128, "rating": 5.0, "text": "I cannot say enough good things about Nick and his team! Nick helped us to design a wedding package that worked the best for us and fit our budget. We wanted to do a lot of our pictures before the ceremony, and Nick worked with us to get everything figured out. He put together a detailed timeline for the wedding day, so we knew exactly who needed to be where and when. He and his team were so incredible to work with and captured absolutely amazing pictures of our entire wedding day. Nick also has 2 Polaroid cameras and took polaroids throughout the day. At the end of the night, he presented us with a beautiful wooden box with our names on it, full of all of the polaroids he had taken that day!! It was such an awesome surprise to have at the end of the night, and we loved getting to see a sneak peek of our wedding pictures. When our final photos came, they were PERFECT!! Thanks Nick and team for being the best and helping make our wedding day so much fun!! Y'all are the best!!", "pics": null, "resp": {"time": 1590690499843, "text": "We are so glad to be part of your special day!! We are so grateful!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "108447198262550732644", "name": "Elizabeth Wells", "time": 1497542527695, "rating": 5.0, "text": "Nick and his team were great to work with through the planning process and the day of our wedding. He took beautiful photos of the wedding and we'd definitely recommend him to a couple looking for a photographer.", "pics": null, "resp": {"time": 1590702242449, "text": "It was an honor you chose me to capture your special day! Thanks so much!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "118360194249319202501", "name": "Natalie Rowell", "time": 1497498547843, "rating": 5.0, "text": "Nick is an amazing photographer and is just as awesome of a person! Very professional and fun! He makes the experience very comfortable and produces amazing images! He will not disappoint!", "pics": null, "resp": {"time": 1590691102608, "text": "Thanks so much Natalie!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "109753910865605205735", "name": "Meredith Moseley", "time": 1497527011479, "rating": 5.0, "text": "Nick did our Senior Portraits and we were and still are in love with our images, Nick was very easy to work with, very affordable and FUN! I can't wait to have my grandson's growth captured!", "pics": null, "resp": {"time": 1590691117347, "text": "So glad we got to capture those memories!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "107856030216026223930", "name": "Haley Daniel", "time": 1497964717408, "rating": 5.0, "text": "He did AMAZING on our engagement pictures, wedding pictures, and wedding album!!!!! We love him!!! So glad we used Nick to capture moments that we will have forever :)", "pics": null, "resp": {"time": 1590690690490, "text": "Hey Haley! It was such an honor getting to share such special moments with you!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "104487008235926237871", "name": "Jenna Garrett", "time": 1497803506600, "rating": 5.0, "text": "From the moment NFP started popping up, I've admired Nick's photography style - so booking him for my wedding was already a given! I've seen Nick in action, and final products, but I was speechless when I finally got into our gallery! He captured so much emotion and happiness authentically, with each image providing an excellent reminder of each individual moments of our day. One of my favorite parts of the day was getting a box of polaroids at the end of the night - along with the film shots later. He can take any space/venue and make it look elegant - even our small backyard ceremony! You can choose a photographer who's style you like, or choose a photographer who's style constantly evolves and adapts with each individual wedding. All the weddings Nick has photographed look amazing, but I don't think you fully appreciate the talent until you see yourself captured by it. He's laid-back, focused, and actually a pretty stealthy photographer. NFP is an investment worth making if you want beautiful memories captured to last a lifetime!", "pics": null, "resp": {"time": 1590690765069, "text": "Hey Jenna! It was truly an honor getting to capture your beautiful day! You've become family! and we love you!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "102806665749781507066", "name": "Derek Tucker", "time": 1625866503806, "rating": 5.0, "text": "Awesome customer service", "pics": null, "resp": null, "gmap_id": "0x889bb52d03c08b75:0xa3593c0d337da849"}
{"user_id": "100059897418243984075", "name": "James Lindsay", "time": 1614323113365, "rating": 5.0, "text": "All Pro - All the time!  :)", "pics": null, "resp": null, "gmap_id": "0x889bb52d03c08b75:0xa3593c0d337da849"}
{"user_id": "110502430179174170939", "name": "Extra Josh", "time": 1607021371627, "rating": 5.0, "text": "Very friendly staff. Book all your gigs through these guys!", "pics": null, "resp": null, "gmap_id": "0x889bb52d03c08b75:0xa3593c0d337da849"}
{"user_id": "106686522521994937389", "name": "Joseph Stapleton", "time": 1561743386127, "rating": 5.0, "text": "Seriously one of the best places I've worked. Love the atmosphere and the people.", "pics": null, "resp": null, "gmap_id": "0x889bb52d03c08b75:0xa3593c0d337da849"}
{"user_id": "111500915471838052434", "name": "Brenda Brown", "time": 1527339876537, "rating": 5.0, "text": "This company has all you need for stage sound and lighting. Great ppl. Great staff.", "pics": null, "resp": null, "gmap_id": "0x889bb52d03c08b75:0xa3593c0d337da849"}
{"user_id": "111452754108101879222", "name": "larry wade", "time": 1502739668625, "rating": 5.0, "text": "Good people always there when I need them", "pics": null, "resp": null, "gmap_id": "0x889bb52d03c08b75:0xa3593c0d337da849"}
{"user_id": "102769613785702947594", "name": "A. Lee Abbett Sr.", "time": 1500461844698, "rating": 5.0, "text": "Some of the most talented production people on the planet", "pics": null, "resp": null, "gmap_id": "0x889bb52d03c08b75:0xa3593c0d337da849"}
{"user_id": "106367377098067637073", "name": "john bolter", "time": 1487600335512, "rating": 5.0, "text": "Great place to work for", "pics": null, "resp": null, "gmap_id": "0x889bb52d03c08b75:0xa3593c0d337da849"}
{"user_id": "117807557896104808508", "name": "Jason Kelly", "time": 1601574963836, "rating": 5.0, "text": "Strong Automotive works very hard for their clients, and have developed strong bonds with their media partners. Working with Strong, I am guaranteed detailed communications, and the items I need for a successful campaign are going to be delivered in a timely manner. I highly recommend working with them, if you need their services.", "pics": null, "resp": {"time": 1601647863712, "text": "Thank you for your review, Jason! Your kind words mean so much to us. We are so glad you have had a great experience working with us and we hope that never changes! Please let us know if there is anything we can do for you. Have a great weekend!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "118280099362659724572", "name": "Erika Rios", "time": 1574347688565, "rating": 5.0, "text": "I am thrilled to be part of this talented team that continually drives results for our clients. The work we do is valuable, and management recognizes us for our hard work. Not only does Strong value the importance of digital marketing, but we ensure our clients do through continuous learning. Our yearly Strong Digital Marketing Summit at Google's Headquarters is a prime example of it. We invite our dealers to come to learn about paid search, service marketing, YouTube pre-roll, and local marketing. I highly recommend working here or better yet hiring Strong to take your dealership to the next level.", "pics": null, "resp": {"time": 1574368118223, "text": "Thank you for your review, Erika!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "115066928371365438972", "name": "David McMath", "time": 1572385610581, "rating": 5.0, "text": "This place really knows what it's doing. In business since the 70s, STRONG has not shifted its focus to some distractingly shiny object and lost its way. STRONG has been helping individual car dealers advertise their businesses and they have just gotten better and better at it. From the Sunday papers in the way-olden days to the digital and social screens that are everywhere all day every day today, STRONG knows how to get the message out there. Good job, SAM.", "pics": null, "resp": {"time": 1572616874532, "text": "Thank you so much for your review and kind words! We're happy to have you on our team!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "108203104048157951893", "name": "Andrea M. Kring", "time": 1528944029715, "rating": 5.0, "text": "When we buy a car, we consider so many details that will reflect our individuality.  The make, model, color, price, even the tires are elements that ultimately reflect what is important to each of us.  Can you imagine not considering the engine?  What good is our vehicle if we don’t have structural integrity under the hood? It would be nothing more than a pretty yard ornament and certainly wouldn’t take you far.\n\nI was drawn to Strong Automotive because I could see it had structural integrity.  I watched the company for over a year before I decided to consider working with them.  On the exterior, it looked bright, energetic, and fun.  When I took a look under the hood, I found in this agency a diverse, highly creative, and dedicated group of people who want one thing:  to be kind of engine that drives customers to your product. Every department at this agency works closely together like a well-oiled machine (pun intended) that is always being tweaked and improved to make sure it runs smoother and faster than the day before.\n\nWhen you consider Strong to represent your business, you can know that the people who make up the company truly love what they do and they are excited about working for you.  Thanks to John Paul Strong, we have a work environment that allows us to be that high-quality engine you need to drive clients to your business. #WEARESTRONG", "pics": null, "resp": {"time": 1572530005412, "text": "Thanks for your review, Andrea!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "116027403893328586710", "name": "Luke Thomas", "time": 1530134089635, "rating": 5.0, "text": "To create the best product, you’ve got to have the best team. Strong Automotive Merchandising has got this down pat. The people behind this agency are friendly, creative, and diverse. Plus, the leadership understands how important it is to stay fresh with training, career development, and providing an awesome place to work.\nFor customers it’s a surefire way to drive traffic, for employees it’s a workplace full of opportunity. Either way, you can’t go wrong when you choose Strong.", "pics": null, "resp": {"time": 1572032482094, "text": "Thank you for your review and kind words, Luke!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "117772951541245199240", "name": "Michele Lee", "time": 1529615144614, "rating": 5.0, "text": "Strong Automotive Merchandising provides innovative, effective, and purposeful service to their clients. Not only does this company value their business with clients, but also with their employees - being named Birmingham's Best Place To Work. I highly recommend Strong to both client and future employee. Anyone would be lucky to develop a relationship with this great company.", "pics": null, "resp": {"time": 1572032497008, "text": "We appreciate it, Michele!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "105800213582110031720", "name": "Tony Lopez", "time": 1532004945941, "rating": 5.0, "text": "If you're an automotive dealer looking to drive results, look no further.  After 19 years of working to drive floor and web traffic for dealers,  I don't think I've worked with a team more dedicated to that.  They have a full understanding of what media needs to be used in each phase of the buying process.", "pics": null, "resp": {"time": 1572032444190, "text": "Tony,\nWe appreciate your review and kind words!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "100401235661534663638", "name": "Katherine Reeves", "time": 1527714843859, "rating": 5.0, "text": "Strong Automotive Merchandising is truly the only advertising agency of its kind. John Paul and his team’s deep knowledge and understanding of the Automotive industry make them uniquely qualified to service automotive clients. Strong is a full-service agency that is organized, efficient, and results oriented.", "pics": null, "resp": {"time": 1527778760951, "text": "Thank you so much for your review and kind words! We're happy to hear that you're pleased with the service we provide, and we love working with you."}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "101176373838177776957", "name": "Emily Johnson", "time": 1572616517917, "rating": 5.0, "text": "Strong Automotive is a great place to work that really cares about both their customers and their employees.", "pics": null, "resp": {"time": 1572706818964, "text": "Thank you for the review, Emily!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "112740085981900133702", "name": "Mimi Hoffman", "time": 1528402336355, "rating": 5.0, "text": "Strong Automotive Merchandising is not only an exceptional and very successful company, but an ideal place to work. Everyone here is very friendly, and works extremely hard to meet and exceed our client’s expectations!", "pics": null, "resp": {"time": 1572530022307, "text": "Thank you for your review and kind words, Mimi!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "109774611003589577684", "name": "Nathan Phillips", "time": 1470843168766, "rating": 5.0, "text": "Full service automotive merchandising solution company offering traditional marketing channels plus world-class Google Premier Partner certified digital marketing. I'm incredibly proud to be part of such a team and a movement that exceeds auto dealer's merchandising needs!", "pics": null, "resp": {"time": 1572530057703, "text": "Thank you for your review, Nathan. We love having you on the team!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "100014998391677947483", "name": "Scott Rossi", "time": 1422229801121, "rating": 5.0, "text": "I have been a client with Strong since 2006. They never have failed to produce.", "pics": null, "resp": {"time": 1572530072027, "text": "Thanks for your review, Scott!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "112083818066161244987", "name": "Aritro Ghosh", "time": 1415792288784, "rating": 1.0, "text": "They suck!", "pics": null, "resp": null, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "101784890318904337391", "name": "E Walton", "time": 1619797124022, "rating": 5.0, "text": "Very loving and genuine family. I thank God for allowing me crossing the Goleman’s path to give me an opportunity of a lifetime of becoming an actor and role in a great movie @arkansasthemovie Very professional casting agency.", "pics": null, "resp": null, "gmap_id": "0x889a4fd0ebafffff:0x55be9e7790a23b89"}
{"user_id": "106267432965755805054", "name": "Thomas Baskowsky", "time": 1615422525779, "rating": 5.0, "text": "All I can say about Goleman Casting is Thank You.  Ron and Brandy were some of the first people I met in Alabama. They treated me as a friend from day one.  I will recommend Goleman Casting where ever I go.", "pics": null, "resp": null, "gmap_id": "0x889a4fd0ebafffff:0x55be9e7790a23b89"}
{"user_id": "105659132868711600717", "name": "Alicia's Spicy Life", "time": 1605840407157, "rating": 5.0, "text": "Professional & detailed company. One of the best casting companies in the film business.", "pics": null, "resp": null, "gmap_id": "0x889a4fd0ebafffff:0x55be9e7790a23b89"}
{"user_id": "107306859149398467343", "name": "Gary Cook", "time": 1624695915372, "rating": 5.0, "text": "Great agency", "pics": null, "resp": null, "gmap_id": "0x889a4fd0ebafffff:0x55be9e7790a23b89"}
{"user_id": "112655460420259339502", "name": "Time to Eat Cafe", "time": 1577812202603, "rating": 1.0, "text": "Profoundly unprofessional folks!  They took a personal disagreement and weaponized it to disparage a business.  Hardly the mark of decent people.", "pics": null, "resp": null, "gmap_id": "0x889a4fd0ebafffff:0x55be9e7790a23b89"}
{"user_id": "105075038705965168381", "name": "A Todd Baker", "time": 1608124967480, "rating": 5.0, "text": "#1 casting for Gulf States.", "pics": null, "resp": null, "gmap_id": "0x889a4fd0ebafffff:0x55be9e7790a23b89"}
{"user_id": "104794436132006187855", "name": "Kenneth Kerns", "time": 1536437586436, "rating": 5.0, "text": "Went to see their production of Joseph Amazing Technicolor Dreamcoat at Lee Highschool. The show was fantastic. Very entertaining!.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO5ArVas3hEGbc9tSx3hkBHqOcXT2O2Du1AusN2=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862148fffffffff:0x9b07b99100e06489"}
{"user_id": "104778417049308953952", "name": "Jackson Robinson", "time": 1521225249568, "rating": 5.0, "text": "Great people!", "pics": null, "resp": null, "gmap_id": "0x88891bbd71b104f3:0x252d52494a7843d2"}
{"user_id": "104523197909592298247", "name": "Trey Short", "time": 1579492744157, "rating": 5.0, "text": "I love this place and the staff they helped me through all of my audio production needs.", "pics": null, "resp": null, "gmap_id": "0x8889cbb913320b0d:0x7a585e512f39395c"}
{"user_id": "115631327055748696995", "name": "Pop Pop Brooks", "time": 1580922554182, "rating": 5.0, "text": "Great website and company!", "pics": null, "resp": null, "gmap_id": "0x8889cbb913320b0d:0x7a585e512f39395c"}
{"user_id": "114772888809185197294", "name": "Malorie Mckee", "time": 1623432514301, "rating": 5.0, "text": "Down in Front blew me away! They are the best in the business. They were all so kind and could not have pictured my wedding day without them. My husband and I will forever be grateful for them. Best wedding video I could have asked for!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "118329760043540933192", "name": "Jennifer Campbell", "time": 1594132841747, "rating": 5.0, "text": "I’ve yet to meet someone who doesn’t love DIFP! They worked effortlessly to make our wedding perfect. They always go above and beyond to help make wedding days run smoothly. We own a venue so we are lucky to get to work with them, but having them video our own wedding was a blessing. On top of being outstanding videographers, they also double as coordinators just because they’re so willing to lend a hand. Numerous times I’ve seen them run to get something that was forgotten or even take off their rain jacket an put it under my dress so it didn’t get soaked from the grass. They are a joy to be around! We are so thankful for DIFP and can’t recommend enough!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOJAeumUS7RE0tA5rChWwqz50UF-2Nj4xx-HdHK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN52eiobG9iCIgxgzn2oDwPOebklK18dcTvPb2D=w150-h150-k-no-p"]}], "resp": {"time": 1596194145187, "text": "We love you and Taylor so much!! Can’t wait for many more years of hanging out with you two!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "100400079868832203022", "name": "Ashlynn Bowman", "time": 1619532789821, "rating": 5.0, "text": "I don't have enough good words for these guys. They capture every detail and make you feel important! They show professionalism and made me feel so comfortable. 10/10 Recommend using Down In Front Productions.", "pics": null, "resp": {"time": 1619533537091, "text": "We love the Collier's!! Thanks again for having us as a part of your big day!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "115913805013458234390", "name": "Taylor Arasmith", "time": 1620918904282, "rating": 5.0, "text": "I cannot say enough good things about Down In Front Productions! They are an amazing crew to work with and have be a part of such a special event. We love our video and are so happy we chose the best to put it together!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "104466812793751764417", "name": "Terri Lane Robertson", "time": 1576078979437, "rating": 5.0, "text": "Recently worked with the videographers at DIFP while I was photographing a wedding. Such incredible people. Courteous, fun, and great at what they do. If you need a videographer for your next event, I highly recommend them!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOwmpBVkzAnBqSMp_b5neYzoSqpB6HlEfOD1_Wn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOLTSRTv7mm9fbmrXwzWxUgVagzh4dgQXsyE6LD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPJaE9mZgj1ESw9K9vGLSKiRuCknCMx419lVQoI=w150-h150-k-no-p"]}], "resp": {"time": 1610576905987, "text": "Thanks so much, Terri! You are amazing to work with!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "117284359638672973210", "name": "Katherine Justice", "time": 1612465024587, "rating": 5.0, "text": "Down In Front Productions, LLC were our videographers on our wedding day. They were amazing to work with! Jennifer, Stephen, Tyler and Haley Grace felt like family by the end of the day. Jennifer made the booking process so easy and helped answer all our questions. Stephen, Tyler and Haley Grace were with us day of the wedding. They were very professional and captured so many memories that we will cherish forever. Highly Recommend!!", "pics": null, "resp": {"time": 1612492438962, "text": "Thanks, Katherine! We had so much fun! We are so thankful we got to spend the day with you and Tim and hope you both cherish your video forever!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "102862053897550284320", "name": "Rietta Marie", "time": 1623859210829, "rating": 5.0, "text": "My husband and I absolutely loved having DIFP for our wedding day! They offer affordable deals/packages, including an option to have the raw footage of your wedding day (who else does that??), and they make awesome teasers and wedding videos, but what especially stood out for me and my husband was the way they conducted themselves throughout the day. I loved having Jennifer and Abbie around as if they were honorary bridesmaids (holding my lipstick in their fanny pack for me, helping me make little decisions like what moments do I want to be wearing my veil, etc.) Some of the videographers even helped unload our cars the morning of. They immediately fall into a close friend role- making sure you're always smiling and/or laughing- they aren't just there to film you. I think that element of what they do is priceless- because the videographers and photographers are who you're gong to spend the most time with on your special day- and it makes a significant difference when those people are kind and fun to be around. You won't go wrong with DIFP! :)", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "105325144137218428456", "name": "Marla Hogue", "time": 1612917453588, "rating": 5.0, "text": "You want the best? DIFP. I never thought I would want a video of my wedding day, but working with this team and seeing their art made me feel lucky to have one. They radiated nothing but positivity and good vibes the entire day. Even if they weren't making a video, I would invite them to my wedding. 10/10 recommend.", "pics": null, "resp": {"time": 1614892120544, "text": "Thanks so much, Marla! We love you guys and had so much fun spending the day with you!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "117122660441644843089", "name": "Kalei Woodley", "time": 1617326844882, "rating": 5.0, "text": "DIFP were our wedding videographers and we literally could not asked for anything better. They were personable, sweet, funny; everything you could want in someone who’s going to follow you around your whole wedding day! Highly recommend using them!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "110387279282910657248", "name": "Breanna Culwell", "time": 1601660034294, "rating": 5.0, "text": "Down in front productions was nothing short of amazing. I had heard so many great things about the company as a whole and everyone talked about how great of a guy Dustin was. When I tell you that’s the truth, I mean it. They made our wedding video dreams come true. They are so easy to get in touch with and really understand in depth what you are wanting behind every little detail that needs to be captured. They were incredibly fun to hangout with throughout the day and produced and amazing video where we can relive our wedding day for years to come. Hiring them was one of the best decisions we made for our wedding day. 💍💗", "pics": null, "resp": {"time": 1610575433620, "text": "Thank you so much for this sweet and thoughtful review! We had so much fun with you both and hope you enjoy your video for years to come!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "105339270767030060106", "name": "Katie Swann", "time": 1621362823194, "rating": 5.0, "text": "WOW! We truly cannot recommend DIF enough. We just received our wedding video, and we can't stop watching it! We are so grateful for all the precious moments that they captured, like our first look and all the fun dancing shots at the reception!\n\nThe DIF team was a huge part of making our day perfect. When my husband and I each arrived separately at the venue that morning, DIF recorded private audio interviews with us both. This simple action really helped us both get in a great headspace and helped calm us before all the big moments to come.\n\nThank you, DIF! You guys are wedding rockstars!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "104050007785366112345", "name": "Beatriz Arcanjo", "time": 1612794411584, "rating": 5.0, "text": "Hands down the best videographers in town! They were so easy to work with throughout the wedding planning process. From day 1, Dustin was super helpful and friendly (not to mention, hilarious to talk to). Fast forward to the wedding day, they were just as awesome in person! Tyler and Haley made us feel so comfortable and were both so sweet. Thank you DIFP for capturing the best day of my life!", "pics": null, "resp": {"time": 1614892082873, "text": "Thank you so much! We had so much with you all and hope you cherish your video forever!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "108189242788140925900", "name": "Briana Freeberg", "time": 1600905025774, "rating": 5.0, "text": "Such an amazing group of people! When I spoke to Jennifer and Dustin in the beginning I had no doubt that we had made the right decision on who should be our videographers. We could not have asked for better people to work with and make our wedding video! They made the day so much fun! DJ was great and made the interview process so easy! We absolutely loved the whole  experience and our amazing video! Thanks for making our day even better! You guys are the best!", "pics": null, "resp": {"time": 1600968195504, "text": "We love you guys and can't thank you enough for this sweet review!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "103369407617648812721", "name": "Tammy Elliott", "time": 1607077748593, "rating": 5.0, "text": "Down In Front Productions went above & beyond to make my daughter’s wedding day, nothing short of perfect! By the end of the day, they were like family! Thanks guys for everything you did, behind the scenes, and for being so helpful! The video is awesome! Thank you for capturing Jessi & Bradey’s story! I will treasure, forever!\nTammy Elliott (Mother of the Bride)", "pics": null, "resp": {"time": 1610575603041, "text": "Thank you so much! We had a great time with all of you and are so thankful we got to be a part of Jessi and Bradey's special day!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "114534264739819979867", "name": "Rachel Campbell", "time": 1603157146883, "rating": 5.0, "text": "Jennifer and Dustin and the whole team with Down In Front Productions were always very responsive to emails and communicated with Jack and I throughout this whole experience. When we had to postpone our wedding in May due to Covid they were understanding and made it a priority to be at our new date. Great people to work with, super helpful and highly recommended. They made our day in September so much more fun and very easy. We love you guys!", "pics": null, "resp": {"time": 1610575642365, "text": "Thank you so much for this sweet review!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "116359974355149958000", "name": "Julia Martin", "time": 1616519525691, "rating": 5.0, "text": "I truly could go on for days about how AMAZING the DIFP team is! You can genuinely feel that they all love what they do. From the beginning they were incredibly wonderful to work with and on wedding day they were even more fantastic. They made us laugh, smile, shared some dance moves, some tears but most importantly they became family! Truthfully, I’m almost certain without them our wedding day wouldn’t have been with the same! We still have guests raving about how much they loved Dustin!! I would absolutely recommend DIFP for any videography needs, especially wedding, do not think twice about it!!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "100141716752179819420", "name": "Kaylin Hill", "time": 1599051900234, "rating": 5.0, "text": "DIFP is amazing!!! 5 stars isn’t 1/2 of what they deserve! They went above and beyond to make our wedding day perfect! They made the day so fun and easy! I’m often awkward when it comes to videos but the DIFP team knew exactly what to say and how to make it fun! We recently received our video of our wedding day & it is more than I could have imagined. We will enjoy our video for years and years to come! Thank you DIFP!", "pics": null, "resp": {"time": 1610575670522, "text": "Thank you so much for this thoughtful review! We love you guys!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "107054080571496429444", "name": "Jeremy Weathers", "time": 1597612271704, "rating": 5.0, "text": "Dustin , DJ and Katie were awesome ! They are great at what they do and make everything super easy for you! I was so worried about talking on the video and being on camera but Dustin made it so easy and like you was talking with someone you had know your whole life! I will forever be grateful for all they did for us on our wedding day! And thankful for the friendship we now have!   Thank y’all again for everything!", "pics": null, "resp": {"time": 1610575706907, "text": "Thank you, Jeremy! We had such a great time with you all and hope you cherish your video forever!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "107413261639147708385", "name": "Kasie Robertson", "time": 1596123138235, "rating": 5.0, "text": "5 stars is not enough!! Addison, Steven, and Stephen were so awesome and fun to be around. They immediately felt like friends. They went above and beyond to make our day perfect and our video turned out amazing! Our wedding day seems like a blur but I'm so thankful we will forever have  our video to relive it! Dustin - thank you for everything! We love you guys!!!", "pics": null, "resp": {"time": 1596194060923, "text": "We love the Robertson’s!!! Thank you guys so much and we can’t wait to see what the future holds for you two!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "102453965584216339589", "name": "Kristen Valentine", "time": 1603903045798, "rating": 5.0, "text": "DIFP is by far the best. I could not have found a better company to be a part of our special day. From the initial inquiry all the way through the wedding the staff were prompt, on top of everything and so friendly. They truly felt like family day of. Cannot sing them enough praises.", "pics": null, "resp": {"time": 1603906348726, "text": "Kristen, thank you so much for these sweet words. We had a blast with you and Clay-Riley and can’t wait to see what the future holds for y’all!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "109205105553516234393", "name": "Kendyl York", "time": 1595017357985, "rating": 5.0, "text": "So much love for DIFP. They made our entire wedding day even more fun, easy, and memorable! The people are as kind and funny as can be and know exactly what to do in any situation. Not only did they travel in town for our wedding, but they were there the entire day capturing every little special moment. The video will always hold a special place in our heart because it will allow us to relive our wedding day that was a dream! All of our guests also picked up on how awesome they were and wanted to know where we found them. From the time we booked them almost a year out they were in touch with us and always available to answer any questions. They create a bond with their customers. I highly recommend them because they are seriously top notch and the best!!", "pics": null, "resp": {"time": 1595081401535, "text": "We love the York family!! Thank y’all so much for having us and we are so happy we got to be a part of your day!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "107513874171980106428", "name": "alyssa eason", "time": 1610997037197, "rating": 5.0, "text": "If I could offer any piece of advice to new brides out there- invest in your videographer! We luckily found  DIFP at a local bridal show and thank goodness we did! They were professional with every meeting leading up to the actual wedding day. Not only did they capture sweet and unforgettable moments, but they were by my side (and my husbands) all day! From carrying my bouquet, carrying my train, reminding me to hold my shoulders back- they were there and I am so grateful for them. You can tell the LOVE what they do. They bring so much energy to the day that can’t be matched. Their finally product of my wedding day is one I will cherish forever. I would recommend  DIFP to anyone and everyone I could!", "pics": null, "resp": {"time": 1612492317831, "text": "Thank you so much, Alyssa! We had such a great time with you both and are so thankful we got to be a small part of your special day!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "115065872787757900897", "name": "Jessica Weathers", "time": 1597612560723, "rating": 5.0, "text": "DIFP is amazing! When I first spoke with Jennifer and Dustin I knew I wouldn’t have to worry about a thing! It was so much fun working with Dustin, Katie, and DJ on the day of the wedding...they fit right in with our family and friends and made everyone feel comfortable! Thank y’all so much for making our wedding day so special! Our video is perfect and we will forever cherish it!", "pics": null, "resp": {"time": 1610575865360, "text": "We love you both and hope you cherish your video forever!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "115371080406591801653", "name": "Taylor Sund", "time": 1590679886007, "rating": 5.0, "text": "They were amazing during our wedding day. Dustin connected really well with my husband and the whole crew made us feel comfortable and relaxed. Even the posing parts was made light and fun even though you have cameras in front of you. The final product is so amazing. Their editing skills and the way they make it real to us was beautiful. They put in the special moments and we're just so glad we had them for our wedding day.", "pics": null, "resp": {"time": 1610575917264, "text": "Thank you so much for having us and we hope you cherish your video forever!!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "103399633477585281900", "name": "Ashley Coppock", "time": 1587082179788, "rating": 5.0, "text": "Down in Front made the whole wedding process and wedding day so easy! They were incredible to work with and were so helpful the day of! Our video captures our wedding so well and we couldn't be more happy with how everything turned out! They were so fun to have at our wedding the day of, they were hilarious, and so helpful with anything we didn't even have to ask, no matter what it was even not related to our video! Thanks for everyone who worked out wedding and helped in creating our video! We highly recommend using this fun group for anything you need!", "pics": null, "resp": {"time": 1610576003978, "text": "Thank you for this sweet review, Ashley! We are so thankful we got to be a small part of your big day!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "115218461940071231459", "name": "Jocelynn Rodgers", "time": 1602525607597, "rating": 5.0, "text": "The Down in Front Productions team was literally the best! Their team went above and beyond. They made sure we stayed on schedule, helped carry my dress/ veil, captured all each moment, and not to mentioned keep the ducks from nipping at my dress (lol). I was so happy I chose them because they were just so much fun to be around and made everything so easy! A brides dream for hiring a videographer!", "pics": null, "resp": {"time": 1610575954522, "text": "Thank you so much! We had such a great time with you both!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "105720606709342613799", "name": "Sydney Surrett", "time": 1600819410367, "rating": 5.0, "text": "Best videographers EVER!  They did such an amazing job capturing our special day! They are so nice and so easy to work with!! They are very responsive and so professional!! If you're getting married Down In Front is a MUST HAVE!! I can not rave about them enough!!", "pics": null, "resp": {"time": 1600823076556, "text": "Thank you Sydney!! We love you and Evan and can’t thank you enough for these kind words!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "103032495665713161700", "name": "Robbie Federer", "time": 1592531317233, "rating": 5.0, "text": "This incredible team helped make my daughter's wedding the day of her dreams.  Thank you all so much for giving us a beautiful video which will allow her and our new son-in-law to re-live that beautiful day for many years to come.  You all were so helpful on that day and we were glad to share the day with you all.  We love you all!", "pics": null, "resp": {"time": 1610576057325, "text": "Thank you so much for having us and for this kind and thoughtful review!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "117814846644791499513", "name": "Kendal Federer", "time": 1592011317357, "rating": 5.0, "text": "From the very first phone conversation I had with Down in Front to the actual Wedding date to even the weeks following the wedding—Down in Front was completely amazing. They made us feel special in every moment on our wedding day! They are truly the most down to earth, thoughtful, hard-working, talented, generous company we have ever worked with. Also, I just want to say how much effort they put in to our day. They were there for us during the whole day. Jennifer was an angel! Seriously! Not only did they produce a video that captured all the moments that we worked so hard to plan that we will cherish forever, but they thought so much about us—from carrying my dress to making sure we stayed hydrated between pictures to just laughing with us and making us feel like we had known them our whole lives—it is very rare to find this in a business and if you are searching for a videographer, I promise, you will not find any better than Down in Front Productions. Thank y’all for making our dreams come true and being a highlight that we will cherish forever❤️❤️", "pics": null, "resp": {"time": 1610576418869, "text": "Thank you for having us, Kendal! We are so glad we got to be a small part of your special day!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "106266547090010898795", "name": "Jared Waits", "time": 1579238371611, "rating": 5.0, "text": "We just got our video back from our wedding! It was better than we expected. I dealt with Dustin the majority of the day. He was exceptional. He communicated well. Over the top friendly. The day of my wedding I wanted to ask him to stay and hangout with me and my friends. Great company and their work is fantastic.", "pics": null, "resp": {"time": 1610576679604, "text": "Thank you for this kind review, Jared!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "115821985310828347736", "name": "Ethan York", "time": 1593623976098, "rating": 5.0, "text": "Amazing company run by even more amazing people! They are way more than just videographers, they are great people. From the time we contacted and booked them 11 months out, they were there for us through messaging and phone calls. They were not afraid to jump in and help! They make a connection. They are an extremely fun and entertaining group of people to hang out with. For what they do their prices are an amazing deal; they were there filming from sunrise until the very end of the night. I would highly recommend DIFP to anyone looking to film a wedding, business, or sporting event. They helped make our wedding day so special and we will be able to watch it over and over again thanks to them! All of our guests also raved over them also! They are THE best!!", "pics": null, "resp": {"time": 1610576308659, "text": "Thank you so much, Ethan! We love you and Kendyl and hope you both cherish your video forever!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "114291801615074796109", "name": "Andrea Casserilla", "time": 1581033614783, "rating": 5.0, "text": "Down In Front Productions was one of the best decision that I made in planning my wedding! We just got our video back and my husband and I were both in tears. They captured our entire day and made it into the most beautiful 10 minute video! Speaking to the day of my wedding, their staff was absolutely phenomenal in making the videoing seem natural. Jennifer went above and beyond even helping me with all the little things to make me feel so special on my big day! Book them today, you will not regret it!!", "pics": null, "resp": {"time": 1610576611458, "text": "Thank you so much for having us!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "115344317828677714968", "name": "Ashley Green", "time": 1603199991895, "rating": 5.0, "text": "I absolutely could not love the folks at DIFP more! We hired them for our wedding and from the moment we started our day, the energy from Dustin and Katie was incredible. They genuinely WANT to be there and make you feel at ease, they WANT to cut up and have a great time while also giving you the highest quality material. Our teaser and highlight video are the most gorgeous things ever- I love how they were edited and colored, the clips are perfect and cover all our favorite moments. The delivery was SUPER quick to be so thoroughly done. We absolutely love our experience with DIFP and love watching other happy couples' that they share as well! You will not regret investing in DIFP for your videography needs.", "pics": null, "resp": {"time": 1610576145968, "text": "Thank you so much for having us!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "114693300566173257779", "name": "Anna King", "time": 1603810394575, "rating": 5.0, "text": "If you need a videographer DOWN IN FRONT WAS AMAZING! not only were they super friendly people to work with but they did such a good job on our wedding highlights and are personal to every couple or event they do", "pics": null, "resp": {"time": 1610576120924, "text": "Thank you, Anna! You guys were so much fun and we hope you cherish your video forever!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "115890685592379581323", "name": "Amanda Nicolosi", "time": 1573088712307, "rating": 5.0, "text": "An absolute gem of a production team and company as a whole. Our video was done within the one month anniversary of our wedding and was absolutely amazing! They did everything we asked for. The team was there all day, literally sun up to sun down, and were so friendly. It’s like they weren’t even there, always in the shadows to stay out of the way but capturing all the best moments. Highly recommend- you won’t be disappointed!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "115028833107585011104", "name": "Katie Martin", "time": 1576547448600, "rating": 5.0, "text": "Dustin and Katie worked with us on the most beautiful day of our life. They made us feel so comfortable from the beginning, even super comfortable around the cameras. They were on site from beginning to end and captured moments we will cherish for the rest of our lives. The entire experience was a life long memory we will never forget and we can now say we gained two friends. Thank you DIFP for everything you did for us! Best of the best without a doubt.", "pics": null, "resp": {"time": 1610576808410, "text": "Thank you so much for having us and for this sweet and thoughtful review!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "112144862027261496500", "name": "Laura Machen", "time": 1597855112082, "rating": 5.0, "text": "We hired Down In Front Productions as the videographers for our wedding. They went above and beyond to make our day fun and special! The crew was super friendly and willing to do whatever they could to help make our pictures and video great. DIF was very responsive to phone calls and emails and made the whole booking and payment process easy. We even had to reschedule our wedding due to the Covid 19 pandemic, and they were very good to work with us through that. The finished product of our video was everything we hoped it would be and more! If you’re looking for a fun, hardworking, and professional crew to video your event, look no further!", "pics": null, "resp": {"time": 1597859575141, "text": "We love you guys thank you so much for these sweet words Mrs Pearson!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "105315731015466359789", "name": "Elizabeth King", "time": 1596072020018, "rating": 5.0, "text": "The BEST part of our wedding day!!! If you are looking for a wedding videographer, look no further!  The DIFP team not only produced the wedding video of our dreams but were incredibly kind, genuine, and FUN. They are quick to communicate and truly go above and beyond for their brides! We will forever treasure our lovely video!!!", "pics": null, "resp": {"time": 1596194085274, "text": "We love you two!! Thank y’all so much for everything!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "116058913926058218571", "name": "Anna Davis", "time": 1572596589872, "rating": 5.0, "text": "Down in Front Productions is so amazing! Dustin, Haley Grace, Jake, and Chris were so sweet and easy to work with during this whole experience! They were such a big part of our day and we absolutely love our wedding video, we will cherish it forever! Haley Grace was with us girls all day and always made sure I had everything I needed and even had a portable fan so I wouldn't sweat in this Alabama heat LOL! Thank you all for hanging out with us on our big day and capturing the sweetest moments! We could not have asked for anything better! We will definitely use Down In Front Productions in the future! Y'all are AWESOME!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "101223844620740488578", "name": "Hannah Locklear", "time": 1595541280260, "rating": 5.0, "text": "DIFP was amazing. Dustin and Jennifer made the whole process smooth, easy, and stress-free from the very beginning. They made us feel so comfortable being in front of the camera on our special day. Each of their crew members were highly professional and SO helpful all day long! They were also very fun to be around, and kept our whole wedding party laughing! They made a special effort to get to know us, our personalities, and attend to our requests regarding our video. They worked super hard to capture every memorable moment from our wedding day, and now we have the most incredible video to remember it by. We are so thankful that we had DIFP to play a major part of our wedding day! Thank you so much, DIFP!", "pics": null, "resp": {"time": 1596194118352, "text": "We love the Bryant’s!! Thank y’all for letting us be a small part of your day!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "101548066984434528647", "name": "Kathryn Gargis", "time": 1582056956176, "rating": 5.0, "text": "Dustin and the entire team were amazing! These memories are process. From the moment I met them they were so personable and made us feel so comfortable! They captured everything I love about my wedding and didn’t miss a single thing. I can’t be more thankful for this!", "pics": null, "resp": {"time": 1610576573587, "text": "Thank you, Kathryn! We love you both and are so glad we got to be a small part of your big day!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "108372587049330528017", "name": "Hailey Pate Phillips", "time": 1572908992746, "rating": 5.0, "text": "Down in Front Productions videoed our wedding on 10.5.2019. Words cannot express how thankful we are for them and how amazing they are. From the very first time I contacted them until they delivered our wedding video, they were nothing short of professional and made us feel so special. Dustin and his team made us truly feel like family. Tyler, Haley Grace and Drew were such an asset to our wedding day, going above and beyond their duties to make sure everything ran smoothly. My video was absolutely beautiful and we will cherish it the rest of our lives. Thank you for everything, DIFP! We will always be thankful for you!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "107941464535853732887", "name": "Jordin Bauer", "time": 1586362512599, "rating": 5.0, "text": "My husband & I absolutely LOVE DIFP. They completely exceeded all expectations. They did more than just document the day, they were accommodating in every way: making us feel comfortable during interviews, helped with the train of my dress, held flowers, helped instruct us how to properly cut our cake, & even brought me Tylenol when a migraine hit me at the end of our reception. They were punctual & helped the overall flow of the day run smoothly, but they also participated in the day as well, which made it so much easier to feel more comfortable in front of the cameras.\nEven just speaking to Dustin over the phone prior to the wedding, I knew we had made the right videographer choice. Dustin & his team are very easy to talk to & always made a point to make sure they knew what moments/details we wanted to be paid close attention to. The entire team involved during our wedding felt like they were friends that genuinely cared about how we were feeling throughout the day.\n\nThe finished product is STUNNING. The attention to detail & the use of natural light is beautiful. I feel like everyone was captured authentically & naturally, which is exactly what we wanted. I cannot say enough about how amazing Down In Front Productions is. Katie, Kayla, & Jake went above & beyond for us & we cannot thank them enough!!", "pics": null, "resp": {"time": 1610576492909, "text": "Thank you so much for this kind review, Jordin! We had such a great time with you guys!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "105717893204042767918", "name": "Jessica O’Connor", "time": 1557773365132, "rating": 5.0, "text": "Down In Front Productions is AMAZING!! Dustin and his team made sure our wedding went off without a hitch! They made sure that we were all smiles and had a blast on our wedding day! They helped bring the vision of our wedding to life and are so much fun to work with! From the day we reached out to them, to our wedding day, and even the day we got our wedding video they were fantastic and so easy to work with! A wedding video was the only thing I really wanted from our wedding and their work captured that day so well and was so beautiful!!! You will not be disappointed by booking this team! They really are the BEST in Birmingham and we love them!!!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "111573493204208273689", "name": "Ashley Ochsenhirt", "time": 1594932557438, "rating": 5.0, "text": "I am blown away with how AMAZING my wedding video turned out!! DIFP is such a joy to work with and they were always so involved during the whole process. Whenever I had questions, they answered quickly and always so kind and respectful. I had my wedding during the coronavirus craziness and they were still very accommodating and understanding of any changes I needed to be made. My husband and I both enjoyed getting our own personal time with the videographers and the whole process was so special. I highly highly recommend them for your wedding or event! 10/10!!", "pics": null, "resp": {"time": 1595081458931, "text": "Ashley, you guys are the best! We had a blast spending the day with y’all and can’t wait to see what the future has in store for you two. We love y’all!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "113108199252173259549", "name": "Brooke Hess", "time": 1569413931461, "rating": 5.0, "text": "I am SO THANKFUL we booked this company for our special day! From start to finish they gave 110%!!! They are so talented at what they do, and they have so much fun while doing it. On our wedding day they felt just like family!!! They kept us laughing, were so much fun to hang out with, were very professional and prepared, and helped capture some very sweet (and funny) moments💕 I could not have asked for a better company or better individuals to have worked with. Dustin, Jennifer, and Haley are such an awesome team!!! We would not have had the wonderful day we had if it wasn’t for them three. I HIGHLY recommend Down In Front Productions to anyone who is in search of videographers for their event!!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "112893156218808844923", "name": "Abbie McCain", "time": 1561515167758, "rating": 5.0, "text": "These are seriously the best people in the world!! They were so much fun to work with, they went above and beyond being videographers (seriously Dustin helped me clean up a busted water bottle that was entirely my fault and kept my lipgloss in his pocket during pictures). I love our video so much! It was like we were back at our wedding day. They captured everything perfectly to the point that it was better than I ever imagined! They are the most incredible videographers, company, and people in general! If you don't like them then you just don't like anybody.  They're affordable and worth every dime! They kept us laughing and I would recommend them to anyone who needs literally anything videoed.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNQ73uBRV4hHkOyA-h2_6XaYCXLOey_n5KjE2XQ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "111724977964136469837", "name": "Gionna Godsey", "time": 1578152353440, "rating": 5.0, "text": "Dustin and his team are phenomenal at what they do. They made our big day even more special! They are awesome to work with and even busted a couple of moves on the dance floor! I highly recommend hiring them for your big day! :)", "pics": null, "resp": {"time": 1610576746055, "text": "Thank you so much for having us!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "110363180060666203483", "name": "Sangeeta Nair", "time": 1591717568337, "rating": 5.0, "text": "Dustin has been such a pleasure to work with from our very first encounter. COVID-19 drastically changed the wedding we'd been planning for over a year. We got married on our balcony at home and wanted to livestream the ceremony for our guests. We went into working with DIFP with really only the livestream being a priority for us, and we left with so much more. <3\n\nDustin came into our initial meeting with a wonderful, creative idea to take footage from getting ready and create a mini-video to show the guests tuning in from miles away what our day had looked like. A rapid, same day edit for wedding footage was a huge undertaking for DIFP and they came out with flying colors!\n\nThe mini-video was a huge hit with our friends & family, and made them feel truly connected in the experience even from around the world! Some of our family is saying this was the best wedding they've ever attended, and they did so from their living room! If that doesn't say something about the quality of DIFP, I don't know what will. :)\n\nDIFP even compiled guest videos of good wishes into one long video we got to watch on our wedding night!\n\nNot only was all our footage edited quickly and professionally, both Dustin & Jennifer were a delight to work with. They were with us all day and were so much fun to have around, which mattered a lot to us! (Jennifer even put flowers in my hair & took a ton of photos with my Polaroid camera!)\n\nMy husband and I would recommend DIFP without any reservations. Their enthusiasm, creative ideas, wonderful execution, and patience went a long way with us. We are so grateful to Dustin & Jennifer for all their hard work, and we love our final video!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPO_lK3sIfRP0AcMkwOabklmh5-LlzpAw4WYziH=w150-h150-k-no-p"]}], "resp": {"time": 1610575519910, "text": "Thank you so much for this sweet review!!! We had such a great time with you both and are so thankful we were able to play a small role in your big day!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "106929668053649153270", "name": "Taylor Perdue", "time": 1563848328300, "rating": 5.0, "text": "Its hard to even begin with how great this production company was though out the entire process. I did not think much into a wedding video but i can honestly say I am so thankful i not only got a video but my personal experience with the staff. My wedding party and my planner commented several times through out the wedding day about their professionalism and they way the staff carried themselves. I would recommend them to anyone who is looking for a 5 star experience.", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "111455545952062116348", "name": "Brittany White", "time": 1570458781993, "rating": 5.0, "text": "We absolutely LOVED using Down In Front Productions for our wedding day!!! They were all so amazing and so talented! They spent the entire day with us and seemed so happy to do so!!! Our wedding video was soooo perfect and I really just enjoyed having them there by our side throughout the day making things run more smoothly! Amazing group of people!! 10.27.18", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "114359198316737347368", "name": "Kelsey Day", "time": 1575515401461, "rating": 5.0, "text": "DIFP couldn’t have done a better job with my video! I absolutely love it and made me tear up! They are so sweet and passionate about their job! They all made sure I was happy and made sure the day went as planned! I would 100% recommend them to anyone!!!", "pics": null, "resp": {"time": 1610576920825, "text": "Thank you for having us, Kelsey!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "101233648718804908888", "name": "Laci Hopkins", "time": 1582476014353, "rating": 5.0, "text": "Down In Front Productions is ABSOLUTELY AMAZING! We were so incredibly happy with them! From day one of booking them for our wedding, Jennifer was my go-to girl for any questions I had and always made herself available to me! We had Jennifer, Haley, and Tyler working with us on the wedding day and they all 3 made us feel so comfortable with them and it just seemed as if they had been our best friends for years, laughing and enjoying the day along side us! For our first look, the ground was a little wet and muddy and Jennifer picked me up and piggy-backed me to my husband just so I wouldn't get my shoes and dress dirty (it also made for great pictures)! They all listened to what we wanted and provided that, plus more! When Dustin sent our wedding video, he made sure we were pleased with it (which we absolutely were)! We still cannot stop watching...and we love being able to relive our day with family and friends! Needless to say....if you need a videographer, you HAVE to book DIFP! You will NOT be disappointed! Thank you Down In Front for being with us on our wedding day, you guys are PHENOMENAL!", "pics": null, "resp": {"time": 1610576533575, "text": "Thank you, Laci! We love you guys!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "110025595089596983885", "name": "Kylie Womack", "time": 1587079455186, "rating": 5.0, "text": "We LOVE down in front productions! They were so easy to work with, and made our wedding day so special! Would recommend to anyone!", "pics": null, "resp": {"time": 1610576440654, "text": "Thank you for this sweet review, Kylie!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "113078792828852189385", "name": "T. Moon", "time": 1576874563319, "rating": 5.0, "text": "DIFP deserves more than 5 stars! They are so amazing. Not only is their work fantastic, but they are great people who helped make my wedding day go brilliantly smoothly! Love them!", "pics": null, "resp": {"time": 1610576783585, "text": "Thank you so much for having us!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "101129521025557645775", "name": "Blake Donaldson", "time": 1576458877610, "rating": 5.0, "text": "We are truly so thankful for the Down In Front Productions team for making our wedding day one we will absolutely never forget. I am so happy we chose this team to be a part of our special day. They go above and beyond making sure no detail is missed working from the moment the sun rises until the bride and groom are on their way home to their happy ever after. They made our day so fun and celebrated as if they were a part of our family. I have never met vendors who care as much as DIFP. Best videographers in the area!!! We could not recommend this team enough. Thank you!!!", "pics": null, "resp": {"time": 1610576824442, "text": "Thanks for having us, Blake!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "104570761966237648142", "name": "Courtney Clayburn", "time": 1579194533239, "rating": 5.0, "text": "WOW! We had Dustin and Katie do our videography for our wedding in December and I could not recommend them enough. They were so awesome to be around and made the entire day a breeze. Down in front productions is the absolute BEST company to use when it comes to needing people to capture any occasion. They are so professional, easy going and a blast to be around!!!! We are so thankful to experience and share our special day with such an amazing company!!!! Thanks for everything DIFP!!!!!", "pics": null, "resp": {"time": 1610576703964, "text": "Thanks, Courtney! We had such a great time with you guys!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "102515552138602959467", "name": "Amy Mechtly", "time": 1574209955990, "rating": 5.0, "text": "We LOVED working with this crew! They are so awesome to work with! They went above and beyond for us during our big day and were so fun and creative when it came to our video. We tell everyone to use DIFP you won’t regret it!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "115938334115031661619", "name": "Nicole Lewis", "time": 1581962534504, "rating": 5.0, "text": "They are the absolute best to work with! They work so hard and our great at what they do. I highly recommend using them for your wedding or any event!", "pics": null, "resp": {"time": 1610576596341, "text": "Thank you so much!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "109323848129530954219", "name": "Presley Mathews", "time": 1578608394040, "rating": 5.0, "text": "To say I recommend DIFP would be the biggest understatement ever. Throughout our wedding day they were so much fun. They honestly felt like they were apart of our family. From the beginning of us getting ready all the way to the end of the reception when almost everyone was gone, they were there. It didn’t feel like they were just there doing a job, they had such a great time with us and it never felt uncomfortable. They danced with us, joked with us, and made us laugh all day long. Katie even helped hold my dress throughout the day when I needed her. We had SO many guests come up and ask who they were because they were just so much fun to be around. They 100% made our wedding day so much better just by being there. If you’re debating on hiring them for your event take my advice and DO IT!!! Thank you DIFP!!!❤️", "pics": null, "resp": {"time": 1610576731594, "text": "Thank you for this sweet review! We had such a great time with you all!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "117143971311271247597", "name": "Macey Thompson", "time": 1564531468435, "rating": 5.0, "text": "DIFP did an awesome job at my wedding. The crew was personable and professional. The planning leading up to the big day was nearly effortless on my part. I had no hesitations about this aspect of my wedding going into our wedding day. I am so glad that we chose to get a wedding video, and I know we will watch it several times over the years to reminisce on this sweet day.", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "110486366300640593953", "name": "Falan Weaver", "time": 1557326076951, "rating": 5.0, "text": "I honestly cannot say enough good things about this group of people. They were all I could've hoped for in a video crew. They were so accommodating, sweet, and genuine! We truly enjoyed having them around on our special day! If you're even considering having a videographer for your big day, you should do it (and go with Down In Front Productions)! You'll never regret it! I'm so glad that I will forever have these precious moments captured on film.", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "114137115366963161743", "name": "Angie Lansdon", "time": 1586364765866, "rating": 5.0, "text": "DIFP helped me create multiple marketing videos to use for my photography business. They were super EASY to work with, extremely friendly, always professional, quick to reply to messages, and created some awesome videos! Would definitely use them again! Thanks yall!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "102279351516243190381", "name": "Nikki Jones", "time": 1564096264581, "rating": 5.0, "text": "I could not recommend DIFP enough. Everyone on their staff has the most friendly and loving attitude to make anyone feel comfortable!! Me and my husband aren’t comfortable in front of the camera but they made us feel so relaxed all day. I feel like I’m reliving our wedding day every time I watch our wedding video!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "114076905950622874933", "name": "Vanessa Bollinger", "time": 1561560019748, "rating": 5.0, "text": "I've worked with Dustin and his crew at DIFP for a long time but nothing will ever compare to how awesome they were at our wedding! They're so fun and they did a fantastic job working with our photographer to capture every moment of our day. Love this talented team with all my heart!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "107217464772829094825", "name": "Taylor Schiffman", "time": 1586360920615, "rating": 5.0, "text": "They did a great job for our wedding. I felt comfortable with them and loved the final product.", "pics": null, "resp": {"time": 1610576510106, "text": "Thank you, Taylor!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "104931585479255035250", "name": "Ashley White", "time": 1569636816890, "rating": 5.0, "text": "Easily one of the best decisions we made for our wedding. They were professional, spent the ENTIRE day with us filming and put together an amazing video in a short amount of time. I’d recommend them to anyone looking for a videographer for their wedding or event.", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "112139937654314987399", "name": "Megan Cernek", "time": 1558163686957, "rating": 5.0, "text": "DIFP was professional, kind, and friendly on my wedding day. They did spectacular work on the footage and even included a song that I professionally recorded as a surprise for the groom. They take direction well, which works nicely coupled with their artistic intuition; perfect combination for such a special memory. My husband and I look forward to making the tradition of watching it every anniversary. :) Very well done.", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "116551384963277846243", "name": "Kayla Alexander", "time": 1530823541723, "rating": 5.0, "text": "The absolute best. Dustin and his team went over and beyond to make our special day run smoothly. They captured every aspect of our day and delivered the best video. We loved it and they were the best to work with. Highly recommend you choose them for your wedding day! S/O to my girl Jennifer for being AMAZING!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "100471764711309153109", "name": "William Brannon", "time": 1546886533084, "rating": 5.0, "text": "Dustin and his team are absolutely incredible! We couldn't ask for a more kind, funny, and accommodating group to work with!! They will never leave your side, always carry your stuff (bobby pins, bouquet, garter, tissues, you name it!), and they're right there every step of the way!! Jennifer even had water handy for when we were taking pictures in the AL heat- such a blessing. They are so professional, so dedicated, and SO sweet to work with, we would do it a thousand times over!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "118406185920839126327", "name": "Bellamy Davis", "time": 1527280507064, "rating": 5.0, "text": "I cannot say enough good things about this business. They made my wedding a day to remember from sun up to sun down. Jennifer was amazing and so helpful with any and every need. The guys got some great footage the entire day and truly captured the wedding party's personality. My husband and I could watch the video over and over again it is so stunning! Thank you for making this a memory we can cherish forever.", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "109159984410081544268", "name": "Alison Riggins Howard", "time": 1562187740393, "rating": 5.0, "text": "DIF Productions is THE BEST! We just got our wedding video back and we can not stop watching it! The crew was amazing and not only did their jobs but went above and beyond to make sure our day was perfect! We love them!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "110161201828932330545", "name": "Katelyn Jones", "time": 1542061127736, "rating": 5.0, "text": "I cannot say enough good things about DIFP. From the very first phone call until we got the video back, they were so easy to work with. They asked what was important to us in a video and made sure they captured it. We truly feel like every part of our big day was captured. They start at sunrise and don't leave until you are gone. It was really nice not having to worry about a time limit. They also helped keep the day running smoothly and are super fun to work with, too! I also love that they let you pick the songs if you want, but they also help you decide what will be a good fit. They really went the extra mile to make sure we were happy with the final video and I am so thankful for that. I could tell they truly want you to be happy with it. I would choose them again with no hesitations!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "109085727045783799962", "name": "Courtney Bishop", "time": 1569874487583, "rating": 5.0, "text": "Down in Front Productions captured our wedding day so beautifully! The team was so easy to work with throughout the entire process and so kind! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "112759977335006449017", "name": "Shelbi Landers", "time": 1479694316122, "rating": 5.0, "text": "Down In Front Productions is so amazing! The staff was wonderful and so much fun to work with. They take so much time filming every detail and they devote a lot to making the perfect wedding video. The drones were an extra added touch that made the video very special & unique. Our wedding video was perfect and captured every detail we wanted. They were even very quick on getting the video edited and returned to us. They were such a great group to work with and provide a service that is above and beyond! I definitely recommend them!", "pics": null, "resp": {"time": 1480145919365, "text": "Thank you so much Shelbi! We had a blast working with you and Josh on your special day. You guys are such a sweet couple!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "106449468579995294536", "name": "Chandler McKinney", "time": 1574860056755, "rating": 5.0, "text": "We can not say enough good things about DIFP. By far our favorite vendor from our wedding. They not only created an awesome video but helped make our day so enjoyable. Not every videographer will carry your flowers and break it down on the dance floor.", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "100619658945759538989", "name": "Mary Grace Wilson", "time": 1562098782610, "rating": 5.0, "text": "Absolutely AMAZING people!  We loved having DIFP apart of our day. They captured every part of our day so beautifully. Couldn’t ask for a better group of people that fit in!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "104799642143759963784", "name": "Candice Dockery", "time": 1577730561212, "rating": 5.0, "text": "There was never a doubt in my mind who I would book for our videographer. The first time I seen one of their videos I was completely blown away! Difp is truly amazing by capturing every moment even then ones we missed. The team that day was so welcoming and heartfelt it felt as if we had known them our whole lives. So thank you all for everything y’all have done and continue to do to make this the the easiest decision made and not to mention capturing the best day of our lives the memories laughs and uncontrollable tears watching our video. They are not just videographers they have definitely made it into our hearts as a life long friendship. It’s perfect in every way. ❤️ The Nelson’s", "pics": null, "resp": {"time": 1610576769005, "text": "Thank you so much for this sweet review!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "105473590633686371923", "name": "Brandi Bendall Bullard", "time": 1550678902243, "rating": 5.0, "text": "The DIFP team was so great and easy to work with! They were very accommodating to meet my very last minute request to film my wedding day! The team was there from sun up to sun down for a full day of filming my wedding. They were fun to have around and never got in the way of all the other crazy logistics of a wedding day! The final production was a perfect snippet of our perfect day!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "113193551308240824983", "name": "talk2nate43", "time": 1522844268281, "rating": 5.0, "text": "Truly appreciate the work of Dustin and his crew! They were very professional and helpful all throughout the planning process leading up to the big day. I was certain we would be happy with the final product, and in the end, they delivered! Our video looks amazing having all the important parts of our wedding day. Definitely something we will value for the many years to come!", "pics": null, "resp": {"time": 1522849057662, "text": "Thank you so much Nate for the kind words. We love you and Lakia and can't wait to see what the future holds for you guys!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "111898777462735911696", "name": "JC", "time": 1580601374712, "rating": 5.0, "text": "Wonderful videographers! Not only do they make beautiful videos, but they also made our wedding day so much fun! We definitely recommend using DIFP as your wedding videographers!", "pics": null, "resp": {"time": 1610576659440, "text": "Thank you for having us!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "103592972517171731338", "name": "Summer Burk", "time": 1508219720469, "rating": 5.0, "text": "I cannot rave about this company enough!! They were absolutely amazing from start to finish! I honestly don’t even know where to being with this review! From the second I booked with Dustin I felt completely comfortable! The day of the wedding they literally went above and beyond (thank you Jennifer for holding Ryan’s suit jacket for like 75% of the day)! They captured the most important parts of our day and it was such a joy to get to relive them through watching this video!\n\nNow I would like to personally thank Jennifer! She stayed in contact with me from the second I booked! The day of the wedding she was amazing! From fanning me, making sure we were okay and not needing anything, helping me get all the shots I wanted, and making us feel completely calm on a crazy wonderful day! But most importantly she stayed up until 12:30 completing our video so we could celebrate our one month of being married by watching our wedding video!\n\nDIFP was the BEST!!!❤️", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "104298017951379304421", "name": "Lacey Brinyark", "time": 1563226139866, "rating": 5.0, "text": "BEST EXPERIENCE! The staff was so kind and hardworking capturing our wedding day! Every one of the videographers were passionate about their jobs and cared so much about not missing a single moment of our day. DIFP went above and beyond our expectations! HIGHLY RECOMMEND! Wish I could give more stars!! :)", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "110771512743434371777", "name": "Julie Riley", "time": 1537755236135, "rating": 5.0, "text": "I hired Down in Front Productions for my Wedding in August. They were wonderful. My husband and I are so in love with are video. If you are looking for a awesome team to capture your special day don't hesitate hire Down in Front Production. They are wonderful with kids also", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "115059429666930941621", "name": "Kati Fernekes", "time": 1503010004833, "rating": 5.0, "text": "I cannot say enough good things about Down in Front Productions, they are amazing! Our wedding video was perfect and even better than I could have ever imagined. They were there all day with us, which I really liked. They make you feel so comfortable the whole time. I also liked that they checked in with me several times before the wedding date to make sure everything was the way I wanted it to be. I am so glad we used them and will have the memories of our day forever.", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "109148341174910434903", "name": "Holly Hawk", "time": 1543630034822, "rating": 5.0, "text": "5 stars isn't enough!! Down In Front is absolutely AMAZING! I have never meet a better group of people! Haley Grace and Drew stayed by my side the whole day and made sure I had everything I needed... and if I didnt they would run and get it for me. They made my day so stressful and easy! They were so willing to help and I am so thankful for them!! Not to mention that our wedding video was totally amazing! They have such a talented team and are truly incredible. I am so thankful to have gotten to become so close with so many wonderful member of their team! I would HIGHLY recommend them and would not even consider using anyone else!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "117751207184614090560", "name": "Holly View Video", "time": 1502420151460, "rating": 5.0, "text": "If you are thinking about engaging Down In Front Productions for your wedding, don’t hesitate… just do it. Not only do they produce a quality product, these were some of the hardest working, nicest folks to be around that I could have imagined. They were there with us all day and I mean dawn to dusk. All of their crew worked very hard the entire time.\n\nThese folks are very professional but also have the light touch to set everyone at ease. They produced a highlight and a full ceremony for us and we couldn’t be happier.\n\nCall them up today and explain what you are looking for… they will work with you and for you, not around you. Great customer service. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "116483273841237663418", "name": "jordan miller", "time": 1580826236688, "rating": 5.0, "text": "This was the best decision we made on our wedding day!! If I was getting married again I would give two pieces of advice- getting a wedding planner and book DIFP!!! I thought it would be awkward having photographer and multiple videographers following us around all day, but it was not. The DIFP crew felt like family and invited guest not strangers. My husband is already thinking of other things we could book them for. If I was not clear- stop researching another vendor and book DIFP now!", "pics": null, "resp": {"time": 1610576643558, "text": "Thank you so much, Jordan! We hope you both cherish your video forever!!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "102978460629525335387", "name": "Ali Foster", "time": 1561589869498, "rating": 5.0, "text": "Down in Front Productions is THE best! Not only do they do amazing work, but they are so easy to work with!! We are so thankful that we had them to capture our perfect day!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "104127343207534293679", "name": "Alex Holt", "time": 1481859880015, "rating": 5.0, "text": "All I can say is AMAZING!! Down in Front Productions was so great from every aspect. We felt so comfortable having the crew around all day. They were so easy to work with, the price was very reasonable, and most importantly they created video magic. I couldn't imagine using anyone else. We love our video so much!", "pics": null, "resp": {"time": 1482209669560, "text": "Thank you so much Alex! We loved spending the day with you and Steven and we're so happy we got to be a part of your day!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "113901142832897699393", "name": "Kelsie Baer", "time": 1560548822729, "rating": 5.0, "text": "DIFP did an AMAZING job at our wedding. They were so easy to work with, so much fun on the day of, and we absolutely love our video! Would highly recommend to anyone!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "101485880652946345472", "name": "Lili Herring", "time": 1479265124267, "rating": 5.0, "text": "Down In Front Productions was the amazing company I could have ever asked for to capture our wedding day. Dustin, Katie, and Cole helped make our day the most special day and captured every single moment in the most beautiful way. If you want a special moment captured in the most amazing way, without a doubt you should use them. We received our highlight video in no time and it's absolutely beautiful.", "pics": null, "resp": {"time": 1479266264139, "text": "Thank you Lili!! You and Cary are a beautiful couple and we loved being a part of your wedding day and creating a wedding video for you both to remember it forever!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "114391317304595959108", "name": "Willie Haygood", "time": 1610415743411, "rating": 5.0, "text": "This is a great company!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "110234844517195489319", "name": "Caroline Adams", "time": 1553013844111, "rating": 5.0, "text": "This was such an incredible group to work with! They were so fun and easy to work with and our video is just what I hoped for! Highly recommend for your wedding video.", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "103799751901880527683", "name": "Courtney Greene", "time": 1555698201272, "rating": 5.0, "text": "It was last minute decision to hire a videographer, but it was the best decision we made during wedding planning. Dustin and the whole DIFP team was amazing! I can't describe how wonderful they were on the day of the wedding. The video is fantastic and such a great way to remember our wedding. You will regret not having them there on your big day!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "110875813683444270086", "name": "Rachel Hobbs", "time": 1479523964537, "rating": 5.0, "text": "The BEST people to work with!!! They are so nice and comfortable to be around, truly make the experience fun without \"getting in the way\" like some videographers do! Great footage, felt like we were in a movie! They came in knowing their plan, they were so organized and helpful! They were so professional but also make everything fun and provide high quality products AND experience! Loved these people! They made our wedding day so much fun!", "pics": null, "resp": {"time": 1479524493289, "text": "Thank you so much Rachel!! You and Tripp are truly amazing and we loved working you with both. Thank you for letting us be a part of your day!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "107641306247832527275", "name": "Dawn Braddock", "time": 1479243424539, "rating": 5.0, "text": "I can't say enough about the quality of the work done by Down In Front Productions. Dustin is incredibly talented and he takes great pride in every aspect of his business.  You will NOT be disappointed with Down In front Productions. I HIGHLY recommend them!", "pics": null, "resp": {"time": 1479243823983, "text": "Thank you Dawn!! We love you and appreciate all the support you give us!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "114126172763072669724", "name": "Parrish Pittman", "time": 1501601310393, "rating": 5.0, "text": "Our wedding video was beautiful! They checked in with me throughout our wedding planning process to make sure they had their plan in place, and then made it happen behind the scenes. I highly recommend Down in Front Productions — great quality for great value!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "101934417145660100830", "name": "Randi Hall", "time": 1568097182137, "rating": 5.0, "text": "Down In Front Productions is ABSOLUTELY AMAZING!! Your wedding (or any other video worthy event) is incomplete without this incredible crew! I searched & searched for a videographer & they were by far the friendliest, most professional, & most reasonably priced (definitely more bang for your buck)! The communication leading up to our wedding put me at ease about our big day. We were blessed to work with Dustin, Jennifer, & Kayla. We hit it off immediately & now I feel like they are dear friends. Not only is their work phenomenal, but their personalities were infectious. DIFP was truly committed to making 8.9.19 the best day for the me, my husband, & our families. The finished product was better than we could have ever imagined & has given us the gift of reliving such a precious day in our lives. Words don’t do this team or their work justice. Many thanks to DIFP, y’all are simply the best😊", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "114453444245177260323", "name": "Kathryn Morton", "time": 1498679233825, "rating": 5.0, "text": "Down In Front Productions created the most perfect wedding video that I will cherish for a lifetime.  Their crew is there all day, using a drone and multiple cameras, and they make you feel comfortable the whole time. They aren't just a company you hired, but you feel like they are friends hanging out at your wedding as well! Highly recommend these awesome people!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "117942670948434161217", "name": "Lance Yates", "time": 1523303358314, "rating": 5.0, "text": "Down In Front Productions captured all of the special moments of my daughters wedding and the video they created is perfect.\n\nDustin and Katie are great people who pour their heart and soul into their work while capturing those \"magical moments\" that last a lifetime.\n\nI am beyond grateful for your talents and very happy that we choose DIFP.   I am thankful that 20 years from now, Autumn Brooke and Jake can re-live their special day with their children and see loved ones who may no longer be with us.  The video is truly special and I cannot thank you enough for making March 10, 2018 a very special day for Autumn Brooke and Jake.", "pics": null, "resp": {"time": 1523367982689, "text": "Thank you Mr Lance!! We love the Yates and Caldwell families and are so grateful we got to be a part of this very special day. Thank you again for everything and we love y'all!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "106523957335762768186", "name": "Hayden Dickison", "time": 1505776568357, "rating": 5.0, "text": "Dustin and Jennifer were like part of the wedding party. They made us feel comfortable and at ease and were able to capture priceless moments that we will cherish forever. I was nervous at first about the interview as well as a camera capturing every moment but their personalities made it so much fun. I would recommend Down In Front Productions and especially Dustin and Jennifer!!!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "101998707501797177206", "name": "Karson Moore Renda", "time": 1553299075162, "rating": 5.0, "text": "Love this group so much! You will not find a better group of videographers that will interact with you and your wedding party like they do! They feel like family!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "112008365192857674305", "name": "Diane McClellan", "time": 1483147567622, "rating": 5.0, "text": "Down in front production videotaped my daughters wedding.  They are the best!! Very professional and personable. They go the extra mile to make sure they capture every moment. We were absolutely thrilled with the results and would definitely recommend them. They are the best!!!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "103169149876914255814", "name": "Alex Atchley", "time": 1480273529414, "rating": 5.0, "text": "We could NOT be more pleased with Down In Front Productions. Everyone is EXTREMELY fun and easy to work with. Their communication is fantastic and their work speaks for itself. We could not be happier with our wedding video! We're so excited that we'll be able to relive the best day of our lives for years to come!", "pics": null, "resp": {"time": 1480274536161, "text": "Thank you so much Alex!! We had a blast hanging out with you and Drew. You two are so sweet and we are so glad we got to be a part of your special day!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "113944190778169247086", "name": "Morgan Branham", "time": 1559141740054, "rating": 5.0, "text": "If you want your big day captured in the most perfect way, there’s no other option than Down In Front Productions, LLC. There’s no other group of people I would recommend! They made our BIG day so fun and memorable!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "104160048440624995595", "name": "Chris Hope", "time": 1479260472279, "rating": 5.0, "text": "Down In Front Productions did an outstanding job at our wedding! I would refer Dustin and his staff for any wedding or production that you need videoed. They are very professional and do great quality work. His passion for his work definitely reflects the quality product that is produced. No regrets at all from using Down In Front Productions.", "pics": null, "resp": {"time": 1479266408013, "text": "Thank you so much Chris for the kind words!! We love you and Morgan both very much and were so happy that we got to be a part of your day!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "101122753021887555360", "name": "Tessie Barrett", "time": 1479264084598, "rating": 5.0, "text": "Dustin and the Down in Front Porducrions crew are great! I refer to Dustin for all the Weddings I hear about. They have amazing extra benefits for using them. My favorite is they start filming at sunrise. So you can watch the sunrise over your venue the day of your wedding. So romantic! Dustin is a great guy with a big heart.", "pics": null, "resp": {"time": 1479266304666, "text": "Thank you Tessie! You are an amazing person and we love helping you in any way that we can!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "117319567444080303409", "name": "Beth Lambert", "time": 1559506591914, "rating": 5.0, "text": "I cannot say enough wonderful things about DIFP and their team of videographers! They were amazing to work with and they answered all of my many wedding questions and even provided great recommendations for other vendors. Leading up to the day of our wedding conversations and planning were super easy and all communication was professional yet like chatting with a friend you haven’t seen in a while. On wedding day, I felt as though they were an extension of the bridal party with cameras and not just a vendor. Conversation was easy and if flower girls needed a bobby pin or I needed tweezers, the DIFP team had us covered. Pair that with a video that perfectly captures our love for each other on the happiest day of our lives, and this crew cannot be beat! We are forever grateful they had a role in our favorite day!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "108418246381362130792", "name": "Ashley Kizziah", "time": 1507744077425, "rating": 5.0, "text": "These guys were AMAZING! I was afraid that it would be a little awkward having cameras follow us around recording while we get ready and during special moments, but it wasn't at all! Jennifer was with us while we were getting ready and she was so sweet! She even helped out with things that weren't her place to help with. The entire team are super sweet and super fun to be around. They fit into our family and friends like we've known them for years. Our video was so perfect!!! The quality and price of packages are awesome which is why we chose them! Best decision ever!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "101364643273981932965", "name": "Kaitlyn Watts", "time": 1531178764971, "rating": 5.0, "text": "Dustin and his crew are seriously the best and so much fun! They made sure to get every detail of our big day and were there from sun up to sun down. Down In Front Productions is such an awesome company and will go above and beyond to make sure your day stress free and fun! We love DIFP!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "114996131914587404965", "name": "Katie Mareno", "time": 1563335543743, "rating": 5.0, "text": "There are literally no words for how amazing the DIFP team is!!! Not only did they give us the most beautiful wedding video that we will cherish forever. But, they spent the whole day laughing, dancing, loving, and making the best memories with us.\n\nDIFP is more than just videographers, they are life-long friends that we will have forever. We are so thankful for them being with us on our special day!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "111433963574923132896", "name": "Dorsey Williams", "time": 1494887253527, "rating": 5.0, "text": "We can't say enough wonderful things about Down in Front Productions. Dustin and Katie were EVERYWHERE and worked so hard to make sure they captured everything about our day. We are so grateful to have had them there to document such an amazing day and give us something that we can always look back on and enjoy. Best people ever!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "109639834789681752409", "name": "Madison Scales", "time": 1544888608893, "rating": 5.0, "text": "The best videographers you will ever work with! They are all so sweet and down to earth! They made our wedding day so much fun, and made you feel like you had been friends for life. They were so easy to work with, and answered all questions we had with no problem. We love them so much and would definitely give them a major 10/10!!! Thank you DIFP for our amazing video!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "105058801263503411626", "name": "Kelly Lau", "time": 1514568085208, "rating": 5.0, "text": "Seriously the best! They went above and beyond on my wedding day. The video was magical and everything I could have hoped for and more. They were a pleasure to work with from beginning to end. SO glad I chose to work with them for my big day!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "107167038765735298231", "name": "Victoria Kuhhirte", "time": 1544633928672, "rating": 5.0, "text": "absolutely amazing team! They go above and beyond and make sure EVERYTHING is perfect. They listen to every request and do all they can to make your day special and capture every moment they can! I would recommend them 1000x's over!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "110846800520141419041", "name": "Brian Iddon", "time": 1483134641192, "rating": 5.0, "text": "Such a wonderful and friendly group of people to work with. Very professional, hard-working and willing to go the extra mile to satisfy. Reasonably priced, so do yourself a favor and check them out!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "116052058564339055225", "name": "Lauren Seal", "time": 1512569482798, "rating": 5.0, "text": "We can't say enough good things about Down in Front Productions. From the first time we spoke a year before the wedding until the very end was a pleasant experience. The day of we didn't even notice they were around all day while they were capturing every moment. Our teaser video and full wedding video were both outstanding and truly captured the love on our wedding day. We are forever grateful to Down in Front as our videographers for our wedding day! Would recommend them 1000 times over.", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "113524380212860357197", "name": "Aleigha Hooper", "time": 1494432044199, "rating": 5.0, "text": "I highly recommend Down In Front Productions!! They were so sweet & super easy to work with! Dustin worked with me & made sure our wedding video turned out perfect & it did! I am in love with our video & I will cherish it forever!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "104479918825514838250", "name": "Kayle Posey", "time": 1532484003607, "rating": 5.0, "text": "Down in Front Productions did such an amazing job! We love our wedding video and we are so excited that we have something so special that we will always be able to cherish and enjoy. Thank you Dustin and Jennifer for capturing the best day of our lives!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "108988406492513171131", "name": "Christina Mareno", "time": 1499547059352, "rating": 5.0, "text": "We had a great experience working with Down in Front productions for our wedding day!! We absolutely love our wedding video that we will cherish for the rest of our lives! Loved having all day coverage, drone images, and working with some of the nicest people that made you feel so comfortable! Thank you Dustin, Jennifer, Sam and Cole!! I definitely recommend Down in Front Productions for a wedding videographer!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "103984007998848260567", "name": "Bryanna Beasley", "time": 1563738297815, "rating": 5.0, "text": "DIFP are the best videographers ever! They are so talented and creative! They made my wedding day so much fun and we loved the video they created! If you are thinking about videography, do yourself a favor and book them now! You will not regret it! I know I do not!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "106120547189830723937", "name": "Meredith Greene", "time": 1535930066143, "rating": 5.0, "text": "DIFP did such an amazing job with our wedding video! They were so easy to work with and made our wedding day even more fun and memorable. I highly recommend them for any occasion!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "104060053637488372240", "name": "Kayla Aldridge", "time": 1541522603128, "rating": 5.0, "text": "The absolute best hands down!!! We used Down in Front Productions for our wedding in October, and they are absolutely amazing!!! From the first phone call with Dustin to our wedding day, they made the whole process so easy and fun! They were so professional and always willing to help! On our wedding day, it felt like they were just part of the family! Dustin kept us laughing the whole day, Jennifer never left my side and was SO much help, and Abbi was so sweet and professional! We were blown away when we got our wedding video! They captured every single detail and special moment of our day, and we could not be more grateful! We will cherish it forever! I highly recommend DIFP to anyone looking for a videographer! Thank you so much Dustin, Jennifer, and Abbi! We love you guys!!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "113956845090834699686", "name": "Amanda Head", "time": 1518588303029, "rating": 5.0, "text": "We LOVED working with Down In Front Productions for our wedding videography!! The whole team was so professional and working with Jennifer was great — she made everything so easy. All of them really made the process so stress-free from start to finish. And Dustin and Katie are THE SWEETEST! They were both so supportive and really made us feel comfortable throughout our entire wedding day. They were so reliable (we had an early start the morning of our wedding day and Dustin called to make sure that me and some of the bridesmaids were awake, and then I’m pretty sure throughout the day if Katie saw me looking for anything — I turned around and the next thing I knew she had in her hands for me), they were so FUN!! (our entire wedding party and guests enjoyed them being a part of our celebration) and most of all, they were invested. Christopher and I truly felt like they were just as invested in us enjoying our day, in everything going smoothly, in us being able to take it all in and all of it being beautifully documented as we were. We have watched our wedding video over and over and both can’t help but smile — they captured our love for each other and our family and friends so perfectly. We still have people reaching out raving over how awesome the video turned out. It was such a pleasure getting to spend the day with Dustin and the rest of the team!!\n- The New Year’s Eve Newlyweds\n#finallyaferguson", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "106032357817476417376", "name": "Nicholas Aldridge", "time": 1541527340779, "rating": 5.0, "text": "I would give more than 5 stars if I could!! DIFP were the absolute best choice for mine and my wife wedding!! Dustin was the main one that I interacted with during the day, and high energy and fun does not do that man justice. He was constantly making everyone laugh and having a great time. The crew definitely added to the amazing time that we had that day. One of the girls even snuck a letter into our luggage, thanking us for having them and congratulating us on our big day, that we didn't see until we got to our hotel that night. I would recommend them to anyone that is having any event where they need a videographer.", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "117612301862310661654", "name": "Autumn Brooke Caldwell", "time": 1523034339818, "rating": 5.0, "text": "WOW, just wow! DIFP is 5 stars - unbelievable quality, service, and the best people you could have to work with on your big day. Dustin and his wife Katie went above and beyond to make our day perfect and thanks to them, my husband and I have a perfect video we can pull up and watch at anytime to relive our wedding day. Thanks again Dustin and Katie, WE LOVE YOU!!!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "117861964146381875694", "name": "Allie Bomar", "time": 1529690977106, "rating": 5.0, "text": "Down in front productions is seriously the best!!! They’re all so sweet and fun to work with. Our wedding video is absolutely perfect and we will treasure it forever! They were great with listening to what I wanted and were there to capture every moment. So glad we chose them to do our wedding video! Would definitely recommended them to anyone looking for a wedding videographer! Thank you DIFP!", "pics": null, "resp": {"time": 1529732603468, "text": "Thank you so much Allie! We had an absolute blast with you and Nick and we hope you guys watch your video a million times over the years!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "115681659367871451983", "name": "John Sutton", "time": 1552965673267, "rating": 5.0, "text": "Great wedding videographers! The video turned out great and they were so fun to work with.", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "105543517773035895497", "name": "Catherine Gray", "time": 1533220418958, "rating": 5.0, "text": "An incredible company to hire from start to finish!! They went above and beyond our expectations. Our video helps us relive our day over and over again! I highly recommend hiring Down In Front Productions for your videoing needs!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "109612607410422058753", "name": "Brittany Elkins", "time": 1479248521859, "rating": 5.0, "text": "Down In Front Productions is a great team to work with! Partnering with them for a few projects has been an honor and such a fun experience. They are always one top of things and work hard to keep you up to date with everything they are doing. Super responsiable, dependable creative group and capture the sweet moments you want to remember forever! Highly recommend them to any bride-to-be!", "pics": null, "resp": {"time": 1479248708742, "text": "Thank you Brittany! You are too kind and we love working with vendors like you who make us look good and make our job easy!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "112799587611480155266", "name": "Madison Wiggins", "time": 1543618718349, "rating": 5.0, "text": "I can't say enough great things about the folks at DIFP! When I say this is the best decision I made in regards to planning my wedding, I mean it. They went above and beyond in every way and we are so thankful to have a way to relive our big day over and over again!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "110432821955838458784", "name": "Lora Clayburn", "time": 1508415800331, "rating": 5.0, "text": "This company is completely amazing. They were so fun and easy to work with and the video turned out so perfect! You definitely won't regret using them!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "106297286378254465420", "name": "Haley Jared", "time": 1562790822855, "rating": 5.0, "text": "We were so excited to have Dustin and his crew do our video (we knew Dustin from UAB Athletics) and we were TOTALLY impressed! They went above and beyond to make sure that every detail was taken care of, and they brought a fun atmosphere that greatly added to our special day. Not many companies would have people looking to help and please in the ways that they did for us. They were there every second with water, fans, tissues, dress help...you name it AND happy to do it all. Not to mention--they made all of the pre-event planning stress-free! We LOVE them.  I would highly recommend DIFP for any of your videography needs. You won't regret it!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "104071692659305044071", "name": "Kelsey Westerman Nolan", "time": 1483740893105, "rating": 5.0, "text": "We had the best experience with Down In Front Productions, and Dustin and his crew were all a pleasure to spend the day with! They captured all the amazing moments of my wedding day--some I vividly remember and others were pleasant surprises. We couldn't be more satisfied with the  the final product of our wedding day compilation video--it is like reliving the wedding day each time we watch it. We cannot wait to see the full ceremony video as well! I will always be grateful and appreciative for Down In Front Productions' professionalism in the months leading up to our wedding up until the day of and even after. They are prompt in their communication and will get back to you in a timely manner--which is very refreshing for a bride planning her big day. Thank you so much to Down In Front Productions, and we look forward to spending the day with you in March as you video my sister's wedding as well!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "117642525502638792307", "name": "Ashten Legg", "time": 1520440792345, "rating": 5.0, "text": "Dustin and Jennifer did a wonderful job with our corporate video. They made the process seamless, and I appreciated their timeliness. I got the raw footage back the same day!! Just a great experience all around. Thanks DIFP!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "112404938872608644989", "name": "Kayla Ashley", "time": 1501031427394, "rating": 5.0, "text": "Down In Front Productions is AMAZING!! Our wedding video is absolutely perfect and we couldn't be happier! Dustin and his crew were so easy to work with and it truly felt like they were just a group of our friends hanging out with us on our wedding day. They were there before the sun came up and didn't leave until we did at 10:00 PM and they were amazing all day long! They got our highlight video to us quickly and we will definitely cherish it forever. I highly recommend DIFP to everyone getting married!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "116854133841629679379", "name": "Rebecca Johnson", "time": 1561321486138, "rating": 5.0, "text": "We could not have made a better decision for our wedding day than picking DIFP as our videographer for our special day! They were amazing to work with and made everything we dreamed of come true! The whole day felt magical because of their help and interpretation of our love! We could not be more excited to show our friends and family who could not make it our video from the BEST DAY EVER! If you want to remember your day and have the most special video capturing your most beautiful moments throughout the day, pick DIFP as your vendor!! They will not disappoint!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "115850625861516691476", "name": "Christy McDonald", "time": 1479267629642, "rating": 5.0, "text": "Down in Front Productions is absolutely the best there is around.  They are professional, affordable & their quality & production is television quality... and I'm not talking PBS or local TV quality.  ;). The staff is friendly & interactive and will make you feel at ease being in front of a camera, which for myself isn't something I am comfortable with.  If you need a video made for your wedding, event, work promotions or whatever I cannot imaging a better company to hire than DIFP!!!", "pics": null, "resp": {"time": 1479267774475, "text": "Thank you so much Christy!! We love you so much and everyone at the SMT team. You guys are amazing at what you do and we love being a small part of it!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "102583480156999442846", "name": "Cary Herring", "time": 1479265908146, "rating": 5.0, "text": "What an incredible company run by the most genuine and friendly people. They helped create many fond memories for us to cherish for the rest of our lives. Thank you so much Down In Front Productions for your professionalism and hard work to make our day a perfect one!", "pics": null, "resp": {"time": 1479266177283, "text": "Thank you Cary for the kind words! You and Lili are a beautiful couple and we love you guys both very much for letting us be a part of your day!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "102199738102465947553", "name": "Joshua Baker", "time": 1479246712498, "rating": 5.0, "text": "The crew is highly personable and intentional even before the event occurs! My wife and I met with Dustin and staff occasionally leading to our wedding (not many videographers are willing to wake up at the crack of dawn to catch the sunrise of the venue). We expressed our desires and received the professional insight provided by the company! We are both extremely pleased with the result and recommend to any. We love reminiscing on our big day with our video! Thanks, guys!", "pics": null, "resp": {"time": 1479247141845, "text": "Thank you Josh! We had an incredible time working with you and Tabitha!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "101339523140309397903", "name": "Cassidy Lunceford", "time": 1530560579984, "rating": 5.0, "text": "Literally the best people ever! So hard working, kind, funny, and AWESOME at their job!! I LOVE my video! 100% recommend them and their awesome team!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "115316888509290363996", "name": "Jordan Holliday", "time": 1502917426102, "rating": 5.0, "text": "I probably researched videographers more than anything when it came to planning my wedding! I knew that this is what I would have to remember my wedding by and I wanted people who could capture it PERFECTLY. That's exactly what DIFP did!! They were so accommodating on the wedding day. They made us relax and just enjoy the day. They made sure every important moment was captured and I'm so glad we chose them. One of the best decisions we made!", "pics": null, "resp": {"time": 1502924671816, "text": "Thank you so much for the kind words Jordan! You and Adam were amazing to work with and truly are soulmates and we can't wait to see what the future holds for the two of you!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "107486572034559904925", "name": "Amber Reimers", "time": 1494013347977, "rating": 5.0, "text": "Down In Front Productions is outstanding!! They far exceeded every expectations we had for our wedding day video!!  Dustin, Katie, and Cole- y’all are awesome! All day long they knew exactly what to do and captured the most special and precious moments of our day!  We couldn’t be more in love with and proud of our wedding video! Thank you, thank you, thank you! We love DIFP!! – The Reimers", "pics": null, "resp": {"time": 1494024922740, "text": "Thank you Amber!! We love the Reimers!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "109391293407490306486", "name": "Parker Seitz", "time": 1510711566123, "rating": 5.0, "text": "Down In Front Productions is THE BEST!!! From the moment I inquired about their videography packages, to receiving the finished product, it has been such a pleasure to work with them. This team is amazing at what they do! Not only do they produce quality work, but they are such genuine, compassionate people.\nDustin answered any and every question I had and made the process so fun. Jennifer was with me through all of my day and I can't say enough great things about her. She made me feel so comfortable and having her around really just felt like we had been friends forever. She was eager to help me throughout my day and went out of her way to make sure it was all perfect!! The rest of the team on our day were organized and a joy to be around! DIFP not only created something we will cherish forever, but just their presence alone on our day made it brighter! I am forever thankful for these wonderful people and this company.", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "110694728302332792189", "name": "Joey Mure", "time": 1479266308114, "rating": 5.0, "text": "Down in Front Productions is top notch! They have done several super high quality promotional videos for my business that truly enhance my brand. They are easy to work with, professional, and are reasonably priced. I highly recommend Dustin Welborn and his team at Down in front Productions for any video needs you have.", "pics": null, "resp": {"time": 1479267339748, "text": "Thank you Joey! We love working with you guys and partnering with brands like yours that are built around great principles and helping in any way we can to promote you!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "102267011433406521306", "name": "Just A Guy", "time": 1494019405686, "rating": 5.0, "text": "As my wife said, DIFP far exceeded our expectations!  With all of the emotions that come with getting married, it is hard to remember every moment that happens throughout the day.  Watching our wedding video truly brought back the emotions, memories and the unseen moments of our special day and that is something you just can’t put a price tag on!!!  We love this company and the crew!!!", "pics": null, "resp": {"time": 1494024960573, "text": "Thank you Cory!! We love you and Amber very much and were thrilled to be a part of the day!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "114318188872383831037", "name": "UAB Athletics", "time": 1483129458074, "rating": 5.0, "text": "DIFP does an amazing job handling all of our live productions. Without their services our games would not have the same entertainment value. We highly recommend them for live sporting events and post-production work!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "116809013815947333082", "name": "Todd Talbot", "time": 1479302365152, "rating": 5.0, "text": "Dustin and his team do an excellent job with videos and the production. He keeps it light and easy so you're comfortable being recorded.", "pics": null, "resp": {"time": 1479309277909, "text": "Thank you Todd!! So glad to have you as a resource too. You are amazing at what you do!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "110051860408444747418", "name": "jamie langford", "time": 1545070027008, "rating": 5.0, "text": "You will never find a better group to work with than DIFP! From phone conversations to get your details to making them come to life, they helped make my dreams become a reality. Thank you so much, DIFP!!!! ❤️", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "104990129813717574363", "name": "Tyler Brown", "time": 1485809069402, "rating": 5.0, "text": "Amazing company and staff. The owners are extremely passionate about their work and know their stuff. From commercial shoots to wedding videos to live events; they do it all!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "100720076356615604989", "name": "Abbye Mathis", "time": 1524783365879, "rating": 5.0, "text": "DIFP made our day so much fun! They were so easy to work with and literally stayed with us ALL day!! I was VERY pleased!", "pics": null, "resp": {"time": 1525794975592, "text": "Thank you Abbye!! We love you and Jon and we are so thankful that we got to spend the day with the you guys!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "110403278094644911111", "name": "Dallas Thomas", "time": 1528305369046, "rating": 5.0, "text": "If we could rate higher than a 5, we would! DIFP was great! The video was awesome and every person that worked with us was caring and there for whatever we needed!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "117810434207607714491", "name": "Alex&Jonny Roberts", "time": 1498694800650, "rating": 5.0, "text": "We cannot say enough amazing things about Dustin and Katie as well as the entire DIFP team! They were there from the crack of dawn until we left that night, they captured every great and special moment and we are forever grateful for that! If you are looking for a videographer look no further because these are the best people you could ask for!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "114614147007340145939", "name": "Gwen Moxey", "time": 1607046679472, "rating": 5.0, "text": "Great prices", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "105662077464432883473", "name": "Ashley Dichiara", "time": 1481145187950, "rating": 5.0, "text": "Down in Front Productions exceeded all of my expectations for my wedding day videography. The crew is incredibly professional and friendly. We loved having them around on our day. They pay close attention to detail, making sure to capture everything from your special day. The staff that was covering my wedding was extremely helpful in every way to ensure I had my dream wedding! We absolutely love our wedding video! Thanks DIFP! I highly recommend.", "pics": null, "resp": {"time": 1481168222551, "text": "Thank you so much Ashley! We had a blast working with you and Chance and we are so grateful that we got to be a part of your day!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "112790824884624692734", "name": "Lisa Worthington", "time": 1522174408438, "rating": 5.0, "text": "As the \"Mother of the Bride,\"  I wanted my daughter's wedding to be everything she had dreamed of, but when It came to choosing a videographer I was overwhelmed with the number of companies to choose from.  I spent a lot of time contacting different companies and checking reviews.  My daughter had been in a wedding a few months prior and the bride couldn't say enough about how wonderful Down In Front Productions was and what a great experience it was for her.  After my initial conversation with Jennifer I knew they were the right choice.  She spent so much time explaining the different packages and helped me choose the one that was best for us.  The communication and customer service that we received from Jennifer and Justin was impeccable and on the day of the wedding they were with us from early morning until long after my daughter and son-in-law left the venue.  If you want 5 star service then Down In front Productions is the place to call!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "108412544719305707753", "name": "Tiffany Roach", "time": 1483132131255, "rating": 5.0, "text": "I LOVE working with these guys! We are working several wedding together next year and I cannot wait. He makes it so much fun!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOysHjSKSOiuYdx8otIGa2lY3JZTrADjfq4A7f9=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "110282516651360577174", "name": "Matthew Ingram", "time": 1479259815743, "rating": 5.0, "text": "DIFP is phenomenal! Truly a top notch organization. Our wedding video exceeded our expectations more than we thought possible. I know you're probably debating on which videographer to choose, because we were in the same place. Down in Front couldn't have been a better choice. From pricing, to planning, to execution, it was amazing. Don't waste time reading more reviews, book them now before your date is gone - you won't regret it!\n\nWish I could give you guys more than 5 stars.", "pics": null, "resp": {"time": 1479266458235, "text": "Thank you Matt!! You and Caroline are an amazing couple and we love you both very much and were so happy that we got to be a part of your most important day ever!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "109195304169844117748", "name": "Lauren Stott", "time": 1541827002366, "rating": 5.0, "text": "If you want a videographer that will spend the entire day with you and film every little detail that you don't even think of and that will take the time to create a one of a kind masterpiece, then you need to hire DIFP!!! I can only say the best about this company because they did an outstanding job!!! The whole team will make you laugh so much the day of your wedding that it will take all of your nerves away. I promise you if you hire DIFP you will not regret it!!!!! I LOVE this team!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "107699128548867957858", "name": "Michael Moye", "time": 1483156788575, "rating": 5.0, "text": "Love working with these guys. Treat me like family and are always looking to go above and beyond client expectations. I'm looking forward to being a part of their expansion in the future", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "114426494707192679501", "name": "Derek Scudder", "time": 1483453875610, "rating": 5.0, "text": "I 've worked with different crews from this company on many different events and their people are top-notch.  Always prompt and professional.", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "117171810228074373703", "name": "Colby green", "time": 1479263775629, "rating": 5.0, "text": "The owner Dustin is an absolute pleasure to work with. He and his employees met and exceeded mine and my wife's expectations on what videography should be. Thank you so much to Dustin and his team for capturing our special day.", "pics": null, "resp": {"time": 1479266364772, "text": "Thank you so much Colby for your kind words! We are so thrilled to be working with you and Michele!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "110281725022342108778", "name": "Genny Williams", "time": 1483134588340, "rating": 5.0, "text": "These guys are super fun to work with and will put the professional time in to make sure you get a great video.  Will continue hiring them for a lifetime!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "114461602532108773560", "name": "Joe McClellan", "time": 1483148416421, "rating": 5.0, "text": "DIFP far exceeded my expectations during my daughter's wedding. They worked extremely hard to successfully capture those rare precious moments that are often times overlooked. The quality of work was such that it made my wife and I laugh and cry. DIFP is a professional business that I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "105395971029440147511", "name": "Hannah Smith", "time": 1487784526348, "rating": 5.0, "text": "Awesome team! So easy to work with and their work is absolutely amazing!! I would definitely recommend them!", "pics": null, "resp": {"time": 1487785917093, "text": "Thank you so much Hannah. We loved working with you and Josh on your big day!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "114240429313844436195", "name": "Haley Robertson", "time": 1482207909221, "rating": 5.0, "text": "DIFP staff is nothing less than amazing! It was such a blessing to have them spend my entire wedding day with me! DIFP absolutely loves what they do! I am forever grateful for all of the special memories that they captured!", "pics": null, "resp": {"time": 1482209738337, "text": "Thank you for everything Haley!! We loved working with you and Sam to make your wedding video and we are so happy we got to be a part of your big day!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "101243673963137381792", "name": "Polly Brothers", "time": 1479265597913, "rating": 5.0, "text": "Dustin and the gang at DIFP make it such an easy process!!  Dustin has an awesome sense of humor that immediately puts everyone at ease!  They go above and beyond.  I would highly recommend DIFP!!", "pics": null, "resp": {"time": 1479266217947, "text": "Thank you Polly!! We love working with you and helping you grow your business in any way we can!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "115893580252755420027", "name": "Stephanie Rothoff", "time": 1498164613954, "rating": 5.0, "text": "I cannot say enough good things about Dustin and his crew!  They are genuine, fun, professional and talented!  For my wedding, they were there from sunrise, until we departed the reception at 10:00 PM.  That's a looooong day, yet they were full of energy and genuinely happy to be there to document our most special day.  The turnaround time on receiving our \"highlight video\" and ceremony video was excellent, and our videos are something we will treasure for the rest of our lives.  For all day coverage PLUS drone footage, you can NOT beat their price!!  Thank you DIFP!!", "pics": null, "resp": {"time": 1498165531346, "text": "Thank you Stephanie! We had so much fun capturing your big day. We love you and Chris very much!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "109963961694986659377", "name": "Debbie Robertson", "time": 1515551647791, "rating": 5.0, "text": "This is one of the most wonderful wedding video s I have ever seen! You do a great job at creating a memorable event '\nThank you for the memory that will last forever !\nI will most certainly recommend you to other people👌", "pics": null, "resp": {"time": 1515608066155, "text": "Thank you so much Debbie!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "104270427121333713120", "name": "Holly Nichols", "time": 1543888563858, "rating": 5.0, "text": "DIFP was the greatest wedding videographers we could’ve ever asked for. They made our wedding day even more perfect!! They spend the entire day with you and send both female and male videographers to make sure everyone is comfortable. They get the video to you in a very reasonable time and make sure you love everything. Booking difp was one of the smartest vendor choices I made for my wedding!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "111640542528076502743", "name": "Emily Brooks", "time": 1484752334826, "rating": 5.0, "text": "If you don't work with DIFP, you will be missing out on your best wedding video. Not only did they make my wedding day easy and fun, but they were quick with having our video back to us. You won't have anything less than professional with DIFP.", "pics": null, "resp": {"time": 1484755727049, "text": "Thank you Emily! We loved spending the day with you and Tyler. You are guys are so sweet and we are so excited to see what the future has in store!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "101989734475039832736", "name": "savannah boyd", "time": 1534905265385, "rating": 5.0, "text": "Out of all the vendors used for our wedding, Down In Front Productions (DIFP) is one that sits at the top of the list. We booked DIFP about a year out from our wedding and chose the Silver Package. From the start, the DIFP was excellent in communicating what all information they needed to start with and when they will reach back out closer to the date. Even though they do not require a contract, DIFP were happy to draw one up at my request to ease my mind. Dustin really knows the perfect way to set the tone. He is super outgoing and fun to be around. Dustin and his wife Katie were two of the three-team members that worked our wedding. The team was up at sunrise getting footage of our ceremony venue and shot until our exit around 10 pm (That is hard work and passion for the work). Katie hung out in my bridal suite capturing all the special moments with my girls, while Dustin spent most of the time in the groom’s room getting the guys fired up for the fun day. My husband spoke very highly of Dustin and raved about how much fun they all had with Dustin and the DIFP team. The team was very flexible and professional. When the timeline did not go as planned and the weather began to turn to rain, Dustin and his team were able to shift gears quickly from the original plans to the new plan, helping make the day worry-free. Dustin and his team helped me manage in the hot and humid, rainy, July day while taking bridals and the rest of the photos. Their fun spirited and easy-going attitude was so refreshing when everything seems as if it is not going as planned. DIFP provided us a speedy highlight video that we got while we were still on our honeymoon and the turnaround for our wedding video was quicker than expected. The quality of the video is amazing and I cried while watching it for the first time. Dustin really listened to what I wanted and included what I felt was most important to me. I am so happy I chose DIFP to be a part of our special day. I will recommend DIFP to anyone for weddings, business, and sports. Thank you Dustin, Katie, and everyone else at DIFP! There are no words to express our gratitude! XOXO", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "118002671484451581274", "name": "Elizabeth Baker", "time": 1511279159617, "rating": 5.0, "text": "Working with the DIFP crew was amazing! I love Dustin and Jennifer, my video was well worth the wait!", "pics": null, "resp": {"time": 1511327405735, "text": "Thank you Elizabeth!! We love you and Trent and can't wait to see what the future holds for the Baker family!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "102321936997705028229", "name": "Stephanie Potts", "time": 1512142650210, "rating": 5.0, "text": "Down In Front Productions is THE BEST hands down! All of my friends and family who had recently got married told me that getting a cinematographer would be the best decision I would make since a wedding goes by so fast. At first I wasn't sure how I'd feel about it but when I found DIFP on YouTube and how a phone conversation with Dustin, I knew right then and there I was it was a done deal! Hope was SO sweet and I felt like I had known her for years! She made sure all the bridesmaids were comfortable being filmed and even watched my flowers girls for me!  Not to mention Dustin and Derk who managed to handle the crazy groomsmen (huge shout out to them for doing that!) who are all still talking about how great and funny they were! Having DIFP film my wedding was truly the best decision I made. We now have great memories of our wedding and an beautiful video to watch for many years to come. I can't thank DIFP enough for how they helped make my wedding amazing!!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "106405617090739607052", "name": "Sam Miller", "time": 1483129380366, "rating": 5.0, "text": "True professionals and wonderful people. A great local company that does national quality work.", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "109811367877604196744", "name": "Heather Reach", "time": 1538779916562, "rating": 5.0, "text": "They are amazing ! Seriously AHHMAZZING!! If you’re considering getting a videographer for your wedding day or special event you can’t go wrong with them ! Im insanely picky and looked into several different videographers before choosing them . Not only are they professional, personable , and have amazing quality work , they were also the most reasonably priced for everything you get ! They were with me ALL day on my wedding day (around 14 hours ) at no additional cost , they captured the whole sunrise to sunset on my wedding day , and they did awesome drone footage (most other companies charge extra for drones !) They went above and beyond to make sure I was happy and comfortable all day . Jennifer even went as far as helping me take off My heels when they started hurting, getting me water , and helping me keep up with my purse, flowers,ect . I’m pretty sure if I would have needed her to step in as a bridesmaid she would have done it , seriously she’s so sweet ! They all are ! Having a videographer is so important for your wedding day , things are so hectic and it’s all a blur ! I’m so glad I had them there to capture all the moments That went by so fast ! BOOK THEM !! :)", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "100770555811316560610", "name": "Cory Guice", "time": 1524605559107, "rating": 5.0, "text": "Dustin, Katie, and the entire DIFP Crew are absolutely amazing. We cannot say enough good things about what all they did for us leading up to the wedding, the day of, and after the wedding. First, communication with Dustin and DIFP was a breeze from the start. They were always prompt in answering emails and calls and were always checking in with us to give us updates on what we needed for our big day. During our big day, Dustin and Katie did an excellent job of making us feel relaxed and were there anytime we needed something. They were there from sun rise to way into the night to make sure we got everything we wanted in our video. They were even able to have a little fun themselves! And the communication with DIFP after the day has been seamless. They were great at keeping us updated on the progression of our video and we were so ecstatic when it was finished. DIFP has a true talent of capturing life's precious moments. We would not have done it any other way.", "pics": null, "resp": {"time": 1525795024639, "text": "Thank you so much for the kind words Cory! You and Rachael are such an amazing couple and we are so thankful that we got to spend the day with you guys. We wish y'all both a lifetime of happiness together!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "109659298562813165085", "name": "Jessica Green", "time": 1516204112078, "rating": 5.0, "text": "DIFP did an amazing job on our wedding video. If you are looking for videography to capture your wedding day, Down In Front Productions is the way to go. They helped make our wedding day go so smoothly and were a pleasure to work with. We can’t say enough about how great they are! Thank you DIFP, y’all are awesome! :)", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "102100427101137270929", "name": "Kelsey Lane", "time": 1498502711244, "rating": 5.0, "text": "AMAZING experience. Dustin and his team were so much fun to hang out with on the day of our wedding and the video was EXACTLY what I wanted. They took into account all of my suggestions and followed what I liked/didn't like about other wedding videos I had seen to a T!! This made for the most personalized video possible. The DIFP team has a knack for figuring out what type of video you are looking for and creating it! Additionally, their pricing was very affordable! The quality of what you receive (3 videographers, unlimited time, drone, audio) is far beyond the competition and at a great price. Throughout the entire planning process, they were organized, easy to communicate with, and went above and beyond expectations. We received a 30-second teaser video within a week and our full, 10-minute video within 4 weeks! Cannot say enough good things about these friendly, fun, relatable people!!!!", "pics": null, "resp": {"time": 1498512497132, "text": "Kelsey,\n\nThank you so much for these kind words. You and Lane are an amazing couple and we know you both are going to do big things in the future. Thank you so much for letting us be a part of your big day and we love you guys so much!!"}, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "114634232130957692451", "name": "Kayla Watson", "time": 1483136354453, "rating": 5.0, "text": "I absolutely love working with DIFP! They are so personable and top notch with everything they do!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "110728185784983107215", "name": "Jessica Swint", "time": 1498177459755, "rating": 5.0, "text": "Where do I even begin. Throughout the whole entire wedding process I went back and forth reguarding whether hiring a wedding videographer was worth the money as we were on a very tight budget. It was hands down the best decision I could have ever made. Dustin, Jennifer, and Sam are phenomenal at what they do. After just minutes of meeting them you forget that you have just met and feel as if you have known them your entire life. Me and my husband joke and say that our wedding would not have been near as fun without them! Everyone is still talking about how great our videographers were. The video brings the whole day, the feelings and emotions, and love to life. I know that we are going to cherish it for years and years to come.", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "102834797983417360232", "name": "Leah Walker", "time": 1483131600864, "rating": 5.0, "text": "Love working with this creative and professional staff! Their execution is always top notch.", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "111833329425980928929", "name": "Seth McFall", "time": 1483209054982, "rating": 5.0, "text": "Love working with these guys! They excel at what they do!", "pics": null, "resp": null, "gmap_id": "0x88891f0e7b5801d5:0xe43f0b2f63472ad8"}
{"user_id": "110264734283440023695", "name": "Britt Maxwell", "time": 1606580178591, "rating": 5.0, "text": "Kyle did an amazing job with my videos. He’s Full service; he does the shoot, edits, ads stock footage as needed, and in the end comes up with a really terrific product. Great value and great to work with, I am absolutely going to work with him again!", "pics": null, "resp": {"time": 1606581164939, "text": "Thank you, Britt! This was such a fun project. When our son is older we'll definitely be looking into an Epic Starfish gift."}, "gmap_id": "0x88640a2ecca31c5f:0xed06e3fb7ee4e66f"}
{"user_id": "113699944153296844060", "name": "Derek Altom", "time": 1600821432066, "rating": 5.0, "text": "NowTech Productions is a \"top of the line\" company.  Kyle Saunders is excellent at what he does and I am continually amazed at what he can do with a video camera!  NowTech Productions has made our organization better by helping us produce high quality videos and content that will assist us in completing the mission of our organization.  Again, we could not do this without NowTech Productions and Kyle Saunders.  No matter what crazy idea we have or how quickly we need something done, Kyle is always there to help and to give the best possible solution while maintaining the highest quality.  You and your organization would be well-served to hire NowTech Productions for all your video producing needs.", "pics": null, "resp": {"time": 1606581312545, "text": "Thank you, Derek! I enjoy working with you and the team on projects. I appreciate your insights before, during, and after each video. I look forward to our next video together."}, "gmap_id": "0x88640a2ecca31c5f:0xed06e3fb7ee4e66f"}
{"user_id": "101779931952478273377", "name": "Jimmy Patrick", "time": 1603844307825, "rating": 5.0, "text": "The best video production company out there. They have done two videos for my company and both were amazing!  I would recommend their services to anyone.", "pics": null, "resp": {"time": 1603913371657, "text": "Thank you, Jimmy! We enjoy getting to help spread the word about LTA in Murfreesboro."}, "gmap_id": "0x88640a2ecca31c5f:0xed06e3fb7ee4e66f"}
{"user_id": "117146049374171087962", "name": "NAFWB", "time": 1600783653925, "rating": 5.0, "text": "Kyle has met and and exceeded our expectations in every project. He listened to our needs, understood our objectives and wishes, and then added his creative expertise for top-notch productions. His efforts went well beyond just a familiarity with the particular project, as he worked to understand our goals as an organization so he could weave those into the videos he produced.", "pics": null, "resp": {"time": 1600792796533, "text": "We appreciate your trust throughout these projects and we look forward to more in the future. Thank you!"}, "gmap_id": "0x88640a2ecca31c5f:0xed06e3fb7ee4e66f"}
{"user_id": "117747050382607590229", "name": "Amber Keisling", "time": 1590076509100, "rating": 5.0, "text": "Kyle and NowTech Productions did an amazing job. The customer service was top notch. They communicated with us throughout the entire process and made sure that we got all of the shots we wanted. The price was very reasonable. I would recommend them to anyone.", "pics": null, "resp": {"time": 1590081704382, "text": "Thank you so much, Amber! We really enjoyed getting to be a small part in the special surprise."}, "gmap_id": "0x88640a2ecca31c5f:0xed06e3fb7ee4e66f"}
{"user_id": "104246275272787316072", "name": "Dean Heasley", "time": 1594239590402, "rating": 5.0, "text": "I so appreciate Kyle and his ability to produce videos so well. He shot a full day event and he was a true professional the whole day. He was on top of everything. The videos he produced came out so well!", "pics": null, "resp": {"time": 1595620778143, "text": "Thanks, Dean!"}, "gmap_id": "0x88640a2ecca31c5f:0xed06e3fb7ee4e66f"}
{"user_id": "108411275927521280805", "name": "Daniel Webster", "time": 1600806430429, "rating": 5.0, "text": "NowTech has been great for us! Highly recommend Kyle and his team.", "pics": null, "resp": {"time": 1606581388666, "text": "Thank you, Daniel. You have a wealth of ideas, and I enjoy getting to help make those ideas come to life when it involves video production. I look forward to some upcoming projects in the spring."}, "gmap_id": "0x88640a2ecca31c5f:0xed06e3fb7ee4e66f"}
{"user_id": "117920354574863831025", "name": "jeremy lee", "time": 1591207065131, "rating": 5.0, "text": "Kyle is personal and professional.  He has amazing gear that he uses to create high quality video.  From production to editing, Kyle is easily one of the best in town!", "pics": null, "resp": {"time": 1591216010382, "text": "Thank you, Jeremy! I love getting to work on projects in which you are a part of the team. You stay focused and grounded even when obstacles arise."}, "gmap_id": "0x88640a2ecca31c5f:0xed06e3fb7ee4e66f"}
{"user_id": "114202600638391906208", "name": "Elena Kulpa", "time": 1624545266333, "rating": 5.0, "text": "Changing States and starting my career back up in Real Estate meant also changing my entire team, choosing the \"right\" photographer is vital in this industry.  I was referred at least 5 photographers and Joe was the first to answer my call.  His adaptability and getting your vision in the first shot is impressive!  Pixel Joe is \"TOP NOTCH\" and is why he is my ONLY choice for photographer in North Alabama. Like they say \" if it's not broke why fix it.\" Give him a call, you won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "104131304197496737316", "name": "Steven Payne", "time": 1624461173930, "rating": 5.0, "text": "Fun and educational! Much appreciated!", "pics": null, "resp": {"time": 1624510833125, "text": "Thanks for coming Steve!"}, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "110220400279779925575", "name": "christina hall", "time": 1622943504536, "rating": 5.0, "text": "Absolutely the best place for any venue needs!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "103803003022946061253", "name": "Thomas Lawless", "time": 1603760874439, "rating": 5.0, "text": "This dude took exactly what I had in my head for my business and made it happen. I couldn’t be more happy with the quality and appearance of the photos I needed.\n\nAbsolutely phenomenal", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "104143428204887567216", "name": "Steven L Payne", "time": 1624510184769, "rating": 5.0, "text": "Super nice setup!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "109102795672237195901", "name": "KAavalon", "time": 1569680089254, "rating": 5.0, "text": "My husband and I hired Joe for our wedding 8/31 to do a highlight video. Joe was AMAZING!!! He assisted us through the whole process helping us select the moments we wanted to capture. He gave us a beautiful video while staying within our budget. He is professional and personable. We had our DJ drop out at the last minute and he assisted us with finding a new one, DJ Scott Blakely was AWESOME!  I highly recommend Joe and Scott and I would definitely hire them again!!! Thank you both so much for helping us make our wedding a party and helping create a beautiful keepsake!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "114884731954220746471", "name": "Kimberly Holmes", "time": 1518198801133, "rating": 5.0, "text": "Joe was Fantastic and easy to work with. Never once got frustrated with us and always had a smile. You can definitely tell Joe is passionate about his work. He did a Fabulous job with our whole team!! I would definitely recommend him.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "114854941382840784237", "name": "Nadine Wormsbacher", "time": 1532815473298, "rating": 5.0, "text": "Joe is a gifted photographer and videographer. He thinks  outside the typical box to create videos and images that are unique and memorable. He created a beautiful video of my horses and farm; he used his drone and the camera that lets him move with the horses and not jiggle. He’s very professional and easy to work with. Although I’d recommend him for anything image related, after seeing my video, I think he would be especially great for outdoor weddings or events.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "113882969702963035749", "name": "John Wood", "time": 1517184820924, "rating": 5.0, "text": "Joe took some headshots for myself and my staff that came out great! Joe had a lot of great tips for posing and took care to always get the best shots he could. Joe's studio was top notch as well as his professionalism and his abilities! Highly recommend!", "pics": null, "resp": {"time": 1517239829093, "text": "Thanks John I enjoyed it. You have an amazing staff and I know you guys will be an amazing all state branch! If anyone needs insurance call these guys!"}, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "107012675560021782345", "name": "Tye Watson", "time": 1505707424106, "rating": 5.0, "text": "Highly creative photos- he can add any theme to create a magical scene. His videos are above the top. Love his work. Would highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "106718618561893959853", "name": "ABC Cleaning and Restoration", "time": 1533649441699, "rating": 5.0, "text": "Joe is the doctor of photography.  He has an eye for the picture and knows the camera like nobody!  Whether it's a headshot, sports action shot or wedding I highly recommend using his vision!  He is also great at making movies so if you'd like to watch that game or wedding over and over he can make it happen!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "111515713004282244226", "name": "Katy Murphy", "time": 1532729877812, "rating": 5.0, "text": "Joe Bullock is an excellent photographer! From headshots to engagement photos to promotional videos, Joe's work is top notch. He is professional and gives 200% to everything he does 📸🎥", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "100096560547750047679", "name": "Brandon Saraceni", "time": 1503714516052, "rating": 5.0, "text": "Joe took some photographs via his drone for me on a roof inspection. He was on time and very professional. I will definitely hire him again. Thanks Joe.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "117225640691016339924", "name": "Lauren Schippers", "time": 1505675033074, "rating": 5.0, "text": "Joe is very professional and took some amazing photos for a friend of mines engagement announcements. They turned out beautiful!!!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "110793175651707402605", "name": "ERICA PRICE", "time": 1508082460020, "rating": 5.0, "text": "Pixel Joe's photography did a great job for us and I will definitely hire him again! Thanks so much pixel Joe!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "108934058374010077336", "name": "Rachel Harchanko", "time": 1532907622867, "rating": 5.0, "text": "Pixel Joe did my head shots for me. Joe was an absolute pleasure to deal with. I was so thrilled with the finished photos.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "100468113882323669988", "name": "Kayla Bullock", "time": 1506294828302, "rating": 5.0, "text": "Joe did a great job with our family pictures and getting 3 wild boys to smile!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "101094930589118909455", "name": "N S", "time": 1610660326681, "rating": 5.0, "text": "Excellent work, exactly what I wanted. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114261246968034770738", "name": "Jason Elmer", "time": 1582761393136, "rating": 5.0, "text": "Web Detail has been great to work with. Being a small business, I did not have the budget for a full-scale website. Jerimy and his team were there to listen to my specific needs and helped develop something that was just what I was needing for right now that can be built upon. From start to finish the process was very quick.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "104913583038605846920", "name": "Sue R", "time": 1594581970239, "rating": 5.0, "text": "WebDetail has done a fantastic job designing our website!  Jerimy and his team are very responsive if we need to make changes and outstanding to work with! We are very happy clients of WebDetail!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "116205120835683811979", "name": "Sean Lee", "time": 1579616634524, "rating": 5.0, "text": "WebDetail does a great job designing and setting up websites.  They have a lot of good ideas.  Jeremy is very responsive and easy to work with.  I will continue to utilize WebDetail for all our needs.  Thanks for a job well done!\nSean", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "115996356981222899046", "name": "SHANNON MCKEE", "time": 1582832316864, "rating": 5.0, "text": "Jerimy does an OVER THE TOP JOB!  He designed a website above and beyond what we had in mind.  Very professional, reasonably priced and excellent quality.  Would highly recommend him!  Very Very Happy Customer!  thefootclinic.us", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "109190100812205585954", "name": "Haley Baron", "time": 1583159740278, "rating": 5.0, "text": "Jerimy and his team have been phenomenal. One of the things I love most\nabout WebDetail is how quick they are in responding to emails AND how quick they make the adjustments you need on your website. I would recommend to anyone!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "106718618561893959853", "name": "ABC Cleaning and Restoration", "time": 1564612648089, "rating": 5.0, "text": "Jerimy has helped with various marketing strategies and insight on helping our business continue to grow its online presence. It’s been great working with him and his team. Certainly recommended!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "118284671236130426430", "name": "Michael Owens", "time": 1591295730241, "rating": 5.0, "text": "WebDetail LLC designed a professional webpage for our counseling practice in Alabama. We would strongly encourage talking with them if you want to take your business/webpage to the next level!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "108932407904691001085", "name": "Ashok Mahbubani", "time": 1560725021883, "rating": 5.0, "text": "Enjoyed working with Jerimy Lee on improving and updating our websites. He was attentive, informative and offered thoughtful ideas & options. He responded well to our requests for change and helped us meet challenging timing goals.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "107726332193636795174", "name": "Kenneth Winton", "time": 1579619285732, "rating": 5.0, "text": "WebDetail has done a fantastic job with our business website.  It is constantly updated and optimized to give our patients the best online experience and information.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "110626101940050352084", "name": "John Conway", "time": 1581698289524, "rating": 5.0, "text": "Jerimy was very easy to work worth and did a fantastic job!  I highly recommend WebDetail for website development!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "100373388406679517445", "name": "ironsclad", "time": 1579616530589, "rating": 5.0, "text": "Complete rebranding of my business - Irons Distillery - was done by WebDetail.  After having a attic webpage for over 4 years, it was time for a total makeover of my website.  WebDetail was able to take what I discussed with them and turn it into real product - and more than “eye candy” - it was a webpage that tells our entire story and allows excellent interaction with customers.  Check it out at ironsone.com - excellent work!!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "112934247421951823378", "name": "RAE RAE", "time": 1522766325827, "rating": 5.0, "text": "This company does a wonderful job managing and helping me with my company website.  They are patient, courteous and professional and always have time to help me with questions about the site, as well as update me on the newest and latest thing that I need to be doing.  I'm not that computer savvy so it's nice to have someone to count on.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "106803349109772970855", "name": "Matt T", "time": 1560863700511, "rating": 5.0, "text": "Extremely happy with the WebDetail team.  We hear from all our customers how much they like our site and how easy it is to navigate.  Five stars!!!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "105234704733787751409", "name": "Ellen Cozelos", "time": 1561738193154, "rating": 5.0, "text": "They did a WONDERFUL job on my new website!  Have had such a great experience with them", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "102387596088737912825", "name": "Bob Benton", "time": 1560362932614, "rating": 5.0, "text": "Webdetail is my \"go-to\" resource for all things web and social media. Their professionalism, combined with deep experimental knowledge and integrity guarantee me the best possible outcome for my clients, regardless of the size of scope of the project. Sincerely Bob Benton - CRE8IVE Branding.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "116108691609514910280", "name": "jenny mitschelen", "time": 1561399306657, "rating": 5.0, "text": "Jerimy & his staff are the best. We received incredibly friendly & professional service. Jerimy was always available to answer questions during the building of my website. Our planning meetings were fun & efficient. The staff understood my brand & vision & brought it to life. I definitely recommend the investment in having WebDetail polish up your online image!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "110337181174330128258", "name": "Russ Russell Commercial Real Estate", "time": 1560435277137, "rating": 5.0, "text": "Jerimy and crew go the extra mile to ensure you have the best quality service and product available!  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "118309393381061308054", "name": "Brent Hunt", "time": 1560426679691, "rating": 5.0, "text": "My business recently needed to update our website, and after much consideration and research, I decided to try WebDetail.  From the beginning, Jerimy and crew were very patient with me.  Together, we were able to capture exactly what I had in mind from the beginning, plus some added bonuses that were suggested to me by WebDetail.  Everything was done on-time and for a very reasonable price.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "116334689896599768559", "name": "david houser", "time": 1555603649238, "rating": 5.0, "text": "Web Detail did an awesome job on our website and is always very helpful.  They are great to work with.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "111472132666586962898", "name": "SWEET ROCK BAPTIST CHURCH", "time": 1518810263302, "rating": 5.0, "text": "Very nice company to do business with.  Jerimy has been very attentive to our needs and does a great job any time we ask for any changes to our site. Outstanding service and very happy with the service they provide.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "108974017083196184930", "name": "Helen McNamara", "time": 1471967972641, "rating": 5.0, "text": "Great and very detailed service. So very happy with everything he has accomplished with my business. So excited to see how far WebDetail will grow my business. Always completes task super fast. Best company ever!!!", "pics": null, "resp": {"time": 1472573566585, "text": "Thank you Helen!!  It's truly been a pleasure working with you thus far!  You have a fantastic and fun business, and I'm proud to be helping you take things to the next level :)"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "100675740381714374023", "name": "Chuck Bailey", "time": 1560481328198, "rating": 5.0, "text": "Alabama FairTax needed a website several years ago, so the hunt for a web designer ensued.  We needed a comprehensive site to get the word out on the national FAIRtax, and of late, The Alabama Economic Freedom Act.  The result was consultation with Jerimy Lee and kick-off of the site design.  He is easy to work with and backs up the work he accomplishes.  The work was successfully completed In good time and the site successfully launched.  Further, Jerimy “services what he sells” and that is much appreciated.  Trust Jerimy with your digital design needs.  We do!", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114707576224750382190", "name": "JoAnna Wright", "time": 1507814790550, "rating": 5.0, "text": "Awesome group! WebDetail has been an immense help to my company's website, social media platforms, and digital marketing. They offer experienced insight and are willing to go the extra mile to get the job done. Highly recommended!", "pics": null, "resp": {"time": 1510669238612, "text": "JoAnna, thank you!  It's been great working with you on SO many projects :)  LOTS more are in the works currently and queued up afterwards!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "113710098397437759369", "name": "Mike Murdock", "time": 1500667270709, "rating": 5.0, "text": "I've been working with Daniel Horton since before he joined WebDetail, and always enjoyed collaborating with him. Daniel really \"gets it\" and has helped us promote our organization to the whole community. I'm always pleasantly surprised by the response that Daniel's work elicits.", "pics": null, "resp": {"time": 1509109703176, "text": "Mike, thank you for the comments!  It's been an absolute pleasure working with you and the team at Huntsville STEAM Works!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "118226670515846768597", "name": "Brooke", "time": 1579636223583, "rating": 5.0, "text": "WebDetail has been such an asset to the development and ongoing production of our website and online marketing plan.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "111054440623475764212", "name": "Jeremy Lihte", "time": 1560362021334, "rating": 5.0, "text": "The group at WebDetail has been a life saver on countless occasions for myself and the organization that I would with. I am an on the ground marketer for a group of health centers in the SouthWest. Without Jerimy Lee and the incredible team at WebDetail, my job would be impossible. Thats not even mentioning the incredible work they have done for us with our online platforms.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "103199170697977985185", "name": "Yvette “Fanci” Kelley", "time": 1495137547326, "rating": 5.0, "text": "It's great! This site helps you locate Businesses as well as promoting yours", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "103899886446719253667", "name": "Brad G", "time": 1501271976446, "rating": 5.0, "text": "WD helps a number of my organizations get their social media handled in a manner that's both creative and efficient. Would recommend their team for your next marketing endeavor.", "pics": null, "resp": {"time": 1510669125545, "text": "Brad, it's been great working with you thus far, and it's only the start of many more incredible opportunities!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114286044098706377322", "name": "Toni Eberhart", "time": 1501272463415, "rating": 5.0, "text": "WebDetail, LLC. is fantastic digital marketing agency to work with. They completed a video project for our organization and it turned out wonderfully. It communicated our story in a visually pleasing and captivating way. The turn around was very quick and reasonably priced. I recommend working with Daniel and Jerimy.", "pics": null, "resp": {"time": 1509109840743, "text": "Toni - we have had an amazing time working with you and Urban Engine!  Excited to see Urban Engine continue to bring great things to the community!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "111446099134632256156", "name": "We Run Huntsville", "time": 1501273877686, "rating": 5.0, "text": "Webdetail is great! They have not only guided us through some challenging times, but have also produced a video that reflects the  essence of our company.  I have been pleasantly surprised at the amount of insight that they have in to the workings of internet marketing. This is a valuable resource that is not to be discounted. Thanks for a great job guys!", "pics": null, "resp": {"time": 1509109915108, "text": "Gregg, we have had a blast working with you on the video projects!  You are doing some fantastic work with We Run Huntsville!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "111020432325955845497", "name": "Greg Austin", "time": 1518127301083, "rating": 5.0, "text": "Jerimy Lee and his team are the best! Friendly, cooperative, super-intelligent, and hard-working, WebDetail will design you a great website and help you perfect it! I couldn't recommend them more highly.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "109534575083022206545", "name": "Andy Johnson", "time": 1480608976682, "rating": 5.0, "text": "WebDetail has been awesome! Jerimy Lee is extremely professional and easy to work with. Always seems to be available when needed. Great company that I would recommend to anyone needing an amazing website.", "pics": null, "resp": {"time": 1480610590149, "text": "Andy, many thanks!  It's been great working with you guys as well!  I'm looking forward to seeing IES grow and succeed!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "100147673057330676819", "name": "Brooks Bryant", "time": 1464206473277, "rating": 5.0, "text": "Jerimy at WebDetail is very professional and easy to work with. The website he created for my business has helped me immensely!", "pics": null, "resp": {"time": 1464213017557, "text": "Thank you Brooks!  Certainly glad we are able to help, and we appreciate your business!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "113316583948192656382", "name": "Nelson Alvarado", "time": 1562602254409, "rating": 5.0, "text": "The staff is awesome and  very professional.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "118026746030869170702", "name": "Brian Hughes", "time": 1500497169568, "rating": 5.0, "text": "I was using a different web designer in the past that was not meeting the needs of my business. Since switching to Webdetail, everything has been smooth and reliable. Jerimy is a skilled and efficient designer and very easy to work with.", "pics": null, "resp": {"time": 1501080165631, "text": "Thank you Brian, I appreciate your business and it's been great working with you guys as well!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "104455046540160577381", "name": "Beth Jett", "time": 1464909157763, "rating": 5.0, "text": "Jerimy is an excellent web designer and very knowledgeable of all of the online strategies to attract users to our website. We are complimented often on how nice our site looks and how easy it is to navigate. He's very proficient and stays current with the constantly changing algorithms of the popular social media venues, teaching us how to and assisting us in capitalizing on SEO. Highly recommended!", "pics": null, "resp": {"time": 1464967479920, "text": "Thank you Beth! It's been a pleasure working with you, not only with updating the new website but also working with you on the SEO and social media side of things!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "110964270584795483257", "name": "Ronnie Kimbrough", "time": 1500480683023, "rating": 5.0, "text": "Great company, we have worked with Jerimy and his staff for last 3 yrs, very pleased with their service!", "pics": null, "resp": {"time": 1501080114467, "text": "Hey Ronnie - many thanks!  It's really been fun working in such an exciting industry - archery and hunting!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "113111821263432371281", "name": "Kenny Wood", "time": 1521566528707, "rating": 5.0, "text": "The folks at WebDetail do a great job.  They live up to their name and focus on the Details.", "pics": null, "resp": {"time": 1521567591806, "text": "Thank you Kenny!  We try to ensure everything is as it should be lol!  Always fun working with you!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114527104744488595419", "name": "mark Barlow", "time": 1498794292084, "rating": 5.0, "text": "I am impressed with Jerimy, more business professional, Marketing savvy than a typical \"web\" man!", "pics": null, "resp": {"time": 1499121147242, "text": "Mark, it's been great getting to know you and  your business!  I look forward to a long lasting business relationship!  Appreciate your business!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114068053410951848338", "name": "Marie Constantinou", "time": 1483656316602, "rating": 5.0, "text": "There are companies out there that make promises they just can't keep.  WebDetail is NOT one of those companies.  Their friendly and professional service is a breath of fresh air.  The results we have had since linking with WebDetail are outstanding and, quite frankly, unbelievable.  I would recommend WebDetail to any business; big or small.", "pics": null, "resp": {"time": 1483824514602, "text": "Thank you Marie!  It's always exciting working with you as well!!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "111293686069620554703", "name": "Donna Robinson", "time": 1464199124662, "rating": 5.0, "text": "WebDetail designed and developed a website for our local chapter of an international non-profit organization and the results were exactly what we wanted.  Jerimy Lee is excellent to work with - very patient and easy to understand for a web novice like me.  When the website was ready to go, he trained several of us on how to make edits on our own so we don't have to bother him all the time.  The way the website was developed makes it very simple and easy for us to edit and add data.  We highly recommend WebDetail for any web development or modifications you need.", "pics": null, "resp": {"time": 1464212981766, "text": "Thank you Donna, for the kind remarks!  As always, we very much appreciate your business!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "106008081027680808414", "name": "Kathey Hamer", "time": 1522087223152, "rating": 5.0, "text": "Executive Women International, Huntsville chapter, was fortunate to learn from Jerimy and Sio'Bhan as our March meeting program/speakers.  WebDetails gave an excellent program on social media platforms. They\nhad EWI members totally engaged as they gave interesting statistics, great advice and information regarding which platform would best meet our needs.  They left us all eager to learn more!  EWI of Huntsville has found a social media, webpage, etc., Connection. We highly recommend WebDetails.  Thank you, Jerimy & Sio'Bhan\n\nEWI BOD\nState Farm, Lara B. Sterling\nJ.R. Enterprises, Margaret Watson\nChamber of Commerce, Pammie Jimmar\nWoody Anderson Ford, Kathey Hamer", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114744844077008166521", "name": "John Molnar", "time": 1480622197799, "rating": 5.0, "text": "Working with a great company is always a good experience, but working with great people is what really makes for a good relationship.  I am so lucky to find both together, here at WebDetail. Jerimy has been both a seasoned professional and a good friend, he is always there for us to answer any question and gives great advice.  Thanks Jerimy!", "pics": null, "resp": {"time": 1482438731272, "text": "Thank you John!  I cannot believe we've been working and dealing together for almost 10 years!!  Thank you again and I wish you all the best!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "114268678467562339658", "name": "C Marino", "time": 1480708535931, "rating": 5.0, "text": "Jerimy at WebDetail is awesome  and a total professional Webmaster.\nyou can count on him.\n\nC Marino    Chicago IL", "pics": null, "resp": {"time": 1482438626629, "text": "Carlos, thank you and it's always a pleasure working with you as well!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "117338195291034601019", "name": "Karol M.", "time": 1467824474292, "rating": 5.0, "text": "WebDetail worked well with us to design our business' web-site.  We were extremely specific in what we wanted and Jerimy worked very hard to make sure our needs were met.  We have had great results what few times we've needed maintenance performed on the site.  The site designed by Webdetail is very functional and can be edited easily by our staff to keep it our company's information current.", "pics": null, "resp": {"time": 1467905810688, "text": "Thank you Karol!  It has truly been a pleasure to work with you, Ray and your staff over the years!  Tempforce epitomizes character and values, and it shines through with how successful you have been!  I'm glad to have been able to help where we can.  Again, many thanks!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "111006006727255089842", "name": "Bob Williams", "time": 1500309709056, "rating": 5.0, "text": "I have had several other websites and I have been working for 5 years with Jerimy of WebDetail as my webmaster for multiple sites. He has been very professional and also personally helps me in many other ways.  We are producing a large worldwide marketing program that covers almost all needed for a very productive site. He also handles the SEO, E-commerce, et al. And we are in different states!", "pics": null, "resp": {"time": 1501080051464, "text": "Thanks Bob!  It's been a fun ride working on all the various projects throughout the years!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "116031216443385728740", "name": "Joe Shinkle", "time": 1498687381139, "rating": 5.0, "text": "Jerimy is very skilled, efficient, and great to work with! I will do business with WebDetail again!", "pics": null, "resp": {"time": 1499121111230, "text": "Thank you Joe -- Always a pleasure working with you!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "105870028499102857029", "name": "Larry Marsili", "time": 1464968829254, "rating": 5.0, "text": "I've been very happy with WebDetail's handling of multiple sites for me.  Not only do I use them for my law practice, but also for an unrelated business venture.  I've found Jerimy to be very prompt in responding, as well as knowledgeably and helpful in advising what steps I need to take to optimize my website's effectiveness.  I would recommend Jerimy and his team at WebDetail to anyone looking to start up with a website from the ground up, or anyone that is looking to improve their overall web presence.", "pics": null, "resp": {"time": 1465843125479, "text": "Thank you Larry!  Always a pleasure working with you -- on your numerous business ventures!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "116836471428552388808", "name": "John Crocker", "time": 1466087795559, "rating": 5.0, "text": "The design and quality our office has received from Webdetail for our website needs is simply excellent. I highly recommend Webdetail for all of your company's Webdesign needs. They are simply the best.\nJohn Crocker", "pics": null, "resp": {"time": 1466444222169, "text": "Thank you John!  I've certainly enjoyed our working relationship and certainly appreciate your business!"}, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "101340839177883447969", "name": "Shelley Fraser", "time": 1555079596412, "rating": 5.0, "text": "Webdetail created and manages our company website. Any issues that come up are handled quickly and professionally.", "pics": null, "resp": null, "gmap_id": "0x88620d9fc836c8c7:0x8984176e4816f2ed"}
{"user_id": "103217788467077880933", "name": "Bill Armistead", "time": 1604716468891, "rating": 5.0, "text": "Image Hive did an outstanding job of transferring over 100 super eight videos onto a thumb drive with outstanding quality. And, they are right here in Birmingham. So there is no need to box up your videos and ship them off to another state to have them transferred. I could not be more pleased!  I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "110914903018948010338", "name": "Theodore Campbell", "time": 1614076726838, "rating": 5.0, "text": "Great quality in and out I no time fast service will use again", "pics": null, "resp": {"time": 1614135354397, "text": "Thank you, glad we could help."}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107947153725319859167", "name": "D. Seibert", "time": 1579375895579, "rating": 5.0, "text": "The staff at Image Hive are incredible to work with!  So far, they have done script prep, teleprompter, studio shooting and final editing of over 30 of my online course videos and are now working on a new course with me.  I just love working with Steven, Dimi, Kat and the others there, that are most professional and caring about me and my projects.  They go overboard and I would strongly recommend them if you have a video project.", "pics": null, "resp": {"time": 1579544761841, "text": "Dear Don, thank you so much for your kind words. You are a great client to work with too. We hope your goal for many more people quit smoking be very successful."}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "104356530368415532220", "name": "Barbara Franklin", "time": 1558556091270, "rating": 5.0, "text": "I prepared a video history for my organization and had Image Hive to reproduce it for me.  Kat was so helpful.  She converted the format, added chapters, assisted me with the cover graphics and produced my requested copies very quickly.  She provided superb service and helped us provide an amateur video that looked professional.  Everyone was pleased.  She was great and very professional.  Thanks, Kat.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "112946115069474444206", "name": "CLIFF STROUT", "time": 1559082988847, "rating": 5.0, "text": "When my mother in law passed away, I took her old 8mm Home movies to these people. They went above and beyond cleaning the dust, adding shots of film titles in her handwriting. They made a wonderful movie for us as a family keepsake. Everyone loved it.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "115173656244661117081", "name": "Jacob delaRosa", "time": 1547494097918, "rating": 5.0, "text": "Image Hive is my go-to choice for studio rental when I need an indoor location for my clients. They offer all the lighting equipment and backdrops you could ask for. Their enormous cyc wall is just amazing! You can comfortably shoot anything from products, large groups of people and even vehicles in their space. They also offer film scanning services for old home movies on VHS and super 8 film. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "114437570016322460272", "name": "Jeff Nelson", "time": 1558466826083, "rating": 5.0, "text": "We had several old 8mm movie reels that we needed transferred to digital and DVD formats.  The results were great and we were very happy.  I would recommend your services to anyone with a similar need.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "101039468108346282478", "name": "Micah Wade", "time": 1547315488676, "rating": 5.0, "text": "The folks at Image Hive have been helping me secure my family’s memories for over three years now. Steven, Mark, and their staff are professional and helpful. As a mom, I was so stressed out about saving videos of my children, since I didn’t have the time or skills to do it on my own. Someone referred me to Image Hive and I’ve been so relieved ever since. They also run regular specials! 5 STARS, Image Hive!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "113249054387056761263", "name": "Hilda Johnson", "time": 1558613663049, "rating": 5.0, "text": "Great job on my videos and great people to work with. Very quick return getting my videos back. Very pleased and anxious to have more done.\nHilda Johnson", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "109268273710875462007", "name": "Lee Winnige", "time": 1558462254581, "rating": 5.0, "text": "These guys did a great job of scanning my old family photos. Great service and friendly staff. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "111309645251360108410", "name": "Richard Schlinkert", "time": 1578065424867, "rating": 2.0, "text": "I took in about thirty 35mm slides to transfer to digital, and while they turned the order around quickly, the slides had dust and lint in them and were very low resolution for the cost, which is about twice what the mail-in services charge for twice the resolution.  Unless you are in a hurry, look elsewhere", "pics": null, "resp": {"time": 1578078597457, "text": "Thank you for sharing your experience with us.  We're sorry that the final results of your scanning order did not meet your expectations.  We pride ourselves on giving each order personal attention and all of the work we do is done in our Birmingham location (in the historic Avondale neighborhood).\nWe recall your order very clearly.  You chose our PROOF quality (700 ppi) for your slide scanning order, which our lowest resolution (and lowest priced).  We also offer ARCHIVE quality scans (1700 ppi) at a slighlty higher cost.  Our scanning service, whether Proof or Archive level, includes the utilization of dust removal software, which can remove superficial debris and blemishes on the scanned images.\nOur technician specifically noted the high concentration of dust on your slides before scanning your slides.  Prior to scanning your order, our tech  attempted to manually clean each of your slides by hand to remove the dust and lint you described.  Unfortunately, dust and lint are often stuck to the film itself and may not be removed except by rewashing or physically wiping the film with a chemical solution.\nWe are generally unwilling to do such aggressive cleaning, out of fear we might damage our clients irreplaceable originals.  More often, if the condition of the originals is so bad that our usual cleaning and post-production are insufficient, we can do restorastion to the scanned images.  This digital retouching is not inexpensive, but for extremely valuable or badly deteriorated images, it is often the best option.\nAgain, we're sorry to hear you were not completely satisfied with our service.  We would welcome the opportunity to regain your confidence."}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "103333855802638099393", "name": "Floyde Young", "time": 1607305734144, "rating": 5.0, "text": "Nice spot for photography", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "117818375670235475378", "name": "Dave Loftin", "time": 1558476871063, "rating": 5.0, "text": "Image Hive did a great job transferring some old video tapes for me. Awesome folks to deal with.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "110791981266546984577", "name": "Lisa Wienhold", "time": 1546988468648, "rating": 5.0, "text": "Hive did a great job with a bunch of old family photos.  I was very pleased.   Fast great service !", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "109031672118015331782", "name": "Robin Anderson", "time": 1572474512907, "rating": 5.0, "text": "Very helpful staff, she did a great job, this is a good place!", "pics": null, "resp": {"time": 1572478428230, "text": "Thank you! Cat is wonderful, glad to hear from happy customers!"}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "111820436179064136417", "name": "tania mendoza", "time": 1476826841000, "rating": 5.0, "text": "I rented the photography studio at Image Hive recently to see if I could get a professional-looking profile pic for my CV, having a friend to take the picture instead of hiring a professional photographer. It turned out way better than I'd imagined. I'm so glad we did it ourselves! The place has a very creative vibe about it and the people there were very encouraging and helpful, without being intrusive. I also discovered that they convert all kinds of old media, like vhs tapes, film reels, and slides to digital. So, I'll be making a return trip after I go through my closets!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "103003612105934390320", "name": "Linda Bryant", "time": 1533832827361, "rating": 5.0, "text": "Great studio rental price. The people at Image Hive are experanced and helpful. Overall perfect shoot.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107842547183007232002", "name": "Tyler Kemp", "time": 1533753591342, "rating": 5.0, "text": "Great and experanced staff. Great studio for everything I needed. They also do film and tape transfers!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107842547183007232002", "name": "Tyler Kemp", "time": 1533753591342, "rating": 5.0, "text": "Great and experanced staff. Great studio for everything I needed. They also do film and tape transfers!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "117513114308618465022", "name": "Jennifer Ralph", "time": 1546893925000, "rating": 5.0, "text": "Image Hive converted some of my old VHS tapes to DVD's and computer files, and I was very pleased with the service and results!", "pics": null, "resp": {"time": 1546896244992, "text": "Great, thank you so much for great review! We are so happy we were able to help!"}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107479741111646750395", "name": "Lee Walthall", "time": 1558562213953, "rating": 5.0, "text": "Image Hive has helped me convert old video recordings to digital files and duplicate CDs on several occasions and I was extremely pleased with their timely high quality service and reasonable price", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "101134386956469162515", "name": "elizabeth cypher", "time": 1559081570094, "rating": 5.0, "text": "Staff very knowledgeable and efficient. Prompt and just what I needed!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107237744589396884880", "name": "Collin Balentine", "time": 1533740724101, "rating": 5.0, "text": "Had a great studio perfect for shooting photography and video.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "114529658832792709921", "name": "Dima Ant", "time": 1464723079142, "rating": 5.0, "text": "Service is great and fast. Everything was done to my specifications. Great people in general.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "108459037081760182904", "name": "Cameron Balentine", "time": 1533143191604, "rating": 5.0, "text": "Can restore and duplicate and enlarge old photos..check them out! Great poster size made at a great price!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "111647182964218600487", "name": "Mike Bryant", "time": 1533753306192, "rating": 5.0, "text": "Had a great set-up and knowledgeable staff. Also flexiable with time.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "101888309380030128580", "name": "Norman Virciglio", "time": 1491255009466, "rating": 5.0, "text": "Great Job on transferring 50 year old 8mm to digital.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "117265729940486182088", "name": "Jimmy Sparks", "time": 1608224493196, "rating": 5.0, "text": "My family and I have used Cam Video for several projects--including transfer of old family video to digital format, producing a slide presentation for our son's rehearsal dinner, and providing live stream and videography for our daughter's wedding this year when so many could not attend. This week they have come through for us again. We wanted to create a short Christmas video for our son who will miss Christmas at home due to mandatory quarantine by his employer. In the midst of his many commercial projects, Vann Cook made room for this small job (not costing enough to be worth his time). My request was last-minute, but he turned it around quickly so our son could have it for Christmas. I have to assume that this company commits itself to serving all its clients, large or small, with the same care and quality. As for the video, it turned out nicer than I could have hoped for. Thanks Vann and Cam Video for helping our family to share Christmas together this year!", "pics": null, "resp": null, "gmap_id": "0x88890cfdbea92c79:0x97cd3a60c6b35670"}
{"user_id": "108361600114441991605", "name": "DrayPullz", "time": 1597460368335, "rating": 5.0, "text": "Wonderful service and very kind. Converted a VHS to DVD for me and did wonderful at a great price. 10/10", "pics": null, "resp": null, "gmap_id": "0x88890cfdbea92c79:0x97cd3a60c6b35670"}
{"user_id": "105559586862547720810", "name": "Deborah Sparks", "time": 1601307399151, "rating": 5.0, "text": "This company is AMAZING! They take the quality of their work very personally. They produced a videography and live stream of our daughter's wedding for guests who could not attend due to covid travel restrictions, and it was one of the highlights of this special day! Vann Cook and his partner took care of all the technology, the coordination with our venue and wedding director, and all other details without any worry from me! We could not be more pleased. Thank you Vann, for preserving these memories for us, and allowing our son to \"be present\" at his sister's wedding! I wish i could give 10 stars!", "pics": null, "resp": null, "gmap_id": "0x88890cfdbea92c79:0x97cd3a60c6b35670"}
{"user_id": "109564110779759514783", "name": "Ginelle Ali", "time": 1563022572069, "rating": 5.0, "text": "The turnaround time for my order was amazing and we were VERY happy with the quality of  our DVDs. Thank you!! We were definitely impressed. Great Job!!", "pics": null, "resp": null, "gmap_id": "0x88890cfdbea92c79:0x97cd3a60c6b35670"}
{"user_id": "103476431782733421308", "name": "Steven Antselevich", "time": 1577762508952, "rating": 5.0, "text": "Great guys, perfect service. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88890cfdbea92c79:0x97cd3a60c6b35670"}
{"user_id": "102776259416306399855", "name": "Rhoa Cox", "time": 1579409357208, "rating": 5.0, "text": "Absolutely will use this place again!! They delivered as promised!", "pics": null, "resp": null, "gmap_id": "0x88890cfdbea92c79:0x97cd3a60c6b35670"}
{"user_id": "109022586663022766085", "name": "Scott Crawford", "time": 1533760395500, "rating": 5.0, "text": "Friendly service; reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x88890cfdbea92c79:0x97cd3a60c6b35670"}
{"user_id": "105954068804107118244", "name": "Lady Swag Tv Cooking Plus More", "time": 1575012785512, "rating": 5.0, "text": "It was fine", "pics": null, "resp": null, "gmap_id": "0x88890cfdbea92c79:0x97cd3a60c6b35670"}
{"user_id": "114415659727939822690", "name": "Christen Henry", "time": 1606581050983, "rating": 5.0, "text": "Happy to help anytime I can.", "pics": null, "resp": {"time": 1606580352311, "text": "Thanks Chris! Thanks for all of your help over the years."}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "103476431782733421308", "name": "Steven Antselevich", "time": 1598535119714, "rating": 5.0, "text": "Great and easy company to deal with. Wide variety of all things technology.", "pics": null, "resp": {"time": 1606580287572, "text": "Thanks Steven! We love partnering with you. Let us know if you need anything."}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "116401516662615409053", "name": "MV SS", "time": 1521991299698, "rating": 5.0, "text": "Holt Audio and Visual is well known to me personally. I worked in the legal field in Birmingham for over 42 years as a legal secretary, legal assistant and paralegal and first learned of Holt AV's services while on the job. However, over the years, I have personally used their services on a number of occasions to obtain duplicates of and share videos and recordings that were taken on vacation and during get togethers with family and friends. One tape in particular was very old, but the staff at Holt AV did an extraordinarily important job for me in duplicating a recorded conversation with my mom made many, many years before her death. I felt they took great interest in and were attentive in doing an excellent job in delivering something that has become very precious and invaluable to me and my family. Thanks, Holt AV - wishing you well for another 60 years and beyond!", "pics": null, "resp": {"time": 1522071411392, "text": "Thanks for the kind words! Hope we can be of help in the future!"}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "101980969016605177617", "name": "Marshall Mooney", "time": 1527514496364, "rating": 5.0, "text": "Customer service at it's finest. They go out of their way to make sure you have what you need when you need it.", "pics": null, "resp": {"time": 1527599902330, "text": "Thanks for your comment! We love making our customers look their best."}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "101757450406956311971", "name": "Kenyetta Currie", "time": 1501622396744, "rating": 4.0, "text": "Nice living", "pics": null, "resp": null, "gmap_id": "0x887d461acd4b1bd9:0xf57065338376a25d"}
{"user_id": "115369186204803671346", "name": "Ashley Tesfaye", "time": 1603822784179, "rating": 5.0, "text": "I am not even sure where to start. Axel's work speaks for itself. From the moment I laid eyes on a video he created, I knew I wanted him to be the one to capture our wedding day. Axel is extremely professional and quick to respond to all emails and communication. We, unfortunately, had to make many adjustments to our wedding plans due to Covid, and Axel didn't hesitate to problem solve, change plans, and be available for us when we needed him. Not only is he an amazing person, he is an exceptional videographer. He captured the entire essence of our wedding day. He got to know us and he made sure to capture all of the big and small moments and then seamlessly integrated them into our gorgeous highlight video. I have already watched it more times than I can count, and I can guarantee it will be something we talk about for years to come. Not only did Axel capture our micro-wedding, we have him booked for next year to capture our large vow renewal and reception. There is nobody better for the job and I can't recommend him enough! You will not regret hiring him for any of your video needs!", "pics": null, "resp": null, "gmap_id": "0x88608b6883032d23:0x91d6f9f32028e966"}
{"user_id": "113977303657611575293", "name": "Tali Mize", "time": 1579288288791, "rating": 5.0, "text": "Axel is such an amazing videographer! He captured our wedding beautifully and made the video romantic, sweet, and fun. He was so punctual with all phone calls, plans, and on wedding day. He really listened to everything we wanted and executed it perfectly! Highly recommend for your wedding", "pics": null, "resp": {"time": 1580224847114, "text": "Thank you so much for the kind review Tali! I really enjoyed shooting your wedding and thank you guys so much for trusting me!"}, "gmap_id": "0x88608b6883032d23:0x91d6f9f32028e966"}
{"user_id": "110220630076010117803", "name": "Natalie Wilson", "time": 1580398106587, "rating": 5.0, "text": "Having Axel to capture our wedding day is the one thing I am most thankful for. He is so kind and fun to work with. I cannot recommend him and his services enough.", "pics": null, "resp": {"time": 1580422017911, "text": "Thank you so much for the review Natalie! It was so great working with you and Scott and I hope you guys are doing well"}, "gmap_id": "0x88608b6883032d23:0x91d6f9f32028e966"}
{"user_id": "111315415920260822259", "name": "Tori Ragsdale", "time": 1582562041555, "rating": 5.0, "text": "If I could give 10 stars, I would unhesitatingly do so. Axel did an AMAZING job with our final product, and he was such a joy to work with the day of! He had a gift of capturing all those special moments throughout the day (he’s got that experience which gives him the professional eye!) and is so professional and friendly. He made my husband and Is vision come to life, and was so patient with all our requests! If you choose Axel Marshall Productions, you’re choosing perfection and you won’t regret it!!!", "pics": null, "resp": {"time": 1582824486237, "text": "Reading this brings the biggest smile to my face Tori! Thank you so much for the kind words and incredible review! You and Nick both were a joy to work with and your wedding was absolutely perfect. Thank you to much for the opportunity to shoot your wedding and play a small role in such a monumental day!"}, "gmap_id": "0x88608b6883032d23:0x91d6f9f32028e966"}
{"user_id": "102845760647558353661", "name": "Josh Ray", "time": 1577961343887, "rating": 5.0, "text": "AMAZING WORK! AMAZING GUY! I can't say enough about Axel Marshall and just how great of a job he does. We've worked with his on what is now our 2nd video production for our business and he delivered and then some! He's informative, flexible, and he has such a great attitude about filming and production which reflects such a positive output on the final product. Highly recommended!", "pics": null, "resp": {"time": 1580224896279, "text": "Thank you so much Josh! I absolutely love working with you and I look forward to ore projects in the future!"}, "gmap_id": "0x88608b6883032d23:0x91d6f9f32028e966"}
{"user_id": "115640266818253552605", "name": "Agnes Gretarsdottir", "time": 1580311564834, "rating": 5.0, "text": "Axel was the best videographer we could’ve ever asked for. He has a passion for weddings and film making and it’s evident that he loves what he’s doing!  Our wedding day would not have been the same without Axel ☺️ If I could leave a 100 stars ⭐️ I would!", "pics": null, "resp": {"time": 1580314376337, "text": "Thank you so much Agnes! I am still blown away that I had the opportunity to work with you guys and create something so incredible in Iceland! I love keeping up with you guys on Seths Instagram by the way haha, stay warm up there!"}, "gmap_id": "0x88608b6883032d23:0x91d6f9f32028e966"}
{"user_id": "118134960036771044666", "name": "The Frenchs", "time": 1602010823709, "rating": 5.0, "text": "I first worked with Axel at a wedding in Kentucky two years ago when I was just starting out. I had the opportunity to watch a professional work his craft!", "pics": null, "resp": {"time": 1602012719876, "text": "You're too kind man! It was an absolute pleasure working with you and I hope one day our paths cross again!"}, "gmap_id": "0x88608b6883032d23:0x91d6f9f32028e966"}
{"user_id": "110172329831148650406", "name": "Kim Livingood", "time": 1584809141701, "rating": 5.0, "text": "As growing videographers, his work is a go to for studying and learning.  Beautiful story lines, great sound selections and excellent video quality.  A true master in the wedding videography industry!", "pics": null, "resp": null, "gmap_id": "0x88608b6883032d23:0x91d6f9f32028e966"}
{"user_id": "105253272870661874272", "name": "Sycamore Farms", "time": 1586099072700, "rating": 5.0, "text": "Axel Marshall was the videographer for a wedding at The Barn at Sycamore Farms this past February.  As a venue manager, I so appreciate vendors who are professional and communicative and Axel was both of these.  If you are looking for a wedding videographer, I recommend Axel Marshall.", "pics": null, "resp": null, "gmap_id": "0x88608b6883032d23:0x91d6f9f32028e966"}
{"user_id": "107049175277051299602", "name": "Brody Contarino", "time": 1580355433011, "rating": 5.0, "text": "Axel is extremely professional, dependable, and best of all friendly and fun to be around! You won’t regret choosing him.", "pics": null, "resp": {"time": 1580422705485, "text": "Thank you so much for the kind words Brody!"}, "gmap_id": "0x88608b6883032d23:0x91d6f9f32028e966"}
{"user_id": "117148338248218566364", "name": "Greg Beasley", "time": 1584647568536, "rating": 5.0, "text": "Very professional and hard working.  We highly recommend Axel and his company.", "pics": null, "resp": null, "gmap_id": "0x88608b6883032d23:0x91d6f9f32028e966"}
{"user_id": "103407058898723280940", "name": "Mark W. Douglas", "time": 1499039106480, "rating": 5.0, "text": "Here's a Fantastic Chattanooga Videographer!", "pics": null, "resp": {"time": 1580309747832, "text": "I appreciate you so much Mark!"}, "gmap_id": "0x88608b6883032d23:0x91d6f9f32028e966"}
{"user_id": "112326072108003445417", "name": "Thomas Quarles", "time": 1549371818880, "rating": 5.0, "text": "Axel is the best around!", "pics": null, "resp": {"time": 1580309731975, "text": "Thank you so much!"}, "gmap_id": "0x88608b6883032d23:0x91d6f9f32028e966"}
{"user_id": "105929705425737849202", "name": "Jarrod Six", "time": 1459868450424, "rating": 5.0, "text": "I've worked with Alex on multiple projects and his work is great. Best in this area by far. Very professional and fair priced. I highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x888ccded13a5583d:0xcfc891cc9833994"}
{"user_id": "103147054831293732053", "name": "Charles Williams", "time": 1604694714820, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x889a4fcc7d59898f:0x4bf1df4017afff6e"}
{"user_id": "113833148064730017164", "name": "Karen Griffin", "time": 1596810121914, "rating": 5.0, "text": "Awesome crew. Definitely go see them for your advertisement needs.", "pics": null, "resp": {"time": 1597667852573, "text": "Thank you Karen!"}, "gmap_id": "0x889293aaf6180031:0x2ac4849b95e6ff5f"}
{"user_id": "115342551679620052856", "name": "Joe F. Watson", "time": 1583448235839, "rating": 5.0, "text": "This is the most professional advertising agency in the area. Great staff.", "pics": null, "resp": {"time": 1588866402829, "text": "Thank you Joe!"}, "gmap_id": "0x889293aaf6180031:0x2ac4849b95e6ff5f"}
{"user_id": "102932560093225843725", "name": "Christopher Calvin Reid", "time": 1568659071298, "rating": 5.0, "text": "I highly recommend this company and the employees that work here.", "pics": null, "resp": {"time": 1588868181890, "text": "Thank you Chris!"}, "gmap_id": "0x889293aaf6180031:0x2ac4849b95e6ff5f"}
{"user_id": "102787019948847241298", "name": "Curtis Tarver", "time": 1516201047089, "rating": 3.0, "text": "Okay", "pics": null, "resp": null, "gmap_id": "0x889288c99e6bb249:0xc76fe141c088fb19"}
{"user_id": "103673975639237529891", "name": "Ronnie Vanderhorst", "time": 1619088401675, "rating": 5.0, "text": "In the midst of the pandemic when nonprofits are reinventing themselves to provide services virtually, Komposition LLC helped us reimagine our website that not only looks good but is user-friendly. Their technical support is also top notch. Big Ups to them!", "pics": null, "resp": {"time": 1619112054884, "text": "Thank you Mr. Vanderhorst for your review! We're happy to hear we hit the mark for you and we look forward to our continuing relationship."}, "gmap_id": "0x88626872735613e7:0x1f3d8962d01ab65e"}
{"user_id": "100408281450390902329", "name": "Frenita B. Fullwood", "time": 1612192277142, "rating": 5.0, "text": "Working with Kanique at Komposition was wonderful! She understood exactly what I needed for my company website and handled all the details. Kanique is professional, responsive, and does great work. She made it happen. Thank you Kanique!", "pics": null, "resp": {"time": 1612230238232, "text": "Thank you Frenita for trusting us with your website needs and for your kind words!"}, "gmap_id": "0x88626872735613e7:0x1f3d8962d01ab65e"}
{"user_id": "118368875577794122298", "name": "Frederick Howell", "time": 1619208214228, "rating": 5.0, "text": "Kanique was thoroughly professional in developing our website.  Kanique's diligence, expertise, and patience make her truly a pleasure to work with.  We highly recommend her services.", "pics": null, "resp": {"time": 1606952117275, "text": "Thank you so much for your kind words! I am so glad for the opportunity to work with you in creating a site that you are proud to display. I appreciate how easy it was to work with you and for your patience. Thank you."}, "gmap_id": "0x88626872735613e7:0x1f3d8962d01ab65e"}
{"user_id": "111258259639437712965", "name": "Macky Outlaw", "time": 1603789683403, "rating": 5.0, "text": "I had a DIY website in need of serious repair. Kanique took the project, and within a week, had my site looking professional. Highly recommended.", "pics": null, "resp": {"time": 1603817273780, "text": "Thank you Macky! I enjoyed working with you on this project."}, "gmap_id": "0x88626872735613e7:0x1f3d8962d01ab65e"}
{"user_id": "102768883376978728199", "name": "Dave Herrling", "time": 1589338906077, "rating": 5.0, "text": "Kanique was referred by a professional associate of 16 years. I’m very demanding and know exactly what I want. She is able to listen critically and offer innovative insights.\n\nI’m Thrilled with the site she created for me, it captures my essence. The value of her talents, far exceed the reasonable price being paid. She builds a Secure site and knows how to get you seen, my Stats are through the roof !\n\nShe is being retained for monthly maintenance and troubleshooting.\n\nThis is what I’m Thrilled about...\n\neyejobart.com", "pics": null, "resp": {"time": 1589378400604, "text": "It has been a pleasure working with you Dave! I love that you know what you want and are passionate about your art and how you would like it to be displayed. Thank you for your continued business and generosity, it is truly appreciated."}, "gmap_id": "0x88626872735613e7:0x1f3d8962d01ab65e"}
{"user_id": "101044985929035720030", "name": "Natalie Francis", "time": 1591033078234, "rating": 5.0, "text": "Kanique was an awesome web designer, she saw my vision for my e-commerce boutique site. She was so patient with me, did zoom meetings, explained and tutored me in areas of technology I had no idea how to maneuver before!! Thanks for an awesome site NatalieReStyles.com. I'm so grateful!!", "pics": null, "resp": {"time": 1591044278194, "text": "I enjoyed working with you and seeing your ideas become a reality. You have an awesome business and product and I see you taking the industry by storm. Thank you for allowing me to be a small part of it :)"}, "gmap_id": "0x88626872735613e7:0x1f3d8962d01ab65e"}
{"user_id": "108912127577634430285", "name": "Draenard Jackson", "time": 1587151165352, "rating": 5.0, "text": "Kanique's quick response and knowledge were greatly appreciated.We will be using your services again in the future. Excellent work!", "pics": null, "resp": {"time": 1591044549169, "text": "Looking forward to working with you again! Thank you for your kind words."}, "gmap_id": "0x88626872735613e7:0x1f3d8962d01ab65e"}
{"user_id": "114750678294158460734", "name": "Troy Levy", "time": 1563820046884, "rating": 5.0, "text": "I tried working on my church’s website myself but just didn’t have the time or patience to figure everything out. That’s when I contacted Komposition. Their reputation preceded them and came highly recommended from another colleague. Komposition took over our website although it was in shambles and out came a beautiful product. They were extremely patient with us and took their time to ensure that we received consummate professionalism and skill. Our church’s public profile is much better off because of Komposition’s work. I’m very pleased.", "pics": null, "resp": {"time": 1563826437649, "text": "Thank you for the opportunity to work with you!"}, "gmap_id": "0x88626872735613e7:0x1f3d8962d01ab65e"}
