{"user_id": "115043859806727366108", "name": "Peggy Kalb", "time": 1552157447840, "rating": 4.0, "text": "We stayed a month at The Palms. The condo was perfect for us. Southern Vacations was great to take care of us. Will return again. Thank you Ann for the one on one contact with us.", "pics": null, "resp": null, "gmap_id": "0x889a0691df184d9b:0x3d081a4ad111ceb2"}
{"user_id": "103858405922204936922", "name": "Madison Johnson", "time": 1562301162217, "rating": 5.0, "text": "The people working there are the absolute nicest and the condo was spectacular!!! Love this rental company and will definitely be using them in the future! Highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x889a0691df184d9b:0x3d081a4ad111ceb2"}
{"user_id": "106686735944765205480", "name": "Lewis Golden", "time": 1334265117422, "rating": 1.0, "text": "I just got off the phone with the owner of the company and these people are TERRIBLE to deal with!  First they double-booked me, then set aside a unit that wasn't comparable.  What adult couple wants to sleep in twin beds?  They kept promising a better unit might open up and when it didn't, we were inside of 30 days.  As any consumer would, I made other arrangements.  They made the initial mistake and never offered any concessions in an attempt to correct it.  The real kicker is that they kept a portion of my deposit for \"processing\".  BUYER BEWARE - definitely will not be doing with this company EVER!\n\nUpdated:  I didn't just \"inquire\" about a unit, you sent me a rental confirmation.  We were on board, but that was before you back-tracked on verbal commitments you made regarding parking passes and check-out time, which resulted in a different total amount due.  We even spoke regarding the refund, at which time you agreed to refund the full amount.  There was a clear pattern of miscommunication and failure to follow through with commitments and we made the decision to make other plans for fear of the pattern effecting our vacation in a more significant manner.  You yourself even admitted that you booked the original before knowing that it was available.  Look, problems do happen.  The difference can be seen in how you respond.  In my opinion, your response was less than satisfactory and I feel the need to make sure others know in advance who they are dealing with.", "pics": null, "resp": null, "gmap_id": "0x889a0691df184d9b:0x3d081a4ad111ceb2"}
{"user_id": "102902075658745163470", "name": "Suzanne Johnson", "time": 1531362256985, "rating": 5.0, "text": "Amazing July 4th! Condo was great as suggested by the knowledgable and helpful staff. We will definitely use 3 Palms for our future vacations. Thanks!", "pics": null, "resp": null, "gmap_id": "0x889a0691df184d9b:0x3d081a4ad111ceb2"}
{"user_id": "110513270765401627514", "name": "Ray Fisher", "time": 1411742332256, "rating": 5.0, "text": "My sister and I have been renting from Three Palms for several years now and our experience with them has been consistenly good.  They have been easy to work with and met all committments they have promised.  When our preferred unit was not available they have worked hard to find us a suitable alternate.  We are going down for October 2014 and looking forward to it.  I believe this will be the fourth year in a row they have helped us with a unit at Four Seasons which we like very much.", "pics": null, "resp": null, "gmap_id": "0x889a0691df184d9b:0x3d081a4ad111ceb2"}
{"user_id": "102210884489617148620", "name": "Daniel Dyas", "time": 1564765074424, "rating": 1.0, "text": "Three Palms manages my family's condo complex. The condo facility has deteriorated in quality and Three Palms has started charging a parking fee on everyone who visits. I wouldn't advise using them.", "pics": null, "resp": null, "gmap_id": "0x889a0691df184d9b:0x3d081a4ad111ceb2"}
{"user_id": "108729805620188265565", "name": "Kathy Hall", "time": 1549390112395, "rating": 5.0, "text": "The entire staff are always courteous and helpful.", "pics": null, "resp": null, "gmap_id": "0x889a0691df184d9b:0x3d081a4ad111ceb2"}
{"user_id": "100815155373854772436", "name": "Cary A", "time": 1503355806114, "rating": 4.0, "text": "Best Southern Hospitality ever these ladies are nice to the point and will bend over backwards no matter what", "pics": null, "resp": null, "gmap_id": "0x889a0691df184d9b:0x3d081a4ad111ceb2"}
{"user_id": "107482345246202648776", "name": "Jennifer Davis", "time": 1501013394995, "rating": 2.0, "text": "The realtors are very rude. I wouldn't use them. They was going to charge me $10 to print one piece of paper.", "pics": null, "resp": null, "gmap_id": "0x889a0691df184d9b:0x3d081a4ad111ceb2"}
{"user_id": "101863334372152138822", "name": "td beddis", "time": 1500376543119, "rating": 5.0, "text": "nice place to visit, unit was wonderful, Three Palms very helpful", "pics": null, "resp": null, "gmap_id": "0x889a0691df184d9b:0x3d081a4ad111ceb2"}
{"user_id": "105348869735042469539", "name": "Sandy Frey", "time": 1564637295571, "rating": 4.0, "text": "Good stay", "pics": null, "resp": null, "gmap_id": "0x889a0691df184d9b:0x3d081a4ad111ceb2"}
{"user_id": "103454098337460525893", "name": "GEORGIANA ENFELT", "time": 1583628319910, "rating": 4.0, "text": "Friendly staff", "pics": null, "resp": null, "gmap_id": "0x889a0691df184d9b:0x3d081a4ad111ceb2"}
