{"user_id": "100538372013296537178", "name": "Chichi Jumbo", "time": 1620720802462, "rating": 5.0, "text": "I spoke to a recruiter, Ms. Cindi, and she was very knowledgeable and very professional! I am pleased with my experience!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "105814282487493392664", "name": "Jessica Smith", "time": 1621453029498, "rating": 1.0, "text": "I do not recommend if you’re looking for professionalism and communication. While the front desk attendant was apologetic, I still will not recommend nor return.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "100444810413229978839", "name": "JD McGuire", "time": 1612383800871, "rating": 5.0, "text": "They always do good here , the instructors are right there to help and are very prompt ... I've never left unsatisfied", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "113211314461321448217", "name": "Rachel Salters", "time": 1581951753632, "rating": 5.0, "text": "While I’m not a student there yet I am hoping to be in the fall. Everyone I walk through the doors it just feels like home and the staff and student are so nice. I got my hair cut there one time and while it did take a little longer I was so happy with my results. What people need to understand is that they are student and they are trying their best, and as for comments made on Ms. Susan I think she is a lovely person, very sweet and very helpful. There was always a teacher walking around checking and I just can’t wait to be a part of the Paul Mitchell family.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "117876733124028924898", "name": "samantha jones", "time": 1598685433873, "rating": 1.0, "text": "I communicated to the student EXACTLY what i wanted. I wanted an overall color change and had multiple pictures as examples. She gave me a halo highlight that barely even made a difference in my color and charged me full price. They do not listen to the client and often times listen to the head instructor even though it wasnt what i had even asked for. Very disappointed", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "114398454353791038194", "name": "Elizabeth Stclare", "time": 1599335700533, "rating": 5.0, "text": "Chelsea is amazing and certainly reflects the professionalism of the Paul Mitchell experience. So glad that I have had the opportunity to return especially in these restrictive pandemic times.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "108444523293906862154", "name": "Dena", "time": 1559362212869, "rating": 5.0, "text": "I always enjoy every experience I have had at Paul Mitchell! They are very professional and seem to stay on top of students. I wish I had time to go there more often. My last visit was great. I was trying something new with my hair color and wished I would of had time to go back during the grace period to have them go up higher with my color. Other than that everything was great. Do not go in when you are in a hurry. It is a school and they are learning so have to have patience. Thanks so much!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "105821179550072432969", "name": "Lindsay Bogle Waits", "time": 1566242768556, "rating": 1.0, "text": "I have been a faithful customer for 6 years, and I have been satisfied with my hair cut and highlight services. Unfortunately the past few times I have had highlights done, the learning leaders have not led the students well. Recently the student was unfamiliar with highlighting and caused the lightener to “bleed” causing an intense and distinctly different contrast to show up on the root and parted portion of hair. They tried to fix the problem by toning this portion. By toning the hair I no longer had highlights in this portion leaving the hair a reddish dark color on the root in contrast to the blond. They offered to provide additional highlights on another visit but I would still have to pay for the lightener. I was told $13. The next time I came within 7 days to have the lightener done to fix the toned area without highlights. It became apparent the learning leaders only add a small amount of lightener to each extra bowl needed to lighten so they can up charge $13 per bowl. I have noticed this in the past. This time I was charged for 3 bowls. The instructor said these extra bowls were not necessary, however the instructor allowed the student to use this amount. In addition to the bleeding mistake that occurred the previous time without proper supervision, I was disappointed by the poor customer service given by the instructors and poor business strategy taken by charging the customer for a mistake that was done under the lack of care by the learning leader. I have recommended this school in the past, but I will no longer do so. I am disappointed in the lack of desire to serve the customer well and the lack of instruction done by the instructors.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "108759375707267287811", "name": "Ashley Linden", "time": 1556374310771, "rating": 5.0, "text": "I am so pleased with my first experience of Paul Mitchell. My stylist was Shelby, and she did a great job of listening to what I asked for. I was very pleased with how her instructor payed attention to her work and helped where needed and did an excellent job. I wish I had gotten her name.\n\nI brought pictures and was very specific about wanting layers and they talked out ideas and were willing to give advice and do whatever I wanted. I never felt rushed (even though my hair was super long and it took an hour and a half) or like I was inconveniencing anyone even when I asked them to go back and put some more layers in.\nOther salons had argued with me about layers in the past and seemed afraid to cut my long hair and I have left disappointed, but not here! Thank you all for a fun and relaxed environment with great prices too!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "107307022358111419352", "name": "S s", "time": 1518128450002, "rating": 4.0, "text": "Went for a haircut recently and had a very good experience. Robert (instructor) did my haircut and he is an excellent teacher. I was here couple of times in past too and never had any bad experience with students. Instructors are always taking care of each client. Thank you Paul Mitchel instructors for all the effort you guys put in to teaching the art to the students. It’s very important to know what you want to get done and explain it to your stylist. Cost is unbeatable. It’s gonna be a while for them to work on you, they are learning on you so help them. Show pictures so they can get a better understanding of what you want.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "104707794931909493545", "name": "Amy Floyd", "time": 1566652703441, "rating": 3.0, "text": "This was my first time, and it was an okay experience. It took a long time for a wash & cut (75 minutes), but that is to be expected as it is a teaching school. I ended up fixing my own hair once I got home because there were lots of uneven places. If you are broke & can't afford to go somewhere else, this is a good choice. You just may have to repair your hair a bit on your own afterwards.", "pics": null, "resp": {"time": 1566922091727, "text": "Hey there Amy! We appreciate your honest feedback and you're absolutely right-we are a school! Our students are all at different levels of skill based on several factors including, but not limited to, length of time they have been in the program and the specific areas in which they excel. You may not have known this, but we have a 100% guarantee and you can always let us address any issues you might have had with your service. Students work on guests because they need the hands-on experience which is part of their curriculum. Students aren't ready for the salon until they have completed their program, hours, and have taken both their written and state board exams. They are then ready to transition to an actual salon. We also have students who are in a program here we call Phase 2. These students must pass an interview and hands-on assessment in makeup, cutting, color and texture. These \"master level\" students are available upon request and you'll be getting a more advanced, driven student that is much further along in their program. However, these services do cost a bit more. All that being said, we have to remember that we are a school, first and foremost. We love being able to offer extremely low (much lower than an actual salon) prices for our guests because our students need the hands-on experience. We can all remember the first time we tried to accomplish something...sometimes it was great, but sometimes we also had a lot to learn from the experience. But with practice and patience, we got so much better than when we started and that's exactly how it is for our students. We hate that you weren't happy with your hair, but we do appreciate the time you gave our student in letting them perfect their craft."}, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "115777177110036560389", "name": "Alyssa ellis", "time": 1576167595111, "rating": 5.0, "text": "As a student, I’d like to personally say, in regards to all of our learning leaders they help us to the best of their ability and in regards to them caring, they care way more than most normal teachers or instructors and ALWAYS try to make sure the guest is happy, although sometimes it can be confusing on what is trying to be communicated - Our learning leaders are the best there are is assisting us in our journey.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "108087962060040193445", "name": "jessalyn jones", "time": 1573316499326, "rating": 1.0, "text": "TERRIBLE SCHOOL!!!!!! No one helps the students out. They have to many people on the floor at once it looks crazy. I went in for a cut and it took 2 and a half hours.. because “Susan” wouldn’t help the student. If I could give a zero star I would. AWFUL!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "108353301106134136806", "name": "Kaitlyn Marlowe", "time": 1562684596730, "rating": 2.0, "text": "The first time I went my experience exceeded expectations.\n\nI have been twice more it service has been terrible.\n\n(1) I was told 2 hours and approximately $40 for a basic cut and color. SIX hours later I was still there and the bill was $110 because the student colored my hair in a way we had not discussed during the consultation.\n\n(2) I had to bring my child with me to an appointment and was refused service.  Which is fine.  Inconvenient, but fine.  However, the attitude behind the refusal was quite rude.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "114838474625145004535", "name": "DaShanee' Miles", "time": 1558046376252, "rating": 5.0, "text": "Absolutely love this place! The people there make you feel like family. Raven did an excellent job flat ironing my natural hair.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "108597386791813559492", "name": "Ashley T.", "time": 1508543179846, "rating": 5.0, "text": "Went in with a perm in mind but they were really honest with me and said they couldn't due to the dyes in my hair but instead said they'd teach me how to curl my hair the way in I had in my reference pics if I wanted which was really sweet of them. I instead went for a hair cut which was great for the price and the job my stylist did was wonderful. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "105614015425466242142", "name": "Diane Harris", "time": 1509710497808, "rating": 5.0, "text": "I had been using the location in Madison, AL for several years, then moved back to the Montgomery area last year.  Birmingham is the closest location to me, so I tried a local cosmetology school.  They do not measure up to Paul Mitchell.  I decided to make the drive to Birmingham and was certainly not disappointed.\n\nI received the service I  have come to expect from Paul Mitchell schools.  I was asked questions to determine my wants and needs and an instructor was checking in throughout to assure the work was being done to my satisfaction.  I have my next appointment scheduled and am bringing a couple of friends, as well.", "pics": null, "resp": {"time": 1512148847976, "text": "Ms. Harris we are so pleased to hear about your wonderful experience here and can’t wait to see you again for your next service!"}, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "101257100058994392771", "name": "Alyse Gilliam", "time": 1462323732682, "rating": 5.0, "text": "Had a great time here! We went in to get my hair, makeup and manicure done for junior prom. Everyone was super friendly and easy to talk to. Even though I got there a few minutes late we had no wait time at all. Taylor was so sweet and helpful, talked to me about exactly what I wanted done and just made the whole thing stress free. I went with a black manicure, curly side updo and soft makeup with a red lip. Everything turned out perfect and stayed from my morning appointment to after prom! I am definitely going back and would advise anyone who has a special occasion coming up or just wants to treat themselves to check The School out! It is also very very reasonably priced :)", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "117104456659928630453", "name": "Kim Nguyen", "time": 1394302261185, "rating": 5.0, "text": "Had a great first-time experience at Paul Mitchell The School Birmingham.   Hannah gave me a cut & style and fixed my poor attempt at a trim from a few days ago (I had completely butchered my bangs). Everyone here is very friendly and welcoming. I love my hair and my bangs now and will definitely be coming back!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "112778539623533206690", "name": "Julie Hughes", "time": 1516940677237, "rating": 5.0, "text": "My daughter, Katie, graduated from Paul Mitchell today. Thanks to the staff for their guidance and expertise.  The instructors, staff and owners taught her, not only how to be a hairstylist, but the business aspect of the profession. Now she has the foundation she needs to go out into the world. Without a doubt, she will be successful! Thank you!", "pics": null, "resp": {"time": 1516982639644, "text": "Julie thank you so much for the kind words! It was so wonderful having Katie enrolled at our school. She is such a kind and creative individual and we’re truly going to miss her. We wish her all the best in this next chapter of her life!"}, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "105604194289316681829", "name": "Tamara Morton", "time": 1473315199595, "rating": 4.0, "text": "The receptionist and my beauty specialist were very professional. My pedicurist tried her very best to do a good job and she did. I was very pleased with the outcome. What a treat! Regarding your website, I would like to be able to see prices for all the services that you provide. I'd probably end up spending money on more procedures if I could see what options were available. Anyways, I just discovered you, I've had two excellent experiences and I'm very happy to be a new client. I'll certainly spread the word to my friends.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "112035044459577097959", "name": "Jennifer R James", "time": 1544130391145, "rating": 5.0, "text": "Great place if you’re willing to help others learn/allow them to practice on you. Love the staff & the students. I always leave happy.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "102670739175007328707", "name": "Monika Camino", "time": 1573316622058, "rating": 1.0, "text": "Students do not seem to know what they are doing. And they seem to not have a lot of help. The student sat and waited for a teacher to come by and help for over 15 minutes while I sat there and watched the black teacher mess around with the black students. So unfair... need better staff!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "116976099037901499967", "name": "Nikita Monroe", "time": 1573316759813, "rating": 1.0, "text": "I will never go back! Teachers are so rude. Small white lady with blonde hair made me feel so unwelcomed and treated the student as if she was dumb for not knowing what to do. Not yet fault this school doesn’t teach the students.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "111075365760350422444", "name": "Nancy Ledbetter", "time": 1539902130995, "rating": 4.0, "text": "Love going there! My sister's and I meet there once a month for girls day. The students are always eager to please and the instructors are very helpful and ready to jump in if necessary.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "110575577554318040963", "name": "Anna-Marie Settine", "time": 1467302201174, "rating": 5.0, "text": "I love to come here to get my haircut. They always do a great job, and all of the products make my hair feel and smell amazing. The students and leaders are all very nice, professional, and talented. They listen to exactly what you want and make sure you leave with beautiful hair!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "108319471911876572984", "name": "Cathy Forrest", "time": 1395957255834, "rating": 5.0, "text": "Loved my haircut today.  People are so nice. The owner came over and helped, very great teacher.  I highly recommend that you try it out!!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "106222392397795432081", "name": "Holly Parker", "time": 1519191002125, "rating": 1.0, "text": "I have been in the past and had good experiences but sadly I can no longer say that. I went a few weeks ago and they seemed really rushed and not as personal as in the past. The instructor didn’t check my hair when I was completely done. After about a week I noticed that my hair was uneven and a huge chunk was shorter. I called to see if they could fix it and was told it had to be within 7 days and I would have to pay for a new cut. I was unable to go in any sooner because it snowed and then I had to work the weekend at my job.  I would gladly have given them a chance to fix it but they haven’t taken any action towards making it right. I am saddened by the fact that they messed my hair up and won’t fix it for the integrity of their establishment. I left a message for the manager and have not gotten a response back. This happened about a month ago. In my book, that’s a sign of being unprofessional. I will not be going back here.I hope they can fix this and do better in the future!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "102031736186000667974", "name": "shawn swartz", "time": 1467902483396, "rating": 5.0, "text": "I love coming here. They give such individual attention, more than I've ever received in a private salon. My hair is extremely thick and quirky and they spend the time asking questions and learning my hair before ever starting. The instructors remember me and my hair every time I come in. I won't go anywhere else to get my hair done.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "105022316516545949870", "name": "Brenna Terry", "time": 1468013419037, "rating": 5.0, "text": "Professional and fun! I have gone in and asked for a variety of edgy, complicated styles- bob, pixies-  and have yet to be disappointed. Even if the student is still learning the ropes, the stylist who oversees them will make sure that they give you a great 'do. Sometimes you may have to wait a bit for the head stylist to approve, offer advice, etc. but the wait is worth it in the end. Please support PM and help these up-and-coming stylists start their careers!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "115167172826745693283", "name": "Tamara Caffee vlogs", "time": 1559161977861, "rating": 5.0, "text": "I got my hair dyed here amd i cant get over how good it looks i did natural colors and it looks great i recommend this place", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "110067753492235791576", "name": "Stephanie Pilgrim Moore", "time": 1407347368868, "rating": 4.0, "text": "Very friendly and professional, the only downside was that it took about an an hour and forty five minutes for a shampoo cut and blow dry (which normally took less than an hour at other salons).  However, I was happy with the service and the results.  Have already booked my next appointment.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "108334357632767568381", "name": "brenda Weaver", "time": 1464712772697, "rating": 5.0, "text": "Tori R.  Dyed my hair and it turned out fabulous!   Not only did I get great results,  but expertise customer service!   Everyone was there to help her with the foiling of my hair, which took a long time.  But she did an excellent job and I am so pleased with the results.  I will recommend Paul Mitchell Academy to everyone I know.  Thank you so much Tori!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "117193440036274103448", "name": "Megan Richey", "time": 1384886245466, "rating": 5.0, "text": "Salon experience for a great price! Their color is amazing and I always get a great cut. Actually, I have had better cuts by the students here than stylists at most expensive salons. Give it a try.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "117643753203189137006", "name": "Patsy Blakley", "time": 1471864380633, "rating": 5.0, "text": "I lost my hairdresser, he retired so I decided to try the school. I was really impressed and pleased with my experience. I got my hair cut and it was great and I liked the products they used on my hair. It made it soft and took care of the frizz. I will go back.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "100509606983275854498", "name": "Wynter Rudolph", "time": 1466454084592, "rating": 5.0, "text": "I had a wonderful experience at Paul Mitchell.  The hairstylist were very friendly to me and I just love how my hair looks now. Robin Rudolph did an amazing job on my Eyebrow wax.  I love it!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "113914686607513187762", "name": "Bonnie Ferguson", "time": 1505152448528, "rating": 1.0, "text": "Adding this to my list of the WORST customer service in Birmingham. I didn't even get to step in the door because they CLOSED the school without letting anyone know! I drove all the way there in the RAIN for nothing! You need to let your customers know if their appointments are canceled! SO SO SO UNPROFESSIONAL. I don't even want to make another appointment if this is how they treat their customers. I wish I could give zero stars.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "112072665809189707237", "name": "Astoria Riggans", "time": 1609591842892, "rating": 5.0, "text": "Love it here", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "111823150342230088946", "name": "Azziza S", "time": 1508823338202, "rating": 1.0, "text": "My daughter, my mother and I all got great cuts. I've never had a color but I've decided to do it.\n\nSadly the student who had great talent graduated. The last time I went the student destroyed my hair, gave me scalp burns from a too strong bleach solution, and turned my blonde hair GREY.\n\nThen the instructor absolutely refused to fix it. They were extremely rude and unprofessional. I will not be going back. Use the Aveda salon and school instead.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "109685844409335155672", "name": "C Gilbert", "time": 1518633233375, "rating": 5.0, "text": "Teairh is awesome. Done great with my hair and will go back to see her!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "113154574367387051629", "name": "Carole Tull", "time": 1385090616033, "rating": 5.0, "text": "I have been coming to the Paul MItchell School Birmingham for about five years, and I have never had a bad experience.  I love watching the new students become professionals, and I usually follow one student until he or she graduates.  I have made many friends, and I still hear from some of the people who did my cuts and color throughout the years.  Keep up the good work, Paul Mitchell students.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "112401603626507881253", "name": "Allison Kerner", "time": 1466448318361, "rating": 5.0, "text": "I am very pleased with the hair trim I received!\nHaley P. did it!  I will be back in a few months for another trim.  And thanks for allowing my hair to stay long...", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "110348508991888168854", "name": "Kat Henderson", "time": 1495776454457, "rating": 3.0, "text": "I've gone three times now. They are very professional and definitely get the job done, I'm just disappointed in the time expectation. It took two hours my first time for hair bleach- I was going to get a cut but passed as I was on lunch and had spent too much time. They're not open Saturdays. 2nd time was cut bleach and toner, which was fine. Third time took almost 4 hours from the time I got there to the time they checked me out just to do root colour + toner. They put two hours on my chart. I'm not sure why the time it took doubled.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "113811335308211893182", "name": "Nameless Faceless", "time": 1456279691637, "rating": 5.0, "text": "Loved my highlights! Great prices and knowledgeable staff! Very professional.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "114922692982462990640", "name": "Khrystal Fairchilds", "time": 1552094939532, "rating": 4.0, "text": "I got my hair done there & love it.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "103674410149119465412", "name": "Katharine Blackwell", "time": 1556048041177, "rating": 5.0, "text": "I routinely get my hair cut at the Paul Mitchell School in Birmingham. They always do a great job, and I feel like I'm treated like a VIP client!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "110847020637767166529", "name": "Catherine Glenn", "time": 1438118684914, "rating": 5.0, "text": "I have always had an awesome experience here!  The stylists do a great job, and the price is right!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "113690816469373003782", "name": "Shannen Wright", "time": 1466715820607, "rating": 5.0, "text": "Been coming here 4-5 years had good experience and have seen many different girls only had one bad hair cut. But over all satisfied.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "104033560432844215694", "name": "Taylor Lee", "time": 1573316361150, "rating": 1.0, "text": "Worst service ever. Teachers are terrible. A student had no help she waited around for 15 minutes trying to get a teacher to help her. They need changes.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "114393586510000084106", "name": "Mary Linda Smith", "time": 1462493710036, "rating": 5.0, "text": "Absolutely wonderful!!!\nGreat experience!!!   I've already made my next appointment!!!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "118350310806644683092", "name": "Kylie Heitman", "time": 1557006646143, "rating": 5.0, "text": "Really great experience!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "113268007299390813181", "name": "K K", "time": 1578052636142, "rating": 5.0, "text": "Proud graduate of 2015!!!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "108745522831049454766", "name": "Rece Stewart", "time": 1466175802371, "rating": 5.0, "text": "Love my haircut.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
