{"user_id": "106660164305676571223", "name": "Valencia E. Beamon", "time": 1534249479562, "rating": 5.0, "text": "From start to finish, the staff has been nothing short of amazing. My career path towards cosmetology started 2016, my instructors were the greatest at what they do, even when it came to motivation and encouragement after graduation. You go there, it feels like home, you’re always welcomed with opened arms and smiles. I can’t remember a bad day at Genesis, they are the ABSOLUTE BEST..!!", "pics": null, "resp": null, "gmap_id": "0x889a43d16120a55d:0x5f5203343575ff5"}
{"user_id": "101934462852885018586", "name": "becky kinder", "time": 1376926660384, "rating": 5.0, "text": "Dawn was so good.   Just finished chemo several weeks ago, she gave me the cutest haircut and color.... made me feel like a million bucks....    What a wonderful time I had!!!!  Great staff... So much energy and enthusiasm.", "pics": null, "resp": null, "gmap_id": "0x889a43d16120a55d:0x5f5203343575ff5"}
{"user_id": "116212823616886800903", "name": "Elizabeth Lemieux", "time": 1534188003307, "rating": 5.0, "text": "My life was spiraling out of control when I enrolled as a student at Genesis Career College (Daphne Campus).   As a 38 year old, soon to be divorcée, I wanted and needed a fresh start for myself.  I needed to be an example for my children.\nI delayed my start time for 6 months, and on August 17, 2010, I nervously walked through the front doors.   I didn’t start out as a standout student, heck, I didn’t even think I had the talent to do hair (I still can’t do a beehive), but I had the passion.\nThe teachers at GCC pushed each student to learn, to not run from a service, that sanitation is just as much a part of this career as cutting hair.\nI excelled at Genesis.  I pushed myself to be better than the day before, my efforts were recognized....and celebrated.\nGenesis Career College changed my life.   I am 4 days away from celebrating the day I started school (August 17, 2010) and the day I clocked out for the last time as a student (August 17, 2011).\nGenesis Career College and the faculty there will give you ALL of the tools you need to be a successful stylist, colorist, or barber....YOU just need to show up and be the success you want to be!!!", "pics": null, "resp": null, "gmap_id": "0x889a43d16120a55d:0x5f5203343575ff5"}
{"user_id": "107304847809417173028", "name": "JordanStephen Margavio", "time": 1549605722202, "rating": 1.0, "text": "Let me tell you the never ending tale that is Genesis College.  So, to start, let me explain to you that you do not need to spend this much money on hair school. You don't.  The competitors will ALL help you pass the board, which is the ONLY thing they can promise to do. BUT that is not what this review is about. I made the decision to go to hair school almost a decade ago. I went to Genesis in Daphne, and they said they could tap into my student loans, and I wouldn't have to put anything down.  Sounded amazing to me!  So, I'd say about halfway through, I withdrew, and honestly I can say not because of anything the school did.  I needed a closer location to work it out with a full time job. SO, I withdrew and went somewhere else out of pocket.  I eventually started paying on my student loans and all was grand.  More time went by, and I decided to take a 9 to 5 job with a larger salary.  Then I decided I probably needed a degree to get to the next level.  Well, because I've still got a bit left on my student loans, the university I want to go to needs a copy of all the Genesis Career College transcripts.  Not that anyone can use an \"A\" in \"hair braiding\", but they still need the transcripts. Ok, fine. SO, I spend the better part of 2 weeks trying to get someone on the phone.  I find out pretty quickly in that 2 weeks that Genesis in Daphne closed, and the Mobile location's phone is ALWAYS busy or taken off the hook. At this point, I'd have to say the latter.  I call other locations.  They transfer me to the Mobile location, it's busy.  I finally get smart and start blasting them with phony requests for them to call me because I'm interested in enrolling.  BINGO!  A phone call happens in less than 5 minutes.  I tell the girl that I need to get a copy of my transcripts, and from the daphne location.  She doesn't know how to do that, but \"someone will call me\".  Ok, that never happened. I call back, and email.  Finally, someone does email me. He says that he will send a certified copy and to send the address.  Great. I go online and keep checking and checking, and they haven't received it.  I call up to the Registrar's office.  They explain that it may have been discarded because I'm not actually going to be using those credits.  SO, I email the guy back again.  Again, nothing gets received or updated at the college.  I email the guy again, and again he reassures me that it has been sent, but he'll send it again. This has been going on since OCTOBER. October. So, I call around today, and get someone in Lebanon, TN.  He tells me that he had to get the director to look me up, he has no idea what can be done, what I can do, oh, and that I owe a 3k balance.  NOPE.  Oh, because on top of owing student loans, you still owe the school once you leave, but I was actually able to pay off the school in 2015, finally. He says that he's showing I owe a balance to the school, so I won't be getting transcripts anyway.  So, tonight I spent 4 hours trolling through the last 5 years of my bank statements to prove I paid them in 2015.  All because they aren't organized enough as an organization to provide SEALED records to another institution a previous student is trying to attend. Think about that.  They cannot, as an organization, bring up your records of attendance, classes taken, grades, and put it in an envelope and lick a stamp.  Chris from Lebanon says that this happens ALL the TIME.  My reply was, \"Then it is a systematic issue your organization needs to fix.\"  Basically, the choice to go to Genesis Career College was a blunder of a decision that I still pay for to this day, almost a decade later, in ways I did not ever consider.  So when you're in that sales office planning your financial aid, and thinking about your options, please, consider your exit.  I did not and I regret that I did not fully understand the consequences of using financial aid to go to school for what ended up being a hobby.", "pics": null, "resp": null, "gmap_id": "0x889a43d16120a55d:0x5f5203343575ff5"}
{"user_id": "105171489641435343467", "name": "chance roberts", "time": 1476116382360, "rating": 1.0, "text": "The level of unprofessionalism at the school is ridiculous. I highly suggest going somewhere else for cosmetology. When I went to transfer they refused to give me my transcripts, so I had to restart at another location.", "pics": null, "resp": null, "gmap_id": "0x889a43d16120a55d:0x5f5203343575ff5"}
