{"user_id": "100641359340524806009", "name": "Patricia Seymour", "time": 1623160948150, "rating": 5.0, "text": "Love Gulf Coast Auto Group staff.  It’s the Audi that’s the problem.  I only have approximately 46K miles on the car.  She’s pretty.  But the convertible top has leaked since the purchase.  Then there have been so many problems with other parts, and a 3x AC problem/fix (qualifying it as a lemon), that it has been in the shop as much as it’s been with me.  I have a color-coded chart. When I let the “powers that be” at Audi know about the first few years of problems, they basically said, “FU with a smile”.  This car was actually built in Germany.  My German friends would be appalled.  They take their car quality very seriously.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "100112269567781664576", "name": "Emily", "time": 1625625044646, "rating": 5.0, "text": "I had a great experience purchasing my new car from Gulf Coast Auto Group. I highly recommend Mr. Kenny Cunningham. He was professional, honest, friendly, and made my buying experience easy and fast. All of the staff I spoke with were friendly and professional. I will use them in the future.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "111938768679638661524", "name": "Ellie M", "time": 1621556496921, "rating": 5.0, "text": "My service representative, Laura Collier, is wonderful! She always ensures that every issue is resolved. We have been extremely satisfied with the service that she and the mechanics at Audi of Mobile have provided to us over the past 5 years with our two Audis. My son took his Audi to another local repair shop and they caused damage to the vehicle because they lacked the knowledge and skills to properly perform the repairs. We then took his car to Audi of Mobile and they corrected everything! I will ONLY have my Audi Q5 serviced at Audi of Mobile.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "100565455965795209337", "name": "Makenzie Brenner", "time": 1613921814076, "rating": 5.0, "text": "I admit I was nervous to purchase a car online from a dealership over 6 hours away, but Gulf Coast Auto, specifically Devon made the experience seamless. Great communication, fantastic customer service and product knowledge. It was honestly the best experience I could’ve hoped for. 100% worth the road trip down and I am obsessed with my new car!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "110817360332479332803", "name": "Queen Royalty", "time": 1613779269412, "rating": 5.0, "text": "Everyone there is so nice and helpful. The finance department and the sales person (Alfredo Montes) made sure we understood the offer for our Volkswagen Atlas.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "112805924154645928935", "name": "Myra C.", "time": 1565860456598, "rating": 5.0, "text": "I went to Porsche of New Orleans and they were trying to blantantly make the 2018 Macan I wanted inaccessible. These fools really tried to make me put down 20,000 for a 500/month car payment. AVOID THAT DEALERSHIP AT ALL COST. They did not want to sell to a African American woman. Anyways, I found 2 more 2018 Macans in the Mobile area the same evening so we decided to go the next day. BEST DECISION EVER! I traded in my 2014 Infiniti Q60S that I loved dearly for a 2018 Porsche Macan! As a traveling CVOR tech, I needed more space and Kendarrius ensured that I didn’t leave without the vehicle that I wanted! I literally pulled up at 12:15 and was driving off at 4:30!! That was crazy fast, but if you are looking for an amazing deal on a beautiful car, THIS is the place to go. My monthly payment is 585/month on a PORSCHE!! That’s unheard of! They knew I wanted the car and this dealership made sure I left in it without having to eat bread and water for the next couple of years!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPPMjuE6t-nrGp_VDRqaVxv5wut1tkjJYEmrndB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMGI3mdzmpiG-nORkuYFClc2Bpn_6tWSNfTCmxE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNE_6zHkKNIJ5awTKYKW-RG0rZr0tyuCKJiQUJs=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "104784565688095890916", "name": "Monica Mingo", "time": 1592176454485, "rating": 5.0, "text": "My last two vehicles were Land Rovers.  I narrowed this purchase to an Audi or a Land Rover.  Devon took me on my test drives after donning a mask and I left with total knowledge of the Q5.  I went to the Land Rover dealership and was left knowing the same about their vehicles as I already knew upon arrival.  I was also unhappy with the attitude once I requested the salesman wear a mask during the test drive.\n\nI called Devon the next morning to let him know that my husband and I would be returning and, when we got there, Devon was ready to go.  This young man has received several awards and accolades based on his performance and knowledge of Audi vehicles. I noticed two certifications on his desk.\n\nHeaded there my husband told me we were not going to buy the vehicle today and that this was simply an exploratory mission and that he wanted to test drive and then get the information in order to make a thoughtful decision.  After speaking with Devon at length, we ended up buying the Q5 same day.\n\nDevon simply makes you feel good.  You sense his honesty right up front and there were no questions he couldn't answer.  We truly felt we were in extremely competant hands.\n\nThank you to Devon, the auto group, and for making it easy to jump the Land Rover ship and become a member of the Audi family.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "113176571186060876778", "name": "Keri Van Atta", "time": 1595680381439, "rating": 5.0, "text": "Alfredo Montes was very helpful and nice. We ended up not being able to afford the car we wanted, but he never made us feel bad or embarrassed. And most importantly he didn't make us feel like we wasted his time. He went above and beyond for us and I really appreciate it! Thanks Alfredo!!😊😊😊", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "106232225682313082666", "name": "Lee Lee", "time": 1602366220389, "rating": 5.0, "text": "Courtney was so accommodating & super nice. Thanks Courtney- appreciate!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "110987515900613283838", "name": "Daniel Flores", "time": 1591199633862, "rating": 5.0, "text": "Purchased a VW all over the phone with Doug Klezmer. Doug took great care of me with a very smooth and convenient purchase. Very happy all the way around. Wish all car purchases were this easy! Thanks, Doug!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "110270196807091139158", "name": "Michele", "time": 1563422147881, "rating": 5.0, "text": "Me and my husband have had so many bad experiences here before the name change and new management or whatever. We always made appointments and would be there for 3 or 4 hours, we hated going there and the customer service was horrible! Today was the first time we've been there in at least a year or more and we were amazed at how much more better it is now. Our appointment was at 1 and we were out in less than an hour. Sean took great care of us and kept updated about what was going on with our car! The customer service was AMAZING! We have never experienced such great service like we did today. Thank you so much Laura and Sean and everyone for such a great experience and service we received today from you all!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "113746022303116937483", "name": "Wayne Douglas", "time": 1590879460985, "rating": 1.0, "text": "This dealership is very deceptive and dishonest. My salesperson was Alfredo. I specifically asked them to run my credit only through VW and stated that on the credit application. I found out a few days later that they had run it through all 3 credit bureaus instead and when I confronted Alfredo about it he said that that is just the way they do business and that my credit won't be hurt if I buy a car from them. My credit score dropped 24 points because of their unethical sales tactics. Most car manufacturers have their on inhouse financial arm so when you run your credit directly through them you only take an 8 point hit so that's why I made the specific request. Because I value my credit score so much it is very high and now I am reluctant to have it run at another dealership to get the car I want because of Alfredo and his companies dishonesty. This is just the worst fo many misleading statements Alfredo made to me. You're better off driving to one of the surrounding cities to buy your next vehicle than from here.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "112133886211962111704", "name": "Krista Blanton-Goguen", "time": 1545329722940, "rating": 5.0, "text": "We recently bought our first Volvo. AJ has gone out of his way to make this experience as seamless as possible. His knowledge about the car far surpasses any other dealership we have worked with.\nThe vehicle is amazing and capable of so many things.  Each time the technology out smarts me he is always available to answer my text or phone call and walk me through it.\nI just appreciate the extra effort he always goes to to make us feel valuable. I love my Volvo and don’t plan on going anywhere else for my future vehicles.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "108163161375008211605", "name": "Robert Sanders", "time": 1581438953720, "rating": 5.0, "text": "Had a wonderful experience from my first contact to walking out the door. Zach was great and took care of my wife and I. Recommended this place to everyone since buying a car and will go back for our next vehicle.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "112669531542555598298", "name": "Patrick Isbell", "time": 1557610667316, "rating": 5.0, "text": "My wife recently purchased a used 16 Beatle convertible that was a recent lease turn in. Devon was an awesome salesman and made us feel like family during the entire experience. I believe we got a quality vehicle and a reasonable price. I know she will be thinking of her buying experience and the welcoming employees whenever she drops the top this summer!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "106560910201391584571", "name": "Edward Thomas", "time": 1566620902121, "rating": 1.0, "text": "Gulf Coast Auto Group should change their name again, because of one simple question- do you give military discounts? No one in the service department knew or was unwilling to give at least 10% off. The parts department gave 10% off for military when I purchased 4 spark plug not less than 15 minutes laters. Military service people active and retired I will inform you don't buy anything from there without a discount 10% or higher, & at this point it should be higher.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "117340162641036974729", "name": "june newton", "time": 1537998509908, "rating": 5.0, "text": "THIS THE PLACE!!\nConsidering a new car, this is the place! My husband and I bought 12 cars in our lifetime - this experience was by far the most professional/personable buying experience. The consultant, Santwan, was knowledgeable beyond measure, unlike the run-of-the-mil hunting salesman. The entire experience, from consultant, to floor manager [John], to Finance [Danny], to the GM [Mark].  Wow, treatment like the customer is a REAL PERSON not just a customer buying one of their cars - really, they have hearts and personality? We couldn't believe the care and the detail in service.  You go Gulf Coast Auto Group!!", "pics": null, "resp": {"time": 1537998874907, "text": "Hi Ms. Newton, thank you so much for the kind words! We are thrilled that Santwan, John, Danny and Marc are an integral part of our team. We are so humbled that you chose Gulf Coast Auto Group!\n\nAshley Allen\nBusiness Development Director"}, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "113503513070520340384", "name": "Elizabeth Millette", "time": 1542572891504, "rating": 5.0, "text": "I recommmed this dealership to anyone. They made the car buying process easy! We first contacted Melissa from their online sales department. She was always quick to respond and answer our questions about a specific car, but never pushy or bothersome. When we were ready, she set us up an appointment to come in to the dealership. From that point we worked with Brittany Smith! She was a pleasure to do business with. Brittany was very friendly, knowledgeable and never made us feel rushed or pressured. We couldn’t be happier with our new car and the service we received at Gulf Coast Auto Group.", "pics": null, "resp": {"time": 1542573666666, "text": "Hi Elizabeth, we are so happy you’re loving your new vehicle! Brittany and Melissa are key members to our sales team, and we are lucky to have them! I’ll pass your kind words on to them and our management staff Monday morning! Thanks again for giving us the opportunity to earn your business and we look forward to serving you!\n\nAshley D. Allen\nBusiness Development Director"}, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "100488610636773159059", "name": "Chris Mayfield", "time": 1532990891732, "rating": 5.0, "text": "These guys were amazing. They knew I wanted the car, and got the price and interest down to what I could afford. I would highly recommend this dealer.", "pics": null, "resp": {"time": 1534967088249, "text": "Thank you Chris! We appreciate your business and congrats on your new car!"}, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "100214355400301326809", "name": "Christian", "time": 1537998404303, "rating": 5.0, "text": "I had an awesome experience with Gulf Coast Auto Group, after 7 months of searching for the right car and having poor experiences with other dealers across the nation as I live in Colorado, I was thrilled with my experience here. Santwan Wiley is the MAN. If you guys are looking for an excellent client advisor who will do everything in your best interest in helping you get into an awesome vehicle, he is your guy. I appreciate all the effort the team put in and his effort in to making sure that car was mine. I did not feel pressured at all and this was by the far the bestcar buying experience that I have had. I Cannot wait to get down there and take receipt of my new 2015 BMW X5! Thanks guys for an awesome experience!!", "pics": null, "resp": {"time": 1542990194503, "text": "Thank you for the great review Christian."}, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "114598941876604798679", "name": "Carly Martinez", "time": 1574792357594, "rating": 5.0, "text": "thanks to mr devon for helping me buy my first car!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "110632320059569299864", "name": "Becky Dunn", "time": 1557355942950, "rating": 5.0, "text": "The is the best car dealer i have ever dealt with and mr. Paul Stanley is the best to deal with!! He will treat you right i love my Volkswagen !!!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "112970522726811636072", "name": "Anthony Cook", "time": 1535766796869, "rating": 1.0, "text": "I leased a 2018 Volkswagen Jetta from this dealership on June the 27th. It is now August  6th and I have yet to get my tag paperwork. I had to call the bank to get my old car loan extended so my old car loan would not go in collections. Not only that shortly after I leased I noticed a small ding on my hood. I went to the dealership to see what they could do and they said it would be no problem to fix. It has now been over a month I haven't received a call or a text. I know the dealership has recently changed owners, but the management at this establishment really dropped the ball. My family will no longer purchase or lease any vehicles from this dealership.\n\nI did try to call you. I left a message and no response. Why would I have expected anything different.", "pics": null, "resp": {"time": 1533650839757, "text": "Anthony- I sincerely apologize for this inconvenience. We expect exceptional customer service, and we regret that we missed that mark. My name is Ashley Allen and I am the Business Development Director here at Gulf Coast Auto Group. Please call me directly at 251.301.0013 so we can get you what you need asap."}, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "100253325127820996916", "name": "Michael Kolbe", "time": 1558022068423, "rating": 5.0, "text": "Thanks Devon! Great experience and a perfect vehicle!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "111104329649903391423", "name": "Lisa Wurst", "time": 1566833164216, "rating": 1.0, "text": "Stated that they did not have to follow through with what was written on my leasing contract “Since Dean sold it to us.”", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
