{"user_id": "109061984838908390779", "name": "John Edwards", "time": 1622397513431, "rating": 5.0, "text": "Not only did the owner, Rhett Tyler, answer my phone call on Sunday of Memorial Day Weekend, he talked us through a simple repair of our Master Craft so that we could use our boat and enjoy Smith Lake this weekend!  It is refreshing when people stand behind their product as advertised. It is also refreshing and uncommon that the owner of a business knows their product So Well that they can diagnose a problem and talk a non mechanic through a repair over the phone. Thank you, Rhett!", "pics": null, "resp": {"time": 1622403036638, "text": "Thank you for sharing!"}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "112247821114928715820", "name": "Dan Paul", "time": 1626201006037, "rating": 5.0, "text": "Skiers Marine is awesome to work with. I bought a used boat from them back in April. There was no warranty offered nor implied. 80 days and 41 hours later we had an issue and Skiers Marine offered to help with the cost of the repair. Wow!", "pics": null, "resp": {"time": 1626261259635, "text": "Thank you Dan for the review and sharing your story!"}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "105465573674608268629", "name": "Jared Brunswick", "time": 1617460643942, "rating": 5.0, "text": "Jeremy made the buying experience extremely easy! It was a no-stress environment and he never put pressure on us just to buy something. He was very informative about the boats and very accommodating for us! He made sure all of our questions were answered before we drove away with our boat. Will definitely be going back for any of our boat needs!", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "105037097995988384338", "name": "rbmorgan2", "time": 1617460531323, "rating": 5.0, "text": "If you are looking for a boat I highly recommend Skiers Marine!!  I was having a hard time getting to a Marina to buy a boat because they all close at 5pm and I work until 5.  Jeremy called me and asked if I wanted to come look at a boat. I told him yes but I didn’t get off work until about 4:45.  Jeremy, my salesman said “Mr. Morgan, the dealership closes at 5, but if you want to look at a boat I will stay until 7 or 8 if that is what it takes.”  I went that day and we stayed until about 6pm and when I left I had a down payment on a boat. The boat was actually in Athens where it had snowed the night before. Jeremy had them bring that boat to Skiers Marine off hwy 280 the next day!  I went in on a Thursday and had the boat in my driveway Saturday!  5/5 on the dealership. 5/5 on the price and 5/5 on Jeremy my salesman. Go see them even if you have a long drive, you will NOT BE DISAPPOINTED!!", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "109636582772579193587", "name": "Matthew Preskitt", "time": 1612887922884, "rating": 5.0, "text": "The entire staff at Skier's Marine is EXCELLENT! No other dealer in the area has a culture of customer commitment like Skier's. At each location they have, we receive the same great service as we did when purchasing our new Supra. We appreciate the sales attitude, service culture and relationship we have with them as our boat dealer. My family loved the entire experience of picking out our new Supra and the memories that will be made in the future! We can't say THANK YOU enough to everyone at Skier's!", "pics": null, "resp": {"time": 1612889177929, "text": "Thank you for sharing!"}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "115953822947162905238", "name": "Steve Korn", "time": 1613604443891, "rating": 5.0, "text": "An absolutely outstanding experience purchasing a Mastercraft boat from Greg and team at Skiers Marine ! Everyone we came into contact with at this dealership was so honest, trustworthy, and kind.", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "115436584936460727434", "name": "Geneva Talmadge", "time": 1614281513685, "rating": 4.0, "text": "They sure have a nice selection and in a nice location.", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "103451077465453524833", "name": "Brad Beasley", "time": 1552838939166, "rating": 5.0, "text": "Good morning, Mr. Tyler and All of Skiers Marine!\n\nWe want to let you know how impressive your company was at the 2019 Birmingham boat show. Besides your line of superior products, you had quite the staff members there who all were knowledgeable in unique ways. Nick Morris was the first person to approach us and we were more than impressed with his easy, friendly demeanor and willingness to explore our wants in a new boat.  He spent time with us, but also gave us space to look around and gather thoughts.  That casual attitude of salesmanship is quite rare.  He knew tons of details about the Supra. Chad and the other guys were also so friendly & helpful with boat and purchase details. We understood immediately that we were buying a choice in a boat dealer and felt extremely comfortable that Skiers Marine was the number one choice.\n\nThis was a large purchase and we did not take it lightly, but the Supra quality coupled with Skiers Marine quality and reputation made this new boat purchase an easy decision.\n\nThank you for being at the boat show and all of the awesome incentives.  My family looks forward to boat season and sharing our Skiers experiences with folks around Birmingham and Smith Lake!", "pics": null, "resp": {"time": 1553006800544, "text": "Thank you for sharing your experience and for trusting us with your boat purchase! We look forward to seeing the boat on Smith Lake and for lots of surf pictures."}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "104940288772934791391", "name": "Jost Bierbaum", "time": 1608262563722, "rating": 5.0, "text": "Great people great boats, always satisfied", "pics": null, "resp": {"time": 1612889193826, "text": "Thank you for sharing!"}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "105414570333196610803", "name": "Lori Yonfa", "time": 1598045837931, "rating": 5.0, "text": "Excellent repair wk on our family's boat & great customer service.", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "106947936253711406898", "name": "Chris Dysart", "time": 1588113564551, "rating": 5.0, "text": "Greg and the team at Skier’s marine made our mastercraft purchase very enjoyable. Our experience was worth an entire day’s travel to make the purchase! Thanks again to their team!", "pics": null, "resp": {"time": 1592141138795, "text": "Thank you for sharing your experience."}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "102579704118441357209", "name": "Bryan Lipscomb", "time": 1606869178798, "rating": 5.0, "text": "Great place and great people", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "117504705289087278124", "name": "Kim Sanders", "time": 1583941722482, "rating": 5.0, "text": "What an amazing experience!! AJ and Rett did an awesome job getting us fixed up with a 2019 Mastercraft. We were welcomed upon arrival, and AJ spent a couple of hours showing us different boats, going over specifics and options, even BEFORE we committed to a purchase. He took care of boat registration, helped with insurance, and paperwork was quick and easy. Can’t wait for AJ to deliver the boat to the lake and show us all functionalities of the boat! Thank you Skier’s Marine for a wonderful boat shopping experience!", "pics": null, "resp": {"time": 1592141161278, "text": "Thank you for sharing your experience."}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "117579917112941508645", "name": "Michael Van Veckhoven", "time": 1553946959759, "rating": 5.0, "text": "Absolutely the most outstanding customer service I’ve ever experienced. Danny, Rett and the guys at Skier’s went above and beyond AFTER the sale to ensure that I knew everything about my boat. As a beginner boater, I really appreciated this. Highly, highly recommend!!!", "pics": null, "resp": {"time": 1554054263211, "text": "Thank you for your review and for sharing you experience. Congrats on the new boat!"}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "116922787428486940166", "name": "Jonathan Spann", "time": 1555900609006, "rating": 5.0, "text": "I purchased my second boat from Rett Tyler and Skier's Marine this weekend.  These guys couldn't be more professional, knowledgeable, responsive and helpful both during and after the sale.  The quality of the product and the buying experience is second to none.  Highly, highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "105256549570213280431", "name": "Scott Kines", "time": 1507324668474, "rating": 5.0, "text": "This place is the best. We were treated excelent from the time we walked in the door. I usually hate talking to salesmen but I felt at home immediately.  After owning the boat for a few months they still do anything possible to help make sure you continue to have a great boat experience. I highly recommend going to them first if you want a boat.", "pics": null, "resp": {"time": 1507331809059, "text": "Thank you for the kind words!"}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "101983409919494840885", "name": "Adria Barnett", "time": 1589117023537, "rating": 5.0, "text": "Thanks to Kyle for being so kind when fixing some problems with our boat. It’s now running better than ever!", "pics": null, "resp": {"time": 1592141121427, "text": "Thank your for sharing!"}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "103606428631067341874", "name": "Allan Vajda", "time": 1457651933198, "rating": 5.0, "text": "I would like to say that without question, Rhett and the staff are the best people, the best boat dealership on the planet. Just took delivery of our new MasterCraft X30 and could not be happier... especially that awesome surf wake! I'm a big guy and can surf all over the place with just my wife driving the boat, something I thought would not be possible. The build quality and ride is amazing too. It's going to be a great summer, thank you Rhett and Ryan for everything you guys do for your customers!", "pics": null, "resp": {"time": 1457652360901, "text": "Thank you Allan, we appreciate the kind words and are very thankful to have you as a part of our Skier's Marine family!"}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "103122869274714281619", "name": "Josh Vanderburg", "time": 1534009474649, "rating": 5.0, "text": "Got my boat in and out of service in less than a week! They even sent me with the technician for a lake test so I could make sure it was working like it should. Highly recommended", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "108999557282861760890", "name": "Shelby Osbun", "time": 1493921001870, "rating": 5.0, "text": "During the last 25 years, I have purchased boats multiple times from Skiers Marine. No auto dealer has earned the repeat history that Rhett and his team have in my family. In fact, Rhett has been like family and it's been a joy to see his business grow to the awesome success that it is today!", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "118013570117448727494", "name": "Kirk Peterson", "time": 1530893663668, "rating": 5.0, "text": "An unbelievable experience! We live over an hour and a half from the location we bought our NXT22 from, and I would have traveled three times that to get the experience that we had with Rhett, AJ and the entire staff at Skier's Marine.  The boat is amazing and the people are the best part.  Every question answered,  patience, knowledge and super-friendly.  I will be using them for all of the service work, and buy again from them.  I would highly recommend them to anyone in the market for a boat - no matter where you live.", "pics": null, "resp": {"time": 1532031169078, "text": "Thank you Kirk!  That is an amazing looking new NXT22."}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "104715267968796115667", "name": "natalie gore", "time": 1439422311789, "rating": 5.0, "text": "Bought a used boat from Rhett.  For a variety of reasons unrelated to the dealer, we decided to trade the boat in for a different boat about 30 days after the initial purchase.  Rhett was very accommodating, helpful, and service oriented.  We can't say enough about how happy we are with our new purchase and the integrity of this dealership!  Rhett isn't just about making money (of course that is why he is in business).  Rather, he focuses on ensuring each customer makes a purchase that meets their needs and makes them happy!\n\nWe would encourage anyone looking for a boat to work with Rhett and his team to make a purchase.  There are not many folks in business anymore with such customer service or integrity.", "pics": null, "resp": {"time": 1440259931719, "text": "Thank you for the kind words!"}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "114889207254338919627", "name": "Bobby Giles", "time": 1506727624267, "rating": 5.0, "text": "I could not have asked for better service.  Dion, Ryan and Les were punctual, attentive, and didn't try to sell you something that you didn't need.  They told me up front what the cost would be and when the service would be completed.  My boat was ready the day promised.  You can't ask for better than that.", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "115373198876492903664", "name": "Igor Nikolic", "time": 1504836010104, "rating": 5.0, "text": "Rhett and Greg are leading great staff providing top notch service to meet pretty much any boater's dreams. I've been treated as family for over 10yrs now. A+", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "112615038012247893305", "name": "Scott Best", "time": 1490834352484, "rating": 5.0, "text": "Great Experience as always. Even though it's an hour and a half from where I live, the main reason I started, and will continue, to use Skiers Marine in Lake Martin is because of Dion. He's not just knowledgable but provides the BEST customer service in the state, if not the southeast. It doesn't matter what kind of boat you have,  he treats it like a yacht. When I get ready to upgrade, which I hope is soon, there's only one place I'm going.", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "115465825691602563492", "name": "Chase Gaston", "time": 1456357234225, "rating": 5.0, "text": "Wow!! Zack and the crew are awesome!! If you need any help with a boat or Marine Audio this is the place to go!! Do not hesitate to call or step in. The guys are always helpful and welcome you like family... Skier's Marine is great!!", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "105317796507271535381", "name": "Cloudzy", "time": 1478319176995, "rating": 5.0, "text": "The spring of 2016 we decided to purchase our first boat and Skier's Marine made the process as smooth as possible.  The service we received from purchase to the first oil change to having it detailed cleaned has been excellent.", "pics": null, "resp": {"time": 1478350525997, "text": "Thank you for sharing your experience!  We appreciate you trusting us to assist you with your boating needs."}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "105382094338227306860", "name": "Timothy Smith", "time": 1452392268143, "rating": 5.0, "text": "Ryan, Dion and the team at Skier's Marine Lake Martin are awesome!  From the first time I walked in the dealership until the day my Mastercraft NXT22 was delivered they were top-notch!  They always treat me with courtesy, respect and like family.  The sales team helped me find the boat that matched my family's needs perfectly with a no pressure sales approach.  Before the sale, the on-water demo was first class and really helped us dial into the perfect boat.  Even after my boat came in they took my family back out on the water (...on a holiday) to answer any questions and familiarize us with the boat again.  Bottom-line Skier's Marine is a first-class organization and I would highly recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "108469895045579164473", "name": "Walter Brush", "time": 1531933698985, "rating": 5.0, "text": "Parts Dept was efficient & effective in finding & obtaining correct parts. Service manager was extremely Nice & helpful.", "pics": null, "resp": {"time": 1532031131519, "text": "Thank you Walter for the kind words, we appreciate your business!"}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "100958289717729524565", "name": "Laura Leigh Drake", "time": 1490918675494, "rating": 5.0, "text": "Skier's Marine is my partner in keeping my boats in perfect condition at a reasonable price.  They come to my lake house and save me the trouble of getting my boat to them.  Their team knows every single detail about their boats.  They treat me like family and I love that I can trust their expertise from maintenance of our boats, to buying skiing gear to trading our boat in at the right time to maximize our next purchase!\n\nFor a busy, small business owner, they make owning a boat and seadoo's easy!  I have been a customer since 2010 and I am on my second ski boat!\n\nThank you Skier'sMarine Team for making owning a boat a lot easier!", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "106995738325304851447", "name": "Mr. Slice", "time": 1492544319109, "rating": 5.0, "text": "The folks at Skier's Marine in Dadeville have absolutely exceeded my expectations both during and after our boat purchase.  They have gone out of their way to make sure I'm happy with the boat itself and their service department.  I would recommend them to anyone considering a ski boat purchase.", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "108520475191490201333", "name": "Ed Fry", "time": 1461081999798, "rating": 5.0, "text": "We recently took delivery on a 2016 MasterCraft X23 from Skier's Marine. We couldn't be happier with the boat and the way Rett and his staff took care of us throughout the whole buying process. Their customer service is top notch and they really make sure you get the right boat for your needs. I would highly recommend buying your next (or first, like us) boat from them.", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "116698806957984915736", "name": "Lon Grundy", "time": 1463917620362, "rating": 5.0, "text": "Entire experience was incredible from start to finish. They treated my son and I like family as they spent the entire day with us at the lake and bought us lunch. Hands down best purchase experience I have ever had.", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "101531528861897178144", "name": "Frank Porter", "time": 1455920630809, "rating": 5.0, "text": "Zack and the crew were friendly and knowledgeable. Excellent customer service! Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "110858325481170093123", "name": "Jay Long", "time": 1471111764138, "rating": 5.0, "text": "Excellent customer service. Wonderful, friendly, knowledgeable people that are always willing to help. Highly recommend Skier's Marine.", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "102725646964188577651", "name": "Jacob", "time": 1479002062390, "rating": 5.0, "text": "Great! Very good communication and service. Went above and beyond with repairing my boat. Would highly recommend them for anything to do with boats! I delt with Deion there, he was awesome.", "pics": null, "resp": {"time": 1479037635113, "text": "Thank you for allowing us to service your boat and for the kind words!"}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "117539948930357624001", "name": "John Holmes", "time": 1476380520590, "rating": 5.0, "text": "I had my boat cleaned and shrink wrapped. The job was superb.  The boat is totally cleaned and wrapped to the chine.", "pics": null, "resp": {"time": 1476382965991, "text": "Thank you John, we truly appreciate you trusting us with your boats care!"}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "105325355914357405162", "name": "Les Webb", "time": 1452824125114, "rating": 5.0, "text": "My family has been buying boats from Skiers Marine for 13 years. Because we spend a lot of time on the water, we have purchased 6 Malibu boats in an effort not to have too many hours on one boat before trading ( it really had nothing to do with all the new cool stuff that became available). We are super excited about Skiers Marine selling MasterCraft boats! We plan on ordering our new MasterCraft boat at the 2016 Birmingham Boat Show. The staff at Skiers Marine treats us like family, and that is very important to my family. This will be our first MasterCraft and we can't wait.", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "111294413316356466993", "name": "Joe Couvillion", "time": 1473289075289, "rating": 5.0, "text": "My wife and I just purchased a new MasterCraft X-10 from Rett Tyler at Skiers Marine for our family. We couldn't be happier. He knows his stuff and really went above and beyond what I would think anyone should do.  No pressure to buy and he let our 3 little kids climb all over his super nice boats without shedding one tear- while we deliberated over which boat to get.  After several weeks and my slow decision making process -  He drove to pick up the boat - drove to our lake to deliver it and then rode around with us for over 3 hours making sure we were comfortable. I think we had to kick him out of the boat bc we knew that he had an hour and a half drive back home.\nAbsolutely happy!  And I think their team was just as excited about the boat as we were.", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "108923251028405884818", "name": "Bob Asmar", "time": 1483496952506, "rating": 5.0, "text": "We recently purchased a 2013 MasterCraft X55 from the Athens, Alabama dealership and it was a wonderful experience.  Kit Barnes was, by far, the best sales person that I have every worked with.  After 20 years of experience with I/Os and a desire to wake surf, we decided to look into purchasing an inboard/tow boat.  Our requirements were unique, in that we wanted a tow boat that was in the 25 foot length, had a large open bow area and yet could also provide a decent wave for surfing.  During my research, it seemed that a Mastercraft X55 was about the only boat that could potentially meet our needs.  I found a few X55’s of interest on Boattrader, sent inquiries out, and Kit was the first to respond (within a day or two).  He later followed up with a phone call to better understand our situation and he even offered advice on different models and brands.  I was very impressed that he expressed interest in helping us find a boat that best matched our needs and really gave me a crash course on the different models of inboards.  The biggest thing is that he really worked with us on the X55, since I knew that we had to stay in a larger model to meet our family’s requirements.  Kit was the only person that was willing to work with us to see if we could configure the X55 to produce a nice wake for surfing.  The test drive went great and with a few adjustments, Kit had the boat configured to make a nice wake for surfing.\n\nWe really appreciate the time that Kit spent with us in answering all of our questions and educating us on the Mastercraft X55.  We proceeded to purchase the boat and are also very happy with the ongoing support and service that Skier’s Marine provides to us. The Athens staff made our buying experience great.", "pics": null, "resp": {"time": 1483503659909, "text": "Thank you for the kind words and for allowing us to serve you!"}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "106245771454457723909", "name": "Advanced Orthodontics", "time": 1490562576616, "rating": 5.0, "text": "Great customer service... they will take care of your boat..", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "101858023279807293068", "name": "kimberly mcleod", "time": 1460810213442, "rating": 5.0, "text": "My family recently purchased a boat from Skiiers Marine (April, 2016). Since we had never owned a boat before, we were very apprehensive and nervous about this process. We met with multiple dealers to get a feel for what we wanted and what we could afford. Skiers Marine provided us first class customer service and was by and far the most knowledgeable and down to earth. The owner, Rhett went above and beyond anything we would ask for in this process. For instance, he brought the boat from Birmingham to our friend's neighborhood on Lake Martin so that we could demo it. He spent a couple of hours with me, my wife, and my three little boys demonstrating the boat. Once we decided that we wanted the boat, the purchase process was straight forward and simple. We live in Northern Atlanta. I expected to take a day off of work to drive to Birmingham and pick up the boat. When the boat was prepared and detailed, Rhett called and let me know the day that HE could deliver it! Rhett drove to Atlanta, delivered the boat, and taught me how to put the boat in and out of the water. Yesterday, I arrived home to a package from Skiiers marine. I opened up the box and found two life jackets! Thank you Rhett and Skiiersmarine for taking care of us through this process. If you are buying a boat for the first time (or 2nd or 3rd time), I would highly recommend Rhett and Skiers marine.", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "113393460720846295698", "name": "Billy Vann", "time": 1496588373427, "rating": 4.0, "text": "Very friendly, very informative. They know their products", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "105184858921943719596", "name": "Greg Koch", "time": 1481151381610, "rating": 5.0, "text": "Dione and the team are extremely knowledgeable and provide great customer service!", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "105725774333529274546", "name": "Paul Case", "time": 1458341576555, "rating": 5.0, "text": "After months of searching for our first family boat, I found a used MasterCraft at Skier's Marine.  Living in Minnesota, and not being able to see the boat in person before purchase, Rett was more than accommodating in answering the numerous questions I had before committing to the purchase. He was kind enough to offer to have the boat brought to the Athens store to knock a few hours off of our drive.  The day we picked up the boat, Chad spent a few hours making sure I was familiar with the boat on the water.  2,000 miles and a memorable road trip with my son later, we have the boat back in MN.  Rett and Chad truly care about their customer's experience. I wouldn't  hesitate to drive 2,000 miles again to buy another boat from Skier's Marine in the future. Thank you.\n\nThe Case Family\nChamplin, MN", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "115190224260806986001", "name": "Jeff Allcorn", "time": 1450753361819, "rating": 5.0, "text": "I had my bayliner serviced there a few months ago. The gentleman that assisted me was curtious and completed the maintenance in a timely fashion.  I will  definitely use the guys again.\n\nJeff Allcorn\nWAGON Wheel Nursery\nChelsea, Al", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "105066307077593175184", "name": "Jamie ODaniel", "time": 1449100910252, "rating": 5.0, "text": "Great service and friendly people. Very helpful", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "113968146958235288038", "name": "M Griff", "time": 1457114632749, "rating": 5.0, "text": "Great customer service. Sales and service staff excellent.", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "114409852384711752337", "name": "Robert Mcmanus", "time": 1450491943170, "rating": 4.0, "text": "Very precise when giving you the outcome of the mechanics observations.", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "111921377667866090886", "name": "Zack Fowler", "time": 1447251822000, "rating": 5.0, "text": "Skiers Marine made buying my first boat easy and painless. No matter how busy they were, they always found the time to treat me like I was a part of the Skiers Marine family!", "pics": null, "resp": {"time": 1447252996466, "text": "We are extremely grateful for your business and glad to have you as a part of our Skier's Marine family!"}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "111455367243917639403", "name": "david adair", "time": 1466269301110, "rating": 5.0, "text": "The guys at Skier's Marine have been taking care of us since 2005! Always a great experience!", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "100307374457319713659", "name": "James Cicero", "time": 1450366236105, "rating": 5.0, "text": "Great people with great products!", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "106361975833631396170", "name": "Susan mcgriff", "time": 1499276665976, "rating": 4.0, "text": "You can find almost anything you need for your boat..", "pics": null, "resp": {"time": 1499280674840, "text": "Thank you for the kind review!"}, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "114501058714253376801", "name": "David Parker", "time": 1459965850692, "rating": 5.0, "text": "Great folks to deal with", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
{"user_id": "102693105229552432177", "name": "Brad Colburn", "time": 1483716222975, "rating": 5.0, "text": "Great Service!!!", "pics": null, "resp": null, "gmap_id": "0x8889419875558687:0x71119d6c950af788"}
