{"user_id": "106742945173025001756", "name": "Doug House", "time": 1628116179171, "rating": 5.0, "text": "Prompt response to a question after the sale.", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "109809022298193252271", "name": "Tamara Fox", "time": 1613505510301, "rating": 5.0, "text": "Great company to work with! Their customer service is outstanding and I love my Kinetico water softener and reverse osmosis drinking water!", "pics": null, "resp": {"time": 1625675826254, "text": "We are so excited to hear that you love your Kinetico water softener and reverse osmosis drinking water! We appreciate your business."}, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "100671342309940644905", "name": "Blanca Perez", "time": 1614801110047, "rating": 5.0, "text": "Austin was very professional and knowledgeable.  Very happy with his help.", "pics": null, "resp": {"time": 1625675607268, "text": "Blanca, It's great to hear you had a five-star experience working with Austin. Thank you for your honest review."}, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "102226105211668546967", "name": "Sharon Mattox", "time": 1591058091781, "rating": 5.0, "text": "Very nice young man, seemed genuinely concerned and made sure the issue was completely taken care of. We’ve been Aon customers for several years and the service has always been excellent! Every home needs this product. In addition to our whole house system we have the drinking water in our kitchen. Be careful it  will make you a “water snob”.⚠️⚠️", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "101780019724495496442", "name": "Grant Wince", "time": 1603114538869, "rating": 5.0, "text": "We received a great product in the Kinetico Water softening system and RO drinking water systems that we had installed recently by Austin. We appreciated the great communication and the efficient and friendly service that was provided and would recommend AON to anyone who wants a better experience with their water for the family.", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "105404712246020945065", "name": "Rampage", "time": 1591385713424, "rating": 5.0, "text": "Long and dependable service. They won’t sell you a system and forget about you. I’ve used them for six years with no issue. Have a whole house filter, water softener and a 24” UV light from them. I never have to ask them for a filter and they show up every year to maintain my system.", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "112425252914390455311", "name": "Kayleen Ridgeway", "time": 1597070498402, "rating": 5.0, "text": "Aon water technology was very friendly both on the phone and at service. We have a kinetico water softener and a K5 RO. The serviceman was very knowledgeable and polite. I highly recommend them for anyone that is looking for a water softener and Reverse osmosis system.", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "114133960191864760254", "name": "Patrick Dierks", "time": 1585611186235, "rating": 5.0, "text": "Anyone can sell water softener systems.   I chose AON over their competition, not because their system was far superior to others, but rather for the simple reason they went to great lengths to explain how the system would be installed.\n\nAlso understanding that they are a plumbing business first, and a water softener supplier second, gave me the reassurance the job would be done right and to my complete satisfaction.   Not only has the system perform flawlessly, I also killed two birds with one stone when they installed the loop system with my exterior main water line.  They were able to remove a \"frozen/corroded \" flow valve outside and replace it with a ball valve, mounted on the inside of the house, which sits right next to my system for easy access.\n\nI'm hoping this review helps other folks that are stratling the fence.  Randy and his installation crew are top notch.", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "105861044733838438271", "name": "Harley Charley", "time": 1531684531961, "rating": 5.0, "text": "The best water technology company in the Tennessee Valley.  They installed my Kinetco Water Treatment System, which includes a Drinking Water Purification System as well.  I scheduled an annual visit by one of their technicians once a year to test the system and change all filters.  The system works flawlessly.  Great system, company, and customer support.", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "105669673542844289139", "name": "Loftin Shanda", "time": 1531436312216, "rating": 5.0, "text": "Tech and sales associates were extremely courteous and informative as I consider replacing 15 yr+ softener system in my recently purchased home. They weren’t pushy but willing to answer all my questions regarding costs, benifits and routine maintenance requirements. Look forward to dealing with them In the future. Thank you, again, for your service call.", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "107192252935544690813", "name": "Bonnie Whitt", "time": 1530744131647, "rating": 5.0, "text": "Aon Water Technolgy gets FIVE stars! I plan to use them again in our next house! Very professional and highly knowledgeable. I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "110339241582014044679", "name": "CocoaBarnett", "time": 1588272958208, "rating": 5.0, "text": "Great experience!  Thank you!", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "111929386702564565565", "name": "Sonny Batchelor", "time": 1593085369343, "rating": 5.0, "text": "Tim did a good job of servicing my equipment. He explained to me what they were doing and what they were test.", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "100835052199882337819", "name": "James Guillemette", "time": 1530737701744, "rating": 4.0, "text": "I've been a customer for approx. 2 years now.  Overall, very good product and I'm happy with the product.  Customer service is sometimes excellent and sometimes poor.\n\nPro: AON's water softener is a very good product.  They bent over backwards to send a guy over to defrost my outside pipes in the middle of a Winter freeze!\n\nCon:  The whole-house water softener developed a leak after 18 months and the top part of the valve unit had a recall and required service.  They were not able to schedule the repair for nearly a month due to company manpower issues.  Parts were covered but labor was not.  AON charged more per hour than my local HVAC and autobody shops at $112 per hour.  Their service techs did a good job repairing my softener, but broke all the pipe half clamps that secure the pipes to the wall, and did not replace them.  ($2.50 worth of clamps - should have replaced them)!", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "105458529161161249670", "name": "Amy Word", "time": 1531782660444, "rating": 5.0, "text": "Great customer service! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "100955586845734275562", "name": "Stephen Kornoelje", "time": 1550843570266, "rating": 5.0, "text": "Service is always prompt and thorough. Thanks for the help as always!", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "113643698442938204409", "name": "David Bumgardner", "time": 1620418111946, "rating": 5.0, "text": "Good people, good products", "pics": null, "resp": {"time": 1625675362510, "text": "David, Glad you hear you like our products! We appreciate your business."}, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "101336437922894676690", "name": "Keith Jones", "time": 1551818914187, "rating": 5.0, "text": "Prompt friendly service", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "101830776166903575991", "name": "Tom Sigg", "time": 1627395167164, "rating": 5.0, "text": "Fast unload load time. Took only an hour.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "109959898700032897135", "name": "David Riddle", "time": 1621358621741, "rating": 1.0, "text": "Requested water delivery and received the following email.\n\nYour delivery request has been received. Someone will contact you shortly.\n\nThank you!\nThe Crystal Mountain Water Team\n\n27 days later and no response.", "pics": null, "resp": {"time": 1621434945341, "text": "Hey David,\nThank you for bringing to our attention that we have a problem with that feature on our website!  We would love to have your business please give us a call at 256-922-1114 or H2Oinfo@crystalmtnwater.com"}, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "113043117462598329929", "name": "R Trev", "time": 1615235631066, "rating": 4.0, "text": "After having many problems with Crystal Springs we signed up with Crystal Mountain and have been very pleased. The purified water tastes nice and customer service is efficient with great southern charm.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "110452765338849326426", "name": "Becca Sadriyev", "time": 1575995982106, "rating": 5.0, "text": "Amazing customer service from this Company. After a disappointing end to service with another company, this one stepped up and has been a blessing to work with. Highly recommended.", "pics": null, "resp": {"time": 1575927765076, "text": "Hey Becca! Please call our office at 256-922-1114"}, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "105601092823382899743", "name": "Paul Burns", "time": 1538758922920, "rating": 3.0, "text": "I've had two accounts for many years.  I think it's been around 9 years.  Have one account at work, and had one account at home.  I had to cancel the home account because the delivery schedule changed almost every month.  I would get random deliveries, or not get a delivery at all.  Sometimes my empty bottles would sit outside for a month.  I just couldn't keep storing empties until I hit the delivery lottery.  My work account has been great, though.  And the customer service has been pretty good.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "101818726358864003325", "name": "Mike S", "time": 1575917816880, "rating": 1.0, "text": "Been out of water for a week now. We have called twice and they said they would be out the next day and never show up. Now when you call they go straight to voicemail.", "pics": null, "resp": {"time": 1575921605031, "text": "Hey Mike ! Please give our office a call at 256-922-1114"}, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "116291234765140819717", "name": "Georgia Benford", "time": 1565513010104, "rating": 5.0, "text": "Water is like drinking figi and that's great for me so smooth", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "106582216621092552488", "name": "Jon Owings", "time": 1520862963183, "rating": 5.0, "text": "used them for home delivery almost 20 years, rare misdeliveries which are quickly corrected, essentially good service and product.  My experience has been good overall.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "109946469646131369499", "name": "Regina League", "time": 1527605505933, "rating": 2.0, "text": "My office has been a customer for over a year now. In the last few months their customer service has declined drastically.  As of today we have waited 1 week for our delivery of distilled water.  Something to make things easier for us, has turned out to be just as difficult has our making a trip to the market for water ourselves. Very disappointing.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "112817813134674707628", "name": "eli williams", "time": 1340876052243, "rating": 2.0, "text": "I am a 53 ft tractor trailer driver and this place is one of the worse getting into.  Do not try to enter from Madison Pike try Governors.  Once inside industrial park, watch for low hanging trees, branches, etc. Bldg 7 is in the very rear. Horrible location for 53ft tractor trailer deliveries.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "115929849669038795983", "name": "I FULLENWIDER", "time": 1554917225316, "rating": 3.0, "text": "Their products are very  expensive", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
