{"user_id": "108499541977609253056", "name": "Ronald Redd", "time": 1500234657287, "rating": 5.0, "text": "Great Dive Experience with a great crew. Can't wait to go again.", "pics": null, "resp": null, "gmap_id": "0x889a0792577b5f41:0xbfd022171eec7e0c"}
{"user_id": "114477928894400351358", "name": "Lynda Tiefel", "time": 1562891336564, "rating": 5.0, "text": "Great crew, plenty of room on the boat, very organized.", "pics": null, "resp": null, "gmap_id": "0x889a0792577b5f41:0xbfd022171eec7e0c"}
{"user_id": "112452067092588535891", "name": "Ben Mikeworth", "time": 1623434820764, "rating": 5.0, "text": "Just a class act all the way around.  From check in to boat rides and especially the parasailing. Highly recommend!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMywjX2ESc4jQnU0J4_qakBO8krgNZKb0EvWYlq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPQa9_1-4mFGURGbwqMQDca78_59h5XyMLUhgwE=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "118334688489341790021", "name": "R1OT MooNLiGhT", "time": 1626058069212, "rating": 5.0, "text": "A great experience with even better service!  Thanks to the Captain and crew! Love the picture package too!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMkvcq-0vzHbtccCIfkqnOE-L5or4VgULYyqst9=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "113680391698937759900", "name": "Eric Patterson", "time": 1621181313327, "rating": 5.0, "text": "The kids have wanted to parasail for a long time, and this trip we did it. Ike's was awesome. They worked us in very quickly and took great care of us. My wife is very nervous around water, and they made her feel comfortable and safe. Jason and Parker were absolute professionals on the boat. They knew exactly what they were doing and were very alert, attentive, and FUN! The music they played was GREAT. I've been listening to Eminence Front by The Who ever since that trip!\n\nIf you're looking for a unique and fun experience this is the place.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "117555793293686319163", "name": "Donna Cook", "time": 1617821519361, "rating": 5.0, "text": "These guys and gals are top notch.  Easter weekend and the water was ice cold, but we would do it again.  Check in girl was nice and personable.  Lots of smiles.  Guy getting us on the banana boat, same.  Two guys on the boat were lots of fun. Jason and Charles, I think, but not sure. Thanks to all for making this a great experience", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "115035756958284019451", "name": "Susan Gonzales", "time": 1623702730230, "rating": 5.0, "text": "Very professional.  From Lady at office( I had lots of questions), to waiting for banana boat( man nice), ride to boat.  Captain Jason and first mate very professional.  Great time. Take off smooth and landing. Beautiful I would use Ikes again. Will return.  Great time.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "105585507491636142436", "name": "Brett Leatherman", "time": 1625006300754, "rating": 1.0, "text": "Booked with Ike’s for a 12:30p flight for a family of 6. We arrived and were told they had boat issues and if we wanted to sail, would need to travel to their Gulf Shores location for an evening flight (6p). We booked there, after spending our morning waiting to go on a noon flight, and received a call at 2:30p asking us to switch to a 5p flight at the Gulf Shores location. Called back to confirm, and was told the captain was canceling the remaining afternoon flights.\n\nWe wasted an entire day of our vacation trying to parasail with this company. We were able to call around and grab a flight with another company - who fit us into a 6p slot (severe clear weather). Will not use this company again - despite the original recommendation - and cannot recommend them to any family or group looking to enjoy your beach vacation.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "100079567439276013111", "name": "Joy Bauer", "time": 1623804694000, "rating": 5.0, "text": "Wow! What an EXCELLENT experience Ike's has it ALL!  From the moment we inquired to the end of our parasailing adventure their customer service was top notch!!  We met some AMAZING people from the lady who greeted us at the stand to the jet ski driver Sawyer and Cam.  Our boat crew Jason and Jacob were super friendly, entertaining and helpful!  They made you feel comfortable the moment you stepped onto their boat!  I would highly recommend Ike's for your parasailing adventure!  You even get to ride the banana boat to get out to the boat!!!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "112613479893655019404", "name": "heidi heusinkveld", "time": 1616977229175, "rating": 5.0, "text": "I cannot express enough, how amazing Ike’s is!! Jason and Sawyer made our dreams come true! The weather did not cooperate the week that we were in Alabama, but they sure worked extremely hard, for our experience. Hands down, the best! Very knowledgeable and lots of fun! Highly recommend this company, five stars!!  Thank you from the bottom of my heart, for all of your effort in getting us in the air!\nHeidi Shanks and boys", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "113068897801911959828", "name": "coloradolife 18", "time": 1622494207309, "rating": 5.0, "text": "Very first activity we did while on vacation.  Had to so much fun I brought my little cousin to fly just 2 days later. Thanks Jason and Parker", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "111624210339903788034", "name": "Lisa Rohr", "time": 1601411651877, "rating": 5.0, "text": "We had an amazing time parasailing with Ike's Parasail.  We had a couple glitches that was no fault of theirs and they made it work so that we wouldn't miss out on the fun.  There were so many jelly fish in the water where we were supposed to get the banana boat they called in advance and said we could still go if we wouldn't mind coming to the marina in Orange Beach to catch the boat.  No problem!  Everyone at the check in point was very friendly and very helpful.  The water was rough that day but it was just a couple days before Hurricane Sally.  Our captain did his best to make it as smooth as possible for us.  Our crewman was amazing.  He handled the rough water very well and managed to get us our life jackets, our harnesses, help us get ready to fly and also took a ton of pictures!  He deserved a large tip for sure!  We were shocked at all he was doing!  We had 8 of us from 9 years old to 67 and we all loved it.  They were very knowledgeable and we felt comfortable with them the entire time.  We all want to do it again someday!  Hopefully the weather and the water will cooperate next time and we will get the banana boat ride too.  Ike's did everything they could possibly do so that we could enjoy our adventure!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPxCb3fWNMIIF4hpBqhG14bKk1kpBNpU2JFykkT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPS6rGqKZOyrnjdSzWTolBvvjCIjdiiT5PO_qTs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOOcf3VWsQXWOCpiAP280S7IXGH477lH97rh5nt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNoZKn8Dkh1vByVAjY-kaCWUkwbGJa4-lZ9-egH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOb6Nggs1uDMPOiGY92cIFKAzh3_9odFQqUcUi-=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "111275201028277313551", "name": "Emily Bauer", "time": 1623802567920, "rating": 5.0, "text": "We had so much fun parasailing! The crew was all very nice, helpful and funny.  I would highly recommend everyone going parasailing with Ike’s.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "112288561029813569404", "name": "Kimberly Dowdy", "time": 1622571228067, "rating": 5.0, "text": "My daughter and I had a fantastic time parasailing. She is scared of heights, but they made the experience phenomenal. They talked us through every step. Jason and Parker were absolutely the best. My youngest daughter and husband loved the boat ride. After, we returned to the boat my daughter said she would definitely parasail again as long as it was with them. Anyone thinking about parasailing, I would recommend them above anyone else, hands down. Great job, guys. We loved it!!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "108039189095717229578", "name": "Keeler Family", "time": 1623365435532, "rating": 5.0, "text": "Ike's Parasail was fabulous...from the friendly girls at the kiosk to the guy getting us fitted for lifejackets....everyone was friendly, helpful and explained how things would work. The crew on the boat were especially great at taking care of things, explaining and making it fun!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "112245816677631539391", "name": "Karen Sweeney", "time": 1617400938059, "rating": 5.0, "text": "Highly recommend this place! Today my two young kids, myself, and my mother went parasailing with this company. The two men who worked on our boat were so fun, and made us all feel at ease. We had a wonderful time, and would recommend this place to everyone of all ages!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "117165957576851976135", "name": "Jill Schilling", "time": 1624554654380, "rating": 1.0, "text": "We just left the banana boat ride. We paid for 30 minutes of ride time, but only received 12 minutes. We paid almost 90 bucks for a 12 minute ride? What the HELL. The boat that took my family out rushed them back and went out to pick up parasailing. WOULD NOT RECOMMEND!!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "101345838248006483130", "name": "Mistie Merritt", "time": 1623901183497, "rating": 5.0, "text": "Most Amazing Part of Our Trip was Parasailing🪂with Captain Jason and Crew 🙌🙌 They were so fun and personable. Oh and don't forget Captain Weiner, that ride to the boat was Epic 😉😆 This is our new Vacay Spot, We will be back. ⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "116064370610976713274", "name": "Amy Guiter", "time": 1619471477132, "rating": 5.0, "text": "First mate Charles and  Captain Jason were FANTASTIC and our kids will always remember the experience!  We felt very safe with them!!", "pics": null, "resp": {"time": 1619533864878, "text": "I am glad ya'll had a great time.Come back and see us again. Thanks Ike"}, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "104449179020374141391", "name": "cuddy link", "time": 1622734483623, "rating": 5.0, "text": "Jason the captain was great and his deck hand Jacob was key to all the fun great time highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "116694581118368868510", "name": "Carol Lawson", "time": 1599453917104, "rating": 5.0, "text": "We had a great time!, Everyone on the team today was kind, knowledgeable, fun to interact with and very professional! We had as much fun getting to the boat as we did flying! Mike and Justin were great on the boat, I didn’t feel nervous at all!  Can’t wait to come back next season and do it again!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPFU4AcRMzM-qJNwQ8oKM9P4ZioaH4908IpPOkO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP1LLwHo7hQacjylGFfcRVJq_XnVquzmniXGU08=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "111187115990737809179", "name": "Mark Black", "time": 1599247258103, "rating": 5.0, "text": "Picking Ike's Parasail off Google was a win. Took my 74 yr old dad for his birthday and he loved it. The entire crew from check in to the water was fantastic and on their A game. They were friendly, safe, and knew exactly what they were doing for a smooth experience from start to finish. Would highly recommend and will go with this company again next time.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "117452201108850334305", "name": "Rodney Teague", "time": 1596765281748, "rating": 5.0, "text": "Loved it! Family of seven from nine to seventy-four years old-- all had a spectacular time. Everyone from the booth attendant to beach side to captain & deckhand took great care of us and were great at their jobs. We felt safe and free to just enjoy the ride. Top notch!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "115893413822450800900", "name": "Marvin Carlton", "time": 1595284727064, "rating": 5.0, "text": "Great group of people... the weather wasn't cooperating well but they got us scheduled and it was great!!! The crew at the gulf state park boat was very nice and you can tell they know what they are doing cause they do it well... l will definitely take the family flying above the gulf again when I come back!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "111093343809286085844", "name": "Jeannie Smalygo", "time": 1593300019788, "rating": 5.0, "text": "Online reservation was fast and easy. Everyone was awesome, from the check-in crew on the beach that got us fitted for life jackets, to the crew on the boat. We had a blast! Note: you can’t take phones or cameras on the boat, so if you want photos - spring for the ones they take (the price was reasonable and you get the SD card). Go and have fun!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "113268338371239321856", "name": "Kristen Neary", "time": 1596658170555, "rating": 5.0, "text": "Everyone communicated what would be happening next very well. We always knew what we were doing. The banana-boat ride out to the boat was an added bonus! Charles was an amazing photographer and was very professional. He kept our daughter calm when she was scared. Mike did a great job driving the boat and made the \"flight\" fun and peaceful. I definitely recommend this place and I hope everyone experiences Charles and Mike on their trip. The guy who put us on and off the banana boat was great too, but I didnt catch his name.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "100572416401252904854", "name": "Debbie Trojahn", "time": 1597430464658, "rating": 5.0, "text": "We rode the banana boat in Gulf Shores. So fun!! The staff was very helpful and friendly. Charlie gave us directions and fitted us with vests. Josh pulled us with the jet ski, and gave us a mildly wild ride. We laughed and laughed. Thanks for a good time!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "108017534121858901873", "name": "Brandy Enlow", "time": 1596552164944, "rating": 5.0, "text": "Mike and Sawyer were amazing. Our little family had such a great time. I’ve never been parasailing before and they made sure we knew what to expect and were so nice and friendly. I highly recommend Ike’s! If we ever come back this will be exactly who we book with.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "103476858386112320358", "name": "John Burnette", "time": 1594963226017, "rating": 5.0, "text": "Absolutely perfect!  All of the crew working Ike's at Gulf State Park Pavillion site were great.  I took my 11 year old and he had a blast.  We bought the picture package and pictures turned out very good.  Great people, great service, great value, and a great time.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "104891323418910225491", "name": "Beth Sparks", "time": 1595083122833, "rating": 4.0, "text": "We entrusted our two 14 year old girls in the hands of Ike’s Parasail and were not let down! We only spoke with the young lady in the booth at the Gulf pavilion and the man who helped them with life jackets and onto the banana boat, but they were both very nice and did a great job explaining the process and just being friendly and interactive. My only complaint (and reason I didn’t give 5 stars) was that the pictures that I purchased in advance for $40 were not of good quality. Yes they took about 40 pictures, but only a couple of them were print/share worthy. The rest are either real blurry or have the rope in front of one of the girl’s faces. Otherwise, the trip was an incredible experience that these girls will never forget.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "115812730219789397743", "name": "Jamie Lane", "time": 1595959188990, "rating": 5.0, "text": "This was our first time to parasail, my 9 year old and me. The experience was amazing! The guys, Jason and Josh, were wonderful! They explained everything to us clearly! I read review after review after review and decided to go with Ike’s. We will go with them again! We had a great time and plan to make this our beach tradition!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "102032660312531378598", "name": "Mitzi Norris", "time": 1618673650232, "rating": 2.0, "text": "The actual sailing was alright. But... The boat driver \"Flew\" over very rough waves, too fast, \"Blaring rock music so loud we couldn't hear ourselves talk, while he \"sang\"! Won't use them again.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "100248874727256271606", "name": "Topitina Topitina", "time": 1594785804021, "rating": 5.0, "text": "This team is really good, they do not risk their customers! It was a very fun adventure, since you start by going on a banana boat to the little but comfy ship and from there off you go into parasailing! My daughter and her friend really liked the whole experience. My only suggestion would be to allow customers to take their own pictures. Anyway, Thank you guys!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "101638656045510729699", "name": "Pearl Green", "time": 1592423465662, "rating": 5.0, "text": "Jason and Sawyer were our boat guides.  Best experience ever! Smooth transition on and off the boat.  Took my 11 yr old granddaughter for her first parasail experience. She loved it! on future trips I will definitely use Ike's again. very fun and professional.  we even got same day reservations! z you will get wet, so be prepared! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "105232924255886792613", "name": "Lailah Utnage", "time": 1595649804256, "rating": 5.0, "text": "I took my daughter for her birthday and it was everything she had hoped for. The crew on board the boat was fun and entertaining, and not to mention safe. This is a professional operation that I will be using again. Thank you.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "108026423971829202722", "name": "Kathleen Edwards", "time": 1597271816464, "rating": 5.0, "text": "Stayed at the Resort 4 days, Parasailing was on my bucket list. All I can say is Katelyn Wood was so amazing and friendly she made the signing up great then Charlie, Sawyer and Jason made us all so comfortable and laughing. A Great time was had by all, Highly Recommend", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "101769737931341262791", "name": "Cheri Hogrefe", "time": 1590945476388, "rating": 5.0, "text": "It's not cheap for a family of five, but it was SO much fun. We filled out all the forms online to expedite the process, and I highly suggest doing that. The banana boat ride out to the big boat was hilariously adventurous. And the parasailing was awesome. Gorgeous views, and felt completely safe. Captain Jason and first hate Sawyer were very professional, but made sure we had a great time!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "116143728085165778929", "name": "Amy Wilson", "time": 1596489340347, "rating": 5.0, "text": "My 12 year old daughter and I went parasailing for the first time with Ike’s. It was a wonderful experience from start to finish! The staff at the beach as well as the captain and crew on the boat were awesome! My daughter and I both had a blast!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "107093398156673812639", "name": "Lisa White", "time": 1592684654635, "rating": 5.0, "text": "Safe, tranquil, beautiful, very smooth take off and landing back on the boat. Not scary at all!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPMHBI2EyLJfjaHJcglB2W36HW5yOVlsC77NPM9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOpE3PzRNhmWAn10Mbnklz_ZcAhZoBOJu1AuQC_=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "107749332393888510601", "name": "Jennifer Rose", "time": 1594524963505, "rating": 5.0, "text": "Jason(Captain) & Swayer(First Mate) were amazing! They explained everything very well. I was very nervous about going up! They were kind and very patient while I convinced myself again to just do it! I highly recommend this group and looking forward to our next trip!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "112631520903087189084", "name": "Caitlyn Matherne", "time": 1596486845842, "rating": 5.0, "text": "We had the most amazing time. My nephew had been asking to parasail since he was little and we finally said yes for him to go. The crew on board were so kind and efficent. The ride was smooth and something we will always remember. Would definitely go again, especially with Ike's!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "102497639235200821433", "name": "Brenda Box", "time": 1592490885631, "rating": 5.0, "text": "Jason and Sawyer were our guides. They were very professional and made our first time experience great. They were very knowledgeable which is what I needed since I am afraid of heights. I highly recommend this it is definitely one I enjoyed and will do it again.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "115305120826021550501", "name": "J K", "time": 1597281925294, "rating": 5.0, "text": "Went parasailing with Jason and Taco. Taco worked very hard and took some great pictures and Jason made sure everyone enjoyed themselves. Would absolutely recommend this experience and appreciate Taco and Jason making sure we were safe.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "103204846140524677660", "name": "Jess J", "time": 1596560545383, "rating": 5.0, "text": "I don’t have enough good things to say about this group. The staff is phenomenal. I can’t remember everyone’s names, but thank you.\nCharles, Sawyer, Chase, and the pretty lady at the kiosk killed it. Highly, HIGHLY recommend.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "103090884463485040102", "name": "Ashley Tharp", "time": 1592452680892, "rating": 5.0, "text": "These guys are super friendly, knowledgeable and fun! We flew at the Flori-Bama spot, and highly recommend them. They made my husband and daughters' first flights easy and memorable. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "107781513781815784943", "name": "Allison Warren", "time": 1594658365283, "rating": 5.0, "text": "Jason and Sawyer were amazing!  Best parasailing we have done. The playlist on the boat was fantastic!  Very professional and we felt very safe. The banana boat ride to the boat was fun too. We also rented paddle boards from Ike’s and that was fun too. Best service!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "101676874983919245980", "name": "Adam Routon", "time": 1593694288912, "rating": 5.0, "text": "My daughter and I had a great time parasailing with these guys. Jason and Josh did an awesome job with us out there! I highly recommend these guys if your in Gulf Shores.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "101991732846455334955", "name": "Tina Mansker", "time": 1599852214070, "rating": 5.0, "text": "These guys are amazing, we will definitely go again and will only use Ike’s in Gulf Shores. Captain Jason, Sawyer and Charles you guys are amazing thank you sooooo much!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "107324075987974502874", "name": "Patricia Strand", "time": 1595081518745, "rating": 5.0, "text": "Had a blast!  The two J's (I can't remember their names, just that they started with the letter j.) were funny and efficient with getting everyone off and Parasailing.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "110156811049658285979", "name": "Bark Bark", "time": 1593544751442, "rating": 3.0, "text": "I believe his name was Nick, one of the employees on the beach who fitted my wife and I our flotation vests was very friendly and seemed like he really wanted us to have a good time. The crew on the boat ensured our safety and was patient when I kept slipping down from the harness seat and reeled me in two times to try to fix the issue. The 3rd time was a charm. What I did not like about my overall experience is there was no safety brief or instructions on what to do before getting on boat. Also, I felt it creepy having to record a video of myself reading a waiver form promising not to sue and send it in. The actual flight was a pleasant experience. I also thought it was a little pricey and nervy to ask to pay gratuity up front.After paying taxes and gratuity, it was expensive. was it worth it? Yes, but at the price I paid, I would not do it again.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "109570846664406890002", "name": "Shawn Schmitt", "time": 1592602512255, "rating": 5.0, "text": "This was our first time parasailing and we loved every minute!! Jason and Sawyer were absolutely terrific!! We have a special needs daughter and they were fantastic with helping her in and out of the boat as well as interacting with her on her level. They made us and our daughter feel comfortable and confident in their abilities. We had a fabulous time and will definitely ask for this crew again next time we are in town. We would highly recommend Ike's Parasailing.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "108616221073660191211", "name": "Devin Pierce", "time": 1597616859210, "rating": 5.0, "text": "Jason and Charles are great! They made the entire experience fun, Friendly, and memorable! Had an awesome time.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "105375721212787858122", "name": "kimberly soper", "time": 1594232587675, "rating": 5.0, "text": "We had an an awesome experience. The staff were amazing! I highly recommend them and would do it again.😄", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "107106280694817929435", "name": "Britney Brunette", "time": 1596488359357, "rating": 2.0, "text": "Little upset that it is now a \"requirement\" for an observer to be on the boat due to under 16. (Ages 13 and 15, 16 in 2 months) the kicker is having to pay the observer fee when it's mandatory. However, the boat crew was very nice, even the lady at the kiosk was nice. The rule is dumb.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "116051210578128818714", "name": "Camae Smith", "time": 1596679255971, "rating": 5.0, "text": "Lyndsey, Jason, and Sawyer were all incredible representations of your company. We had a blast, and will definitely recommend to friends and family!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "113139942268546363021", "name": "Chris Melton", "time": 1592621585164, "rating": 5.0, "text": "It was a great experience I highly recommend doing this. Sawyer and the boat driver (sorry I can't remember the name), were great and made everyone on the boat feel comfortable.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "115374143736102184044", "name": "Doug Ernst", "time": 1596192414691, "rating": 5.0, "text": "We booked Ike’s parasailing online for our trip to Gulf Shores. My boys (6 & 8) had never been, but they wanted to try it.\nThe booking experience was simple and easy. On the day of our flight/sailing, we were able to park at Ike’s (great, as parking at the beach can be tough), then walked over and were treated and taken to check-in. It was friendly and efficient!\nIn no time, we were life jackets, and being escorted out for a (fun! My boys loved it!) banana boat ride to the pick-up area to boat the Chute Yeah.\nAs we got on the boat, I couldn’t help but think it was the Outer Banks guys or the Rob Spicoli was our captain... but immediately I saw the way they handled the boat & gear and KNEW that these guys were true pros. Not only were Jason (Capt) and Josh (first mate, shark fighter/rescue diver/photographer) extremely Proficent, but they made it a complete BLAST!\nGreat tunes, fun atmosphere, PERFECT (safe, from take off to the dip, and landing) experience!\nBook at Ike’s...ask for Jason & Josh... you won’t be sorry.\n\nOh, and the ride itself... well, my 6 y/o told me it was “the best week of his life” because of it, and my 8 y/o simply said “Dad it was epic”...\n\nAnd you know what...they both were right. Come see for yourselves!!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "100867944459465400873", "name": "Katie Davis", "time": 1592169702147, "rating": 5.0, "text": "Great experience! Beach crew were friendly and efficient. Boat crew (Jason and Jacob) were awesome. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "118236299864760211956", "name": "Sarah Jane Richards", "time": 1563922579178, "rating": 5.0, "text": "The staff made this the best parasailing trip! The men were kind and helpful. You may need their assistance getting on the banana boat! I'm glad I found my one piece for this activity! 😎 We plan on doing this again during our next visit.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMfbiV9MnPJCeT6fq86vwl3RjVLHTgHuKOGtQx4=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "110121690249245439181", "name": "Bruce Shipwash", "time": 1592421328542, "rating": 5.0, "text": "Great time, Great service. Went para sailing for the first time with my 12 year old son. We had a blast and would definitely do again.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "106658722596838009141", "name": "Dawson", "time": 1596758609608, "rating": 5.0, "text": "Ike's Parasailing is the best! Jason and Sawyer knew what they were doing and explained everything since it was our first time. Give Ike's Parasailing a try you won't be disappointed! I will go with Ike's again.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "113197449152152375286", "name": "Pam Van", "time": 1596051356607, "rating": 5.0, "text": "Other than me and my husband falling off the bannana boat🤣😂🤣😂 it was a great time. Our kids loved it!!!  RIP my ball cap!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "113953689603143165695", "name": "A C", "time": 1594818289752, "rating": 5.0, "text": "Took my 12 year old son out yesterday. The pretty blonde haired guy driving the boat was wonderful and so was the guy helping on the boat. The people we rode with were complete weirdos to put it nicely but we had a good time anyways. I have been parasailing many times in many different places and can tell the guys operating this boat know what they are doing so if this is your first time parasailing you are in good hands.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "107961848279338047579", "name": "Jennifer Crumby", "time": 1592186806720, "rating": 5.0, "text": "My daughter , and I did this today. We had such a great experience! Great group of people.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "114386236418888039550", "name": "mindy davenport", "time": 1594237030116, "rating": 5.0, "text": "We went out this morning with Captain Mike and Josh. They were both amazing!\nHighly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "111882113478526662272", "name": "Jennifer Searcy", "time": 1596464434853, "rating": 5.0, "text": "what a blast.  music on the boat was great.  everything we expected", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "110950394431088888214", "name": "Amy McCall", "time": 1594919297931, "rating": 1.0, "text": "Absolutely terrible! 1:00Pm scheduled time and they tell us “sorry we can’t find you anywhere”. We have a paid receipt, charged over $600 and are told by the girl on the phone, “sorry, we can book you again but will have to charge us another $600”.  We are currently waiting to see if the manager actually calls us back.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "102659449226715424178", "name": "Dustin Klinedinst", "time": 1589161311858, "rating": 5.0, "text": "Road the Banana Boat float. Was a blast. Great guest service. Easy booking. Well worth it.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "106074214723852385975", "name": "Jason Archer", "time": 1597176343350, "rating": 1.0, "text": "This is probably the worst business I’ve ever encountered. Ashley is super incompetent and should barley be able to be out in society.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "102224258252334903203", "name": "Victoria Russell", "time": 1595109873655, "rating": 5.0, "text": "So fun! Everyone was very nice and helpful!!! Boat crew had the best vibes! Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "113168284171787233297", "name": "treetop7232", "time": 1590508422665, "rating": 5.0, "text": "We were first timers and they made it smooth! It was a great experience, wish we had done it sooner and will add it to the future trips.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "116001283764394403842", "name": "Smils", "time": 1599528551816, "rating": 5.0, "text": "We had a great time! Highly recommend", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "109138288733879746891", "name": "Cheryl H", "time": 1593958161229, "rating": 5.0, "text": "These guys and gals did a great job. We had a blast!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "101944790716029360841", "name": "Ashley Smith", "time": 1592591774515, "rating": 5.0, "text": "Fantastic customer service and experience. We will definitely return on a future trip.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "112432046853882313922", "name": "marc alexander", "time": 1593812436805, "rating": 5.0, "text": "Great time, my kids LOVED it! Professional and courteous people.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "112241099385591840121", "name": "Allen Scholl", "time": 1598040417569, "rating": 5.0, "text": "It was definitely an experience worth trying at least one time.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "109251174601236724901", "name": "Warren Harper", "time": 1592468539587, "rating": 3.0, "text": "My wife and son (13) loved the parasailing, but not fond of the \"adventure\" to get to the boat. Had to ride a banana-boat pulled by a jet-ski to the parasailing boat. Our jet-ski driver was over-eager to say the least. He took off before my wife was on the banana-boat which forced her to get on it in higher water which was extrememly more difficult. Once on, he took off before she had a secure hold which slung her into the middle of the \"water carriage\" and onto the legs of other passengers. Thus, 5 for the parasailing; 1 for the banana-boat.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "102465602373915874427", "name": "Lance Smith", "time": 1564921028890, "rating": 5.0, "text": "My wife and I loved our trip up in the sky. Beautiful sites all around. The captain was a great guy to talk to (forgot his name, originally from Maine, worked in the Virgin Islands at one point.)", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "105365681693080263931", "name": "Michelle Bennett", "time": 1560782816508, "rating": 5.0, "text": "Parasailing with Ike's was the best vacation activity!!  The staff was best in class at service and making you feel comfortable.  I was the adventurous mom who took her 2 boys flying.  It will be one of my favorite memories from our trip.  The boat staff was AMAZING and very professional.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "110821965051048549114", "name": "janet spare", "time": 1561821720394, "rating": 5.0, "text": "Ike’s parasailing is the best in gulf shores. The staff are helpful and friendly and are an example on how to deliver great customer service. We had people of various ages 12-50 participating and they all had a great time and felt safe doing so. Great day!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "103135950865856860224", "name": "Kerry Story", "time": 1592658091106, "rating": 5.0, "text": "This was a great crew and a hell of a experience would recommend to everyone .", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "112693605406061859330", "name": "Amber McKathan", "time": 1596928278029, "rating": 5.0, "text": "Great experience and the captain/crew were great!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "103192913367894143594", "name": "Jeff Mathews", "time": 1563545299186, "rating": 5.0, "text": "Everyone was friendly and knew what they were doing. The pictures did not turn out as well as we had hoped, but we got a few good ones. Thanks for the fun adventure!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "104041625155973876743", "name": "SARAH RICHARDS", "time": 1563405045765, "rating": 5.0, "text": "Awesome trip! The two men that helped us were patient and understanding. We had a blast. Hardest part is getting on the banana boat. 😎", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "103427951324057219766", "name": "Todd Thurston", "time": 1565721030435, "rating": 5.0, "text": "Took my daughter for her first trip up. SHE LOVED IT. We had captain jotty and he was wonderful.  We were a few minutes late to get started but our flight times were not shortened to \"catch up.\" The staff were all professional and polite. Capt. Jotty was awesome. Good pictures. They are a few dollars more than their competitors but would easily recommend to a friend. Book early as they fill up the day pretty quickly.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "117733576284056620838", "name": "Richard Wiginton", "time": 1563910705643, "rating": 5.0, "text": "This place was amazing! They are in the process of renovating their office, but they were extremely helpful on the phone in getting us to the right location.  Once there, we only waited about 10 minutes until we were seated on the banana boat and headed out to the boat. The crew was amazing and very personable. They obviously know what they're doing, but still take the time to talk with the participants. I had a fear my motion sickness would kick in once in the air, but I felt nothing.  However, I might suggest taking motion sickness medicine anyway due to waves you experience when sitting idle in between rides. Overall, we loved this experience and would use Ike's again in a heartbeat.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "110257829677286289920", "name": "Clare Anderson", "time": 1564022055195, "rating": 5.0, "text": "The staff was so friendly and were very good at their job! I never once felt unsafe or nervous. I will definitely go back if we are in the area again and wanting to parasail!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "106432624414931280707", "name": "Jeffrey Keel", "time": 1594242959851, "rating": 5.0, "text": "Thanks Jason and Sawyer. Great trip.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "110607161027293131714", "name": "Marc Weindel", "time": 1563812295855, "rating": 5.0, "text": "The staff was amazing! Mike (the boat driver) was fun and accommodating! I would highly suggest this place for an enjoyable and fun experience for the whole family!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "116808953903976977163", "name": "jared thacker", "time": 1561553573347, "rating": 5.0, "text": "The team was courteous and helpful. It made a great experience all around. I would do it again next time.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "108109980520497428882", "name": "Kayla Hauser", "time": 1565926597454, "rating": 5.0, "text": "Super easy to book the trip and the whole experience was well done.  Very friendly and knowledgeable staff.  Such a smooth activity, an amazing experience.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "115267238608189928063", "name": "Jade Wilson", "time": 1593173372861, "rating": 5.0, "text": "Great crew, boat captain excellent, banana boat captain was great.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "105692500393328825040", "name": "Ryan fister", "time": 1564977615445, "rating": 5.0, "text": "It was me and my 8 year old daughters first time parasailing and I’m so glad we found Ike’s. Everyone was so nice and safety was obviously everyone’s number one concern. Highly recommended!!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "102460884055257639906", "name": "Levi Underwood", "time": 1561769563180, "rating": 5.0, "text": "They really treated me well. I showed up a little late compared to when I was asked to arrive but they kept my spot for me. I even got a little sick on the boat and was nourished well. Plus I was even by myself and they accommodated me well in that scenario.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "100234380431765613428", "name": "Steve Rogers", "time": 1562117348065, "rating": 5.0, "text": "All around great experience. Staff was friendly and knowledgeable. The parasailing was really fun. Can’t wait to do it again.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "116800483391050360045", "name": "Julie Hasty", "time": 1562449883370, "rating": 5.0, "text": "Great experience and very helpful/friendly staff!!! Warning: if you go out from Gulf Shores you will board a banana boat to get to parasail boat! It’s hard to get on and hang on to but it sure is fun!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "104750761825576428167", "name": "Jennifer Klenke", "time": 1562379926127, "rating": 5.0, "text": "Love Ike's. We did banana boating, parasailing and rented lounges from them. Friendly and helpful!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "113703997588711212206", "name": "Courtney Bernado", "time": 1560294809612, "rating": 5.0, "text": "First time parasailing for myself and my husband. Great experience. Staff was very professional. The guys on the boat were thorough and professional. I would recommend you taking some motional sickness pills if you tend to get nauseous on a boat! Overall we LOVED it and would go again! Highly recommend Ike's in Gulf Shores.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "110536361943520648012", "name": "Chad Butler", "time": 1533779250868, "rating": 5.0, "text": "Super day with Ike’s Parasailing!  We went with our 11 yo son and daughter. They took great care of us from the shore to sailing! Great attention to detail—safe, beautiful ride.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "115883216304872508396", "name": "Melina Keithly", "time": 1560464571055, "rating": 5.0, "text": "Very professional crew! It was a gentle and smooth ride. Instructions were clear and safety was obviously a priority.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "117369579549438678671", "name": "Aimee", "time": 1529958355890, "rating": 5.0, "text": "This was our first time parasailing!  It was awesome!! The staff at Ike’s were knowledgeable and very accommodating.  They made sure everyone had a blast!   We made a reservation online and we went right at our scheduled time.  I highly recommend Ike’s!!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "116438575126355228591", "name": "Brian Honaker", "time": 1533586863362, "rating": 5.0, "text": "Very friendly, professional and knowledgeable of what they are doing. This was my first time and they made sure I had a great experience.... so much fun.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "101104037439829589132", "name": "Ronald Gramling", "time": 1534284351231, "rating": 5.0, "text": "Outstanding staff from signup to boat to shore!  What an experience for some first-timers from TX. Went with my daughter and her friend and they were nervous as nervous could be. The demeanor of our boat crew made us all comfortable. Nice.  Helpful.\nGenuine. Honestly I dont think the 15% tip was enough and wish there was a close out process after the experience so I could have increased it. When they ask if you want the picture package, just do it, totally worth it. So many great photos for us to share!  Good people.  Great experience.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "110083815035414690132", "name": "andrew newby", "time": 1590357289839, "rating": 5.0, "text": "Great operation and a great time!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "113617680312776947828", "name": "Teresa Kidder", "time": 1599580820796, "rating": 5.0, "text": "Absolutely Amazing.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "106256254356720434457", "name": "Stevie Sims", "time": 1561848784008, "rating": 5.0, "text": "The owner was extremely helpful, courteous and understanding! I would definitely recommend them to anyone in the area!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "114580842230203515641", "name": "Scott Lambert", "time": 1523196737416, "rating": 5.0, "text": "Best and Safest Parasailing on the island.\nThe crew is extremely Pleasant and knowledgeable.\nEveryone we talked to said this was by far their best experience parasailing.\nWe cant wait to go again next year.\nGet the photo package, you will be glad you did.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "102368606240960942114", "name": "Maegen Nicole", "time": 1565141644662, "rating": 5.0, "text": "Such an amazing experience. Get the pictures it's worth it.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "116730304879611512537", "name": "Beth Cason", "time": 1533829168903, "rating": 5.0, "text": "This was my first time parasailing and it was an awesome experience.  Everyone with Ikes services was wonderful.  I would definitely use them again.  VERY friendly and helpful!!!!  Thanks for a wonderful experience!!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "112315854680256032888", "name": "Seth DeVries", "time": 1559225148547, "rating": 5.0, "text": "The whole crew is great. The only thing I would suggest is take some motion sickness pills before you go.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "105628245276558954979", "name": "Susie Kryzsko", "time": 1597155413946, "rating": 5.0, "text": "Awesome experience!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "100853742136232120639", "name": "Therron Henderson", "time": 1531449222621, "rating": 5.0, "text": "ABSOLUTELY WONDERFUL AMD SOO MUCH FUN!!! DEFINITELY WILL VE RETURNING AGAIN SOON!!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "101605316290849187644", "name": "Bryan Hagen", "time": 1532533931818, "rating": 5.0, "text": "We can't wait to go again next year!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "114077504837964089235", "name": "sherry stephens", "time": 1560014820039, "rating": 5.0, "text": "Wonderful experience the Crew were awesome!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "112395099541026468552", "name": "Nicholas Pohl", "time": 1623804787569, "rating": 5.0, "text": "Very nice fiberglass catamaran 26’ boats, completely coast guard compliant, all rigging included, modern engines.\n\nThe staff is very friendly and knowledgeable. We ran into a bad weather issue after an hour on the water, but with the fun we’d already had, we’ll be returning tomorrow morning for some fun in the sun.\n\nI would highly recommend them if you are looking to do some exploring, play on sandbars, fish a bit… whatever.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "116278162261279291552", "name": "Brandon Williams", "time": 1597367877371, "rating": 5.0, "text": "GREAT DAY ON THE WATER!\n\nMy family recently rented a pontoon boat from Orange Beach Boat Rentals and had a fantastic experience! From making the online reservation, payment, orientation, boat pick up, and drop off processes were super easy.  The entire staff was friendly, informative and very helpful. You can tell they love what they do. The boats were top notch and it even had a restroom.  Would highly recommend and will be back next time we're in OB!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNRKWHIU8xfmUIGET_AbM3ulrUyMW6V6HH3fX6K=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN5Omg0aFDlsslEkvG92qmGAURryvS5NO92Y-jq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMAqiYFg7XKRw722iQu184om9SoTyzyRhUyKcb2=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "118007504726909748777", "name": "Memorie Cole", "time": 1624062563899, "rating": 5.0, "text": "Doug was amazing. Very helpful and accommodating. We had so much fun on the water and have already started planning our next time out", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "117948448512418976744", "name": "Ashley Allerson", "time": 1618341412388, "rating": 5.0, "text": "We had a great day on the water renting a pontoon. Danny was through and knowledgeable and a super cool guy to chat with. The boat was extremely clean and well kept. Pulling back in after a full day was easy to fill up and pass the boat back over. Prices were great and we would definitely rent here again. Thanks Danny!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "106016187240139687001", "name": "gaye mayo", "time": 1561312496490, "rating": 5.0, "text": "Thank you to Orange Beach Boat Rentals for an amazing time yesterday! My family had an awesome time going to Pirates Cove, seeing dolphins and going swimming! The directions and the GPS are fantastic and having a bathroom on-board is a lifesaver! The directions and it was nice to see that Jack wanted to make sure we knew everything about the boat before we left.  Thanks again Orange Beach Boat Rentals and we can't wait to come back the next time we're in Orange Beach!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNSTe0jkZsb1fUkCd88hCVXoBzx-K26Ta6QdGaI=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "104282226857319213304", "name": "Karla Thornton", "time": 1620501907383, "rating": 5.0, "text": "Great time, great boat and crew.  Lots of dolphins and seagulls and pelicans.  Just a beautiful day with great tunes playing.  Everyone had a nice time.  Recommend highly!!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "117366644843506561311", "name": "kevin stutting", "time": 1616170958042, "rating": 5.0, "text": "Capt Danny was awesome! Best renting experience I have had in boat renting. A rental boat with a stereo that was loud and and a 150hp motor that wasn't throttled down. These boats have a head (bathroom) that keeps everything less urgent...", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "107428951886942898318", "name": "David Naylor", "time": 1617588975049, "rating": 5.0, "text": "Best part of our vacay. First, Captains Igor and Danny are good guys who are knowledgeable, friendly and patient. The boat was immaculate and so nice having a step down bathroom!  Our dog was welcome and he loved it!  They brought fishing stuff for my son when we changed our mind last minute, and got us out on the water quick. Their recommendations of where to catch a fish and where to see dolphins were spot on!\n\nThe boat itself was easy to use and had great technology. Good sound system and excellent depth finder / gps. Boat was in tip top shape and easy to use. While I am very experienced on a boat, a beginner could use this pretty easily.\n\nWe took the four hour trip. The only problem was we should have gotten the full day rental!!!  Next time!  I will definitely rent from them again.\n\nFinal part was the gas up and check for damages. They quickly assessed the boat and saw it was in good shape. Four hours of boat time and just about $20 of gas only, so efficient as well.  No hidden fees or charges at all.\n\nWe appreciate y’all making our day so fantastic!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "103379792096691051342", "name": "Tommie Mccool", "time": 1598479949069, "rating": 5.0, "text": "Great Rental Company\n\nWe had an Amazing day. The check-in process was very thorough and informative. The boats were Amazing and very clean. They were fully loaded with a bathroom, GPS, xm radio etc.\nWe saw lots of dolphins, fished for a few hours, stopped by a beautiful sandy beach island and had lunch at Tacky Jack's.  We have rented boats from all over, and this company really stands out, we were impressed all the way around. Great Boats! Great Service! Great Day!  Top Notch Service. We will be back next time.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "109613474280614917898", "name": "Ryan Files", "time": 1601303446614, "rating": 5.0, "text": "We rented one of their pontoon boats a couple of weeks ago. Fantastic experience! The boat was in great shape and they provided a map that was extremely helpful for our navigation. Everyone there was a pleasure to deal with and I wouldn’t use anyone else after such a great experience. I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "110744075825733328626", "name": "natalie mrocek", "time": 1596221052448, "rating": 5.0, "text": "AMAZING DAY!\n\nAmazing day on the water. I am so glad we decided to rent a boat for the day. We saw lots of dolphins, got to hang out on a island, go fishing and had our best day on vacation on the back bays of Orange Beach on the boat.  Customer service was Awesome. We can’t wait to rent from Orange Beach Boat Rentals again very soon. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "105511405355175593558", "name": "Richard Dias", "time": 1498184650488, "rating": 5.0, "text": "Orange Beach Boat Rentals was fantastic. Captain Igor did an excellent job with boat preparation. There is a video that explains the safety features of the boat and of proper etiquette for traveling on the Inlet. Captain Igor then reviews any questions you have. Our boat was well-maintained and very clean. Our entire family had a great day on the water seeing dolphins and finally stopping at a beach. I would recommend orange boat rentals to everyone. When our family goes again no doubt where I will go to rent a boat.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOvjFu5GATUyB1Nys4uMZJP6-73M6CvjAnBjoOJ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "114217863759634135426", "name": "The Nortons (Jenny)", "time": 1599574538175, "rating": 5.0, "text": "Our family had a great time on the water thanks to Orange Beach Boat Rentals! Danny was very knowledgeable about the area and helpful at check in and the boat was perfect for a family! We saw so many birds and dolphin! Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "103988879924585843331", "name": "ihyzey", "time": 1593732638419, "rating": 5.0, "text": "We had a blast. Worth every penny. Danny was amazing. Customer service was awesome and you don't get great customer service too much anymore. You can tell they love what they do. We arrived and everything was ready to go. They made it so nice and easy.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "111301384544058275380", "name": "Christopher McCarthy", "time": 1600087508452, "rating": 5.0, "text": "Had a blast! Great training video. GPS and hand map made it SO enjoyable.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNnpTJu4LkWhkoKdraVhL5pMqrRJ64Z8-hSvdAm=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "117951613584680788421", "name": "Natalie Whitehead", "time": 1595549117233, "rating": 5.0, "text": "A great family excursion! We saw dolphins, caught fish, and had plenty of room on the boat for 5 of us. Plus, we went out in the rain, and the people at Orange Beach Boat Rentals told us to keep the boat out for a couple of extra hours no charge in order to make up for subpar conditions. We didn’t ask for it; they just kindly offered. Such great service!!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "115860195063294710490", "name": "kenneth gossett", "time": 1592351497751, "rating": 5.0, "text": "Came down here on vacation, we have used a few different boat rental places so far and we definitely saved the saved the best for last. Best boat rental by far. Very clean, very respectful and courteous staff, with top of the line boats! These guys will not disappoint!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "106806080659760136917", "name": "Bill Knox", "time": 1600727116029, "rating": 5.0, "text": "April and Capt Danny were amazing in helping us with our fishing trip.  Their prices were competitive, but their service was off the hook - much like my bait.  We will be back for more.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "103954048580229089139", "name": "Jeff McLaughlin", "time": 1597240336922, "rating": 1.0, "text": "Boat itself was very enjoyable. Family loved it. However, April whomever that may be sorely needs a class in customer service and has an issue with feeling the need to be correct. Even with a paying customer.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "113185380629164030485", "name": "Kate Green", "time": 1590032055066, "rating": 5.0, "text": "Rented a boat full day on May 19th. It was the best day we had on vacation by far. Family owned very friendly. We loved the boat super comfortable sat 6 comfortable and could have sat more. Will definitely rent again when in town.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "113708637985060761434", "name": "Michael R", "time": 1592108798361, "rating": 5.0, "text": "Wonderful Time for the Family! Thanks Captain!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN-mNkxomi_fdR4XCcI7xyKAvEqYK_UubU73KPC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMEXm14qQRfqJio3gMO84jfwpTtfO454TPFnw9K=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM-9XPU2AD8HWb4OhWIEZG1AcmqWTWqJ87dbafj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNTfatAX1BMm5CnASHVsRk3loQGL1QhWe77-Nhj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNtV_dj3yvpGLT-I6Uzs3HtRVhH0QVAAOaErvZZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNdLiH4r7b11REje18LILFYG7YE-n3JM9GFk_gz=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "110504018353551169783", "name": "Shell Mitchell", "time": 1597253261359, "rating": 5.0, "text": "Amazing Day! Highly Recommend!\n\nYesterday was our 2nd time renting with Orange Beach Boat Rentals and we love their boats and their Amazing customer service. We have rented from many other rental companies and they by far have the nicest boats. We love the convenience of the restroom and the garmin gps. The orientation is very detailed and thorough. We saw lots of dolphins, went to pirates cove and did a little fishing. Once again my families favorite day of our vacation. We highly recommend Orange beach boat rentals. Highly Recommend!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "111387897484717645469", "name": "Heather Roaden", "time": 1591137742867, "rating": 5.0, "text": "Best Day on vacation!! Kids had a blast catching fish! Customer service is amazing!!! Very clean and well maintained boats! Got to see alot of Dolphins!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "108838757210566577432", "name": "Sydney Verant", "time": 1565032680236, "rating": 5.0, "text": "I highly reccomend a full day boat rental so that you have time to go to the beach, go fishing , hit the restaurants (I reccomend pirates cove), and see the dolphins. Go to the beach earlier when there are less people and drive slowly to see the dolphins. There may be a shrimp boat throwing over their unwanted catch where the dolphins are hanging out. You can buy some shrimp right from the boat too, but dont feed the dolphins: it's illegal.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPHg6yYyNvmF22nviNHZvMQVg9u6Guaq1D8UgaJ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "100081859849112308879", "name": "Sherrill Mitchell", "time": 1566238587273, "rating": 5.0, "text": "Excellent Boat rental company\n\nWe rented a boat from Orange Beach boat rentals on Saturday. We had a group of 8 and it was very comfortable. The boats were extremely clean, we loved having a restroom onboard, and they rode so smoothly. We had such a great day.  Everything about this company was professional and smooth, from booking the reservation, to being greeted and instructed during the orientation., they gave us all the local tips and recommendations, which was right on point. We highly recommend renting from orange beach boat rentals and will be back soon.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "118388488383513067012", "name": "John", "time": 1566943967968, "rating": 5.0, "text": "Great boat rental company. Highly recommend going to Robinson Island area.. there’s lots of restaurants and bars. You can also park your boat on the sandy island just south of Robinson Island (many people go there).\nThe instructions and orientation of the boat is from a simple 10 minute video on an iPad they give you.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "113783782381522352755", "name": "Debbie Mcneal", "time": 1562364710431, "rating": 5.0, "text": "These guys are awesome. They give you the best service in Orange Beach. They take really good care of their equipment. Have no junk. Best boat ride and fishing trip I've ever been on. Please contact them for all your boating needs when your at beach. You want be disappointed.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "116858513354408406740", "name": "Craig Anderson", "time": 1589890795378, "rating": 5.0, "text": "Great experience! I have rented from several places in OBA, and this was the easiest by far.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "102111347070563568211", "name": "Ryanne Riegling", "time": 1554991294513, "rating": 5.0, "text": "We've rented boats from many different places and this was by far the best. Very good pricing, excellent boat! The catamaran has a bathroom in it, which was super helpful since we were out all day. The boat was outfitted with a GPS / fish finder and the company provided a very detailed map to go along with it. The gulf is quite a large area and this made it very easy to navigate.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "108873400515275903745", "name": "Kevin Tuttle", "time": 1563840607776, "rating": 5.0, "text": "Me my family had a great time anybody that complains about the $75 charge cost for running into sand bar are idiots or must be drunk  and not paying attention I had no problem  with the state-of-the-art of quipment that they supply I also went to Robinson beach but I did not beach the boat I went to the radar showed 2' and had no problem my family swam we caught fish the great thing about it was the bathroom for my small children was the excellent decision we had a great time rented for a whole day Jack the deckhand did a excellent job in explaining everything and showed great care for my children and safety I would definitely rent from them again no questions asked it was a great experience", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "109699628240724154815", "name": "Rachael Austin", "time": 1562115271737, "rating": 5.0, "text": "Fantastic boat rental company! They are very thorough and make sure your boating needs are met. They provide great customer service and the boats are easy to operate and fully equipped. Will be renting from them again, hopefully soon!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "114453271817809852265", "name": "Steve Vance", "time": 1537674073999, "rating": 5.0, "text": "Great company that truly understands customer service. They went out of their way to ensure our day was trouble free and enjoyable with a very structured introduction to the boat and area. Although, the most important touch was their genuine care for my son who was sick the night before, checking on him even after our boat ride. Class acts.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "106653473675616632123", "name": "Shqne 850", "time": 1563239424662, "rating": 5.0, "text": "Had a great time! Knowledgeable staff, showed us fishing spots and where to go for some good food! Very clean boats. 10/10 I will definitely return!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "114620295721756633515", "name": "Albert Garcia", "time": 1497544438330, "rating": 5.0, "text": "Absolutely Fantastic!!!!\nWe rented a boat yesterday from Orange Beach Boat Rentals, and had the BEST Day ever. Our family of 5, 2 adults and 3 kids spent most of the day at the island swimming and hanging out on the beach, the island was such a fun atmosphere, my kids played with all the other kids, we had a picnic on the beach, and got a nice tan. On our way back in we saw lots of dolphins, they are just amazing to watch, and our on private dolphin show.  Our check in process was super easy, Igor gave us a very detailed orientation and explained to us how to stay safe. The boat was Very nice, it had a full restroom, a nice stereo system, comfortable cushions a canopy to get out of the sun, our motor was super quiet and cranked on the 1st turn, in the past we rented from other companies, and their boats don't even come close to Orange Beach Boat Rentals. We can't wait to come back. We highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "109590816554578942191", "name": "Brenda O’Quinn", "time": 1529795035063, "rating": 5.0, "text": "Best Day Ever!\n\nWe had a Great Day. The boats were very nice. We saw dolphins, went to pirates cove and swam near the islands. The boat was very nice and had a lot of get up and go power. We were a family of 7, with 2 small kids, they napped perfect on the boat, as the back of the boat had a nice canopy and comfortable seat cushions. We couldn’t have asked for a better day on the water. We will be back in a few months and will only rent from Orange Beach Boat Rentals, as they truly are the Best.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "105320767736524840279", "name": "Kelly Robertson", "time": 1526581023468, "rating": 5.0, "text": "Amazing Boat Rental!\nWe rented an 8 hour boat rental yesterday for our family of 5. It was a perfect day. Igor did our orientation he was very nice and answered all of our 150 questions. The boats were very nice and clean, the restroom was such a nice bonus. The shallow water alarm was very helpful of keeping us away from the sandbars.\nWe spent most of the day on Bird Island, and stopped by Pirates Cove on our way back, then finished the day watching all the beautiful dolphins.  We have rented from many companies before and Orange Beach Boat Rentals does it right. We Highly recommend them, and we can’t wait to come back and rent again.\nRobertson Family", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "113592040548256165247", "name": "Emma Whitlock", "time": 1529162184268, "rating": 5.0, "text": "Amazing Boats!\nWe had a Great day on the water. We spent most of the day watching dolphins, swimming, fishing. The boats were perfect, very clean and had lots of extras. We loved having the restroom, the shallow water alarm kept us safe, the islands were beautiful. It was an Anazing day. We can’t wait to go again. I highly recommend Orange Beach Boat Rentals, as they made sure to cover all the details to make our day perfect.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "106665424345273713859", "name": "Timothy Thurnes", "time": 1564068958207, "rating": 5.0, "text": "Friendly and helpful staff. Equipment is clean and in great condition. We really enjoyed the experience.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "114183063742620900243", "name": "Keila Morse", "time": 1601408441212, "rating": 4.0, "text": "It was not very luxurious but they had a small toilet on board.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "118035943494891631236", "name": "Mike", "time": 1527427654172, "rating": 5.0, "text": "These people are top notch. Very nice and informative. We took our 6 year old out and let him catch fish. Captain Egor was busy but still was more than happy to answer any questions we had. He led us right to the fish. You get a map with Fishing spots,restaurants,dolphins and other attractions that’s easy to follow. I will be renting another boat from them next time I come.\nAs far as the prop goes: don’t run it in the sand and you won’t be charged. Pay attention to the channel markers and the gps mapping that is provided on the boat. It only takes common sense. As a boat owner myself I know how expensive props and lower units are so I completely understand there charge for running there boat aground.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "101131062611636075267", "name": "Marylynn Dibble", "time": 1496510908639, "rating": 5.0, "text": "Fun day on the water!!!!\nMy family took a boat out yesterday with Orange Beach Boat Rentals. It was a Awesome experience from the time of booking till the very end. Fantastic boats with a nice Restroom, lots of room. It had a GPS on it with a shallow water alarm which kept me away from the sandbars. We went to pirates cove and had a cheeseburger in paradise, we saw so many dolphins and had the best day of our vacation. Orange Beach Boat Rentals really made us feel welcome, and even gave us some great tips where to take our kids fishing. We have rented from several other companies and this was the Best experience we have ever had, we will defiantly be back. Thank you again, my kids will talk about this day forever now.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "113095909993476827769", "name": "Momma Savannah", "time": 1496281038509, "rating": 5.0, "text": "Awesome day on the water!!!!!  My family absolutely had the best day on the water. The boat was Great, it had a nice canopy so my kids could stay in the shade, a Full RESTROOM, which was so convenient, a stereo system which was awesome while we were parked at the islands, and lots of storage for our stuff. This was not our 1st time out with Orange Beach Boat Rentals, and we will be back again next year, Thanks Again for a Awesome day on the water..", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "111066108640683324583", "name": "Jason Easter", "time": 1496336901150, "rating": 5.0, "text": "The BEST - only rent here!\n\nMy family and I rented a boat for the day & were EXTREMELY impressed!! Such great service, attention to detail, nice clean boats & most of all personal, professional service from a husband & wife team.  They went over in detail with us on how to operate the boat safely, understand the GPS and the shallow water alarm, and even gave us a laminated map with all the local waterfront resturants, fishing spots and where the Islands were. As another reviewer said -they have great reviews for a reason! We felt personally welcome & safe on the boat & they wanted us to enjoy our experience. We saw 24 dolphins- no kidding- all on our own as we cruised the back bay areas. Better than any dolphin cruise we have ever been on- our 2 boys (7 & 9) loved it! We rented some fishing equipment for our boys & it was perfectly prepared and on the boat for us when we arrived. Can't say enough about how impressed we were with Orange Beach Boat Rentals, as we have rented from other companies in the area and we will be back with them on our next trip to Orange Beach.  Call early to reserve as they do book up!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "116325614472174986931", "name": "Brian Handke", "time": 1530217180827, "rating": 5.0, "text": "Awesome!!!\nThat is the only way this company can be described.  They go above and beyond on everything, the boats are great, the GPS is great, the maps are unbelievably detailed, the video explaining everything, Jack then went over everything again and even helped us load and unload the boat.  We rented for 8 hours and ran all the way up to Perdido Key bridge then down to Robinson Island and back and only used $40 in gas.  Got to see a bunch of dolphins, had a blast at \"hermit crab island\" near Holiday Harbor, and had an awesome time at Pirate's Cove, letting the kids swim while we waited on our food.  Really can't say enough good things about these folks, will definitely rent from them again when we come back!!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "103258629579986958208", "name": "Kristy Santa Cruz", "time": 1497538411490, "rating": 5.0, "text": "Awesome Boats! We had so Much Fun!!\n\nMy family of 5 had a wonderful day on the water. The boat was spacious, very clean, and very well equipped with lots of extras, including a Restroom, GPS and large map, it even had a radio with xm radio. Much better than others that I had looked at in the area. I booked online, it was very easy, and they emailed me my confirmation, and directions.  Igor was very friendly, patient, and very informative during our orientation he explained to us how to stay off the sandbars, and gave us some great fishing tips too. We had a great, safe day on the water, we should have applied more sunscreen as we were all having so much fun and forgot.  Will definitely rent from Orange Beach Boat Rentals again. Thank you so much for such a wonderful trip! Our kids can't stop talking about how much fun they had!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "114416386633050404268", "name": "Meagan McClain", "time": 1538781395563, "rating": 5.0, "text": "Thoroughly enjoyed our time on the water, great recommendations with places to eat and where to fish and see dolphins. Pirates cove will definitely be a place that we revisit. We will be using orange beach rentals again.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "110371950577891451870", "name": "Adam Austin", "time": 1468343005091, "rating": 5.0, "text": "I COULDN'T BE HAPPIER WITH THIS TRIP!\nI called to rent a boat for me and the wife to go out for a day! Booking was easy and Captain Igor met us at the boat launch to explain boat safety and great places to explore. Rachael and I spent all day boating! Robinson Island was our fun and the water was so clear that day. We felt like we were in the Bahamas. We explored some of the bay and stopped by Pirates Cove for a drink. We loved seeing the dolphins and the sunset on the way back was beautiful. The boat was clean and in good condition. Overall, very pleased with this trip!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "113286482925029115737", "name": "Cazes Martin", "time": 1526323142609, "rating": 5.0, "text": "Our family rented a boat for the day and had a perfect time. Boat was clean and  comfortable and ran perfectly. Igor and April were very friendly, attentive and professional and were genuinely focused on assuring that we had a nice day. I've been going to the Gulf Shores area for 30 years and had never rented a boat to explore the back waters - we'll have a boat day every year from now on!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "117525525610685395549", "name": "Monica Sands", "time": 1497466961358, "rating": 5.0, "text": "AWESOME! AWESOME! AWESOME!\nWe rented a boat yesterday June 8th, 2017 from Orange Beach Boat Rentals.  Everything was just Amazing, we rented some rods and bait, and they had it ready on the boat when we got there, he showed us on the map where the fish were biting the day prior and gave my son some great fishing tips.  After fishing for a few hours, we did catch and release, we ran into a group of about 15 dolphins, they were so graceful and beautiful, we had our on Private Dolphin Cruise.  We then pulled into Ingram's Bayou, which was easy to find from the map that was provided to us and we swam for a while, then went back out and watched the dolphins some more. Then we pulled up to a secluded beach and found some nice treasures to take back with us \" shells, driftwood etc.\"  It was such a perfect day, and Igor and April was so accommodating, we felt so welcome on their boats, and they really went above and beyond in many ways. There was even a restroom on the boat! The GPS was a huge plus and the shallow water alarm kept us away from the sandbars.  So glad we found Orange Beach boat rentals, we will make this a annual trip now.  Thanks Again so much from the Sands Family!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "116459542144011387819", "name": "Sunshine S.", "time": 1519840301181, "rating": 5.0, "text": "BEST BOAT RENTALS ON THE ISLAND!!!\n\nStarting from the time of booking \"which we did online\" to the emailed instructions & directions to our orientation, then a great day on the water,  up until we unloaded from our day on the water was smooth and enjoyable. We loved the boat, the restroom was a great bonus as well as the gps which made navigation around the shallow areas easy. We spent most of the day at the islands, found some shells, did a little fishing and saw lots of dolphins. We ate lunch at Tacky Jacks, we just pulled right up on the boat and tied up, super convenient. We have been coming to Orange Beach 1-2 times a year for the last 10+ years, and we will Only rent from Orange Beach Boat Rentals from now on.  Great People and Great Boats!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "112783600554682097273", "name": "Dusty Bias", "time": 1473036391569, "rating": 5.0, "text": "I have rented from Orange Beach Boat Rentals multiple times over the years. I have always had the best experience and really felt like we got the best bang for our buck. The boats are reliable, clean, and properly prepared to accommodate the needs of any boater.\n\nThe bays around Orange Beach can be challenging and confusing for someone who has never spent time boating in the area. Orange Beach Boat Rentals does a fantastic job giving a quick and thorough tutorial of the the local waters, preparing you for a fun and safe day boating.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "103700708859532234948", "name": "Katy Marie Heick", "time": 1533572637166, "rating": 5.0, "text": "We recently rented a pontoon boat from Orange Beach Boat Rentals and had a great experience! The reservation, payment, pick up, and drop off processes were easy peasy. Igor and Jack were friendly and definitely knew what they were doing. Would recommend and will be back next time we're in OB!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "110928108998968420847", "name": "David Barajas", "time": 1532454817239, "rating": 5.0, "text": "This operation is phenomenal!! - No rigid fixed time slots, very accommodating and great services!\n\nMy family was in Orange Beach for a USSSA World Series torny and\nmy grandson had a very tight schedule..\n\nI needed to start our day earlier than their normal time, and wanted to use the boat for 6 hours instead of their normal 4.. NO PROBLEM!\n\nWe had a great time out, saw lots of wildlife, birds, dolphins and\nhad a great time fishing.\n\nBoats are clean, easy to handle, and staff is top notch!!\nMade a great addition to our vacation.\n\nIf I'm ever back in this area I will definitely use them again.\n\nThanks to all!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "117054111439049194551", "name": "Ron Thrift", "time": 1468206533386, "rating": 5.0, "text": "HIGHLIGHT OF OUR VACATION !!!\nThank you Igor a April for our smooth experience.\nGreat directions, pleasant boat orientation, clean and reliable boat\nwith a restroom aboard ! Map and GPS were great, XM radio jamming..\nWE LOVED THE BEACHES, PIRATES COVE AND ABUNDANCE OF DOLPHINS ALL AROUND !\nI am so glad that we have booked week in advance before all boats were taken. We will be back next year!\nHighly recommend to any family visiting Orange Beach", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "112796912546378090881", "name": "Tomas Kratochvil", "time": 1527960975589, "rating": 5.0, "text": "Best Boat Rental!!!\n\nNicest boat we have ever rented, it looked like a personál boat and not a normal standard rental. The restroom was a huge bonus. Very comfortable and smooth ride. Igor was very professional and provided us with some local knowledge of where to go and we had a awesome day on the water. I will be reccomending Orange Beach Rentals to all my friends and family. Amazing day.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "107051506088243757108", "name": "Caleb Santa Cruz", "time": 1401216129679, "rating": 5.0, "text": "Very fun atmosphere! The boat was clean and comfortable. Our captain made it a very fun, safe trip and my family and I thoroughly enjoyed it. We will definitely be using A-Pair-A-Dice Charters again and I would recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "109903186994302467553", "name": "Jackie Thurnes", "time": 1563990184913, "rating": 5.0, "text": "Super friendly! Great advice on lunch, fishing and dolphin watching!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "105787092029259373948", "name": "Archie Little", "time": 1556222321200, "rating": 5.0, "text": "Great experience. Enjoyed the day. Nice friendly service.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "104407425253793224600", "name": "Shell Mitchell", "time": 1533148603129, "rating": 5.0, "text": "Amazing Operation! Highly Recommend.\n\nThey run a top notch operation, our boat was Amazing, clean, had a full restroom, lots of other extras and a Yamaha 150hp motor that had some get up and go, these boats are Amazing unlike other rental companies who we have rented from  in the past which had 60hp motors, which were loud and smoked on us the whole time.  We saw 20 + dolphins, were able to visit Pirates Cove and the Flora Bama Yacht club in the same day, such a fun filled day, we can't wait to do it again. We will only rent from Orange Beach Boat Rentals in the future, we highly recommend them. Thank you for truly making our day Amazing.\nThank you- The Mitchells", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "106519802089698495669", "name": "Brandon barenis", "time": 1496771875066, "rating": 5.0, "text": "Had a great time. The boat had very good equipment and was also very clean! There was also a bathroom on board which other rental boats we looked at didn't have.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "105853800751980711110", "name": "Kristy Beard", "time": 1519359853299, "rating": 5.0, "text": "This was our 2nd time renting from Orange Beach Boat Rentals, and it was once again a Great experience. We had such a perfect day on the water we saw lots of dolphins, went over to pirates cove, and we all got way to much sun ;)  We love their boats compared to others we have rented in the area. The restroom is super convenient, the xm radio is great, and loved the power of the 150 hp motor, and the boat rides super smooth. Once again they exceeded our expectations. They also have a great map which makes it easy to navigate. We can't say enough good things about this company, they are truly a pleasure to rent from. We can't wait to rent again and go back out on the beautiful bays of Orange Beach.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "116871293106049204326", "name": "Talk Time", "time": 1469762076930, "rating": 5.0, "text": "We were going to rent a boat, but opted for a private shrimping cruise after talking to April!  Our captain was Matt, and he was amazing!  He was a family man and very knowledgeable about the area as well as the marine life.  We got to see and touch stingrays, flounder, shrimp, catfish, squid, jelly fish, and other fish!  The dolphins swam up close to the boat and sprayed us several times!  The dolphin cruise boats followed our boat for dolphin sightings for about 5 minutes.  We also got to hang out at Pirate's Cove.  It was the highlight of our trip!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "111517579818557492258", "name": "Wendy GODWIN", "time": 1496271961985, "rating": 5.0, "text": "Best Rentals on the Island!\n\nNicest boats we have found and they had power (Yamaha 150hp)  We rented the boat on Memorial Day weekend and went over to Pirates Cove it's a awesome place to visit, then we went over to the islands and the kids played and swam, and we even saw dolphins while we were there. Then we went over to Tacky Jacks on the water, and just pulled in and got out and ate lunch, that was pretty cool.  They meet us on the boat at 9am (our scheduled time to arrive) did our orientation and gave us all the pointers we needed to find the dolphins and the better fishing spots too, and fitted the kids with life vest.  We rented a few rods from him, and he had everything already on the boat when we got there.  So just to sum it up, we went fishing, stopped by pirates cove, hung out at the islands for a couple hours, ate lunch at a waterfront restaurant, saw dolphins, and my kids even napped on the ride back to the marine. We had such a fun day and can't wait to do it again.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "106292412364219471442", "name": "Fabio Soller", "time": 1496303887725, "rating": 5.0, "text": "Awesome Day on the Bay!! We had one day to play while coming to mobile and we chose to rent this boat.. it's not a pontoon but more like a small catamaran  but we had a wonderful time the boat was amazing and it had a bathroom which is a huge plus, and a really nice stereo system..  We rented fishing rods and bait and fished all over the bay.  Everything was in perfect condition and captain Igor was awesome and made sure we had everything we needed . He gave us a map so we could stop and dock the boat and eat at some of the restaurants along the bay ... on our way back in the evening the dolphins were everywhere and they were jumping and playing . We kept our distance and didn't want to disturb them but they were so beautiful to watch ...if you make the trip to robinsons island it's about a 45 min ride and it's usually busy there but it's beautiful and a great swimming area, we had a fantastic day and highly recommend Orange Beach Boat Rentals to all our friends.", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "108008225106401209703", "name": "Kacie Pipkins", "time": 1496010123632, "rating": 1.0, "text": "The boat was very nice. But just like another person said in the reviews if you rent from this company be prepared to pay the extra $75 dollars for prop damage. Me and my family has owned a boat for many years and simply hitting sand one time does not damage the prop. They paint fresh red paint on the bottom of the prop and if any lil bit of paint is gone they are gonna charge you. It's a complete rip off. And just like they did on the last persons review they are gonna come onder my review and try to defend there selves. We saw this review prior to renting from this company and didn't really think any thing of it. But like I said the boat was nice and Yes it has state of the art equipment on it but that still doesn't always prevent you from bumping some sand. So be prepared to pay the extra $75 or just don't stop at any island.", "pics": null, "resp": {"time": 1496838787070, "text": "We are very sorry about your additional cost due to running into the sand.\nThe reason the paint looks shiny and wet is because it’s an Epoxy paint - hardest paint known, which cures with shiny Amino blush film on top.\nMost of our customers do not have issues with bumping into the sand\nalso we only charge the prop fee if damage is medium to severe.\nWe are truly sorry,  Capt. Igor"}, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "100067172426083034271", "name": "Israel Pipkins", "time": 1496029597367, "rating": 1.0, "text": "I was satisfied with the trip up to the point I was informed I would owe an additional 75$ due to the fact I scratched some of the red paint,  that Orange Beach Boat Rentals, had hand painted on the skeg. Which is the fin below the propeller. This is painted solely for the purpose of seeing if this fin has touched sand. Keep in mind, this is hand paint that was painted on moments before rental. Which will come off just by operating this boat. I asked exactly what damage had been done to the prop, and I was told I had damaged the (Stuff) inside the the propeller.  When asked which part? Like, shaft, bearings, gears, or seals! He was confused and only could explain that if the paint was gone the lower unit was damaged! The boat was returned in perfect working condition. But I was still charged an additional 75$. I bought this mistake. There is no need for u to do so as well. Consider someone else for your rental needs or be prepared to pay an additional 75$ God Bless! And safe travels!\nIt is very unfair to assume everyone that rents from you is uneducated in the operation of a boats lower unit. You see I grease my own foot, change my own water pump, and props. I service my own Yamaha outboard. I understand you are used to dealing with those who do not do these things. That's why it's only fair for me to share this to help them out before they do business with you!", "pics": null, "resp": {"time": 1496837651541, "text": "We are very sorry about your additional cost due to running into the sand.\nYes we paint the lower part of the motor so we know if lower unit been digging thru the sand.\nYour statement that we painted it moments before the rental is false. The reason the paint looks shiny and wet is because it’s an Epoxy paint - hardest paint known, which cures with shiny Amino blush film on top.\nYes we brush it on by hand, because spray-paint is 4-5 times thinner. It does not come off at all unless you drag  4000 Lbs boat thru the sand. It’s a lot of wear and tear.\nPrior every departure, there is 15min orientation on video which clearly explain the operation around sandbars,\nthe GPS shallow water alarm and there is a special section informing you if you run into the sand there is a $75 charge. No hidden fees, everything is loud and clear upfront.\nI would like to believe, We have it almost foolproof, There is GPS which color-marks shallower waters less than  6 feet in blue color, Deep water is white color. You go less than 3 feet –alarm sounds.\nWhile cruising sandbars are bright yellow visible from a distance by untrained eye.\n\nWe specifically ask in the video to not beach the boat due to our shallow access. We ask to keep the boat floating in at least 2 feet of water with motor trimmed up.\nI am sorry my helper Stahl was not able properly explain the damage of the Propeller’s  hub.\n(Rubber and composite bushing between the transmission drive shaft and Prop it’s self)\nThis is a sacrificial part to protect $ 2,600 lower unit.  Can’t be seen by eye, it’s inside the prop.\nCost of this Power-tech hub is $ 69.00 plus $ 6.00 shipping, labor 45 min on my end – No charge.\nIf prop shop does it, cost is $ 280.00 .  Damage does not stop here, as the propeller work in the sand the blades loosing the cup. (ability to scoop water and go forward, start just slicing water, Rpm running high and boat does not go fast anymore). Replacement cost $ 630.00\nI am losing more than you  with your damage.\n\nYou present yourself as a motor educated person and trying to help out other people.\nWe thank you. We are honest and we go beyond, our boats are nicest on the island.\n\nCaptain Igor"}, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "118392928070936463169", "name": "Jennifer Hanger-Musson", "time": 1499013063253, "rating": 5.0, "text": "What a great experience.   Igor was awesome and explained everything perfectly!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "103186362846555461845", "name": "Carol Thrift", "time": 1494447720216, "rating": 5.0, "text": "What a fun day on the water. The boat was super nice, had a full restroom, nice stereo system, comfy cushions, it was by far the nicest rental we have ever rented. We went to Pirates Cove and had a bushwacker and a cheeseburger, drove around saw tons of dolphins, then went over to the island and collected seashells and played in the water. It was a pefect day, we will defiently be renting from them again, Highly recommend Orange Beach Boat Rentals!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "111476689596269172722", "name": "Loredana N", "time": 1528762023228, "rating": 1.0, "text": "booked a pontoon when showed up they  told me -its rented out they apologize but they  can give me newer one almost 200$ more then we have agreed . they acknowledge their mistake but wouldn't do anything to fix it .we were  very upset especially kids  ((((", "pics": null, "resp": {"time": 1528982264961, "text": "PLEASE DELETE THIS FALSE REVIEW!!!!  I'm Sorry, but you are mistaken, you have written this review under the wrong company, you may be speaking of OB Watersports, but we are Orange Beach Boat Rentals, we are at the Wharf Marina in Orange Beach, not Tacky Jacks area in which you are speaking of. You are not a customer of ours, or ever spent money with us.  We take payment at the time of booking, there is NO way for us to give your boat to someone else, because you have already paid for it.  Please kindly remove this false review from our company.  If your still in the area we would love the opportunity to serve your family, we promise to give you the Best Customer Service possible."}, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "115734303809125623925", "name": "Jim Paar", "time": 1378303222987, "rating": 5.0, "text": "Great pricing, super clean boats, and love the extra attention to details. Thank you!", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "100060372746565717979", "name": "Alison Sturtz", "time": 1562879891289, "rating": 5.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "106433695436049969067", "name": "Brenda Highfield", "time": 1504150283257, "rating": 5.0, "text": "Great fun on the water clean boat", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "116775641050694950388", "name": "Orange Beach Boat Rentals", "time": 1377185776718, "rating": 5.0, "text": "Great specials for Orange Beach Boat Rentals this Fall #orangebeachboatrental", "pics": null, "resp": null, "gmap_id": "0x889a07b1ee0a0e57:0xd9fd06f174faed2"}
{"user_id": "110327173692805321407", "name": "alberto siller", "time": 1621827411442, "rating": 5.0, "text": "No hassle rental. Boat was in as new condition and very clean. Very easy check in and checkout. Tyler was very friendly and easy to deal with. Very good experience and would definitely recommend this boat to anyone.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOcNHags1GJe9N4QhOm6uPlXGFj3t37rPsTrXFr=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "103530423175040676400", "name": "Eva Lord", "time": 1615757311423, "rating": 5.0, "text": "Thank you to Wahoo Water-sports once again! We had an amazing day on the beautiful brand new pontoon boat we rented for the day in Orange Beach. The owner helped us himself to make sure everything was perfect for our day on the water. He provided a map of the area and made suggestions of where we should go for the day. We will definitely be renting from him again when we come back in July. Thank you!!!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "109412667275359363712", "name": "Cyndi Montgomery", "time": 1617978287517, "rating": 5.0, "text": "We rented two pontoons with a large group and had a great time. The staff were very helpful and communicative. The dolphins were a hit!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "105035732224015728264", "name": "Olga Ascione-Spittle", "time": 1615998444318, "rating": 5.0, "text": "I highly recommend Wahoo Watersports. Brooks who is the owner was so accommodating and had great recommendations for us too. He has beautiful new clean pontoons. We will be back!!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "116839353068875582094", "name": "Mike Rogers", "time": 1512508496740, "rating": 5.0, "text": "On Tuesday before Thanksgiving I called Wahoo and requested a Pontoon Boat for my family to tool around the Bay for the afternoon. I had called several other places but they were either booked, didn't sound interested at all, or were very rude. Brooks at Wahoo talked to us like a personal friend, fixed us up with a brand new pontoon and treated us like royalty when we arrived. We loved the boat. It was so nice and roomy and we just had the most incredible time. We took food aboard, fished a little, spent time looking at all the porpoises following us and came in about 5 p.m. with the joy of an incredible family time together.  My daughter replied, \"Best day ever, Dad!!!\" Such a special thanks is in order to Brooks who made this day so special for us.  Forget about all the other places that promise you the moon.  Ole Brooks delivered!! We will be back next year and the first place we will call to book our boat will be Wahoo Watersports. Did I mention that it was incredible?  Well, it was!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOv3qCgCPbTxM9DRy7KmTQ82SldRSDM4bi5Jvlq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPKxc5pd_iFByBEuBZevQ4oHyDAkErsM-jm1kLh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOc4RcuiL5H1tnq-nzOjvloGB4MKbEqgcXmvgeJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNV3duHBJVlHLZO1ajHQ9FDZrYZZ0eUbgCewkm9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNFqtCLszDp0fw0qVE-c3FvfKuI-z6TogOvEusG=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNLFO9Lw2cRNLN7v5Yh5m7ggWqjFi1JWZbsJ1Q7=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNy3XZbjDPofsjUAAAxssbt_Zpsltve6_8cKQQp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNd8lUHzX4CSLgdugn4bGqrOR5qWS7gdU4NYC6K=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "107762942233474332508", "name": "Kathy Coleman", "time": 1592856873687, "rating": 5.0, "text": "I called on a Tuesday afternoon and was able to rent a pontoon for a Thursday afternoon for 4 hours.  When we arrived they were ready for us and quickly took care of the business side then showed us how the boat worked, filled up the gas tank and got us on our way.  Boat was spacious and comfortable and we had a great time!  We asked for recommendations on what to see and they were very helpful.  Price was very reasonable and fuel was included which was helpful in knowing our final price!  Both employees were very nice and we are ready to go back next year on our vacation!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "113830695107305061489", "name": "Shaun Ek", "time": 1593617801063, "rating": 3.0, "text": "This is a nice little rental shop and overall I thought it was great. They took my reservation over the phone with no hassle, and even with only one day notice I was happy they had availability. They gave simple training and were friendly. The only thing I didn't like was that it takes almost 15 minutes from their beach to get out of the no wake zone, so that is a really significant chunk of time going super duper slow, so be aware of this if you plan to rent a wave runner for only one hour, you'll only have a bit over 30 minutes of actual fun time on the water.", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "104600621235391908832", "name": "Mark Austin", "time": 1594827314834, "rating": 5.0, "text": "Had a great time with my wife, son and a few buddies. Very relaxing ride out to the gulf. The Captain and crew were very friendly and made sure we were taken care of. Fish on! We took back several fish and cooked up a small feast. Very delicious. Great time with the family.", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "109273706176531952132", "name": "breanne ballard", "time": 1592051452308, "rating": 5.0, "text": "We rented jet skis for or first time through this company. We loved every minute of it! They explained everything thoroughly from how to use the skis to the map. Great prices and the guys helping us were great. Will definitely be going back!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "104458362032868116764", "name": "Chad Hinders", "time": 1593468949597, "rating": 5.0, "text": "I called on Monday and was able to reserve a pontoon for the next Sunday. The boat was ready to go and worked perfect for my family. The location is easy to get to and has easy access to great boating spots. Will be going back for our next rental!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "117708356280930367216", "name": "Heidi Vallee", "time": 1587941521610, "rating": 5.0, "text": "Brooks was helpful and easy to work with. Great experience touring the bay. Reasonable rate that included gas. Boat was ready right away- walk right up and we were off. Thank you!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "115320887907448602728", "name": "Jennifer Madere", "time": 1594417044411, "rating": 1.0, "text": "I can’t really say how the place was because the day before our rental we received a phone call that they have to cancel our reservation. I asked if they could assist with locating another place for us since we were out-of-towners. I received a call back about an hour later saying the rental was back on. We were very excited to get that call. The next day, morning of, on our way to the place we received another call saying our reservation was again cancelled. Just enough to ruin what we figured would be the highlight of our family trip. Very disappointed :(", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "112856815703388139094", "name": "Caitlin Marie", "time": 1562525417719, "rating": 5.0, "text": "Super great service - called about a week before the 4th of July and they were able to rent us a pontoon boat. Nothing majorly fancy but it wasn’t janky either. It was perfect. Very friendly staff. We brought our super well bagged dog on board. It was such a fun time. We will definitely be using their services again in the future when we visit our favorite spot in Alabama.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMZeeU5OprBTQkEyzl8o3suvQxtuHZqsBhygPNL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOlF639rltsEOv68juFUHyQB_vn5IV2inLkINz9=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "106171913395351703030", "name": "Leigh Anne Bennett", "time": 1592159407369, "rating": 5.0, "text": "Great prices and spectacular boat ride!!! Staff was friendly and helpful! A wonderful day on the Bay!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "102160037362667261186", "name": "Bill Shumate", "time": 1590273551627, "rating": 5.0, "text": "I had so much fun with our pontoon boat.  Reasonable rate and awesome deals on jet skis.", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "108187712307499248005", "name": "Carl Streeval", "time": 1561071062022, "rating": 5.0, "text": "This place is the one you want to rent from. Prices are the cheapest in the area, and the minimum time (1.5hrs) which turned to 2hrs is longer then everywhere else.\nThe staff are very helpful, I was able to call them several times while out on the water for directions and questions. Also the jet skis are very fast. You wont be dissatisfied with your rental or experience. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "106346912327195633289", "name": "Anthony S", "time": 1561675294762, "rating": 5.0, "text": "We had a great day with our boat rental from Wahoo. Very helpful and friendly staff and good prices in comparison with the area, especially since fuel is included in the price so there's no guessing game at the end. I would highly recommend them to anyone looking to rent a boat.", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "107544883889673261059", "name": "Chris Oubre", "time": 1551569564760, "rating": 5.0, "text": "Great owner. We had such a fun time. This owner went the extra mile, helping us with navigation and fishing spot locations. He even looked over our bait and gave us more appropriate lures.  This is the only place that I will ever rent a boat from again when I’m in Orange Beach.", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "106815732135981057406", "name": "Kelly Gomez", "time": 1564687039245, "rating": 5.0, "text": "We had a great time on our pontoon boat rental! We loved that we were able to bring our own fishing gear and head out on our own adventure exploring the waters! We will definitely be back on our next trip to the beach!!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "116724971979697479888", "name": "Tristin Miller", "time": 1561764086109, "rating": 5.0, "text": "Very good staff and the jet skis were well maintained.   Fair priced and personable.  Will definitely be back and recommend to others", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "108858053109687816108", "name": "Jason Hitt", "time": 1557356236215, "rating": 5.0, "text": "Great experience with Wahoo Watersports!! Brooks was extremely friendly and streamlined  in setting up our rental. And Tyler gets you in and out with a great personality! Awesome rates and they cover the gas which is an awesome perk!!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "102260908484149793450", "name": "Michael Bearden", "time": 1556567083949, "rating": 5.0, "text": "Best customer service experience I have had in the area! Great watercraft and flexible scheduling! They really go above and beyond to make sure you have the best experience possible. Ask for Tyler!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "109706209225800493108", "name": "Shelby C", "time": 1521390922557, "rating": 5.0, "text": "Love them dolphin cruise guarantee to see dolphins more than one well worth it me and my family loved it very good price. The captain let them Drive the boat!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNEM3vhGi65oNZMK5vISzFxyRQTfyNh78s3dlDR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNMsY6Db_X01yratko6De67Fv8KwWzXABQMpHRm=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "114480296036743410655", "name": "Jeannie Darnell", "time": 1526595363528, "rating": 5.0, "text": "We had a great time. Capt. Brooks is the best. He had us on fish in no time. The boat was nice, clean, and well maintained. We will definitely book with him again. Highly recommend him!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "107728944841355383755", "name": "Ike Chimbandi", "time": 1575154122685, "rating": 5.0, "text": "We rented a pontoon boat. Great price & extremely friendly service. We will be back, Thank you!!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "118397571603156689449", "name": "T. Keith Hollis", "time": 1562139820184, "rating": 5.0, "text": "Great service, great pontoon. Very helpful folks. No hassle rental. Highest recommendation.", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "105308070240528862261", "name": "Dennis Morgan", "time": 1503557038268, "rating": 5.0, "text": "Great customer service and delivered exactly what we needed.  Rented a 24' pontoon boat for four hours and was the best price and clean boat.  Family had a blast!  Will definitely do business with them again.  Thanks for a great experience the Morgan family.", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "105514357316332476212", "name": "Nicholas Grafe", "time": 1466711668016, "rating": 5.0, "text": "We had a party of 6 including an 8 year old and did the 2 hour dolphin tour. It was an incredible experience. The tour guide was super helpful with every step of the process. The employees are very customer service oriented. I highly recommend Wahoo Watersports to everyone! We will be back!", "pics": null, "resp": {"time": 1466750062561, "text": "Thank you so much for taking your time to let us know! Our team at Wahoo Watersports continues to do our best to provide a safe, fun and enjoyable experience for our guests. Let us know ahead of time and we will do our best to accommodate, we look forward to having y'all back!"}, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "104531257437835410898", "name": "Jeremy Witherspoon", "time": 1539294269089, "rating": 5.0, "text": "Great to do business with. Super friendly and considerate. Highly recommend for anyone wanting to do jet skis or anything else they offer. Tyler was super polite.", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "113787307039604595426", "name": "Rose Chikiar", "time": 1505416837908, "rating": 5.0, "text": "This is an unforgettable experience. Forget using any other companies this one is the best! Tyler was a very knowledgeable and instructive guide. We saw dolphins, jelly fish, sting rays, and an eagle. You have to do the jet ski tour with these guys, worth every penny.", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "118139129305438665905", "name": "Kris Horning", "time": 1563768376488, "rating": 5.0, "text": "We rented a pontoon boat and they were great!  Good price and super cool on timing of the return.", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "114848367468736607954", "name": "Zachary Marsh", "time": 1530123126417, "rating": 5.0, "text": "If you are looking to rent jet skis, this is the place to do it! I checked out the other places in the area and none of them had better prices for the experience you get. ZERO no-wake zones to waste your time like the other places. Great military discount/incentives too!!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "103204508440775991245", "name": "Samantha Wilkinson", "time": 1560544998330, "rating": 4.0, "text": "I will totally be renting from them again they are great....very down to earth people....kind as well....the boat ride was amazing....had a lot of fun", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "117254596661315497008", "name": "Carolynn Gaylord", "time": 1510595312971, "rating": 5.0, "text": "We had such a great time fishing with Captain Brooks & Will!  We caught a good bit of fish, the King Mackeral were biting!  Some boats were fishing we were catching!! Captain Brooks is a 3rd generation fisherman & knows how to put you on the bite!  Thank you Captain Brooks & Will!  I highly recommend you look him up when you are in Orange Beach!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "112344947411326526684", "name": "Michaela May", "time": 1535122842543, "rating": 5.0, "text": "Had a wonderful time doing the Jet Ski Dolphim tours. Our host Tyler was a hoot, took us around to all the hot spots. We visited sculptures submerged in water, pirate coves, a nest of a bald eagle, 3 different pods of dolphins and had 3 hours of ecstatic fun. All of us in our party fell in but it was a great time and we were all laughing and smiling the whole time. Would one hundred percent recommend, but get your sunscreen on! You also will be sore the next day in your legs so keep that in mind, just a factor of using muscles you dont normally. A fantastic time!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "102908584758280572481", "name": "Jennifer Cotton", "time": 1500437597096, "rating": 5.0, "text": "We had an awesome experience with Wahoo today. The boat was very nice, well maintained and the people were VERY PERSONABLE. Excellent customer service and warmth... what more can you ask for!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "117210041051601334951", "name": "Chad Tucker", "time": 1468606950572, "rating": 5.0, "text": "We had a party of 6 and rented 3 jet skis. The guide was very knowledgable and helpful. The 2+ hour dolphin tour was absolutely awesome and extremely high value. I would highly recommend this company to anyone who loves having too much fun. Thanks guys for the wonderful experience.", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "100887955573011012913", "name": "Chris Cash", "time": 1597434090238, "rating": 5.0, "text": "Had a blast!!! Can't wait to go again!!!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "108615704427995407466", "name": "Mike Sabin", "time": 1510355168262, "rating": 5.0, "text": "Captain Brooks was a great!  His boat, Dark Thirty, was a trusty old gal. We were a party of 4 from Ohio and this was our first deep sea trip in the Gulf. We were here in November, off season, but caught 4 nice Bull Redfisf and 4 King Mackeral.  Loved it.  Great service.  First mate, Will, did a great job of rigging our poles and putting us on the fish. All in all, we highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "105028291517872365705", "name": "Patrick", "time": 1498667790537, "rating": 5.0, "text": "We went on a dolphin tour with Patrick as our tour guide! It was an absolute blast!! I'm going to recommend this to family and friends! We saw so many dolphins. Patrick was able to get us right on top of them and gave us an amplatude of options while we were out there!! I definitely will be coming back every year!!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "103602732273231651668", "name": "Andrew Trefny", "time": 1533317918937, "rating": 5.0, "text": "Brooks and Jason are awesome. Don't go out when it's choppy waters. These dudes seriously know what they're doing though. Support the locals for sure.", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "108525648983492841245", "name": "Alex Mounsey", "time": 1527739189875, "rating": 5.0, "text": "I've rented at a couple places the past few years, and this is by far the best. Great wave runners and great hospitality.", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "117751884503873687719", "name": "Joey Roberto", "time": 1504448462569, "rating": 5.0, "text": "Nicest pontoon boat I've ever rented!  Looks and runs brand new.  Great customer service!  Renting again from them today.", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "110690225256291806939", "name": "Charlie Gonzales", "time": 1525185475869, "rating": 5.0, "text": "The best rentals we've found around Perdido. We rented a pontoon boat for 4 hrs and went out to the sand bars. The whole party had a great time.  Our boat was very clean and had Bluetooth radio.", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "102696302784409641414", "name": "Brayden Grimsley", "time": 1533312323793, "rating": 5.0, "text": "Rented jet skis from here and loved it! Fair pricing, great staff, and a decent sized area to ride in", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "117648027117728049090", "name": "David Belser", "time": 1500241136685, "rating": 5.0, "text": "Excellent equipment and very nice guys to deal with.  They had the better looking pontoon boats of all the other places.", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "118033026397720391263", "name": "Redmond Wilkerson", "time": 1458084284542, "rating": 5.0, "text": "Unparalleled hospitality. We called them out of no where to book a fishing charter and didn't know what to do after and they called a taxi for us and gave us hotel recommendations that were perfect. We didn't catch any fish but was worth the experience itself.", "pics": null, "resp": {"time": 1459211092545, "text": "Thank you so much, we enjoyed having y'all!"}, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "115887568983987238875", "name": "Chickie Martin", "time": 1565369107353, "rating": 1.0, "text": "We have rented here in past years, but NEVER again....the pontoons were in deplorable condition, no one was on the premises when we arrived at our reserved time...someone arrived 20 minutes later !\nOver the day fee of $450., we were charged more fees,.!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "101404108663232320735", "name": "Billy Brooks", "time": 1526501221889, "rating": 5.0, "text": "Great experience! Great equipment? Great service! Nice staff!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "111332575293455204422", "name": "Lee “CHILLEDxFIGHTER” Wells", "time": 1567281203379, "rating": 5.0, "text": "Great, helpful, and great prices", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "110855390192927846541", "name": "Nikki Mutschler", "time": 1466721147412, "rating": 1.0, "text": "I would give no stars if it was possible. We rented a pontoon boat and 4 jet skis. 15 mins into our rental time one of the jet skis wasn't working. We had to tow it back to the rental place. Waited for 20 mins and no one was there. Asked for refund and owner refused to give refund!!!!", "pics": null, "resp": {"time": 1466749777739, "text": "Hi NIkki,\n\nWe apologize for the inconvenience during your time with us. Yes, unfortunately, even the new 2015 jet skis have unforsseen issues that arise. We offered one of our functional jet skis to make up for the unfortunate situation, and you chose to decline.  As a business, we would lose money if we issued full refunds when working replacement equipment is available. Again, we are very sorry that you didn't enjoy your experience with us."}, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "103048723229405804450", "name": "Tyler Jones", "time": 1501432647925, "rating": 5.0, "text": "Hand an amazing time renting our jet skis from wahoo watersports! We rented 4 skis for the hour rental and we had such a good time we decided to go do one of the jet skis dolphin tours with pattrick and had a wonderful time we got to see dolphins and play around a bunch!! It was an awesome experience and I would highly recommend them as a family fun destination.", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "109283617737948130357", "name": "Garrett Orange", "time": 1527110674298, "rating": 5.0, "text": "If looking to go out on the water this is your place to go very affordable and friendly staff", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "112171092612467431851", "name": "Shane Williams", "time": 1466985197446, "rating": 1.0, "text": "They don't have a negative star; otherwise I would use it. Their equipment is old and outdated. Who knows if its even sea worthy.  Their equipment breaks down and they will not refund you. We had to drag a jet ski that stopped working just as soon as we left the marina... We were unable to get in touch with anyone other than the employee who sent us out on the unit. He assured us that instead of sending another ski that they would refund us for one of the units...The owner was disrespectful and very unprofessional! Do not use this company! Im posting to all my friends to warn all of their friends!", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "114535983373880651294", "name": "Clifford Hepler", "time": 1466884234798, "rating": 1.0, "text": "If only 0 stars was an option. Pulled up at roughly 2:15 for the 2:30 dolphin tour. Chose wahoo over dolphins because of the interaction with the dolphins. When we arrived, about 4 ppl were outside. We parked, and the ppl had disappearef. Nobody in the building. Still no appearance by 2:30 so we left. Really would love to know how a business makes money when they cannot have sales due to no personnel around", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "102062798179342287465", "name": "Angie McCurley", "time": 1424036789733, "rating": 5.0, "text": "Loved the dolphin tour and the guide knowledge of area and wildlife.", "pics": null, "resp": null, "gmap_id": "0x8890a849c9f808db:0x324d429726aad788"}
{"user_id": "111706600655394390217", "name": "Michael Keene", "time": 1431996778760, "rating": 5.0, "text": "Our experience was top notch. Our paddle boards were brought right to our location on the lagoon which was super convenient. The gear was in new condition and great quality. Scott, the owner, showed up right on time and helped us out to get started since we were complete newbies. Great instruction. Also gave us some great tips on good locations. We saw so much wildlife in such a short time. Thumbs Up!", "pics": null, "resp": {"time": 1451409474274, "text": "We are delighted you enjoyed your paddle boards! Come again!"}, "gmap_id": "0x889a05bb812c456f:0xf5339ff209557445"}
{"user_id": "102889925360210350400", "name": "Alex Toler", "time": 1499368816467, "rating": 5.0, "text": "I have had the pleasure of going on the cruise and renting paddle boards multiple times.  Scott has always been a great captain and teacher.  I highly recommend his services when you're down in Gulf Shores.", "pics": null, "resp": {"time": 1499881261076, "text": "Thank you so much for the kind words, Alex! Glad you have enjoyed your experience with us and look forward to seeing you and your family again soon."}, "gmap_id": "0x889a05bb812c456f:0xf5339ff209557445"}
{"user_id": "107983002225513339041", "name": "Hannah Sherertz", "time": 1486737872260, "rating": 5.0, "text": "Our experience in Gulf Shores and with Gulf Shores Boat and Paddlesports Rental was awesome! Scott provided pleasant and quick service for all of our groups needs.  He also gave us some great tips on what else to do in the area throughout our stay! We definitely will make Gulf Shores Boat and Paddlesports Rental part of our annual visits.", "pics": null, "resp": {"time": 1486742827820, "text": "Thank you, Hannah! We are so pleased that you enjoyed your experience. We look forward to seeing you again soon."}, "gmap_id": "0x889a05bb812c456f:0xf5339ff209557445"}
{"user_id": "117728982895070170488", "name": "Mark Roberts", "time": 1486940651321, "rating": 5.0, "text": "Our family had a wonderful sunset cruise with Gulf Shores B & P.  Capt. Scott  was  accommodating to our group (our disabled child needed some extra assistance)  and timed our outing perfectly to catch the beautiful sunset as we watched for dolphins.  The boat was well maintained and I felt safe taking the family out.  We will definitely be going back.", "pics": null, "resp": {"time": 1487082635548, "text": "Thank you so much for taking the time to share your experience with our service, Mark. We hope to see you and your family in Gulf Shores again soon."}, "gmap_id": "0x889a05bb812c456f:0xf5339ff209557445"}
{"user_id": "102856857285322860979", "name": "Grant Bolding", "time": 1501798846912, "rating": 5.0, "text": "Really great customer service! Scott was awesome and worked with me when we had inclement weather during our kayak rental. I will definitely use them again when I come back to Orange Beach.", "pics": null, "resp": {"time": 1531398570882, "text": "Thank you, Grant. We always want our customers to have the best time possible. Look forward to seeing you again soon!"}, "gmap_id": "0x889a05bb812c456f:0xf5339ff209557445"}
{"user_id": "103813137902377377521", "name": "Maggie tibbetts", "time": 1494871018608, "rating": 5.0, "text": "We had a great time with these boards! We wanted to go paddle boarding and I found Scott on google and texted him. We had the boards delivered the next morning. They were so easy to use and Scott was very friendly and prompt. Amazing experience for the cost. We vacation every year in Gulf Shores and I will be renting from Scott again in the future.", "pics": null, "resp": {"time": 1495728210351, "text": "Maggie - thank you so much for making us a part of your vacation. So glad you enjoyed your experience and hope to see you again soon! - Gulf Shores Boat and Paddlesports"}, "gmap_id": "0x889a05bb812c456f:0xf5339ff209557445"}
{"user_id": "105328882134115222704", "name": "Reade Mitchell", "time": 1487045713323, "rating": 5.0, "text": "Gorgeous Sunset Cruise!   Capt. Scott gave us the perfect way to cap off a full day in Gulf Shores.  The service & the scenery were fantastic.  Definitely will be back again & recommend you do the same!", "pics": null, "resp": {"time": 1487082543494, "text": "Reade, I remember the cruise we had with you and Carla that evening. It was indeed spectacular that night. We are so happy you enjoyed your experience and hope to see you both again soon."}, "gmap_id": "0x889a05bb812c456f:0xf5339ff209557445"}
{"user_id": "113383429332150400442", "name": "Blackhawkbaker Ashby", "time": 1486930852977, "rating": 5.0, "text": "As a Service Member, R&R is at a premium, and Scott really treated My Family to a top class experience. His gear is all new, and ready to use, unlike other rental spots that aren't willing to upgrade equipment when it's needed. I'd recommend Gulf Shores Boat and Paddleboard Rental to rookies or regulars that demand the best. Thanks Brother!", "pics": null, "resp": {"time": 1487082760586, "text": "Thank you for the kind review! We do work hard to make sure our gear is in excellent condition and that our guests have the best experience possible. Thank you for your service to our great country, as well. Hope to see you back in Gulf Shores soon."}, "gmap_id": "0x889a05bb812c456f:0xf5339ff209557445"}
{"user_id": "118365055532208817555", "name": "Latosha Moore", "time": 1623605561316, "rating": 3.0, "text": "Rental was good other than slide coming detached and we couldn't move it back to reattach it because the water all over it made it to where we couldn't move it back, so we only got to play on one slide. The ice machine was ok, ice shavings went everywhere instead of one particular area and the 2 guys moved the ice machine from where we had placed it and luckily my mother seen it or else my brother would've ran it over the next morning heading to work.", "pics": null, "resp": {"time": 1623683115703, "text": "Thank you so much for your review and we are so sorry about the problems you mentioned. We will be in touch shortly with you."}, "gmap_id": "0x88882af3cef64387:0xb8dfbd25a9205fa4"}
{"user_id": "111300365265238738341", "name": "Katie Anderton", "time": 1618239142316, "rating": 5.0, "text": "You get plenty of hours for your money. Delivery, set up, and take down was on time. My kids love the slides!", "pics": null, "resp": {"time": 1618239834769, "text": "Thank you so much for your review! We truly appreciate your kind words!"}, "gmap_id": "0x88882af3cef64387:0xb8dfbd25a9205fa4"}
{"user_id": "106957218046433656535", "name": "Brandon Reeves", "time": 1611869524365, "rating": 5.0, "text": "Showed up on time for delivery and pickup. Very courteous. The kids enjoyed every minute of it.  We will use them again.", "pics": null, "resp": {"time": 1612131493649, "text": "Thank you so much for your review! We appreciate it!"}, "gmap_id": "0x88882af3cef64387:0xb8dfbd25a9205fa4"}
{"user_id": "105647222550266284150", "name": "Ashley Walker", "time": 1620053323445, "rating": 5.0, "text": "Showed up early for set up. All of the kids enjoyed it!", "pics": null, "resp": {"time": 1623683000383, "text": "Thank you for the review"}, "gmap_id": "0x88882af3cef64387:0xb8dfbd25a9205fa4"}
{"user_id": "101344926970491723392", "name": "Donna Young", "time": 1604358872285, "rating": 5.0, "text": "I have rented from Just Add Kidz three times. Every single experience has been a great one. I would highly recommend them! Great customer service!!!", "pics": null, "resp": {"time": 1604633467258, "text": "Thanks for the kind words Mrs Young!"}, "gmap_id": "0x88882af3cef64387:0xb8dfbd25a9205fa4"}
{"user_id": "111747128435121291476", "name": "Amber Ellis", "time": 1595951538991, "rating": 5.0, "text": "Wonderful experience!  They stayed in contact throughout the whole process. The kids had a blast! Thank you Just Add Kidz! We will definitely be renting again!", "pics": null, "resp": {"time": 1596145288505, "text": "Thank you for for the review!"}, "gmap_id": "0x88882af3cef64387:0xb8dfbd25a9205fa4"}
{"user_id": "106343724571639997758", "name": "Deborah Brown", "time": 1604973080807, "rating": 5.0, "text": "I would use them again, they will do whatever it takes to satisfy the customer.", "pics": null, "resp": {"time": 1618241633302, "text": "Thank you so much for the good review!"}, "gmap_id": "0x88882af3cef64387:0xb8dfbd25a9205fa4"}
{"user_id": "103044791299950507616", "name": "Christina Standefer", "time": 1596033315808, "rating": 5.0, "text": "Love this place if u havent booked with them U should they are sweet friendly people the people I booked with on the phone and the guys that came out to my house to set it up for me they are very friendly and nice and go out of the way to help u. I have recommend this place to all my friends and family and all my neighbors that asked where did u rent that...", "pics": null, "resp": {"time": 1596038340759, "text": "Thanks so much for the kind words Christina! 😁"}, "gmap_id": "0x88882af3cef64387:0xb8dfbd25a9205fa4"}
