{"user_id": "102360768626742717055", "name": "C A", "time": 1612263834647, "rating": 5.0, "text": "Perfect hideaway for pitching a hammock and enjoying the beautiful surroundings and fresh air....while sipping on a bottle filled from the spring ✔️\nOn my list of best places to 'reset'🌎🌏🌍", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPPxCx0wbAPxE-1qeVvHLMkxCAsC_Yml5br9r9w=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOK6MQ0AbJOjDyK2yHfF49giO_8h3XxIGkZoFwX=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215d5d375d4e9:0x13ed8f12b916405d"}
{"user_id": "109693900654323066503", "name": "Eric Konecny", "time": 1594566327797, "rating": 5.0, "text": "The BEST TASTING SPRING IN MADISON COUNTY!!!!\nI feel the best for weeks everytime after I drink from this spring!!!\nTake a couple of empty water bottles and see for yourself!\nHealthy life begins with healthy water", "pics": null, "resp": null, "gmap_id": "0x886215d5d375d4e9:0x13ed8f12b916405d"}
{"user_id": "106238862246323638706", "name": "Bree k", "time": 1559405799389, "rating": 5.0, "text": "The best tasting water you will ever find and very much Worth the time to take to find it.\nBeautiful surroundings that complement the springs namesake", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNxo_FVtCCLUt_kAwz9VDritsxuVcpE54amPKE=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886215d5d375d4e9:0x13ed8f12b916405d"}
{"user_id": "106742945173025001756", "name": "Doug House", "time": 1628116179171, "rating": 5.0, "text": "Prompt response to a question after the sale.", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "109809022298193252271", "name": "Tamara Fox", "time": 1613505510301, "rating": 5.0, "text": "Great company to work with! Their customer service is outstanding and I love my Kinetico water softener and reverse osmosis drinking water!", "pics": null, "resp": {"time": 1625675826254, "text": "We are so excited to hear that you love your Kinetico water softener and reverse osmosis drinking water! We appreciate your business."}, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "100671342309940644905", "name": "Blanca Perez", "time": 1614801110047, "rating": 5.0, "text": "Austin was very professional and knowledgeable.  Very happy with his help.", "pics": null, "resp": {"time": 1625675607268, "text": "Blanca, It's great to hear you had a five-star experience working with Austin. Thank you for your honest review."}, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "102226105211668546967", "name": "Sharon Mattox", "time": 1591058091781, "rating": 5.0, "text": "Very nice young man, seemed genuinely concerned and made sure the issue was completely taken care of. We’ve been Aon customers for several years and the service has always been excellent! Every home needs this product. In addition to our whole house system we have the drinking water in our kitchen. Be careful it  will make you a “water snob”.⚠️⚠️", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "101780019724495496442", "name": "Grant Wince", "time": 1603114538869, "rating": 5.0, "text": "We received a great product in the Kinetico Water softening system and RO drinking water systems that we had installed recently by Austin. We appreciated the great communication and the efficient and friendly service that was provided and would recommend AON to anyone who wants a better experience with their water for the family.", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "105404712246020945065", "name": "Rampage", "time": 1591385713424, "rating": 5.0, "text": "Long and dependable service. They won’t sell you a system and forget about you. I’ve used them for six years with no issue. Have a whole house filter, water softener and a 24” UV light from them. I never have to ask them for a filter and they show up every year to maintain my system.", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "112425252914390455311", "name": "Kayleen Ridgeway", "time": 1597070498402, "rating": 5.0, "text": "Aon water technology was very friendly both on the phone and at service. We have a kinetico water softener and a K5 RO. The serviceman was very knowledgeable and polite. I highly recommend them for anyone that is looking for a water softener and Reverse osmosis system.", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "114133960191864760254", "name": "Patrick Dierks", "time": 1585611186235, "rating": 5.0, "text": "Anyone can sell water softener systems.   I chose AON over their competition, not because their system was far superior to others, but rather for the simple reason they went to great lengths to explain how the system would be installed.\n\nAlso understanding that they are a plumbing business first, and a water softener supplier second, gave me the reassurance the job would be done right and to my complete satisfaction.   Not only has the system perform flawlessly, I also killed two birds with one stone when they installed the loop system with my exterior main water line.  They were able to remove a \"frozen/corroded \" flow valve outside and replace it with a ball valve, mounted on the inside of the house, which sits right next to my system for easy access.\n\nI'm hoping this review helps other folks that are stratling the fence.  Randy and his installation crew are top notch.", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "105861044733838438271", "name": "Harley Charley", "time": 1531684531961, "rating": 5.0, "text": "The best water technology company in the Tennessee Valley.  They installed my Kinetco Water Treatment System, which includes a Drinking Water Purification System as well.  I scheduled an annual visit by one of their technicians once a year to test the system and change all filters.  The system works flawlessly.  Great system, company, and customer support.", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "105669673542844289139", "name": "Loftin Shanda", "time": 1531436312216, "rating": 5.0, "text": "Tech and sales associates were extremely courteous and informative as I consider replacing 15 yr+ softener system in my recently purchased home. They weren’t pushy but willing to answer all my questions regarding costs, benifits and routine maintenance requirements. Look forward to dealing with them In the future. Thank you, again, for your service call.", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "107192252935544690813", "name": "Bonnie Whitt", "time": 1530744131647, "rating": 5.0, "text": "Aon Water Technolgy gets FIVE stars! I plan to use them again in our next house! Very professional and highly knowledgeable. I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "110339241582014044679", "name": "CocoaBarnett", "time": 1588272958208, "rating": 5.0, "text": "Great experience!  Thank you!", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "111929386702564565565", "name": "Sonny Batchelor", "time": 1593085369343, "rating": 5.0, "text": "Tim did a good job of servicing my equipment. He explained to me what they were doing and what they were test.", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "100835052199882337819", "name": "James Guillemette", "time": 1530737701744, "rating": 4.0, "text": "I've been a customer for approx. 2 years now.  Overall, very good product and I'm happy with the product.  Customer service is sometimes excellent and sometimes poor.\n\nPro: AON's water softener is a very good product.  They bent over backwards to send a guy over to defrost my outside pipes in the middle of a Winter freeze!\n\nCon:  The whole-house water softener developed a leak after 18 months and the top part of the valve unit had a recall and required service.  They were not able to schedule the repair for nearly a month due to company manpower issues.  Parts were covered but labor was not.  AON charged more per hour than my local HVAC and autobody shops at $112 per hour.  Their service techs did a good job repairing my softener, but broke all the pipe half clamps that secure the pipes to the wall, and did not replace them.  ($2.50 worth of clamps - should have replaced them)!", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "105458529161161249670", "name": "Amy Word", "time": 1531782660444, "rating": 5.0, "text": "Great customer service! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "100955586845734275562", "name": "Stephen Kornoelje", "time": 1550843570266, "rating": 5.0, "text": "Service is always prompt and thorough. Thanks for the help as always!", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "113643698442938204409", "name": "David Bumgardner", "time": 1620418111946, "rating": 5.0, "text": "Good people, good products", "pics": null, "resp": {"time": 1625675362510, "text": "David, Glad you hear you like our products! We appreciate your business."}, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "101336437922894676690", "name": "Keith Jones", "time": 1551818914187, "rating": 5.0, "text": "Prompt friendly service", "pics": null, "resp": null, "gmap_id": "0x88626c91d840bec9:0xd90edadc72172ece"}
{"user_id": "101830776166903575991", "name": "Tom Sigg", "time": 1627395167164, "rating": 5.0, "text": "Fast unload load time. Took only an hour.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "109959898700032897135", "name": "David Riddle", "time": 1621358621741, "rating": 1.0, "text": "Requested water delivery and received the following email.\n\nYour delivery request has been received. Someone will contact you shortly.\n\nThank you!\nThe Crystal Mountain Water Team\n\n27 days later and no response.", "pics": null, "resp": {"time": 1621434945341, "text": "Hey David,\nThank you for bringing to our attention that we have a problem with that feature on our website!  We would love to have your business please give us a call at 256-922-1114 or H2Oinfo@crystalmtnwater.com"}, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "113043117462598329929", "name": "R Trev", "time": 1615235631066, "rating": 4.0, "text": "After having many problems with Crystal Springs we signed up with Crystal Mountain and have been very pleased. The purified water tastes nice and customer service is efficient with great southern charm.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "110452765338849326426", "name": "Becca Sadriyev", "time": 1575995982106, "rating": 5.0, "text": "Amazing customer service from this Company. After a disappointing end to service with another company, this one stepped up and has been a blessing to work with. Highly recommended.", "pics": null, "resp": {"time": 1575927765076, "text": "Hey Becca! Please call our office at 256-922-1114"}, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "105601092823382899743", "name": "Paul Burns", "time": 1538758922920, "rating": 3.0, "text": "I've had two accounts for many years.  I think it's been around 9 years.  Have one account at work, and had one account at home.  I had to cancel the home account because the delivery schedule changed almost every month.  I would get random deliveries, or not get a delivery at all.  Sometimes my empty bottles would sit outside for a month.  I just couldn't keep storing empties until I hit the delivery lottery.  My work account has been great, though.  And the customer service has been pretty good.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "101818726358864003325", "name": "Mike S", "time": 1575917816880, "rating": 1.0, "text": "Been out of water for a week now. We have called twice and they said they would be out the next day and never show up. Now when you call they go straight to voicemail.", "pics": null, "resp": {"time": 1575921605031, "text": "Hey Mike ! Please give our office a call at 256-922-1114"}, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "116291234765140819717", "name": "Georgia Benford", "time": 1565513010104, "rating": 5.0, "text": "Water is like drinking figi and that's great for me so smooth", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "106582216621092552488", "name": "Jon Owings", "time": 1520862963183, "rating": 5.0, "text": "used them for home delivery almost 20 years, rare misdeliveries which are quickly corrected, essentially good service and product.  My experience has been good overall.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "109946469646131369499", "name": "Regina League", "time": 1527605505933, "rating": 2.0, "text": "My office has been a customer for over a year now. In the last few months their customer service has declined drastically.  As of today we have waited 1 week for our delivery of distilled water.  Something to make things easier for us, has turned out to be just as difficult has our making a trip to the market for water ourselves. Very disappointing.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "112817813134674707628", "name": "eli williams", "time": 1340876052243, "rating": 2.0, "text": "I am a 53 ft tractor trailer driver and this place is one of the worse getting into.  Do not try to enter from Madison Pike try Governors.  Once inside industrial park, watch for low hanging trees, branches, etc. Bldg 7 is in the very rear. Horrible location for 53ft tractor trailer deliveries.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "115929849669038795983", "name": "I FULLENWIDER", "time": 1554917225316, "rating": 3.0, "text": "Their products are very  expensive", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "102518755225529899810", "name": "Sherry Marter", "time": 1619546874215, "rating": 5.0, "text": "Hailey is very friendly, and informative! I'm excited about taking steps to better our families health. I am looking forward to benefitting from all of the wonderful experiences available there.", "pics": null, "resp": null, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "102248682154996532041", "name": "Vicki Webster", "time": 1617815597441, "rating": 5.0, "text": "I have only been in Fairhope for several weeks and I was looking for someplace to help boost my health a bit. I sure found that home in Peak Alkalinity. I have had three foot detoxes, enjoyed the oxygen bar, infared sauna and drank lots of alkaline water! I even filled up bottles of their great alkaline water to drink at home! I feel amazing! I have been doing lots of reading about alkaline water, it is so good for you! Everyone there is so knowledgeable. After talking with Missy, Ingrid and Hailey I found that they have a strong health interest and conviction. I'm very impressed and have learned a lot from each one of them. As long as I am in town, I will continue my quest for improving my health so I will keep going there to use their services and learn all that I can! Hopefully their Salt Therapy room will be finished before I leave! Thank you Peak Alkalinity! You were just what I needed!", "pics": null, "resp": null, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "102380492722108003764", "name": "Lorene “Lo” Kinslow", "time": 1620583585906, "rating": 5.0, "text": "I had a wonderful time there with my sister we sat joyed our feet getting taken care of and had a joyful time just sipping on water and watching the sunshine outside outside", "pics": null, "resp": null, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "113810267466521839955", "name": "Zoey Senn", "time": 1620146348401, "rating": 5.0, "text": "I was recently at the fairhope store for a bachelorette party. I had received the oxygen bar treatment and the foot detox. The treatment was amazing. Thank you", "pics": null, "resp": null, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "111173842036001352696", "name": "DIANA FURLOW", "time": 1616192967549, "rating": 5.0, "text": "I had a foot detox, my first, and it was amazing! Missy is the bomb.com!\nIt’s crazy to see all the stuff that comes out through the detox.", "pics": null, "resp": null, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "114105739222941048862", "name": "Rolanda Dorsey-Sanders", "time": 1611115706579, "rating": 5.0, "text": "Missy was very patient and informative. She made the entire experience relaxing as well as educational. Will definitely be a regular customer!", "pics": null, "resp": {"time": 1611157016787, "text": "So happy to have y’all join the Peak Alkalinity family!!! I enjoyed getting to know you!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "115602605382020625787", "name": "Holley Wade", "time": 1621260396214, "rating": 5.0, "text": "I will be back and try more services. I enjoyed the foot detox it was a relaxing and educational experience.", "pics": null, "resp": null, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "102165327933367620982", "name": "Vincent Sanders", "time": 1611415284119, "rating": 5.0, "text": "The owner was very knowledgeable and personable. Truly enjoyed the experience. Certainly plan on going again.", "pics": null, "resp": {"time": 1610992833980, "text": "Vincent, it was a pleasure to have you and Shea in for a foot detox! Hope you had a great day for your birthday!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "105720926868900153525", "name": "Bruna Matheson", "time": 1600092146457, "rating": 5.0, "text": "We went for a Infra Red sauna and left with so much knowledge! Will be going back for sure!", "pics": null, "resp": {"time": 1600215379271, "text": "Thanks Bruna! Enjoyed meeting you both! Would love to have y’all back in!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "116536234649274030522", "name": "Brittany francis", "time": 1576428114223, "rating": 5.0, "text": "Going Peak Alkalinity was a amazing, very knowledgeable experience! The owner, Missy and her staff are so welcoming and they know there STUFF! I had never been to any place like that this, but a friend of mine gave me a gift card as a Christmas gift and I’m so glad she chose this to give to me! From the time I walked in I felt I knew Ingrid already she was so friendly and pleasant. While  working and setting me up for my services she talked about the meaning of the equipment they have in the spa and what it does  to help we as people be in tune with our body naturally... I was stayed hydrated with the purified water they have available for you. It tasted great. These ladies didn’t miss a beat on the great customer services I received and I can’t wait to get back in the spa!! I recommend this as a birthday gift, Christmas gift  and just simple thinking of you gift for anyone!", "pics": null, "resp": {"time": 1576465932770, "text": "Brittany, so pleased that we exceeded your expectations! We look forward to having you in again soon!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "105751609002761066201", "name": "Dana Maloney", "time": 1576114941240, "rating": 5.0, "text": "I love this water!  Helps me sleep better and feel better.  Want to buy the filter system for home as soon as possible.  Really appreciate Missy's customer service and genuine concern for all.  I highly recommend", "pics": null, "resp": {"time": 1576160693106, "text": "Thanks so much, Dana! We enjoy seeing folks achieve better quality of life! We’d love to get you (and all of your guests at the fabulous Jubilee Suites) set up so it’s convenient for everyone!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "112483296439204698947", "name": "Anthony Jones", "time": 1578952736611, "rating": 5.0, "text": "Peak Alkalinity is an evolutional way to become healthier, more alert, and on track for a better lifestyle.  My wife and I have used all of their products and treatments on the road to detoxing our bodies.  Missy, Ingrid and Bobby ensure that you know the basis of treatments and the benefits you are receiving from each visit and the use of their products.  I see and hear nothing but positive outcomes from all those who are joining us at Peak Alkalinity!", "pics": null, "resp": {"time": 1579300523357, "text": "Anthony, we love hearing this! Thank you so much for the wonderful review!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "115544963268237144841", "name": "Kelly Killingbeck", "time": 1575214888832, "rating": 5.0, "text": "Peak Alkalinity is fabulous! Everyone at this business is so friendly and efficient but more importantly,  they are very knowledgeable about health and wellness, You could not ask for a more dedicated team! I feel so good since I started  drinking the water, and using the other products they offer!  I cant wait to have my very own water system installed at my home!  Kelly", "pics": null, "resp": {"time": 1575331154682, "text": "Kelly, thanks so much for the great review. Easy to help when we’re working with a like-minded gal. 😁"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "115126998949215672283", "name": "Kari Lyke", "time": 1574823064988, "rating": 5.0, "text": "Missy and Bob are awesome! We are so happy with our alkaline water machine and would highly recommend them and their products. You wont be disappointed!", "pics": null, "resp": {"time": 1574911853376, "text": "Thanks Kari! Hope you and Howie are doing great! Let me know if there are any more cougars on the loose in the neighborhood 😂\nCall if y’all need anything!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "112350570166192175734", "name": "Whit Stuckey", "time": 1577766213327, "rating": 5.0, "text": "Missy and her team at Peak Alkalinity do a great job of educating and helping you explore the amazing health benefits of alkaline water and the many applications of acidic water. The customer testimonials, research put into the machines and health benefits of alkaline water culminate into a powerful tool each of us need to use everyday to combat an ever growing array of threats to our body. After much consideration I purchased a water ionizer for my family. I will follow up in coming months with results.\n\nThanks Peak Alkalinity!", "pics": null, "resp": {"time": 1577837635741, "text": "Whit, thank you for the exceptional review! We can’t wait for the follow up to hear about your progress!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "109449103689393256071", "name": "Ginger Poling", "time": 1560198258777, "rating": 5.0, "text": "Not only is the owner invested in what she does, the employees are as well. As soon as you walk in, you feel immediately welcomed. Everyone there is very knowledgeable about the benefits of alkaline water and talk you through them all. They are very educating! I had the foot detox while I was there and that was the most interesting thing I have ever done! They can tell you exactly what toxins are being pulled from your body. I was sitting next to a friend and her results were completely different form mine. I had been eating a lot of sweets and breads and they told me yeast was coming out of my body. My friend had eaten a lot of fish that week and she was having mercury released out of her body. I was in awe of my results from the foot detox! Bottom line is Peak Alkalinity is a MUST to go and get educated on all the benefits of alkaline water and detoxing.", "pics": null, "resp": {"time": 1560272239233, "text": "Thank you Ginger for such a wonderful review!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "103613004845992495808", "name": "Nancy Franklin", "time": 1585168185680, "rating": 5.0, "text": "I had the ionic foot detox. Couldn’t believe what was pulled out. Also had  an oxygen session. Definitely want to come back for another session of each in the near future!!  Thank you Missy!", "pics": null, "resp": {"time": 1591717880019, "text": "We enjoyed having you in Nancy!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "114047407761960503933", "name": "Tracey Goens", "time": 1563244977939, "rating": 5.0, "text": "I love going into peak Alkalinity.  They are so helpful and take time to explain things. Missy really cares about her clients. Love my water ❤️", "pics": null, "resp": {"time": 1569010929102, "text": "Thank you for the kind words, Tracey! We still laugh about the prank that y’all pulled on Bob during the install. Classic! 😂"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "112170498318455204585", "name": "Aaron VanHauter", "time": 1581093980161, "rating": 5.0, "text": "Strong knowledge of the business. I walked away after 20 min understanding so much and still feel like I only scratched the surface of the knowledge of Peak Alkalinity. Strongly recommend.", "pics": null, "resp": {"time": 1581097907692, "text": "Thank you so much, Aaron! We love helping others discover optimal health from the inside out!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "112199736692920479633", "name": "Stefanie Samson", "time": 1580227579754, "rating": 5.0, "text": "I an from California and came with a friend I was visiting. It was amazing.  I can't wait to order my water system. I felt so rejuvenated and had so much energy immediately following... my poor husband on our 3 hour drive lol! I hope I can find a place to do foot detoxs near me.", "pics": null, "resp": {"time": 1580503255350, "text": "Stefanie, we love hearing this! Thank you so much for visiting us! If you are ever this way you will have to come back to see us!!!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "100252692400405620178", "name": "Chad Bartz", "time": 1581195170855, "rating": 5.0, "text": "Missy was extremely knowledgeable. A great listener to truly find out why I am interested in using a product like hers.", "pics": null, "resp": {"time": 1581230204188, "text": "The pleasure was ours, Chad! Happy to help!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "111595298519650779169", "name": "Laura Hall", "time": 1579984841414, "rating": 5.0, "text": "I’m addicted to my Foot Detoxes, Far-Infared Saunas, and the Oxygen Bar!! Missy and Bobby are brilliant in their innovative designs and products! The staff is extremely knowledgeable and so incredibly friendly. If you don’t have a water 💦 ionizer you’re are missing out! Clean ionized water is everything to having Peak Health!", "pics": null, "resp": {"time": 1579989190865, "text": "Laura, we love your enthusiasm and commitment to health! Hope you’re enjoying the ionizer in your St Augustine condo as much as the one in your Malbis home!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "117139071269607790078", "name": "Kelly Hanna (Big Sprout Media)", "time": 1558378462851, "rating": 5.0, "text": "Peak Alkalinity  it’s truly an amazing place. The owners are so invested in what they do and the community that they serve. Missy and Bob always go the extra mile to make sure everyone is so well taken care of. They remember their customers they become family they genuinely care about your health and your well-being.  Their employees are also just as knowledgeable in helping you understand what an amazing difference drinking the right water can make.  I seriously suggest you check this place out number one for the amazing foot detox and sauna room, number two to fill up on some really high-quality water that will truly make a difference in your health, and number three seriously consider getting one of these units for your house.", "pics": null, "resp": {"time": 1558644972810, "text": "Thank you so much, Kelly, for the amazing review!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "109417768278361434115", "name": "Ross Sykes", "time": 1560440343997, "rating": 5.0, "text": "The Peak Alkalinity team is a wealth of knowledge and you can feel their passion behind what they do. As a Peak customer I have enjoyed the journey that this product has made in my own life.  Everything this company represents is a Godsend and those not using this should.  Thank you Peak and I look forward to watching the change you make for many families.", "pics": null, "resp": {"time": 1560807464448, "text": "Thank you so much for your feedback Ross!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "108956492838397783134", "name": "Joshua Hembree", "time": 1575561668140, "rating": 5.0, "text": "Missy and her entire team at Peak Alkalinity are beyond excellent. I've struggled with heart burn my entire life and have bounced from one medication to the next because of it. However, after just a couple of weeks drinking their alkaline water I started to see improvements. I can't recommend them enough!", "pics": null, "resp": {"time": 1575565820763, "text": "Josh, happy to have alleviated some of the pain associated with your acid reflux!\nMy dad had a similar issue, so I know that it can impact your quality of life. We appreciate the feedback!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "102732276713348291226", "name": "Scott Blair (Scott the Wheelman)", "time": 1573580155888, "rating": 5.0, "text": "Missy and her team have created an affordable water system that can help prevent many serious illnesses, including Cancer.  Everyone needs to have their Alkalinity System in their house.  I don't let my dog drink straight city water, much less my family.", "pics": null, "resp": {"time": 1573982707530, "text": "Thanks, Scott! I know that caring for your dog is what brought you to us. That’s a special bond. So happy that we could be of help!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "115132984564748474012", "name": "sopheary huy", "time": 1584212692751, "rating": 5.0, "text": "Missy is amazing, we will be back to get more educational information from her.", "pics": null, "resp": {"time": 1591718106404, "text": "Sopheary, excited to provide more education. Stop by anytime."}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "114792851622733231643", "name": "Deedra Harrison", "time": 1576171714595, "rating": 5.0, "text": "The owner and staff at Peak Alkalinity Fairhope are very friendly and knowledgeable.  I enjoy the other services they provide and have started using the water in my neti pot.", "pics": null, "resp": {"time": 1576182969562, "text": "Thanks for the great review, Deedra! Yes, using the ionized acidic water in the Neti pot helps greatly during cold and flu season!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "111320147244270875911", "name": "Emily Stuckey", "time": 1575735254022, "rating": 5.0, "text": "Peak Alkalinity helped me restore my health! Missy & Staff go above and beyond to explain the benefits of drinking the Ionized/Alkaline water along with a healthy diet. Since drinking the water I have more energy & mental clarity. I was also able to get a foot detox and have a sauna session, which along with the water boosted my energy level even more. So glad I stopped in, met Missy and jumped on the Alkaline water train! Thank you Peak Alkalinty!\n-Emily Stuckey Sellers", "pics": null, "resp": {"time": 1575821163157, "text": "Emily, we have so enjoyed having you and the kids in regularly! We’re thrilled that you’ve noticed improvements. With your schedule, we know that you can use all the “boosting” you can get!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "104424771729032150959", "name": "Heidi Will", "time": 1547949022969, "rating": 5.0, "text": "What a unique business! Missy and her staff possess an impressive knowledge set backed by years of research, and are super nice, too! We enjoyed the detox foot bath and far-infrared sauna today, and of course refilled our reusable water bottles with their ionized alkaline water. Great way to learn about the numerous benefits of ionized water, and invest in your health.", "pics": null, "resp": {"time": 1548368886205, "text": "Thank you so much, Heidi! We really appreciate your kind words and look forward to talking to you soon!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "101044288099792352714", "name": "jkdsdmf", "time": 1575394934172, "rating": 4.0, "text": "Seems like alkaline water would help some people. Not particularly me though.  Knowledgeable and caring staff are two of the things you can expect when visiting this business.", "pics": null, "resp": {"time": 1575475815681, "text": "So sorry that your desired results weren’t experienced. If you’d like to come in and talk it through, we may be able to help alter the specifics of what’s needed to help. Thank you for coming in and for acknowledging our caring staff."}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "104228551516771168364", "name": "Barb Stassen", "time": 1576516504276, "rating": 5.0, "text": "Everyone who works here is very helpful. It's always a pleasure to stop in.", "pics": null, "resp": {"time": 1576533463295, "text": "Barb, appreciate your kind words. We enjoy seeing you as well."}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "101844814231602146976", "name": "Maurice Morrisette", "time": 1574366217875, "rating": 5.0, "text": "This is a company that genuinely cares for you. They're not there just to make a sell.", "pics": null, "resp": {"time": 1574370649026, "text": "Thank you, coach! That’s what we strive for! Good seeing you each week!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "104845316487976267239", "name": "Tami Williams", "time": 1573927629241, "rating": 5.0, "text": "Missy and the entire staff are extremely knowledgeable, helpful, friendly and caring.", "pics": null, "resp": {"time": 1573982472813, "text": "Tami, love having you in regularly. You did an excellent job in the vid! A star is born! 😁"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "110683132212576732135", "name": "carrie devolder-edwards", "time": 1576779185715, "rating": 5.0, "text": "Everyone could benefit from Prak Alk services & different ph levels of water for everything in life. You are treated like family!", "pics": null, "resp": {"time": 1576783345053, "text": "Thanks, Carrie! We’re very blessed to have an “extended family” via our clientele. It’s an honor to help!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "107850941627328347402", "name": "Eric Friese", "time": 1559695102384, "rating": 5.0, "text": "I love Peak Alkalinity! I’ve struggled with acid reflux for so long. Drinking alkaline water from Peak Alkalinity helped that immediately. Missy and her staff are great!", "pics": null, "resp": {"time": 1560272289431, "text": "Thank you for the review and we are happy to have helped!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "107028945166885212747", "name": "Glenda Turnbow", "time": 1531495496042, "rating": 5.0, "text": "Had my first foot detox, last Saturday it was very informative.  I slept so good after my detox,  I haven't slept that good in years.  I wanted to wait a few days before I made a review, and I must say,  I have notice a little more energy this week, scheduling my next one now!", "pics": null, "resp": {"time": 1533153451974, "text": "Glenda, we are thrilled for you! Thank you so much for the great review and are looking forward to seeing you again soon!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "109999653082171284154", "name": "Danielle Mccord", "time": 1537706310681, "rating": 5.0, "text": "One of the nicest places clean neat and friendly service Emma is fantastic. Emma was a huge help in understanding the detox. Will most definitely going back.", "pics": null, "resp": {"time": 1537909262568, "text": "Thank you so much, Danielle for visiting us! We are thrilled that Emma was such a great help! We look forward to seeing you again soon!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "115018915785208052568", "name": "Sean Sullivan", "time": 1557842454767, "rating": 5.0, "text": "Felt amazing after my foot detox and I love the alkaline water!", "pics": null, "resp": {"time": 1558645017571, "text": "Sean, thank you so much for wonderful review! Was happy to meet your Mom! She loved the foot detox that you purchased for her as well."}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "100462622528917477019", "name": "Greg Wall", "time": 1576859615686, "rating": 5.0, "text": "Peak not only has great products that my family relies on daily but Peaks passion for their clients health and well being is why I will only purchase from Peak.", "pics": null, "resp": {"time": 1576871849519, "text": "Thanks for the great review, Greg! We’re stoked about having our products in CO!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "108022263596083176346", "name": "Kameren Bowie", "time": 1560260755856, "rating": 5.0, "text": "If you’re looking to detox and rid indigestion peak alkalinity is your place. Missy will take care you and is so energetic about getting you healthy.", "pics": null, "resp": {"time": 1560272159130, "text": "Thank you so much Kameren for your amazing review!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "100692022562873549492", "name": "Sean McClay", "time": 1574782458710, "rating": 5.0, "text": "Love the idea! Love the way they educate you about alkalinity.  Hoping to try the sauna soon.", "pics": null, "resp": {"time": 1518814454745, "text": "We are thrilled to hear this! Thank you so much, Sean, for the great review! We are looking forward to seeing you soon!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "103747289634684322215", "name": "Ricky Louis", "time": 1560260364425, "rating": 5.0, "text": "The owners  love what they do and love to help.", "pics": null, "resp": {"time": 1560272210358, "text": "Thank you Ricky! I'm glad you found us to be helpful!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "100735156674403404718", "name": "Zachary Wilson", "time": 1542504676960, "rating": 5.0, "text": "An amazing organization that puts people first and business second, helping people realize the importance of clean water and the amazing benefits ionization can have on the body.", "pics": null, "resp": {"time": 1543514725496, "text": "Thank you so much, Zachary. We love helping people in and out of our community as well as educating them on how they can maximize their health!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "106114572683656781241", "name": "Donna Lucas", "time": 1603572346554, "rating": 5.0, "text": "Make your body thrive with Peak Alkalinity!!!", "pics": null, "resp": {"time": 1604582233533, "text": "Thanks Donna! Happy to have had you in! 😊"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "112464777080144149472", "name": "David Rounsaville", "time": 1559670864592, "rating": 5.0, "text": "Missy goes way over the top to explain how and why alkaline water is beneficial to the health! She knows her stuff!", "pics": null, "resp": {"time": 1560272313260, "text": "Thank you David for the great review!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "115628833202727503646", "name": "Amber Granato", "time": 1583245785249, "rating": 5.0, "text": "Customer service is always a priority at Peak! Thank you", "pics": null, "resp": {"time": 1583273921184, "text": "Thanks, Amber! That’s what we strive for!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "115675035670514824078", "name": "Pete Canarela", "time": 1574194564266, "rating": 5.0, "text": "Great products!!  Very helpful Staff!!!!!!", "pics": null, "resp": {"time": 1574202316103, "text": "Thanks Pete!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
