{"user_id": "105918042636015189513", "name": "Miss Macy", "time": 1599492735737, "rating": 5.0, "text": "Cute little rustic chapel for your services plus a reception hall next door. Great for family reunions or weddings. I've been there for a few weddings since we actually had a daughter get married here over 10yrs ago and the chapel still looks the same.", "pics": null, "resp": null, "gmap_id": "0x889bb30f76275061:0x5951b98b2ff2f2e2"}
{"user_id": "102633137838757805285", "name": "Glen Perry", "time": 1557939222673, "rating": 5.0, "text": "A great hidden gem here in Mobile. This secluded chapel is great for small personable weddings.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMRz0TAGEx_r9q3tJe6Tm8d6LzmS1hR5urYF6hO=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb30f76275061:0x5951b98b2ff2f2e2"}
{"user_id": "101356322480531822528", "name": "Chloe Suzanne", "time": 1577816902232, "rating": 5.0, "text": "We absolutely loved having our wedding at Brookside! We wanted something just for close friends and family, and this place was perfect. Christina is great and made sure every thing was exactly how we wanted it. We loved her!!  My husband and I both agree that we had a perfect day❤️❤️\n\n-Sarah", "pics": null, "resp": null, "gmap_id": "0x889bb30f76275061:0x5951b98b2ff2f2e2"}
{"user_id": "106606316366832418229", "name": "Crystal Moon", "time": 1578231889761, "rating": 5.0, "text": "My son got married here. Service was being compare and the location is absolutely beautiful.", "pics": null, "resp": null, "gmap_id": "0x889bb30f76275061:0x5951b98b2ff2f2e2"}
{"user_id": "109413527040660335824", "name": "John Brent", "time": 1552310809989, "rating": 5.0, "text": "Great place to have a wedding great place landscaping is awesome", "pics": null, "resp": null, "gmap_id": "0x889bb30f76275061:0x5951b98b2ff2f2e2"}
{"user_id": "110263370765815283126", "name": "Ana Maria Sawyer", "time": 1546547077029, "rating": 5.0, "text": "Very pretty chapel and fellowship hall.", "pics": null, "resp": null, "gmap_id": "0x889bb30f76275061:0x5951b98b2ff2f2e2"}
{"user_id": "109206097019723326721", "name": "Vergie Burrell", "time": 1584414798478, "rating": 5.0, "text": "Very nice and spacious", "pics": null, "resp": null, "gmap_id": "0x889bb30f76275061:0x5951b98b2ff2f2e2"}
{"user_id": "108443932110957142443", "name": "Stacy Ezelle", "time": 1571635386275, "rating": 4.0, "text": "Beautiful serene venue", "pics": null, "resp": null, "gmap_id": "0x889bb30f76275061:0x5951b98b2ff2f2e2"}
{"user_id": "105074688589203972493", "name": "Ernie Adams", "time": 1544136473594, "rating": 5.0, "text": "The Reid brake house is now for sale it is a great place to have weddings, graduation, meetings.", "pics": null, "resp": null, "gmap_id": "0x8889a96c286d51bd:0x130929acaebd3514"}
{"user_id": "100625927906362288429", "name": "Tracie Stjohn", "time": 1541311852620, "rating": 5.0, "text": "It’s so beautiful I love it", "pics": null, "resp": null, "gmap_id": "0x8889a96c286d51bd:0x130929acaebd3514"}
{"user_id": "112138889072020537660", "name": "Allyson Shelton", "time": 1496842069917, "rating": 3.0, "text": "Beautiful place just spread out awkwardly.", "pics": null, "resp": null, "gmap_id": "0x8889a96c286d51bd:0x130929acaebd3514"}
{"user_id": "103628677169676611593", "name": "Robert Taylor", "time": 1500395276077, "rating": 1.0, "text": "Never", "pics": null, "resp": null, "gmap_id": "0x8889a96c286d51bd:0x130929acaebd3514"}
{"user_id": "109654560847909075331", "name": "Joshua Bane", "time": 1613946452649, "rating": 5.0, "text": "Friendly staff. One of the better barn styled venues. We've filmed weddings here and we partipated in their open house.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOnBZMaDlYbnWjvuAjsHuXnzmqfWoqqJDSjg5Sd=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP9CB6mRvn-vpjuNyTEg6APM6suI9H_h3MIUIWq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMVoZymP_UlwNJcLMq5H45ouuVtvxhs5KN1bHn4=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "112893014097833870566", "name": "Amanda Gross", "time": 1618157397922, "rating": 5.0, "text": "Having our daughter's wedding at Adams Acres was an absolutely amazing experience from day 1! The venue is beautiful inside and out and the staff went above and beyond to ensure that we were happy with every detail.", "pics": null, "resp": {"time": 1618759278631, "text": "It was so wonderful to get to know you all! Your daughter was a beautiful bride and the day turned out to be beautiful weather!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "116272721592409637393", "name": "Craig Storey", "time": 1618162659915, "rating": 5.0, "text": "A great place for a wedding.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNx06RC2E5MEWWGwAQph0zFp6e7nt-NIb7L70Ym=w150-h150-k-no-p"]}], "resp": {"time": 1618759226651, "text": "Thank you so much!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "100744166876050308519", "name": "Stacey driver", "time": 1592448525029, "rating": 5.0, "text": "My daughter, Summer and her husband Will were married at Adams Acres in February of 2020. They were one of the first few couples to ever be married there! This venue is the absolute best! It is located on private property in a secluded country setting away from high traffic areas giving you a serene and peaceful setting! The sunset pictures at Adam’s Acres are a must because I don’t think you can get a more picture perfect setting. The rustic decor and set up inside and out also make for the perfect background for pictures! The owners go ABOVE AND BEYOND to make your special day perfect!  From the first walk through to the final minutes of the wedding day (clean up time) Brittney Adams, her husband, and their wonderful tribe of helpers were the most gracious and supportive hosts! Brittney and I kept in constant contact from the very beginning! She gave me so much helpful information from how to set up the venue to the best priced insurance coverage to use! She made the stressful things that people don’t always think about when it comes to wedding planning extremely easy! The day of the wedding when we were still decorating, she and her her husband were there willing to move things around, hang things, decorate things, and even loaned us an industrial steamer for the bridesmaids who forgot to steam their dresses beforehand! From beginning to finish  Adams Acres made the entire experience an absolute beautiful memory for everyone involved! We can never thank them enough for making our youngest daughter’s wedding dreams come true!", "pics": null, "resp": {"time": 1592532974937, "text": "Their wedding was so stunning! Every detail was absolutely perfect! The best part was getting to know you guys! Y’all are so genuine and fun! We had a blast celebrating your daughter!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "105175271811881829136", "name": "Erin BeidlemN", "time": 1600199194841, "rating": 5.0, "text": "We recently used Adam’s Acres as the venue for our daughter’s rehearsal dinner, wedding and reception. Brittney and her husband are both so kind and accommodating! They were always available for questions and truly made this special time as stress free as it could be. They have really thought of everything! We have received countless compliments about the venue and recommend them whole heartedly!", "pics": null, "resp": null, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "104635057263720362442", "name": "Vanessa Rexford", "time": 1598363870919, "rating": 5.0, "text": "We had our wedding at Adams Acres this past weekend. It was stunning and everything I had always dreamed of. The venue was gorgeous, and needed very few decorations to give a simple, elegant, rustic ambiance. Brittney and Anthony were so great to work with and were so accommodating when we had to postpone our wedding due to COVID in May. It's the most beautiful venue of its style in the area, and we couldn't have asked for better people to work with.", "pics": null, "resp": {"time": 1598370305385, "text": "Thank you so much Vanessa! Your wedding was beautiful and one of our favorite moments was when your daughter joined in on your first dance! Your family was so much fun!\nThank you so much for choosing us! Best wishes to you and William!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "104046459604668153535", "name": "Shea Wilson", "time": 1597164921946, "rating": 5.0, "text": "As a wedding planner, there is nothing better than finding other vendors that you adore working with and let me say Adams Acres is one of them! From the first wedding I did there Brittany and Anthony have made me feel like family from the start! They go above and beyond for every single bride, family, & guest to step foot on their grounds! I always look forward to wedding days there knowing my brides have been given the best treatment possible!!", "pics": null, "resp": {"time": 1597169466573, "text": "Thank you Shea! We love working with you (The Grey House Events) as well! Your attention to detail and purposeful planning makes our brides’ days flow so smoothly and our days stress-free! When you are at our venue, we know every detail has been well thought-out and planned for! We always love working weddings with you! We look forward to seeing you again soon!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "114660097300887421958", "name": "Britney Nelson", "time": 1596913756617, "rating": 5.0, "text": "Working with the Adams family was an absolute joy! Brittany was always so quick to reply and answer any questions I had. I loved that what they had to offer was bundled all together and there was no added cost that blind sided you. I would highly recommend Adams Acres to everyone!!!", "pics": null, "resp": {"time": 1597171114670, "text": "Thank you so much! We always try to be available because we know the wedding planning process can be overwhelming!\nThanks for trusting us through these uncertain times. The draping and decor at your wedding was amazing! We can’t wait to see the rest of your wedding photos!\nThanks again for booking with us!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "100363738383884739698", "name": "Jennifer Gilman", "time": 1592479899930, "rating": 5.0, "text": "It’s a beautiful property with many greats amenities. The owners have been very generous and accommodating with their time helping guide us through many event planning dilemmas. They are really easy to work with and we’re very happy with our venue choice. Totally recommend!", "pics": null, "resp": {"time": 1597171425006, "text": "Thank you Jennifer! Planning has difficult lately, but that’s why we are here to help!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "109918851669954436447", "name": "Chelsea Keener", "time": 1597148730076, "rating": 5.0, "text": "We LOVE Adams Acres! We are photographers and videographers who have worked along side the staff of Adams Acres. We were welcomed with open arms and always had our questions answered and needs met. The venue is rustic with shiplap which is totally our style. The venue is always clean and the ground well kept. Working with Brittney is so great and easy! I would definitely recommend this venue!", "pics": null, "resp": {"time": 1597170730722, "text": "Thank you so much! We are always excited to see Chelsea & Joey Photography on our brides’ vendor list!\nWe love working with this creative duo! Amazing vendors make each wedding day a breeze!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "100448056971029253708", "name": "Nazareth Thornton", "time": 1592447154129, "rating": 5.0, "text": "This is the most amazing,  beautiful and professional venue that I have had any dealings with. The owner Brittney is so sweet and kind, she has been so helpful during this Covid-19  Pandemic,  when we couldn't have our planned Anniversary event,  she jumped right in and offered us another date, even into 2021 ,that really meant a lot to me. Every business has suffered during this time.When you have made plans and things happen beyond our control, we need more professional people like Brittney to keep us calm, and reassure clients that everything is going to be okay, and she has our backs. Thank you so much, I will I could give this venue 100 stars if I could. The customer service top notch. Book them, you can't go wrong. Mrs. Thornton", "pics": null, "resp": null, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "103893578034168874082", "name": "Timothy Gilley", "time": 1600125883309, "rating": 5.0, "text": "Wonderfull place to have a wedding or any gathering", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPdBFpIbgMts4t4235JcTEREQNBclM-DRVDoSwJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMw_1rY_fFsEUbwg6C0zfwgHWVP4FYXnow4ZWz_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMo1jWpogZVVADKmWB2knseqm_wBgiQwYbLUR1J=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPBb17Gjo-F7B64a4mN-J3dhJOtpeJD8TmanY3k=w150-h150-k-no-p"]}], "resp": {"time": 1598113991510, "text": "Thanks Tim! We were so happy to celebrate with you & Amber!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "104833969271483734634", "name": "Tammy Storey", "time": 1618758569796, "rating": 5.0, "text": "Beautiful place to have a wedding.", "pics": null, "resp": {"time": 1618759200858, "text": "Thank you so much!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "106529932451351127827", "name": "Katie Dukes", "time": 1592890072646, "rating": 5.0, "text": "They went above and beyond the calling of venue owners! I couldn’t be happier with the way they made my day special! I highly recommend Adams Acres for your special occasion!!", "pics": null, "resp": {"time": 1597171272589, "text": "Thank you Katie! One of our favorite parts of your wedding was your father-daughter coordinated dance! It was so much fun. The love between you and Dylan was very evident and it was such a wonderful day!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "112092613902590790470", "name": "Madison Ingram", "time": 1597026397247, "rating": 1.0, "text": "I would not recommend this venue if my life depended on it! Do not sign a contract with Adam’s Acres, and do not trust them. Adam’s Acres has been operating for less than a year. I was the first bride to book Adam’s Acres. I booked them when all that Brittany Adam’s had to show was studs and pictures of what it would look like when completed. I took a huge risk and trusted Brittany. Now, I regret that decision.\n\nDue to the COVID shutdowns in March, I was forced to postpone my April wedding. All of the dates I had to choose from included holiday dates or August dates. We picked August 15th thinking that COVID would be over by then. However, COVID-19 cases are worse now than they were in April. After a lot of praying and talking to relatives, a month from our wedding, we made the decision to postpone our wedding again! This is not at all what we wanted to do, but for the safty of our family and friends we felt it was necessary. Brittany, being the heartless person she is, refused to give us another Friday-Saturday date in 2021. She offered a Sunday date with our rehearsal dinner being on a Thursday. That would not work for religious purposes and the fact that we have so many out of town guests.  She said “we would cut into her 2021 revenue if she gave us a Friday-Saturday date”. The only way we would be able to have a Friday-Saturday date is to pay the new 2021 rate of $3500.00 when we have already paid in full of $2500.00. Not only will she not let us postpone to a Friday- Saturday date in 2021, she refuses to give us a refund.\n\nShe has stolen our money and has taken advantage of the COVID-19 situation!! Do not book here!! Check out Magnolia Bay, Serendipity, Windmill Station, or The Grand!! Stay clear of Adam’s Acres and Brittany Adams!! Learn from my mistake!", "pics": null, "resp": {"time": 1597036927052, "text": "We are so sorry that we were unable to find a compromise that worked for both parties after your cancellation. COVID-19 has been a nightmare for everyone and we understand your frustration.\nWhen the State of Alabama shut down all businesses we rescheduled affected couples. It was heartbreaking for our couples and incredibly difficult for our small business that had been operating less than 6 months. We were so happy to have Fall dates still available, but we will be very honest...it has been difficult trying to recover from all the bookings we lost because of reschedules, especially when we didn't qualify for any assistance. We are thankful that unlike a lot of businesses we were able to survive and didn't have to close our doors.\nWhen we rescheduled you to August 14th/15th, we held that date for you and turned away other couples and parties that contacted us for that date. Unfortunately when you cancel 3 weeks prior, it is impossible to re-book.\nWe have been open and safely hosting events again since May 30th. Every single couple has been dealing with the uncertainty of COVID and taking precautions to keep everyone safe. We offered to discuss these options with you as well. The mother of the bride tonight told us, \"I know it wasn't as big as they planned, but they are finally married and we felt SAFE.\" Yesterday’s couple rented additional tables to put outside to further socially distance. All weddings have provided masks and had hand-sanitizer readily available. Tonight's bride also live-streamed her event so that her grandmother (who could not attend because of her assisted-living's COVID policies) could watch her get married. Vendors are wearing masks, caterers are hiring extra staff to safely serve everyone, our venue has extra staff at events for sanitizing... Everyone is making compromises and working hard to keep everyone safe.\nWe are in no way downplaying the seriousness of this virus. We also have no idea when it will end. We understood the reason for your cancellation and although it goes against our cancellation policy, we were empathetic and offered you a Sunday date in 2021 with no additional payments required. When you told us that interfered with your religion, we again offered for a Monday-Thursday. We are so sorry that none of those options worked for you.\nWeddings are such an emotional time for everyone and we understand your disappointment. We know that all couples and wedding vendors alike have been thrown into incredibly difficult situations. When what you want to do for your couples conflicts with how you have to run your business--it feels impossible. If we let one person reschedule, we would have to do it for everyone to be fair. We are so sorry, but we simply cannot do that and keep our doors open. We have to follow our cancellation policy in this situation."}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "110397822002346395480", "name": "Jodie Kent", "time": 1592453850445, "rating": 5.0, "text": "Gorgeous venue with professional, attentive staff. The owner Brittany is caring, professional and such a pleasure to work with.", "pics": null, "resp": {"time": 1597171443925, "text": "Thank you Jodie!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "114136424988350459320", "name": "Sofia Harper", "time": 1592487589506, "rating": 5.0, "text": "As a photographer I get to see the behind the scenes of venues and I can honestly say that I am so impressed with Brittany and how she treats her brides, their families, and the other services that cater to her clients from pre-booking to after the ceremony. During the covid crisis she she offered the bride I worked with several options to help her decide how to proceed and practical solutions to help with unusual circumstances. When the outer bands of a tropical depression blew in the weekend of the wedding; she was onsite to help fulfill the dream and workout the details of this outdoor wedding. It was a joy to work with Adams Acres and see what they were made of when the going was tough, they shined.", "pics": null, "resp": {"time": 1592533123583, "text": "Thank you Sofia! We are thankful for amazing vendors like you!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "114896723576451712504", "name": "Yaak18", "time": 1596318625887, "rating": 1.0, "text": "Updated to include Class Action Lawsuit contact information!\n\nMy Daughter scheduled and paid for a wedding. Due to Covid shutdowns ordered by the Alabama Government,  the wedding could not be performed.  It wasn’t my daughter’s fault and it wasn’t Adams Acres fault.  In this case a reasonable person, in other words,  not a crook, would refund the deposit (full payment of $4000) to my daughter.  The owner, Crooked Brittney Adams,  refused to refund the money.  Her contract is iron clad to screw the customer no matter what happens.  She claims to be a Christian and puts off a wholesome,  caring demeanor but In my opinion she’s a scammer just like so many in today’s world.  Don’t trust her! Do not sign a contract with Brittney Adams and don’t give her any money.  She will steal it from you.\n\nUpdate:  I have been contacted by other disappointed customers of Adams Acres and we are planning a Class Action Lawsuit against this fraudulent business.  If you have been victimized by Brittany Adams please send us an email at AdamsAcresClassActionLawSuit@gmail.com\n\nWe have a Dothan Law Firm ready to proceed.\n\nThank You.", "pics": null, "resp": {"time": 1592438891742, "text": "We are so thankful that out of the 9 brides affected by COVID at our venue, 8 have them have successfully been rescheduled. Two of those rescheduled weddings have already occurred at our venue since the restrictions were lifted. COVID has created such an unprecedented set of circumstances. While it hasn't been ideal for anyone, we have had open and honest communication throughout the process. Only 1 bride out of those 9 affected refused to communicate with us via phone and requested that communication be only between our attorneys. We honored her request. All brides affected were offered comparable Saturday dates and we even offered to extend those date options into 2021 if they still desired a Spring wedding. For those who were in school-- they were offered dates while school was not in session including dates during the Summer, Fall break dates, Winter break dates, and of course Spring 2021. We always try to work with our brides and their families and will continue to offer alternative dates for the 1 bride who has not yet rescheduled. We know that trying to plan a wedding during COVID has been very difficult and we are here to help with that process as much as we can."}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "103937440666172904278", "name": "wesley letourneau", "time": 1616792140857, "rating": 5.0, "text": "Excellent service and staff", "pics": null, "resp": {"time": 1618759328659, "text": "Thank you so much! We strive to go above and beyond for every couple!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "103972297711535481112", "name": "Cindy Lynn", "time": 1596328106506, "rating": 5.0, "text": "Beautiful wedding I attended there!", "pics": null, "resp": {"time": 1596339431294, "text": "Thank you so much!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "114609472214801082624", "name": "shari Arnold", "time": 1592482957663, "rating": 5.0, "text": "Lovely venue. Sweet people.", "pics": null, "resp": {"time": 1597171389906, "text": "Thank you Shari!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "114594637535230658344", "name": "Gayle Gilliland", "time": 1598148757658, "rating": 5.0, "text": "It was really nice and spacious.", "pics": null, "resp": {"time": 1598892402824, "text": "Thank you!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "101637263742840666180", "name": "todd mcgarvey", "time": 1611088475281, "rating": 5.0, "text": "great people!", "pics": null, "resp": {"time": 1618759362738, "text": "Thank you, Todd!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "114122825909578758227", "name": "Hannah DeMello", "time": 1598553177770, "rating": 5.0, "text": "Beautiful venue!!", "pics": null, "resp": {"time": 1598892388126, "text": "Thank you Hannah!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "102028452505159082954", "name": "Jamanuelle Land", "time": 1603314383308, "rating": 5.0, "text": "Love the PROPERTY", "pics": null, "resp": {"time": 1618759372567, "text": "Thank you so much!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "104585317139886580380", "name": "John Long", "time": 1592024777683, "rating": 4.0, "text": "Nice set up", "pics": null, "resp": {"time": 1592438924611, "text": "Thank you! Our brides do a phenomenal job decorating!"}, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "110000460455677524346", "name": "Abby Lee", "time": 1592451958314, "rating": 5.0, "text": "Awesome venue!", "pics": null, "resp": null, "gmap_id": "0x889297ef32ece5ff:0xf3bd8bb0f4a416a"}
{"user_id": "105829977282092117998", "name": "Patricia Silvey", "time": 1562730387498, "rating": 5.0, "text": "My husband bought roses from this establishment. They are the most beautiful roses I have ever received! Truly amazing job!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPt9YqawR9JswoGuDNLbtIId9xjSoIw_heiZqbS=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "110438248719764660604", "name": "Daniel Munroe", "time": 1590760516382, "rating": 5.0, "text": "Rococo is amazing! My mom loves to be sent flowers so, over the years, I’ve used a lot of different florists but none of them compare to Rococo. I don’t know anything about flowers but I do know that everything Rocco has done for my mother has been above and beyond. This florist has helped me become my mom’s favorite child and I will never use anyone else! Thanks!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "103083752002050393112", "name": "Kellye Sparks", "time": 1518653578189, "rating": 5.0, "text": "Who knew thinking outside the box, meant putting flowers in a box! Thank you Lori for your fresh, fun perspective.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNhbH0CgCGErsSSTu_vHgbG-sUYr6czOH4Z2pT4=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "107131227101613878566", "name": "Matthew", "time": 1599936230203, "rating": 5.0, "text": "Lori has a good eye and newer take on flower & plant arrangements!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "117975654514838470562", "name": "Ken Giery", "time": 1589835508021, "rating": 5.0, "text": "Lori is amazing. Went above and beyond to help me out. This is the place you need when you need flowers and awsome service. Thanks again Lori.", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "113008748501563276998", "name": "James Jones", "time": 1596042961489, "rating": 5.0, "text": "Awesome staff very satisfied with the flower arrangements I received.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMZF01x62R5j9kFT2rD99kzOegJeG-8Lja9Ltsr=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "102055794536141014826", "name": "Victor S.", "time": 1531658243747, "rating": 5.0, "text": "Lori & Co., You did an absolutely beautiful job for my daughter’s wedding at J&D farms! Not being from the area, it’s a little unnerving to work with artisans such as yourself, just not knowing what you’re going to get! Boy am I glad we did! You’re truly an artist! Thanks again for an exceptional job!\nThe Sparks gang!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "107438622568234007127", "name": "Kay Moore", "time": 1503200305876, "rating": 5.0, "text": "Great service, talented owner and beautiful arrangements!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPWN4egnOJze7ddHi5WbK2ZKdhrSrURV5lpab37=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "118076871623881267392", "name": "Hanna True", "time": 1517957048072, "rating": 5.0, "text": "I stopped by Rococo's after a bad experience at another local florist, and boy am I glad that I did! Lori is so helpful and has a unique, creative eye. She took time to look at pictures of the types of arrangements I had in mind, and was very easy to work with. I will definitely be a repeat customer, and I will give her an excellent review any chance I get! Thank you for finally bringing a high quality floral studio to Gadsden, Lori! It's about time!! Just walking in your beautiful studio lifts my spirit :)", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "114497242304926249997", "name": "Deannia Spiller", "time": 1580758340766, "rating": 5.0, "text": "Would not use anyone else!!! Gorgeous, bright and unique flowers. Staff is very friendly", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "100482230679656032455", "name": "Scott Beavers", "time": 1476731964322, "rating": 4.0, "text": "First time costumer. Very pleased of the work. Ordered flowers for my girlfriend and she thought they were amazing. She said they look like they put a lot of work and heart in their work.", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "103249129131866945938", "name": "Lori Clay", "time": 1548528262170, "rating": 5.0, "text": "I was so pleased with Lori's service , I look forward to doing business with her in the future!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "101538667498352790085", "name": "Kenny Lawley", "time": 1527792918509, "rating": 5.0, "text": "AWESOME SHOP!!! Very unquie and creative! The entire place of done well, and a little bit \"outside the box\"! I will diffently use them in the future!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "113061897206546524417", "name": "lee johnson", "time": 1537569334559, "rating": 5.0, "text": "Very unique flowers, the owner is very knowledgeable and friendly. She got us exactly what we wanted and needed!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "103760784239362878261", "name": "Kay Moore", "time": 1537299434191, "rating": 5.0, "text": "I love to just go visit with Lori and enjoy the beautiful colors and arrangements!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "108006920187738328508", "name": "Crystal Anne Casey", "time": 1538060076110, "rating": 5.0, "text": "What an awesome place cannot day enough great things.. love this place..", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "100810014111835622815", "name": "Phyllis Barnett", "time": 1529610500614, "rating": 5.0, "text": "Wonderful  place, Beautiful flowers . Everyone there is very friendly and helpful,  making sure your flowers turn out perfect.", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "116493929882013260180", "name": "Courtney Linam", "time": 1505333526248, "rating": 5.0, "text": "Whatever the occasion, Rococo has the answer to your floral needs! If you need to brighten someone's day, decorate for an event, beautifie a wedding or send a condolence, look no further than Rococo!\nMy first encounter with Rococo was picking up beautiful center pieces for a business after hours event. I was absolutely captivated walking in to her studio! There are so many gorgeous, creative and one of a kind creations in Rococo Studio.\nMy husband has surprised me with a number of arrangements created by Rococo. Fresh flowers to succulent arrangements,it's always made my day and filled my home with happy!\nWhen we planned our wedding, I knew I HAD to ask Lori to make the bouquets, boutanners and hair pieces. They were more beautiful and perfect than I could have ever dreamed! Thank you for decorating my special day!\nIf you haven't visited Rococo Floral Studio, what are you waiting on?? Go now! ☺️💓", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "103198149223233625049", "name": "Nathan Martin", "time": 1517163805612, "rating": 5.0, "text": "Fabulous florist! Very talented staff and friendly too!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "100241161881978384171", "name": "Glen Bryan", "time": 1590608321642, "rating": 5.0, "text": "It is an awesome place", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "101860309363480546007", "name": "Angela Williamson", "time": 1496585530267, "rating": 5.0, "text": "Very talented. Flowers are unique and individualized to each person.", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "113279600396914396307", "name": "Jason Guinn", "time": 1502313142159, "rating": 5.0, "text": "Lori did my grandmothers funeral flowers and hit out of the park. Would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "108811085073104398724", "name": "Amberlee James", "time": 1478640245020, "rating": 5.0, "text": "Love this shop! She will stay in your budget ! Beautiful work!!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "112013831046541882420", "name": "Tami A. McGee", "time": 1508674010294, "rating": 5.0, "text": "Beautiful, creative. My go to florist!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "113490408509949684387", "name": "deana jackson", "time": 1551835083983, "rating": 5.0, "text": "Friendly and professional staff.", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "107415801216916338030", "name": "Ken Lewis", "time": 1493647766306, "rating": 5.0, "text": "Awesome!!  Best in Alabama.", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "106081945217787407270", "name": "Alecia Henninger", "time": 1606103577441, "rating": 5.0, "text": "Wonderful venue!  I highly recommend  J & D Farms for your wedding venue.   Friendly and accommodating owners and staff.  Beautiful barns, carriage house and grounds.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOxVxn_hoOHHy9YK6kHcljU7N_qfqH9Ri6Hg35a=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNx41MM-yC8YRH5V-tNmqJ2Vs0iCaQC3Ho80jEc=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "108024512397956072915", "name": "Sharon Iwasa Perkins", "time": 1555906748496, "rating": 5.0, "text": "Just had my granddaughter’s wedding here. She’s a fan of the Keira Knightly Pride and Prejudice movie, and when I saw the chandeliers in the barn (see photo), I saw why she chose this venue. It was perfect. We had approximately 125 guests in attendance, and we fit well in both the ceremony and reception areas. While the weather was sunny and hot, they cranked up the AC in the barn. Also, my granddaughter had fans printed up and passed out, so people were fanning themselves throughout the service in true Southern style. After the ceremony, we walked across the gravel road to the reception area, and dined under the wide open blue skies. Fireflies danced among the rose bushes as evening softly surrounded us, and the stars and twinkle lights added to our celebration. Of course, my granddaughter’s father-daughter dance music selection was the opening theme song of the movie, “Pride and Prejudice.” Then, the DJ put on the latest dance music, and the crowd of twenty-somethings danced the night away. The food and bar offerings were greedily devoured. I found the J and D staff kept our needs met unobtrusively but also with a sweet spirit. We just loved everything about this wedding, and it location was a large factor in our celebration. We’re very grateful.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMoM5e9igeIvxv2luIi8UDPFDeOwPTyRZfZDvSH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPTqI0QCsEfxclmun9dRiCdQSSppFEC_G4Ej0qp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipODuuVe95sV3AwFaH8b8QpqDkpyIODUD5ldbuaz=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "109235525994058932155", "name": "Nadal Kim", "time": 1602476952014, "rating": 5.0, "text": "Incredible venue with very accommodating staff members. Definitely would love to come visit again.", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "113905074811618015853", "name": "J Mills", "time": 1604200258165, "rating": 5.0, "text": "Beautiful setting for a wedding !", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOsziOkBxJoWVRGOnd9bvMx7bGE6PRZqrEgl900=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNgvFhVFeiUfBNz2k0DOLrQUsuZJoAcexIIHw7_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPBnTNP4kdGqEycNvLerVOGhsc3sJ5BXAPqtMUF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOiJjHVOb8hqW_6y9CudmVBqOtmqowVY6w7IvNC=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "105806291830511461998", "name": "Ross White", "time": 1601779011409, "rating": 5.0, "text": "Great venu for weddings, very friendly and helpful staff !!", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "116045114262846063124", "name": "Rachel Crumbley", "time": 1572761935020, "rating": 4.0, "text": "What a great place for a small rustic wedding. Great setting. Beautiful old and built to look old structures. We had a great time.", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "103871961679369731433", "name": "Pam Brewer", "time": 1594090557234, "rating": 5.0, "text": "Very talented photographers. Worked well with the students having senior portraits made.", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "101397922007471770255", "name": "C Bondy", "time": 1542229280981, "rating": 5.0, "text": "I was in love with this venue from the first time I saw it online. When we did our first visit, I quickly realized that this was the only choice for our wedding. The owners are very helpful, and accommodating. They are obviously invested in making each wedding perfect. They are quick to field questions, and flexible on the use of the space. I would very highly recommend using this venue to anyone! Thanks for making our big day so perfect!", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "102055794536141014826", "name": "Victor S.", "time": 1531634815527, "rating": 5.0, "text": "Just had our daughter’s wedding here! Love the venue as well as all the staff! Danny does exactly what he tells you he will do! Mackenzie was a sweetheart! We have 3 other children & I would be perfectly satisfied to do this place again! Also, can’t say enough good about the vendors that came recommended! Thanks again for a beautiful, memorable day!", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "109709745613782907524", "name": "John Tipler", "time": 1539385198664, "rating": 5.0, "text": "Recently attended a wedding here. The grounds are fantastic. Rustic, sophisticated, well-maintained, and classy. The small goat enclosure was a pleasant surprise. The reception area was big and had some great views.", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "116799254521220437376", "name": "Eric Chase Stewart", "time": 1575767348547, "rating": 5.0, "text": "Beautiful venue. Love how it sits right in the mountain", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "107285217128648920291", "name": "Sherry Wisener", "time": 1605555087086, "rating": 5.0, "text": "Beautiful, warm and inviting!!", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "114097669468790557471", "name": "John Traylor", "time": 1526586059209, "rating": 3.0, "text": "Went to J & D Farms to attend the wedding of some friends. It was very hot, though I obviously don't knock the location for that. My main complaint would be that they had to move the chairs from the ceremony area to the reception area. This took about 20 minutes, and left all the guests standing confused in heat. No one came to tell us when they were finished setting up, and we eventually meandered up to the barn where the reception was held. There were also quite a few chiggers (red bugs), at the barn as well. Perhaps this all wasn't to their fault and was resultant of poor planning, though it seemed as though it was.\n\nThe parking was also odd, it was about a quarter of a mile from the venue. They had transportation between places in the form of what was basically a golf cart. Though they took forever to come back and forth, resulting in my girlfriend walking up the hill in heels.\n\nOverall the place was quite beautiful, I hate to give this sort of review to such a lovely place, but this was my experience.", "pics": null, "resp": {"time": 1572798023395, "text": "Hi John,\nThanks so much for your review and the kind words about the overall beauty of our venue. In regards to the seating in the orchard... we actually have multiple seating options available that do not require seating to be moved from ceremony to the reception. We have over 300 chairs, vintage church pews as well as custom made wood benches. In this case it was requested that the same chairs be utilized at both, ceremony and reception, so we did in fact have to move them... which is a job that  requires about 20 minutes and 6 staff members. We do strongly discourage this option, but ultimately it’s the decision of the bride. :-) As far as instructing guest to make their way to the barn, this would fall under the job of a wedding planner or coordinator, not the venue itself. In regards to chiggars, we do keep all gathering areas around the barn and reception area mowed and well maintained, however we do have 40 acres of Bermuda surrounding the barn, so if you got in any of these areas, a chigger or two is very likely :-). Finally, our parking lot is located on site but 600 feet from the barn. We do this as an effort to keep the ceremony & reception area safe, as well as clear of vehicles for photography purposes. A 6 seater electric (2017 Polaris Gem) shuttle is available for all weddings. The round trip for this takes only 90 seconds, of course that time does vary..  Especially when exiting, as we make every effort to drop guest directly at their car.  Again thank you for the very kind words. We hope you get the opportunity to attend another wedding soon!"}, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "103568562845208798660", "name": "Kelsey Girdwood", "time": 1539266183067, "rating": 5.0, "text": "Beautiful venue, great staff, gorgeous grounds.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPLygehDrv52f-WPgkZAWPUn-elKI6uJZIdmLoR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMhIblFMHcuI2WHpSk2ALIQqUVXTdvh23E3Cdpu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP-ulH--wbejq5xgRr5yWW3jHvZRnwTO6ikRi-_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPsvYAiaAHbTIfR0HSk0azwFW1CZeAQOY31-bM8=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "114229691780223493642", "name": "James", "time": 1574460942610, "rating": 5.0, "text": "While I was here for a wedding that was rained on (they are still married) the staff and layout kept us dry. Do not where dress shoes, it’s a farm.", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "107126172872245550548", "name": "Alex Tomlinson", "time": 1601407086827, "rating": 5.0, "text": "Beautiful venue.", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "117745482145879769610", "name": "chad clay", "time": 1532389272139, "rating": 5.0, "text": "Wonderful wedding venue.. Top notch staff will bend over backwards for you!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNw2iakv78KXZGhiqzaS2cwkNaMxRubuF-S2FYj=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "107338641020189310153", "name": "Douglas Shuey", "time": 1530023892013, "rating": 4.0, "text": "Nice overall. Would be great for a smaller wedding. I think our wedding was too big for this venue.", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "116537229658831650336", "name": "Peggy Jackson", "time": 1512420667449, "rating": 5.0, "text": "My daughter's wedding! Couldn't have been a more magical place for the wedding of her dreams to come true! No words to describe how awesome the staff helped in making her day the most perfect ever, not to mention, J&D being the most gorgeous and appropriate place for everything she had desired, from engagement, to the moment Roni & Kyle Routon said \"I Do\",  & became One! 💗", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "100898580238470164198", "name": "Ali Nichols", "time": 1538509592394, "rating": 5.0, "text": "This place was something out of a book. Magical beautiful and rustic at same time.", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "101538667498352790085", "name": "Kenny Lawley", "time": 1529635421960, "rating": 5.0, "text": "I was really surprised by how well this place was done! Good job!", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "108807544934752843323", "name": "Skylar Nelson", "time": 1512093247388, "rating": 3.0, "text": "Bad parking situation.  Small dance floor. Otherwise,  a neat place for a wedding.", "pics": null, "resp": {"time": 1512101140445, "text": "HI Skylar, Thanks for your review. I wondered if you might elaborate our parking situation?"}, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "109856960475615609195", "name": "Debbie Hayes", "time": 1577499525299, "rating": 5.0, "text": "Beautiful setting", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPVdqFKC_LMUvqRFX3DokV8mkW8yELCryFCObwu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPHqJTmGABm-eH61fiMQoI-Cm8LQB87FG7rlzIB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMhvtqHvLzmfuA4KRYQB_m59vcJ-XImCNO9VRw-=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "103436715724762727112", "name": "Dericc Williams", "time": 1592114449588, "rating": 5.0, "text": "Loved this place", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "110741459784620369917", "name": "Brandie St. John", "time": 1489357720619, "rating": 5.0, "text": "Absolutely gorgeous! They really go the extra mile to make sure everyone is taken care of!", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "107441372427139907492", "name": "caity buford", "time": 1524159995212, "rating": 5.0, "text": "Beautiful location and grounds, fantastic venue.", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "108922205334312662946", "name": "Misty Merilien", "time": 1528472264692, "rating": 4.0, "text": "Beautiful venue for wedding!", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "109158256755941282370", "name": "Mike C", "time": 1572142257783, "rating": 5.0, "text": "Fantastic venue", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "101106058485339330330", "name": "Marie Johnson", "time": 1541699998548, "rating": 4.0, "text": "Very beautiful!", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "105897027548253808141", "name": "Kelly Kawthorne", "time": 1499943232487, "rating": 5.0, "text": "Meticulous", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "103198149223233625049", "name": "Nathan Martin", "time": 1494732287353, "rating": 5.0, "text": "Great place for wedding!", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "117237085462078750015", "name": "Chris Ellis", "time": 1470273677716, "rating": 5.0, "text": "Beautiful setting and great employees!", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "111656424495465799478", "name": "John Longshore", "time": 1482621264361, "rating": 5.0, "text": "Incredible venue.", "pics": null, "resp": null, "gmap_id": "0x888a30d338f76721:0xf2771ad745e07a53"}
{"user_id": "102910422149305281818", "name": "JR H", "time": 1547445740499, "rating": 5.0, "text": "A lovely, roomy old mansion that is ideal for receptions and parties. It is owned by some longtime friends of ours. They live on the premises. They can offer many options. Has a good amount of on-site parking.", "pics": null, "resp": null, "gmap_id": "0x889a4e302535f1cf:0x723c83e652a0e40"}
{"user_id": "107910239034434221196", "name": "Ruby Tadlock", "time": 1563883967105, "rating": 4.0, "text": "Was there years ago. Lovely place", "pics": null, "resp": null, "gmap_id": "0x889a4e302535f1cf:0x723c83e652a0e40"}
{"user_id": "108129051609559194747", "name": "MzAwesome", "time": 1488638181423, "rating": 4.0, "text": "Went to a ball here really nice place", "pics": null, "resp": null, "gmap_id": "0x889a4e302535f1cf:0x723c83e652a0e40"}
{"user_id": "106570938823520019133", "name": "William McHenry", "time": 1529701223878, "rating": 5.0, "text": "Wonderful place and evening", "pics": null, "resp": null, "gmap_id": "0x889a4e302535f1cf:0x723c83e652a0e40"}
{"user_id": "104361923940974605727", "name": "Courtney Seals", "time": 1505267096135, "rating": 5.0, "text": "nice and open", "pics": null, "resp": null, "gmap_id": "0x889a4e302535f1cf:0x723c83e652a0e40"}
{"user_id": "102716372488678810720", "name": "Eubanks Quarters Farms", "time": 1591483814051, "rating": 5.0, "text": "Micah is awesome . great value", "pics": null, "resp": null, "gmap_id": "0x889a686c08dab557:0xaa517cd39e2e1f41"}
{"user_id": "102081287960428248112", "name": "Ginny Phillips Allen", "time": 1520676449738, "rating": 5.0, "text": "Both new and used pianos, variety of sizes and wood finishes, even exotic. Private lessons available, as well as concert rentals.", "pics": null, "resp": null, "gmap_id": "0x889a686c08dab557:0xaa517cd39e2e1f41"}
