{"user_id": "100781626474118880199", "name": "Rollin Dye", "time": 1612554215528, "rating": 5.0, "text": "I travel for work and drop in to CrossFit gyms all over the country. More Fire is on of the best. Very well equipped, clean, and they are very knowledgeable about fitness. I highly recommend this gym!", "pics": null, "resp": {"time": 1612653519407, "text": "Thanks Rollin, we hope to see you next time you pass through Birmingham, AL."}, "gmap_id": "0x88892175fed0ab33:0xa743c30e11cde7c3"}
{"user_id": "106103852373840391488", "name": "Jessica King", "time": 1605751833306, "rating": 5.0, "text": "I had my first experience with CrossFit here. Andrew, one of the trainers really took the time to show me the correct mechanics for every workout! Morefire has a good atmosphere and they make you feel like family. If you want a challenging workout this place is awesome no matter your skill level.", "pics": null, "resp": {"time": 1607654780378, "text": "Thanks Jessica"}, "gmap_id": "0x88892175fed0ab33:0xa743c30e11cde7c3"}
{"user_id": "110848771014483007402", "name": "Zockly Glockly", "time": 1617870451434, "rating": 5.0, "text": "It is dope, if you’re thinking about joining you’re already doing to much, just join bruh.", "pics": null, "resp": null, "gmap_id": "0x88892175fed0ab33:0xa743c30e11cde7c3"}
{"user_id": "109580837453919981279", "name": "Staci Walden", "time": 1588771686464, "rating": 5.0, "text": "Andrew and the MoreFire team are outstanding!  As a newcomer to the area (and to CrossFit) I quickly found a home and expert guidance to navigate a new path to fitness.  As a health related professional it was very important to me that the approach used was scientific and evidence based, and that appropriate supervision was available to prevent injury and maximize benefit. All of my expectations were met. I truly couldn't recommend them any higher, stop thinking about it and do it!", "pics": null, "resp": {"time": 1590683677936, "text": "Thanks Staci, I'm glad you allowed us the opportunity to be the first to introduce you to CrossFit.  It makes us really happy that you have an additional shared passion (in CrossFit), that you can now mutually enjoy with your son.  It is always great to have other health & fitness professionals around to bounce ideas off of as well. As a Registered Dietitian you give great food for thought :-). https://foodsforthoughtllc.com/"}, "gmap_id": "0x88892175fed0ab33:0xa743c30e11cde7c3"}
{"user_id": "101866329590680488949", "name": "Justin Brewer", "time": 1607447423375, "rating": 5.0, "text": "Great group of people and the most detailed and personalized instruction I have ever received, highly recommend.", "pics": null, "resp": {"time": 1607654609143, "text": "Thanks Justin"}, "gmap_id": "0x88892175fed0ab33:0xa743c30e11cde7c3"}
{"user_id": "105944412143579486652", "name": "Patrick Harbin", "time": 1607669810222, "rating": 5.0, "text": "I had absolutely no experience with crossfit prior to joining Morefire, and now looking back, I  wish I would have started a lot sooner with Andrew and his gym. Even in my limited crossfit experience, l feel I can confidently say that most gyms in the Birmingham area will have the same equipment. However, what really sets this place apart from the others, is the head trainers knowledge, experience, and coaching style. I've learned more in the past 3 months than I have in the last 22 years of traditional weightlifting/exercising, and it has been a humbling experience to say the least. Andrew promotes community and self improvement, and since day 1 of the on-ramp course he's done nothing but motivate me and taken a genuine interest in helping me reach my goals. Great dude and good gym all around.", "pics": null, "resp": {"time": 1607654841475, "text": "Thanks Patrick."}, "gmap_id": "0x88892175fed0ab33:0xa743c30e11cde7c3"}
{"user_id": "116638196570629780922", "name": "Carlton Adderley", "time": 1569259151398, "rating": 5.0, "text": "Feel the burn!! This is a gym where you can definitely be pushed to the next level. The trainers pay careful attention to your goals, they are also great at scaling up or down work outs to maximize safety and ensure you get the most out of your time and effort. This is the gym for people who want results and are ready to work for it, and have fun at the same time.  10/10 would recommend!", "pics": null, "resp": {"time": 1569259432945, "text": "Thank you! A safe CrossFit workout to help you meet your lifestyle goals and maximize results is our passion!"}, "gmap_id": "0x88892175fed0ab33:0xa743c30e11cde7c3"}
{"user_id": "114684608550627591966", "name": "Quiawanna Dallas", "time": 1600626109070, "rating": 5.0, "text": "The best to ever do it! I really need to get back soon!", "pics": null, "resp": {"time": 1600647904847, "text": "Thank you Q!"}, "gmap_id": "0x88892175fed0ab33:0xa743c30e11cde7c3"}
{"user_id": "110253291144492279013", "name": "Charles Campbell", "time": 1582054059459, "rating": 5.0, "text": "I dropped in for open gym. Andrew basically gave me a private coaching session. He went way above and beyond to work through some muscle up drills and cleaned up my power clean technique. He knows how to break down a movement and then demonstrate how to do it. He adapts his teaching to how you learn. If I lived in the area I would call this place home.", "pics": null, "resp": {"time": 1582054950402, "text": "Thanks for stopping by, it was a pleasure helping you out.  Hopefully we'll see you on future visits."}, "gmap_id": "0x88892175fed0ab33:0xa743c30e11cde7c3"}
{"user_id": "111634115179159149441", "name": "J. Blitz", "time": 1578394973804, "rating": 5.0, "text": "Such a great gym, a close-knit bunch that really felt like family.  Andrew and Jason are great coaches, really knowledgeable and great with people. I started going after a running injury, and I was leery of CrossFit going in. I thought it was crazy and dangerous.  Some CrossFit gyms have a reputation of throwing their clients into the fire with little or no training, leading to injury or just being discouraged. This turned out to be just the opposite. Not only did they help rehab the injury, but I got into the best shape I'd been in since college.  If I hadn't moved out of state,  I'd still be a member. (I still stop in when I can)", "pics": null, "resp": {"time": 1579194189685, "text": "Thanks J, I hope you are able to find a good box in your new home."}, "gmap_id": "0x88892175fed0ab33:0xa743c30e11cde7c3"}
{"user_id": "115453317831322434730", "name": "Chad Hawk", "time": 1569464196241, "rating": 5.0, "text": "Classic Crossfit. Caring coaches. The effort made to ensure your movements are correct and Drew’s keen eye will keep you safe and get you on you way to bionic in no time at all. Great people and a welcoming community.", "pics": null, "resp": {"time": 1569469063880, "text": "Thanks, Chad! I'm glad you enjoyed CrossFit high-intensity workouts!"}, "gmap_id": "0x88892175fed0ab33:0xa743c30e11cde7c3"}
{"user_id": "116861709863376828554", "name": "Louis Oddo", "time": 1605983455107, "rating": 5.0, "text": "I have done CrossFit in the past. Andrew is another level Coach!", "pics": null, "resp": {"time": 1607654803263, "text": "Thanks Louis"}, "gmap_id": "0x88892175fed0ab33:0xa743c30e11cde7c3"}
{"user_id": "105269829747111270766", "name": "Nicole Karamichael", "time": 1569256737054, "rating": 5.0, "text": "If you want to become healthier and fitter, stronger and faster, MoreFire is where you should come. Coaches Andrew and Jason really know their stuff, and will break down movements for any skill level, and set you on a plan to improve all the pieces that make up your fitness, i.e. strength, mobility, balance, endurance, etc. Guy or gal, no matter your age or current fitness level, there is a starting place for everyone here.", "pics": null, "resp": {"time": 1569259375093, "text": "Thanks"}, "gmap_id": "0x88892175fed0ab33:0xa743c30e11cde7c3"}
{"user_id": "103271480096788182892", "name": "Patrick Pence", "time": 1597796375241, "rating": 5.0, "text": "Dropped in for a class when i was in town. Great coaching!", "pics": null, "resp": {"time": 1597800630711, "text": "Thanks Patrick, glad we could get you started on you CrossFit journey."}, "gmap_id": "0x88892175fed0ab33:0xa743c30e11cde7c3"}
{"user_id": "112760792762709480492", "name": "Jason Lucia", "time": 1569251800587, "rating": 5.0, "text": "I have worked out for years and trained in and around alot of gyms. Morefire crossfit is by far been my best experience and i have made more progress in 3 years here than i have in the past 10-15 years of training. I have lost over 50 pounds since i started in 2016 and kept it off. Thanks to the unbeatable coaching I can do things i would not ever dreamed i could do. Like handstand walking, muscle ups double unders, and kept raw strength. I have made friends along the way and morefire has become my second family. The community, excellent coaching and dedication from andrew and all the members is superb. I love coaching and training at morefire.", "pics": null, "resp": {"time": 1569256298908, "text": "Thank you."}, "gmap_id": "0x88892175fed0ab33:0xa743c30e11cde7c3"}
{"user_id": "111819240051630166856", "name": "fxynina", "time": 1543863814799, "rating": 5.0, "text": "Great Gym. The owner is amazing and the trainers work at your pace while being very motivational.  Be prepared to sweat", "pics": null, "resp": {"time": 1556832874424, "text": "It was great working with you and having you drop-in for a visit."}, "gmap_id": "0x88892175fed0ab33:0xa743c30e11cde7c3"}
{"user_id": "101950225624460713759", "name": "Lilian Amaya", "time": 1606536592779, "rating": 5.0, "text": "(Translated by Google) A place where you can not only meet your athletic needs. Otherwise you also make new friends. The coach's charisma and patience make this process easier. Andrew is definitely the best when it comes to crossfit.\n\n(Original)\nUn lugar donde no solo puedes llenar tus necesidades atleticas.  Si no que tambien haces nuevos amigos.. El carisma y la paciencia del entrenador hacen este proceso mas facil. Definitivamente Andrew es el mejor en la materia de crossfit.", "pics": null, "resp": {"time": 1607654719519, "text": "(Translated by Google) Thanks Lilian\n\n(Original)\nGracias Lilian"}, "gmap_id": "0x88892175fed0ab33:0xa743c30e11cde7c3"}
{"user_id": "111360595667985499249", "name": "AB H", "time": 1603637523006, "rating": 1.0, "text": "Pell City Fitness has a very nice facility and Alana is great, but unfortunately the owner of this gym is so unprofessional, arrogant, and sometimes downright rude. They have dropped prices and promoted new pricing because they say they care about the community but the truth is they have lost several members over the last several months due to the owner’s attitude and the price is an attempt to get people back. I wouldn’t go back if the membership was dropped to $50. It’s just not worth dealing with him. Plus he is actively trying to sell the business without any of his customers knowing. The gym is suppose to be a place to mentally decompress and this environment does not do that.", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "108182209841654731139", "name": "Jami Shear", "time": 1579301717639, "rating": 5.0, "text": "Getting out of bed and to a 5 am class has never been so easy with the staff and people that work out here. Super caring and friendly coaches and an overall wonderful environment to be in. Plus, sharing a prayer after ever workout is the best way to start your day. I could never say enough nice things about this place. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "113601980884009403557", "name": "Lori Galloway Cochran", "time": 1579377229214, "rating": 5.0, "text": "This place is so awesome!  The Coaches are encouraging, knowledgeable, professional, and genuinely care about each person.   You feel like family from your first class.  I have spent years looking for a gym like this- and I am blessed to have found it right here in my town", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "112578313843758427398", "name": "Holly Bell", "time": 1579384522845, "rating": 5.0, "text": "Love Pell City Fitness!! Joining was the best thing I could have ever done. I have made so many new friends and we are all encouraging each other in our fitness journeys.  We are truly a family!!!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "102974151115831169395", "name": "Stephanie Braden", "time": 1579311848461, "rating": 5.0, "text": "If you are looking for a gym that stands above all the other guys, this is the place! To Pell City Fitness, you are not just another “member”. They sincerely care about you and your fitness goals. The coaches are personable and push you to get the very best out of your workout. They truly want to see you hit your goals and hit those goals you never thought was possible. I love the flexibility in class schedules and the fact that they have free childcare! Make your home gym PCF. You will be so glad you did!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "102431306809225511279", "name": "shay pierce", "time": 1579308141525, "rating": 5.0, "text": "Amazing People/FitFam. Clean equipment. Truly a life changing place. Positive atmosphere. Coaches that genuinely bring you into their family. Highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "108558898543631100751", "name": "Christy Bline", "time": 1579288044515, "rating": 5.0, "text": "PC Fitness is my home away from home!! The staff are great and very knowledgeable, helpful And caring!  They will know you by name not number. Whatever fitness level you are you will fit in!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "116918614897171633945", "name": "Kelly Clark", "time": 1579288011600, "rating": 5.0, "text": "PC Fitness is a family. Scott and his gang are always available to help. If you can’t do something they are going to get you fit to do it. Give them a try!!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "118015590510539671435", "name": "Bridget Ham", "time": 1579298331217, "rating": 5.0, "text": "Great place and great people.  I never thought working out could be this fun!!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "111970455786397063485", "name": "Christine", "time": 1556913677907, "rating": 5.0, "text": "If you want the best extended family this is where you need to go. Everyone there is very welcoming and will help you if you have problems with the workout with no judgment ever. Come in and say hello you will not be sorry", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "103392536493921317628", "name": "Neil Allman", "time": 1547936328544, "rating": 5.0, "text": "Even if you don't like working out, you'll love this gym. They are just so dang welcoming and good at modifying for beginners. You can do this, no matter what shape you are in.", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "110017427534765095447", "name": "paula eiser", "time": 1579287971950, "rating": 5.0, "text": "Amazing program and people..helped me get healthy and fit with amazing support and direction!!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "101117746081410402102", "name": "Jade Martin", "time": 1556908941672, "rating": 5.0, "text": "Awesome gym! Great coaches and a good environment! Everyone is very nice and welcoming!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "105468558060890805552", "name": "Laura Rogers", "time": 1556909524067, "rating": 5.0, "text": "PC Fitness has become my home away from home. Everyone is so helpful and encouraging.", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "110141460230043745050", "name": "Lindsey Bone", "time": 1556561563842, "rating": 5.0, "text": "Love the environment, the skilled coaches and the encouragement from all of the great teammates!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "105209763606379655671", "name": "Catherine Salinas", "time": 1562012139880, "rating": 5.0, "text": "Love the owner & it's trainer especially Alana weems", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "104684776848355204871", "name": "Wilson Thomas", "time": 1548625447116, "rating": 5.0, "text": "Great facility with staff that really cares. If you are looking to reach your fitness goals this is the place to go!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "109048716233879236430", "name": "Nathan Seville", "time": 1557003459430, "rating": 5.0, "text": "Great people! Great coaches!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "117043280500091485783", "name": "Stephanie Sawyer", "time": 1547606812168, "rating": 5.0, "text": "Loved the yoga class!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "111647816791446920826", "name": "Curtis Garrett", "time": 1540600966416, "rating": 5.0, "text": "If you to get in shape, crossfit/boot camp will help.", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "108307295350341348238", "name": "James", "time": 1601787841119, "rating": 5.0, "text": "Great gym, so glad I found this place. They have specialty barbells and a monolift, which were the big things I was after.\n\nThey also have some good strongman equipment, such as a loadable log, circus dumbbell, and axle bar.\n\nThe equipment is in good condition and the facility is always clean.", "pics": null, "resp": null, "gmap_id": "0x88861d3510c2c091:0x471ae4b1ae249bf2"}
{"user_id": "107699598055333102423", "name": "Manned Crown2", "time": 1607486002810, "rating": 4.0, "text": "Other than it being pretty overpriced for two people at the least, it's an AMAZING gym and I go there everyday!! Worth it!", "pics": null, "resp": null, "gmap_id": "0x88861d3510c2c091:0x471ae4b1ae249bf2"}
{"user_id": "104800693067323932776", "name": "Chris Douglas", "time": 1562205001864, "rating": 5.0, "text": "I was a member of this gym for 3 years, and only gave up my membership because I moved.  It's a wonderful space to lift in, has a great atmosphere, and is very affordable.  The owner, Charlie, is knowledgeable, friendly, and professional.  The other lifters are supportive and welcoming.  I always had a spotter when I needed one. Some of the machines aren't the newest, but they're kept in good shape and clean.  The powerlifting area is more extensive than average.  Strong, Inc feels like the sort of gym my dad used to lift in in the 80s and 90s.  And I think that's a good thing.\n\nI'm genuinely upset to be leaving.  I know that finding a gym of a similar caliber elsewhere will be difficult.  Strong, Inc is a work of love wrought in iron, chalk and sweat.", "pics": null, "resp": {"time": 1562205954698, "text": "Can’t thank you enough for this review! We are sad to see you go but so grateful to of had you for 3 years! People like you are what make Strong Inc the gym it is! We look forward to seeing you again one day! Stay Strong!"}, "gmap_id": "0x88861d3510c2c091:0x471ae4b1ae249bf2"}
{"user_id": "105396337333905912595", "name": "Ty Johnson", "time": 1591998695543, "rating": 4.0, "text": "Some of the equipment needs updating but everyone is super friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x88861d3510c2c091:0x471ae4b1ae249bf2"}
{"user_id": "114770193620928528137", "name": "King Craig", "time": 1577473781712, "rating": 5.0, "text": "Best 24r gym in town,  always clean, great equipment", "pics": null, "resp": null, "gmap_id": "0x88861d3510c2c091:0x471ae4b1ae249bf2"}
{"user_id": "104901922842660602442", "name": "Chong Xing", "time": 1533598773894, "rating": 5.0, "text": "When you see a monolift and a reverse hyper, you know this place means business. This gym is well organized and sectioned (cardio area, dumbbell-bodybuilding area, and powerlifting area), with all kinds of bars and equipment you can think of. I was visiting Tuscaloosa for a week (hi from Mount Oread) and lucky enough to find this place - bought a week pass and enjoyed every single day training there. If you like lifting weights, heavy or light, look no further – this is the place.", "pics": null, "resp": {"time": 1533600069057, "text": "Thank you so much for the kind review. It was a pleasure having you and we hope to see you again!"}, "gmap_id": "0x88861d3510c2c091:0x471ae4b1ae249bf2"}
{"user_id": "100340914448179021922", "name": "Rachel", "time": 1516383665804, "rating": 5.0, "text": "Definitely not your sterile, boring gym! Strong has all the equipment you'd want for powerlifting (and other sports, but I'm a powerlifter, so I'm not as familiar with the others): cages, platforms, combo racks, barbells galore, bumper plates, you name it. The gym is well-worn (i.e. people actually use it) but stays nice and clean. Chalk is allowed and stays cleaned up. The owner (Charlie Lyons) is super helpful and the USPA AL state chair. I was a recent newcomer and welcomed by the crowd; the community is excellent. Rates are great. 24/7 access is super convenient. The women's bathroom area has plenty of room to stretch, which I also like; I prefer not to stretch in the middle of the gym. It's fun being in a gym where you see people lifting 500+ lb every time you go in.", "pics": null, "resp": {"time": 1547660943837, "text": "Thank you!"}, "gmap_id": "0x88861d3510c2c091:0x471ae4b1ae249bf2"}
{"user_id": "113087798647714649871", "name": "Hunter Regan", "time": 1597097184096, "rating": 5.0, "text": "This is the gym for powerlifting in Alabama.", "pics": null, "resp": null, "gmap_id": "0x88861d3510c2c091:0x471ae4b1ae249bf2"}
