{"user_id": "108859647785200805632", "name": "thomas dunnavant", "time": 1311258060502, "rating": 5.0, "text": "I have used Travis and his team for many things over the years.  I routinely recommend his services to my clients and customers.  He is among the best for decorative hand rails and all thing metal.  A true artisan", "pics": null, "resp": null, "gmap_id": "0x88628b7eae45781b:0x7e26935615af68dc"}
{"user_id": "108022525354680234845", "name": "Jill E", "time": 1601600409727, "rating": 5.0, "text": "Did a great job fixing a trailer hitch.  I found other things we was working on (vintage furniture, art) fascinating.  A long-lost craft and trade.  Great guy!", "pics": null, "resp": null, "gmap_id": "0x889a4c5aeac9e339:0xfd08ffc4b085cd50"}
{"user_id": "106848103495103379631", "name": "payton troup", "time": 1619815266458, "rating": 5.0, "text": "Fixed trailer properly and cost effectively", "pics": null, "resp": null, "gmap_id": "0x889a4c5aeac9e339:0xfd08ffc4b085cd50"}
{"user_id": "100974172666404577042", "name": "Lonnie Davis", "time": 1595680033726, "rating": 5.0, "text": "One of Best at custom fan and welding , a top notch guy", "pics": null, "resp": null, "gmap_id": "0x889a4c5aeac9e339:0xfd08ffc4b085cd50"}
{"user_id": "108698198049461626156", "name": "Bruce Jones", "time": 1481310376427, "rating": 5.0, "text": "Russell Hill is one of the best people to deal with when it comes to having welding done. He is fast, reliable, and most importantly honest. If it can't be fixed , he won't jerk you around. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x889a4c5aeac9e339:0xfd08ffc4b085cd50"}
{"user_id": "110568829324097227778", "name": "Stephen Haywood", "time": 1610636500269, "rating": 5.0, "text": "Russ is a pro", "pics": null, "resp": null, "gmap_id": "0x889a4c5aeac9e339:0xfd08ffc4b085cd50"}
{"user_id": "106735620518050096424", "name": "Bill Kerney", "time": 1570974882659, "rating": 1.0, "text": "Gate closed, called multiple times, no answer.", "pics": null, "resp": null, "gmap_id": "0x889a4c5aeac9e339:0xfd08ffc4b085cd50"}
{"user_id": "108657428958476759448", "name": "English Farms", "time": 1567353120258, "rating": 5.0, "text": "Mike is one of the top fabricators in the area. They turn out precision parts for wood and pulp Mills like dampets vortexes etc med to large type pieces. Great person to do business with. They also do custom Fab work .", "pics": null, "resp": null, "gmap_id": "0x88896d882e7bde4b:0x93d37751a125ad45"}
{"user_id": "108498960422338305654", "name": "Nate Lewis", "time": 1617698849651, "rating": 5.0, "text": "These guys are the absolute best. They have been around ever since I can remember and I'm happy to see that they are still going strong. I can't wait to use them again soon.", "pics": null, "resp": null, "gmap_id": "0x888d479d559bf309:0xfd3b51653fa6e49e"}
{"user_id": "113985557879019678789", "name": "Linda Trautman", "time": 1599937276140, "rating": 5.0, "text": "Thank you Neil for the immediate repair of our  disc harrow!\nNot only did you weld the broken arm but reinforced the existing. Same day turnaround too! This dude Rocks!", "pics": null, "resp": null, "gmap_id": "0x888d479d559bf309:0xfd3b51653fa6e49e"}
{"user_id": "103411913129078609119", "name": "Dominique Ricks", "time": 1624978050885, "rating": 5.0, "text": "Great and timely manner", "pics": null, "resp": null, "gmap_id": "0x888d479d559bf309:0xfd3b51653fa6e49e"}
{"user_id": "103017085331686874161", "name": "Eric Johnston", "time": 1604062523865, "rating": 5.0, "text": "Best prices around for cm truck beds. So much so I drove through  hurricane zeta to get there. (A 4 hour drive on a good day)  The staff are great and went out of their way to accommodate my needs. They go above and beyond with the installation. It's the best way I have ever seen one installed before.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNiV_v9kJ-pBBeuor460PUMWBp8_zKpFpWQo3YN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMHd9hwj6SkjXrtgQk6aU4lq8VXRy5cD3jDPKmF=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d48c2884c1d7f:0x6b340a3acf01611c"}
{"user_id": "112519763510937865434", "name": "Jimmy Irvin", "time": 1616188235064, "rating": 5.0, "text": "Called on Tuesday  got my axles, wheels and tires on Friday.  Great advice and help getting the parts in a timely manner. Jake is a professional.", "pics": null, "resp": null, "gmap_id": "0x887d48c2884c1d7f:0x6b340a3acf01611c"}
{"user_id": "111738601786735661344", "name": "Edward Mulder", "time": 1623389207739, "rating": 5.0, "text": "Friendly people, and a solid trailer. 20ft car hauler.", "pics": null, "resp": null, "gmap_id": "0x887d48c2884c1d7f:0x6b340a3acf01611c"}
{"user_id": "114459713124567710169", "name": "Phillip Rhodes", "time": 1608054099207, "rating": 5.0, "text": "Great place to get a new trailer.", "pics": null, "resp": null, "gmap_id": "0x887d48c2884c1d7f:0x6b340a3acf01611c"}
{"user_id": "103604756899185447630", "name": "Michael Davis", "time": 1541616797511, "rating": 1.0, "text": "I have done business with this place before, but that will never happen again. I have recently purchased a truck with a CM bed installed on it and the toolboxes are leaking. So, I called CM directly and discussed the issue with them. They were very nice and helpful and also apologized for the inconvenience. They (CM) located a local distributor for me to take my truck bed to for repair. This happened to be Jake's Trailers. The person at CM told me who to talk to and what to tell them to get my issue taken care of. So, I called Jake's trailers today and talked to the owner(or at least that's who he said he was) and explained my situation to him. His first question was, where did you buy it from and I told him a dealership in Tennessee. His response was, \"then you should take it back to the place where you bought it\". The place I bought the truck(with the bed already installed) was a car dealership, not a CM distributor was my response. You will have to work it out with them, not my problem. I'm asking you to do warranty work, not give me your unsolicited advice. Just lost a customer for life as I will never shop at your facility again. I will also spread the word among all of my friends as well.", "pics": null, "resp": null, "gmap_id": "0x887d48c2884c1d7f:0x6b340a3acf01611c"}
{"user_id": "115031347576833025872", "name": "Vernon Atkinson", "time": 1600737977116, "rating": 3.0, "text": "Did not get any service done just ask few questions but they were nice. Hope to do some business later.", "pics": null, "resp": null, "gmap_id": "0x887d48c2884c1d7f:0x6b340a3acf01611c"}
{"user_id": "104627797078001055157", "name": "Otis Dickerson", "time": 1512664772586, "rating": 5.0, "text": "GREAT PLACE TO SHOP FRIENDLY AND KNOWLEDGEABLE PEOPLE TO DEAL WITH..", "pics": null, "resp": null, "gmap_id": "0x887d48c2884c1d7f:0x6b340a3acf01611c"}
{"user_id": "102290603432541552191", "name": "Mary W", "time": 1529946159620, "rating": 1.0, "text": "Terrible service, he price gauges. Saw him charge a man 700 forwhat he said was a new brake system and all it was a small wire needed replacement. He is a slimmy business man.", "pics": null, "resp": null, "gmap_id": "0x887d48c2884c1d7f:0x6b340a3acf01611c"}
{"user_id": "108062893508860136211", "name": "Kim Kimbrough", "time": 1591202718797, "rating": 5.0, "text": "Great people", "pics": null, "resp": null, "gmap_id": "0x887d48c2884c1d7f:0x6b340a3acf01611c"}
{"user_id": "103838042998700340769", "name": "James Young", "time": 1544924311751, "rating": 5.0, "text": "Great place to shop for Christmas", "pics": null, "resp": null, "gmap_id": "0x887d48c2884c1d7f:0x6b340a3acf01611c"}
{"user_id": "108015902358694270361", "name": "Thomas Parish", "time": 1591924976667, "rating": 5.0, "text": "Super nice guys!", "pics": null, "resp": null, "gmap_id": "0x888c917ee747b6ef:0x16d82c5e5d56321c"}
{"user_id": "100289875884956892517", "name": "steve parker", "time": 1625624546964, "rating": 5.0, "text": "Excellent job on repairing the suspension on my 20 ft utility trailer. Good price and fast service.", "pics": null, "resp": null, "gmap_id": "0x8889cb3b7d8ef205:0xcd59bce127a33197"}
{"user_id": "110644701443674498013", "name": "A W", "time": 1604613291770, "rating": 5.0, "text": "So thankful for this company.   Had a bracket crack under our Jayco Seneca Super C on our way to Cullman.  They got us in first thing in the morning and within an hour Charlie had the weld complete!  Very professional!  Believe the company goes under John's Welding now (John is the owner).  Highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x8889cb3b7d8ef205:0xcd59bce127a33197"}
{"user_id": "100484585423004806340", "name": "Raymond Williams", "time": 1605130149729, "rating": 5.0, "text": "Friendly, quick to understand my needs and fabricate the item. Yes I will go back for other items I may need.", "pics": null, "resp": null, "gmap_id": "0x8889cb3b7d8ef205:0xcd59bce127a33197"}
{"user_id": "107364841369420735953", "name": "Dee bowden", "time": 1585846355951, "rating": 5.0, "text": "Great friendly people the owner and his wife are super friendly and wonderful work they do is superb!! Very very highly recommended!", "pics": null, "resp": null, "gmap_id": "0x8889cb3b7d8ef205:0xcd59bce127a33197"}
{"user_id": "105571672141666968136", "name": "karen Cross", "time": 1532363712632, "rating": 5.0, "text": "Very nice couple....they were very knowledgeable and very helpful....", "pics": null, "resp": null, "gmap_id": "0x8889cb3b7d8ef205:0xcd59bce127a33197"}
{"user_id": "106193211946417362318", "name": "Ringr 57", "time": 1605230134498, "rating": 5.0, "text": "I had them fabricate me a custom fuel rail. They did it quickly professionally and it looked amazing. One year later it is still holding strong.", "pics": null, "resp": null, "gmap_id": "0x88621565137406b1:0xf86b9a268bbfb90"}
{"user_id": "107028028701855097245", "name": "jason martinez", "time": 1587153203111, "rating": 5.0, "text": "Jasper built me a custom fuel cell.. Something I drew up and needed to utilize stock fuel pump and sending unit.. He built it exactly how I drew it up and made the stock parts fit perfectly... This fuel cell is not thin aluminum.. It's very thick and sturdy.. And he does beautiful welds.. No leaks... I'd recommend to anyone for aluminum welding and custom fab", "pics": null, "resp": null, "gmap_id": "0x88621565137406b1:0xf86b9a268bbfb90"}
{"user_id": "104414388551406107678", "name": "Charles Malone", "time": 1587050351557, "rating": 5.0, "text": "This is an excellent experienced shop that can handle most any of your welding and fabrication needs. Give them a call!", "pics": null, "resp": null, "gmap_id": "0x88621565137406b1:0xf86b9a268bbfb90"}
{"user_id": "115451729599649110524", "name": "David Smith", "time": 1578078526329, "rating": 5.0, "text": "Part of the front fender of my wife’s Toyota Sienna Van has been hanging off for a while from hitting a traffic cone. A little metal bracket that held the front fender/bracket on, broke off. I had been concerned for quite a while that the whole front bumper might come off but fixing it would involve getting an entirely new front bumper and paint job which may have cost a few thousand dollars. I talked to Jay on the phone, he was very polite and professional. I brought the van in to him about an hour later and he fixed the part of the fender that broke off that was supposed to hold the fender/bumper. He did this job very quick and at a reasonable price. If you ever need something fixed, Jay’s welding shop is the place to go.", "pics": null, "resp": null, "gmap_id": "0x88621565137406b1:0xf86b9a268bbfb90"}
{"user_id": "107049715102986966294", "name": "Jay's WeldShop", "time": 1572544894165, "rating": 5.0, "text": "If its broke most likely here we can fix it!", "pics": null, "resp": null, "gmap_id": "0x88621565137406b1:0xf86b9a268bbfb90"}
{"user_id": "100512865428840768977", "name": "Nathan Adamek", "time": 1541530385908, "rating": 5.0, "text": "Lanbro is an awesome company. Very responsive, polite, and they went the extra mile to make sure everything was 110%. Very impressed with the quality of work, knowledge, and capabilities. Highly recommended", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOU0VCWjqtmuH5AmY1frhMlvTCcdXfbQVnI6-W5=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886269865c470725:0x1cbda7f2d6611ad9"}
{"user_id": "104021208411383164935", "name": "Justin “Manaconda” White", "time": 1526329600244, "rating": 1.0, "text": "Dropped off a piece for my motorcycle to have a small piece of metal welded on. Was told it would be 3 days and $30. I called on the day it was supposed to be ready, and it wasn't ready. That's fine... I was in no hurry. He said the following Monday I could pick it up. So I waited till Monday and called again, and again it wasn't ready. I asked when it would NOW be ready? I was told that they had lots of work and wasnt able to get to it yet.   He told me to give him two more days. I called again two days later and it still wasn't ready. I then asked how long was it going to be until it was ready, he said tomorrow. I then asked how much it was going to be, which he then quoted me $50. I asked if there was a discount for being late not once, not twice, but three times. He then said \"Come pick up your piece, we can't do it!\" and abruptly hung up on me. Top Notch customer service there, and that's from the Owner of the business. Sad that I was referred to this company from another, and was told they were good people. Sad that this is what \"good people\" is referred to now as. Take your business elsewhere, these guys are worthless.", "pics": null, "resp": null, "gmap_id": "0x886269865c470725:0x1cbda7f2d6611ad9"}
{"user_id": "101112171743350036386", "name": "Paul Spradlin", "time": 1584359380099, "rating": 5.0, "text": "Expert craftsmanship and attention to detail these guys can do it all. Professional welding and soldering and brazing.", "pics": null, "resp": null, "gmap_id": "0x886269865c470725:0x1cbda7f2d6611ad9"}
{"user_id": "117163766318300214269", "name": "Ralph Cantrell", "time": 1518072181812, "rating": 5.0, "text": "WOW! This place is the real deal, folks. They do all kinds of big, complicated jobs, but I only needed a small one and therefore feared I might not get the priority I needed. Not so! They made a custom catch pan for my water heater, which is in a rather awkward location, and the finished product was way beyond my expectations. It was practically a work of art and the measurements, which Vince took over the phone,  were spot on. This was a major relief because I had no wiggle room at all. They were also able to work it in fast, which saved me and my family much grief.\n\nYou can count on the good folks at Lanbro Sheet Metal, Inc. to take your request seriously and do the job right in a timely manner. They're a 5-star business for sure.\n\nThanks again, guys!", "pics": null, "resp": null, "gmap_id": "0x886269865c470725:0x1cbda7f2d6611ad9"}
{"user_id": "110378731812828031350", "name": "Eli Jeep", "time": 1599529640307, "rating": 5.0, "text": "Awesome help, if you like to improvise", "pics": null, "resp": null, "gmap_id": "0x886269865c470725:0x1cbda7f2d6611ad9"}
{"user_id": "106223809575964295207", "name": "Jeffrey Kilian", "time": 1487859127228, "rating": 5.0, "text": "Fast, Accurate, Affordable, Customer oriented.  Seems no job too small.  Great experiences.", "pics": null, "resp": null, "gmap_id": "0x886269865c470725:0x1cbda7f2d6611ad9"}
{"user_id": "106962197234597285862", "name": "Whitney Bell", "time": 1627335070176, "rating": 5.0, "text": "Jackson and his team were great to work with. Everyone is slammed these days in the construction/remodeling business, so I did not hear back immediately, but I was not surprised as I assumed they were very busy. Once I did hear back, Caitlin was super responsive and answered all of my questions. I knew nothing about iron railings, so I had a lot of questions.\nJackson and Isaac handled the measurements, created the skeleton railing, and completed the install.  They are both very attentive to detail and personable. They made sure we understood the process and were happy with the final results.\nI did receive 2 other estimates, and Allen Iron Works offered the best pricing and best timing. I am very pleased with our railing and would highly recommend them.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN28nC1CCINFMcPDe7iJERNaK_nKkkJlgkL4llp=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "116570765014476343592", "name": "Donna Orrison", "time": 1617808777033, "rating": 5.0, "text": "I wanted to update my house by taking off the wooden porch columns and railing.  I added new columns and Allen Iron Works created a custom railing and stair railing for me. It turned out absolutely gorgeous!  Jackson worked with me on the design and Isaac and Jacob were fantastic with the installation.  They truly do fantastic work.  I couldn't be more pleased with how it turned out", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPRjo3xyTS2rlh3bfLWx6apeaX_FpPTMN2A7Pqd=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP3JZW1bGvzJgr7BkazZODTCqHxrHf8Zo2ZqGdy=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "104083717212329833161", "name": "Frances Mayhall", "time": 1618930148735, "rating": 5.0, "text": "The new owner of Allen Ironworks, Jackson Langston, helped us with a repair to our iron railing on our front porch. He and his employees were responsive, super professional, and gave us a fair price. They also did a great job. I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "118081020871359579098", "name": "stephanie stone", "time": 1596413990506, "rating": 5.0, "text": "I ordered an iron trellis and it was beautiful!  The staff were helpful, responsive to questions, and timely on delivery. I love it!  Would definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "106559254276616683387", "name": "Michelle Ford", "time": 1612312692477, "rating": 5.0, "text": "Friendly people and very reasonable", "pics": null, "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "115563040197908999532", "name": "Paris Lady", "time": 1541384788859, "rating": 5.0, "text": "Our cast iron mailbox pole broke from the yard guy backing his car into it. The pole was 70 years old. My Mother mainly wanted to keep the ornate work that the mailbox rested on. Little Hardware quoted a price of 287.00 to weld a new pole to the scroll work and the wait would up to 3 weeks. My Mother said \"Call Allen Iron Works. They have been around for years and will give a fair price for repairs\". They welded a new pole and while I waited for only 20 minutes. They charged us 40.00 which I felt was very reasonable. That was a year ago. Tomorrow I will go again for a custom flagpole that has to be made and I have complete confidence the price will be reasonable. The entire staff treated me with kindness and respect. My Mother was so excited and happy to see the mailbox iron work back in place like it hadn't changed at all since the 1940's. A businessman once told me \"It's repeat business that you always want to strive for. That's the secret of success\". He's right because Allen Iron Works has a customer for life with me.", "pics": null, "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "111419282386881666393", "name": "Vivian F", "time": 1595859942681, "rating": 1.0, "text": "I signed a contract on June 30th with a deposit of 50% of the cost. In mid July I called them for an installation date. They said \"about two weeks out.\" On July 27th I called them and they said \"a few weeks out.\" I pushed for a delivery date. They said August 17th. I canceled my order as previous promises were not upheld.", "pics": null, "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "103881629705066137010", "name": "Liz Harding", "time": 1458169347892, "rating": 5.0, "text": "I looked all over for a replacement number for my mailbox. The msilbox's manufacturer recommended this company and they were right!! Fast and wonderful customer service and the store is fascinating!!", "pics": null, "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "118201279491499764634", "name": "Bman16", "time": 1613434043324, "rating": 5.0, "text": "Awesome place, great people, Gary is a very knowledgeable person, he has a huge amount of experience in a lot of different areas. Always a great experience when we use Jones Welding! Gary and his team have got or company out of a tight spot more than once, always great with meeting deadlines!", "pics": null, "resp": null, "gmap_id": "0x889a51ba61f65707:0xd91b301d57f02e00"}
{"user_id": "107397905065140557404", "name": "Valen montano", "time": 1604528937463, "rating": 5.0, "text": "The staff are nice and they work very good", "pics": null, "resp": null, "gmap_id": "0x889a51ba61f65707:0xd91b301d57f02e00"}
{"user_id": "117669765747809049382", "name": "Brandon Jackson", "time": 1526650712503, "rating": 5.0, "text": "Courteous and helpful staff. Reasonable rates also", "pics": null, "resp": null, "gmap_id": "0x889a51ba61f65707:0xd91b301d57f02e00"}
{"user_id": "106361975833631396170", "name": "Susan mcgriff", "time": 1620235128682, "rating": 5.0, "text": "Wonderful ppl. Great service", "pics": null, "resp": null, "gmap_id": "0x8889052c0f223991:0x2273e1b3ba25fd26"}
{"user_id": "103899179450674281178", "name": "Julia Sanders", "time": 1481391778063, "rating": 1.0, "text": "Sorry company!!!!! The most heartless people you'll ever come across!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888990a6d1e127cb:0x564830d0d362f51"}
{"user_id": "109292766465495540584", "name": "Tony Smith", "time": 1612385522917, "rating": 5.0, "text": "Great place to work and Great people to work for. Been here 20 years and counting.", "pics": null, "resp": null, "gmap_id": "0x88928eda8ceada2b:0xd9294e7bcc9f4eea"}
{"user_id": "109688919002205563676", "name": "Johnathon Henry", "time": 1518627336719, "rating": 5.0, "text": "Really loved working here", "pics": null, "resp": null, "gmap_id": "0x88928eda8ceada2b:0xd9294e7bcc9f4eea"}
{"user_id": "117505918540446061463", "name": "Annette Smith Bentley", "time": 1594135362685, "rating": 5.0, "text": "I recommend these guys to anyone. They have worked around my work schedule many times just to make sure that every problem is addressed and that I would be safe in my travels. So with that being said give these guys a try", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "105931572962626369800", "name": "kenneth mote jr", "time": 1600558356946, "rating": 5.0, "text": "Excellent service, super people to do business with!!   This is the only place I carry my  vehicles.   I highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "115311921207622748001", "name": "Jason Bentley", "time": 1597189196792, "rating": 5.0, "text": "First Class Service All Around!!! Recommend these guys to anyone!", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "107069074555890870895", "name": "David Robenstine", "time": 1567865650054, "rating": 5.0, "text": "Russell and the staff are very knowledgeable.  Prices are reasonable.  I will be giving them more business in the future They do the job right the first time", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "114120447781306521154", "name": "Ben Martin", "time": 1586789697806, "rating": 5.0, "text": "Randy and his crew always do really great work, at a very reasonable price. I always recommend them for repairs both big and small, and based on the stuff they always have sitting around, I am convinced they can fix anything.", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "106259516170268633094", "name": "Brittany LelaFaye Mote", "time": 1564943858649, "rating": 5.0, "text": "These guys will definitely fix you up! They are amazing at what they do and they have the beat prices around.", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "105555205937588776773", "name": "Evan Alden", "time": 1546856685384, "rating": 5.0, "text": "Great place, wonderful staff, good quality work and prices are the best around. They do all my work.", "pics": null, "resp": null, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "105059312789048976152", "name": "Jason Crow", "time": 1536440091499, "rating": 1.0, "text": "I took my truck to these people and and there not mechanics they just change parts til they find the one it is what I call a part changer", "pics": null, "resp": {"time": 1536607833374, "text": "Thank you for the review Jason. I am sorry that we were unable to satisfy your needs. Maybe you should have had us diagnose the problem before you told us to change parts.\n\nWe appreciate your business and am sorry that you had such unrealistic demands.\nHave a wonderful day."}, "gmap_id": "0x8889bf4896ec09cd:0x75b55a4cd4c40ff1"}
{"user_id": "105516565369550744684", "name": "Daniel Deyette", "time": 1606161055883, "rating": 5.0, "text": "Friendly folks, fast and easy load. Excellent experience.", "pics": null, "resp": null, "gmap_id": "0x888604b3ccf01bd1:0x30e1f83daba1de55"}
{"user_id": "113059063596593895599", "name": "clay morse", "time": 1613853674869, "rating": 1.0, "text": "Not open 😕", "pics": null, "resp": null, "gmap_id": "0x888604b3ccf01bd1:0x30e1f83daba1de55"}
{"user_id": "105344017966492100210", "name": "Lowery Duvall", "time": 1583601747663, "rating": 5.0, "text": "Does excellent work in a timely manner.reasonable rates.Very friendly.Helpful in any way possible.", "pics": null, "resp": null, "gmap_id": "0x8889f671b030c4cb:0xd4f8958dc61bc1ad"}
{"user_id": "105361581675712527013", "name": "p-nut Cline", "time": 1627922289332, "rating": 5.0, "text": "They done great work at a fair price", "pics": null, "resp": null, "gmap_id": "0x8889f671b030c4cb:0xd4f8958dc61bc1ad"}
{"user_id": "109463740598937389849", "name": "G E MERRILL", "time": 1618395522238, "rating": 5.0, "text": "Excellent service and workmanship. I needed some welding on a trailer both of the tail light  bracket and the swivel jack. He showed me that the swivel jack actually should not be welded but just replace a worn snap ring. He did a beautiful job on the tail light bracket and even sprayed primer on it so it wouldn’t rust until I could get to it. I recommend this service.  He took care of me immediately when I went to the shop. Just a note I was referred by the Kabota dealer as he did excellent work.", "pics": null, "resp": null, "gmap_id": "0x889a68e49b2eafcd:0xc157a44a948126d6"}
{"user_id": "104972885596742207586", "name": "Ryan Easterling", "time": 1608222965109, "rating": 1.0, "text": "This place is a joke.  I rarely take the time to review a business, but couldn’t help sharing how unprofessional and short tempered this guy is.  Anywhere else...", "pics": null, "resp": null, "gmap_id": "0x889a68e49b2eafcd:0xc157a44a948126d6"}
{"user_id": "112364206912718364554", "name": "B'Beth Weldon", "time": 1544544430668, "rating": 5.0, "text": "A three time customer since 2013... couldn’t imagine having anyone else make custom electric gates or custom fountains out of aluminum or steel. Kudos James and thank you for your consistent attention to detail!", "pics": null, "resp": null, "gmap_id": "0x889a68e49b2eafcd:0xc157a44a948126d6"}
{"user_id": "118051133925414835998", "name": "GRUNT 0311", "time": 1537055632204, "rating": 5.0, "text": "Seeing as this is a business that provides the service of WELDING and not let me kiss the customers butt service . I'd have to say he does excellent work and has a imagination when it comes to customized requests!  So what that he didn't kiss my butt and God forbid he cursed!  I'm a marine infantry veteran so it's nothing that no one hasn't heard before! Stop wearing your emotions on your sleeves ! He's a welder that's what men do! Crybabies!", "pics": null, "resp": null, "gmap_id": "0x889a68e49b2eafcd:0xc157a44a948126d6"}
{"user_id": "107261201096579323306", "name": "Thomas irwin", "time": 1482500607705, "rating": 5.0, "text": "I was traveling through from Kentucky and needed specialized work done on my class A rv.  I am a welder myself and was naturally critical of work any welder might do on my coach.  He surpassed my expectations. Better than factory.  Plus he actually figured out a better way of fabricating.  He is a real\"go getter\".  If he can't fix it he wont waste your time and money.  Fair price as well.", "pics": null, "resp": null, "gmap_id": "0x889a68e49b2eafcd:0xc157a44a948126d6"}
{"user_id": "118332889616587351679", "name": "Charlotte Keith", "time": 1556635146094, "rating": 1.0, "text": "Was just blasted by horn from the vehicle of said establishment. Not sure why? Not only that saw the driver swerving dangerously in and out of traffic and not using a blinker. I know my laws and do not cruse in the left lane. The only reason you get 1 star is because you know how to use your horn! Bravo👐🏼", "pics": null, "resp": null, "gmap_id": "0x889a68e49b2eafcd:0xc157a44a948126d6"}
{"user_id": "116280473268558838171", "name": "Katherine Lee", "time": 1499802636749, "rating": 1.0, "text": "The owner of this company is a crazy, hateful lady! I was driving with my infant in the car and while we were at a red light waiting to turn left she pulled up behind me and honked her horn, then when we were able to go she tried to run me off the road 2x before i was able to pass her and get away from her. I used my bluetooth to call the number on the side of the truck to report the driver and when i asked for management she said she rudely said she was the owner. When I told her what happened she started yelling and cursing at me about being on my phone and threatening me saying she WOULDN'T share the road with people like me! I had only had my phone in my hand while stuck at red light and is that any reason to try to harm me or my child?", "pics": null, "resp": null, "gmap_id": "0x889a68e49b2eafcd:0xc157a44a948126d6"}
{"user_id": "105398713147920596326", "name": "Jandre Felix", "time": 1556712403088, "rating": 1.0, "text": "Yep, the guy is crazy, curses like he is the king and you're just a pawn. Would never recommend to anyone their service.", "pics": null, "resp": null, "gmap_id": "0x889a68e49b2eafcd:0xc157a44a948126d6"}
{"user_id": "113956344505758134843", "name": "Nicholas Leone", "time": 1354216631323, "rating": 5.0, "text": "Very GREAT work!!! I love this place!! Seems crazy that someone would write a bad review abt them both the husband and wife were such nice ppl!! Sweet lady and a family man!! I would recomend this place to anyone!!!", "pics": null, "resp": null, "gmap_id": "0x889a68e49b2eafcd:0xc157a44a948126d6"}
{"user_id": "108241628123319016375", "name": "Chip Bryars", "time": 1479238960589, "rating": 5.0, "text": "Brash but he is an excellent welder.", "pics": null, "resp": null, "gmap_id": "0x889a68e49b2eafcd:0xc157a44a948126d6"}
{"user_id": "111859715219121634196", "name": "C.H. Helterbrand", "time": 1469205047852, "rating": 1.0, "text": "The previous negative reviews about this business owner being vulgar and unprofessional are spot on. There are probably not many options for welding and fabrication services in Loxley, AL...but I would definitely try to find someone OTHER than this guy at all cost.", "pics": null, "resp": null, "gmap_id": "0x889a68e49b2eafcd:0xc157a44a948126d6"}
{"user_id": "112961577322438553942", "name": "Lisa Capers", "time": 1327617689492, "rating": 5.0, "text": "very good work ethics and beautiful handrails", "pics": null, "resp": null, "gmap_id": "0x889a68e49b2eafcd:0xc157a44a948126d6"}
{"user_id": "118057868617756104396", "name": "Melissa Barnhill", "time": 1533247068409, "rating": 1.0, "text": "I would never recommend this place.the guy has no manners at all.very bad personal skills..absolute ridiculous.how he has a business is way beyond me!!!", "pics": null, "resp": null, "gmap_id": "0x889a68e49b2eafcd:0xc157a44a948126d6"}
{"user_id": "117070996157584185323", "name": "bob bob", "time": 1498057444826, "rating": 1.0, "text": "how do i give negative stars? Rude, Rude, Rude", "pics": null, "resp": null, "gmap_id": "0x889a68e49b2eafcd:0xc157a44a948126d6"}
{"user_id": "107741142403929769549", "name": "Joshua Rogers", "time": 1331644182445, "rating": 1.0, "text": "Would rather use someone who doesn't think he's god's gift to mankind.  Very rude & belittling.", "pics": null, "resp": null, "gmap_id": "0x889a68e49b2eafcd:0xc157a44a948126d6"}
{"user_id": "105334959053825565427", "name": "William Covan", "time": 1510868918195, "rating": 1.0, "text": "rude,and had his welder  turned up too high for the metal being welded on....3 weeks from today now and welds have broke", "pics": null, "resp": null, "gmap_id": "0x889a68e49b2eafcd:0xc157a44a948126d6"}
{"user_id": "104810042552115040622", "name": "Robert Bullock", "time": 1441904591088, "rating": 2.0, "text": "Very rude guy.", "pics": null, "resp": null, "gmap_id": "0x889a68e49b2eafcd:0xc157a44a948126d6"}
{"user_id": "110851076987678472442", "name": "Andrew Dunscombe", "time": 1621453671925, "rating": 5.0, "text": "Great service, Friendly, & Helpful", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP9Hy4XgBv_PDLFgcArUTB2tE-1CWk9zMMFpJvG=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN3b1t194d3OLJ2FxG9_c_i0PH-j4rFE3I7Pww9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNcdBnVNoMuM02EMiZj34eeHlJhhVyoJJcb1tTD=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888bb3eb79ec9e8d:0x77c2f967afdb9327"}
{"user_id": "104655649512308667850", "name": "stan jones", "time": 1605621008673, "rating": 5.0, "text": "Great bunch of people working there\nLarge selection of metal products to pick from", "pics": null, "resp": null, "gmap_id": "0x888bb3eb79ec9e8d:0x77c2f967afdb9327"}
{"user_id": "117556020728811126388", "name": "John Mcnair", "time": 1597865823083, "rating": 5.0, "text": "Terry, Jason and the rest of their staff are professionals in the steel business.  Very knowledgeable and efficient with their product.", "pics": null, "resp": null, "gmap_id": "0x888bb3eb79ec9e8d:0x77c2f967afdb9327"}
{"user_id": "101110475755227727834", "name": "Gregory Kent", "time": 1623202920806, "rating": 5.0, "text": "Great local repair shop. Quick service.", "pics": null, "resp": null, "gmap_id": "0x8892931fef2dac93:0x575a55d37c9d01cd"}
{"user_id": "103458312456886980914", "name": "Lee Harrell", "time": 1610627662990, "rating": 4.0, "text": "Had a 12,000 lb winch mounted to my 25' flatbed trailer. Joe, owner/operator, mounted it exactly where I wanted it and did a pretty good job. He's already working on another small project for me to make a low pressure gas cooker. This will be my \"go to\" welding shop! Support this local, small business!", "pics": null, "resp": null, "gmap_id": "0x8892931fef2dac93:0x575a55d37c9d01cd"}
{"user_id": "104279497235161106431", "name": "Chris Andrews", "time": 1610583504284, "rating": 5.0, "text": "If you need something welded us voice to go and do a reasonable price very good service very satisfied", "pics": null, "resp": null, "gmap_id": "0x8892931fef2dac93:0x575a55d37c9d01cd"}
{"user_id": "106918705983962323176", "name": "Kevin Dunne", "time": 1613756184187, "rating": 5.0, "text": "Joe Riley was courteous and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x8892931fef2dac93:0x575a55d37c9d01cd"}
{"user_id": "112125865468461068870", "name": "Joe Whiddon", "time": 1621606481625, "rating": 5.0, "text": "Great experience", "pics": null, "resp": null, "gmap_id": "0x8892931fef2dac93:0x575a55d37c9d01cd"}
{"user_id": "111304030992766108060", "name": "Patrick Scott", "time": 1621970015796, "rating": 1.0, "text": "Chris at Harden Welding  built a wheelchair rack for the back of our S.U.V for the electric wheelchair and I have to say what a great job he did. He was kind and  very knowledgeable of his craft.  In the future if I need anything else like this done I will certainly call on Chris at Harden Welding. Chris has been gone from Harden Welding for some time now and sense then personally I don't know of any certified welder on hand at this shop the Owner Joe isn't Certified for certain.", "pics": null, "resp": null, "gmap_id": "0x8892931fef2dac93:0x575a55d37c9d01cd"}
{"user_id": "101406190137285117726", "name": "Rolando Cruz", "time": 1573488740895, "rating": 1.0, "text": "Called and call never answers the phone or pick up and hang up. Very unprofessional wouldn’t go here even if it was free.", "pics": null, "resp": null, "gmap_id": "0x8892931fef2dac93:0x575a55d37c9d01cd"}
{"user_id": "114662398417127069380", "name": "Baymont Inn", "time": 1542045704461, "rating": 1.0, "text": "Called to get a quote to repair my metal fence, never came. I Called him back and re scheduled myself he finally came, looked at the issue, he was very nice, said he knew how to fix it no worries he would send a quote.\n\nWaited a week no quote, called him he stated he would call the office for the quote to be emailed to me. We are 3 months now still no quote, I've called him half a dozen times he hasn't followed through with anything he's told me. My fence is still in disrepair, tired of calling this guy every week about HIS company.\n\nIf I cant even get a quote how can I trust his work? I'd look somewhere else if I were you, maybe they can follow through a little better with quotes and actually showing up!", "pics": null, "resp": null, "gmap_id": "0x8892931fef2dac93:0x575a55d37c9d01cd"}
{"user_id": "103969467047463090573", "name": "Troy Dunn", "time": 1592409014467, "rating": 5.0, "text": "Very good to work with", "pics": null, "resp": null, "gmap_id": "0x8892eca961a71a49:0xf29c019b0f846c6b"}
{"user_id": "103893980761011604774", "name": "ronald shannon", "time": 1580099583279, "rating": 5.0, "text": "AWESOME WORK", "pics": null, "resp": null, "gmap_id": "0x8892eca961a71a49:0xf29c019b0f846c6b"}
{"user_id": "104239154596480568890", "name": "Brenda Myrick", "time": 1616663669032, "rating": 5.0, "text": "The people are very knowledgeable about their metal. Friendly and helpful. Good prices! Great service!", "pics": null, "resp": null, "gmap_id": "0x8889aacaecbd179d:0xd0fab4df1900de4d"}
{"user_id": "115870506091736398788", "name": "Brett Norwood", "time": 1606927458020, "rating": 5.0, "text": "These guys at sloans supply are all amazing people to work with!! they have blessed me tremendously over and over again! I would recommend sloans to everyone that needs any kind of metal roofing or framing materials", "pics": null, "resp": null, "gmap_id": "0x8889aacaecbd179d:0xd0fab4df1900de4d"}
{"user_id": "103544790502108285433", "name": "Belinda Nelson", "time": 1611262688794, "rating": 5.0, "text": "Answered the question that we had and great prices on the supplies that we will need", "pics": null, "resp": null, "gmap_id": "0x8889aacaecbd179d:0xd0fab4df1900de4d"}
{"user_id": "107684651271823175609", "name": "David Willis", "time": 1595368255992, "rating": 5.0, "text": "Great place friendly staff quick loading 👌 👍 😀", "pics": null, "resp": null, "gmap_id": "0x8889aacaecbd179d:0xd0fab4df1900de4d"}
{"user_id": "111629201481998458747", "name": "BJ Lawrence", "time": 1610746865508, "rating": 5.0, "text": "Informative,  helpful, friendly,  attentive and expeditious.", "pics": null, "resp": null, "gmap_id": "0x8889aacaecbd179d:0xd0fab4df1900de4d"}
{"user_id": "102786639304610279275", "name": "Sheryl Blankenship", "time": 1540195922935, "rating": 5.0, "text": "I needed a few pieces of roofing and a couple pieces of  transition material and the kind and helpful staff fabricated it all while I waited.  A true pleasure to do business with these folks!", "pics": null, "resp": null, "gmap_id": "0x8889aacaecbd179d:0xd0fab4df1900de4d"}
{"user_id": "107859115927188287859", "name": "Jeff Harding", "time": 1555606283073, "rating": 5.0, "text": "Great company to work with. Highly knowledgable and friendly. I highly recomend Sloan Supply for all your metal needs", "pics": null, "resp": null, "gmap_id": "0x8889aacaecbd179d:0xd0fab4df1900de4d"}
{"user_id": "107482795528189812093", "name": "Taylor Taft", "time": 1443712593896, "rating": 5.0, "text": "Best place to get exactly what you are looking for. Super friendly and sincere people. You will not go wrong with Sloan Supply!", "pics": null, "resp": null, "gmap_id": "0x8889aacaecbd179d:0xd0fab4df1900de4d"}
{"user_id": "109732714594483860770", "name": "Karen Lawless", "time": 1490382831811, "rating": 5.0, "text": "GREAT PEOPLE< AWESOME PRODUCT\njust wish the hours available were better for \"Working\" people!", "pics": null, "resp": null, "gmap_id": "0x8889aacaecbd179d:0xd0fab4df1900de4d"}
{"user_id": "109853705725154948759", "name": "Kevin", "time": 1467748622921, "rating": 5.0, "text": "Good to work with and everything I've purchased was measured correctly with no defects.  Thank you!", "pics": null, "resp": null, "gmap_id": "0x8889aacaecbd179d:0xd0fab4df1900de4d"}
{"user_id": "117781652981926515535", "name": "Robert Eadie", "time": 1518021126810, "rating": 5.0, "text": "Great people! Family owned and operated!", "pics": null, "resp": null, "gmap_id": "0x8889aacaecbd179d:0xd0fab4df1900de4d"}
{"user_id": "117266916792771288645", "name": "Glenn McDonnell", "time": 1455470475880, "rating": 5.0, "text": "I have used Sloan Supply several times for metal roofing.  Works great.", "pics": null, "resp": null, "gmap_id": "0x8889aacaecbd179d:0xd0fab4df1900de4d"}
{"user_id": "100578997349483543743", "name": "Elizabeth Key", "time": 1566785286263, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x8889aacaecbd179d:0xd0fab4df1900de4d"}
{"user_id": "111530961740366497009", "name": "Robert Brewster", "time": 1520351994768, "rating": 1.0, "text": "These people are con artists", "pics": null, "resp": {"time": 1520352894937, "text": "Robert's company Brewster Roofing wrote us bad check in 2018 for $3100. He is upset that we are filing charges against him. Sorry for the fake review.\n\nHere is a link for you https://www.alabamanews.net/2018/11/19/montgomery-county-arrests-november-12-18/pic/114271/"}, "gmap_id": "0x8889aacaecbd179d:0xd0fab4df1900de4d"}
{"user_id": "114319472608274245063", "name": "Alex Key", "time": 1477580184294, "rating": 5.0, "text": "Excellent metal and customer service!", "pics": null, "resp": null, "gmap_id": "0x8889aacaecbd179d:0xd0fab4df1900de4d"}
{"user_id": "104118707421109643245", "name": "Electrical Power and Control", "time": 1601638339033, "rating": 5.0, "text": "Webster welding does it right every time, give them a call on your next project.", "pics": null, "resp": null, "gmap_id": "0x88897dc164b66635:0xa59515c505e27d9e"}
{"user_id": "103733953955143824482", "name": "Bruce Weaver", "time": 1598043494714, "rating": 5.0, "text": "Great people and service. They took control of my project and exceeded my expectations. The priice was right what I had calculated it would be as well. Great Job!!!", "pics": null, "resp": null, "gmap_id": "0x88896dbe8894868b:0xcb76626134c1d485"}
{"user_id": "104099598367036383258", "name": "adam ledbetter", "time": 1590617637056, "rating": 5.0, "text": "Great service. I highly recommend them for all your welding needs. Stainless steel, aluminum, mild steel and everything in between. Great repairs and fab work from scratch.they can even cut custom jobs on the water plasma table.", "pics": null, "resp": null, "gmap_id": "0x88896dbe8894868b:0xcb76626134c1d485"}
{"user_id": "100201846689322805856", "name": "ken hollis", "time": 1562106245686, "rating": 5.0, "text": "I had a very good experience at Valley Repair Service on 7-2-2019. We had a lawn tractor wheel and hinge break off a cutting deck. I called this service and spoke with Ken the shop foreman and he told me they could make the repair. I drove to the shop with trailer and mower in tow. Ken welded the wheel hinge back onto the cutting deck within minutes! Great service and very nice welding work!\nThank you to Ken and Valley Repair Service!", "pics": null, "resp": null, "gmap_id": "0x88896dbe8894868b:0xcb76626134c1d485"}
{"user_id": "108466177877219908807", "name": "Rachel Sausley", "time": 1518386679085, "rating": 5.0, "text": "Great group of people", "pics": null, "resp": {"time": 1518387382216, "text": "Thank you"}, "gmap_id": "0x88896dbe8894868b:0xcb76626134c1d485"}
{"user_id": "103686525798708435275", "name": "Mark Toland", "time": 1565535129288, "rating": 5.0, "text": "Best Fabrication and CNC company around. Great people very nice and very helpful. Made arrangements to have some special custom work done.", "pics": null, "resp": null, "gmap_id": "0x88623f78e2b30541:0x26b62ee1cf3e76f0"}
{"user_id": "104156937073273351145", "name": "Ted Sharp", "time": 1525205486894, "rating": 5.0, "text": "I had an air dryer that needed some aluminum welding, I talked to several welding shops and they were the only one that told me they could fix it while I waited. Not only did they fix it there repair was superior compared to two repairs I had previously. Would give a 10+ great people great work.", "pics": null, "resp": null, "gmap_id": "0x88623f78e2b30541:0x26b62ee1cf3e76f0"}
{"user_id": "110441295356112920827", "name": "Timothy Johnston", "time": 1596467407732, "rating": 5.0, "text": "Always a pleasure to visit Edwards Design and Fabrication", "pics": null, "resp": null, "gmap_id": "0x88623f78e2b30541:0x26b62ee1cf3e76f0"}
{"user_id": "106936609754789920856", "name": "Abby Edwards", "time": 1519268463795, "rating": 5.0, "text": "Very hard-working family business. Would recommend 10/10.", "pics": null, "resp": null, "gmap_id": "0x88623f78e2b30541:0x26b62ee1cf3e76f0"}
{"user_id": "104896252106829990882", "name": "Joel Lay", "time": 1592847971657, "rating": 5.0, "text": "Great guys and great management..", "pics": null, "resp": null, "gmap_id": "0x88884c7fe924020f:0xcf866761faa2c944"}
{"user_id": "109238524712506093832", "name": "Chad Knapp", "time": 1592598530739, "rating": 5.0, "text": "Friendly staff turning out quality parts.", "pics": null, "resp": null, "gmap_id": "0x88884c7fe924020f:0xcf866761faa2c944"}
{"user_id": "115305925976424784456", "name": "Clint Rice", "time": 1515868757904, "rating": 5.0, "text": "This place is kool and has a lot of metal fabricating machines lasers,brakes,turrent  presses and more , nice people and great parts", "pics": null, "resp": null, "gmap_id": "0x88884c7fe924020f:0xcf866761faa2c944"}
{"user_id": "110573740662435565002", "name": "Uncle Fungus", "time": 1448047347119, "rating": 5.0, "text": "Some good Ol Boys", "pics": null, "resp": null, "gmap_id": "0x88884c7fe924020f:0xcf866761faa2c944"}
{"user_id": "102679193764789257722", "name": "Jamie Vaal", "time": 1620433648954, "rating": 5.0, "text": "We had an amazing experience with these gentlemen! We were visiting from out of town and had a huge issue with a trailer which literally made impossible for us to continue our trip! They went above and beyond (seriously) to help us out! Thank you gentlemen so very much!", "pics": null, "resp": null, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "117549284173165215237", "name": "Mike B", "time": 1621546963480, "rating": 1.0, "text": "Very very rude people. Rseppionist is very rude when she answers phone. Terrible way to treat customers. This place is a joke . Waisted our time and didn't even do the job Which was a very simple job.", "pics": null, "resp": {"time": 1621596726752, "text": "We tried to accomadate this lady with her situation, I was even working on her project when she came to shop ,as far as being  rude, she wasn't very pleasant  herself, when you explain you will have to work her project in ,I even asked her to go wait in her truck while I finished her project, but no ,so sir I will be glad to finish ,come see me this morning yourself ,plates are all ready  made"}, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "112073226468449551182", "name": "amy tolbert", "time": 1588297643690, "rating": 5.0, "text": "Called almost at closing time and they told me to have my husband come on in . They stayed open for him and did an amazing job fixing the problem, charged a very reasonable price ,were very professional and friendly.Couldnt ask for any better.Would definitely use again.Thanks Micheal and the guys at J and S.", "pics": null, "resp": null, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "110104542312120385760", "name": "Reggie Burns", "time": 1604983331462, "rating": 5.0, "text": "Good workmanship", "pics": null, "resp": null, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "116948428538353870721", "name": "Nathan Nance", "time": 1605137427045, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "113305976062415365904", "name": "ashley robison", "time": 1494845545157, "rating": 5.0, "text": "I had a good neck ball installed in my truck and they did an awesome job it is clean and looks like it was installed during manufacturing!! I love it !! Thanks j&s!!", "pics": null, "resp": null, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "107743390634055755749", "name": "Yadier Val", "time": 1605808232936, "rating": 5.0, "text": "Very professional.", "pics": null, "resp": null, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "109292971604925715603", "name": "Sam K", "time": 1612384008844, "rating": 5.0, "text": "Mike and the team at Tramsmatic are fantastic - honest, fair, and extremely knowledgeable. I wouldn’t go anywhere else for all things transmission.", "pics": null, "resp": {"time": 1612544580940, "text": "Thanks Sam for leaving us a great review! Glad we could help."}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "103337085481804846037", "name": "Shane B", "time": 1609535023034, "rating": 5.0, "text": "Mike at transmatic is great. He does good work and actually cares about his customers.", "pics": null, "resp": {"time": 1612544596985, "text": "Thanks Shane!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "102491649837628209017", "name": "Stephen Corey", "time": 1582049009740, "rating": 4.0, "text": "Great place. Dose good work great prices.would high recommended to anyone that transmission work or anything.", "pics": null, "resp": {"time": 1582053544441, "text": "Thanks for the review!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "100401259912054628531", "name": "Aleksandr Emelyanov", "time": 1579195971325, "rating": 5.0, "text": "Very knowledgeable and helpful people work here. Hot rod DIY Friendly. Highly recommend!", "pics": null, "resp": {"time": 1579653250450, "text": "Thanks Aleksandr for the recommendation! Glad to help you with your project."}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "106652062642643447279", "name": "Nina Rossi", "time": 1555385884405, "rating": 5.0, "text": "Had an awesome experience with Transmatic! Took my Ford Edge in because I had a concern with a possible shifting issue and wanted to get it checked to make sure it was just me not being used to driving a Ford since it’s a new (to me) vehicle. The staff were not only super friendly, they were beyond fair on the diagnostic fee when they checked and said everything was fine after test driving it and checking for any codes. I highly recommend these guys for an all around great experience!!!!", "pics": null, "resp": {"time": 1579653413012, "text": "Thanks Nina!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "102815960528724658450", "name": "AL Hesse", "time": 1573701245820, "rating": 5.0, "text": "Fast and efficient service as they were able to get me in very quickly while on vacation.", "pics": null, "resp": {"time": 1579653343865, "text": "Glad we were able to help! Thanks for stopping in."}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "115902663058336642260", "name": "Dominick Mascolo", "time": 1522189103935, "rating": 5.0, "text": "Just got my Chevy Suburban back from Mike and the guys at Transmatic. By far one of the most professional experiences I've ever had with an auto shop. They kept me well informed on the progress, took me through a breakdown of all the parts and maintenance they were preforming and ensured it all was completed in a timely fashion.\n\nMike is a genuine character and very fun to interact with. His staff is the same way. Each time I went into the shop they made me feel comfortable and at home. I actually quite enjoyed going there. They scheduled me a follow up appointment for 2 weeks, to ensure all their work is in perfect order.\n\nI would recommend Transmatic to everyone. Excellent work by Excellent people!", "pics": null, "resp": null, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "117172514367151581450", "name": "Vinny Carnazza", "time": 1548479608810, "rating": 5.0, "text": "A true craftsman’s, the shop is a clean as a surgical room. Mike does not work on cars, he fixes them.  Great honesty service, ole fashion values, with technical competence as his centerpiece.  What a great experience during a frustrating time.", "pics": null, "resp": {"time": 1579653522717, "text": "Thanks Vinny!! What a wonderful complement! Glad we were able to help you out!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "105666152869664299029", "name": "nathan worth", "time": 1523556327269, "rating": 5.0, "text": "Hands down best service I have experienced in a long time. These guys clearly pride themselves in everything they do. If you are looking for an honest job these are the guys. This is will be my first stop regardless of the project.", "pics": null, "resp": {"time": 1523575401341, "text": "Thanks Nathan!! Glad to help!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "103790590323419236258", "name": "Clint Grantham", "time": 1509450886117, "rating": 5.0, "text": "Friendly, honest, knowledgeable & professional.  Shop is clean and organized.  Reasonable prices. I have complete confidence in these guys.", "pics": null, "resp": {"time": 1518840315256, "text": "Thanks Clint for a great review!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "113225349212928468319", "name": "Stephanie Hawkins", "time": 1522449684273, "rating": 5.0, "text": "Mike, Trent and the entire crew at Transmatic Transmission are incredible!! They are professional, knowledgeable and very friendly!! They fixed our Infiniti G37! They were able to do a clutch and master cylinder installment with fabrication to the transmission bell housing which improved clutch pedal and shifting response and eliminated his problem of premature friction plate wear! For the work we received the cost was incredible as well!! We highly recommend them!!\n\nThank you guys - John Perez & family!!", "pics": null, "resp": {"time": 1522460273320, "text": "Thanks John for taking the time to leave a review & recommendation! Let us know if we can help with anything else."}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "113025087287525443540", "name": "J Steph", "time": 1509850177926, "rating": 5.0, "text": "You won't find another shop in 300 miles with this amount of good reviews. Mike is trustworthy and accountable, it will be repaired right or not at all. Mike rebuilt my 48re in a 2500 ram diesel with heavy clutches, billet servo piston, and a billet torque converter. He had to replace some hard parts and still only charged me what he quoted me. I will say this, it cost 1k less than any other 48re built the same that I could find . It has now been 6 months, pull a 10k lb camper regularly - not a single problem. I feel fortunate to have found this shop, could not be happier with the service and product that I recieved.", "pics": null, "resp": {"time": 1518840268306, "text": "Glad we could help Joel! Thanks for the recommendation!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "112837280534817230354", "name": "Michael Lassiter", "time": 1449703487774, "rating": 5.0, "text": "Some of the best people you will ever meet. Honest and trustworthy is an understatement. I have never seen a shop that will invite a customer in to show exactly what the problem is, explain what caused the problem and then gives options and recommendations even if his recommendation is a solution that is less work and less expensive.", "pics": null, "resp": {"time": 1518842027374, "text": "Thanks you Mike! Thanks for taking time to leave us a great review!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "106739305892121837823", "name": "Jeffrey Roth", "time": 1449678997471, "rating": 5.0, "text": "We love the service at Transmatic Transmissions.  Mike and Jamie are always very helpful when ever we need them.  We have never had any issues with any repairs and they will make you feel like family. They are the only shop I will ever use.", "pics": null, "resp": {"time": 1518841709183, "text": "Thanks Jeff for a great review! Let us know if we can help in any way."}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "107529841673916316916", "name": "Matt Seiber", "time": 1460208809051, "rating": 4.0, "text": "Transmatic did some warranty work for me last week,  and was very helpful and friendly. I'm sure that warranty work is a pain, but he never gave me any issues and got my vehicle back to me in a very timely manner.\n\nIf I'm ever back at Rucker (we always come back: )) and need work done, I'll come here first.", "pics": null, "resp": {"time": 1460389630928, "text": "Thanks!!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "106740913926680189066", "name": "Isaac Helvin", "time": 1527117140457, "rating": 5.0, "text": "Needed an air conditioning line welded up on my Chevy pickup. They did a great job! Very professional! Could not ask for better service!", "pics": null, "resp": {"time": 1579653597683, "text": "Thanks Isaac!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "118253030385258409939", "name": "C. Herring", "time": 1492706217036, "rating": 5.0, "text": "Superb service and repair! Mike and Trent are truly professional when it comes to the care and maintenance of your vehicle. Their repair shop is organized and well maintained. Trent came and picked up my truck and delivered to their shop with care. They immediately started the repair and was amazed on how fast they completed the job. After they removed the transmission and before putting it back together, Mike took the time to show me each part, the part that failed, and what parts he was going to install. He also make recommendations on upgrades and suggestions on the care and maintenance on the vehicle after the repair was complete. While removing the transmission and re-installing it, Trent inspected the vehicle components to ensure that any or potential problems were identified along with repair recommendations.\nThere was no stress and at no time did I feel they were pushing for un-neccessary repairs. I can say that they truly \"have your back\" on repairing your transmission.\nThey are like doctors, they want to do a check-up on my truck in two weeks to ensure that everything is operating properly with no leaks. The one year warranty is awesome, but I believe that because of the correct and  proper repair, I won't have to bring it back in for any warranty work. Awesome job Mike and Trent, I know with your high maintenance standards and friendly customer service will take your business far!!! Thanks again!!!!!", "pics": null, "resp": {"time": 1518840492829, "text": "Wow!! Thank you for taking time to give us a great review & telling our future customers about your experience!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "104282376125779286894", "name": "Jan Peters", "time": 1549666188583, "rating": 5.0, "text": "Clean shop, true car mechanics (no parts changer).\nHighly recommended!", "pics": null, "resp": {"time": 1579653443382, "text": "Thanks for the recommendation!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "116450463262720192262", "name": "wickdgt", "time": 1449685569161, "rating": 5.0, "text": "(Mike) Transmatic Transmissions is the only shop that works on my vehicles transmission. Trust worthy, has done my race car transmission, the gears on my truck and my wifes van etc. All great prices, tells you and shows you what is wrong and what is needed to be done. He would not start a job unless he has confirmed with the owner. Very honest and will not guide you wrong.", "pics": null, "resp": {"time": 1518841907509, "text": "Thanks for the repeat business & for leaving us a great review! We value you as a customer. Give us a call with any future needs."}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "100845472705666318348", "name": "Jerry Sanders", "time": 1449705571105, "rating": 5.0, "text": "I had my transmission on my Honda Odyssey rebuilt 2 years ago by these folks and have been well pleased. No issues at all. They were very helpful and courteous and treated me very well!", "pics": null, "resp": {"time": 1518842125472, "text": "Thank you Jerry for your business & for taking time to leave us a review!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "104815540079696195547", "name": "Brandon Jackson", "time": 1471444469149, "rating": 5.0, "text": "Mike and his guys are absolutely awesome.  I took on a project transmission at my house and was ready to give up.  Mike did everything he could to save me money by keeping my transmission out of his shop.  He gave me so many tips and tricks, and pointers on how to properly build my transmission.  He even stopped by my house to check my work, FOR FREE!\n\nI have spent many hours in the shop with Mike, just watching him work, and he is incredibly thorough.  He is a very honest and trustworthy individual and I would never hesitate to take my vehicles to him if need be.  If you have troubles with your transmission then don't even think about any other shop, GO TO MIKE!!", "pics": null, "resp": {"time": 1518842489194, "text": "Thanks, Charles! Glad I could help you out!! I enjoy project cars and enjoy teaching. Thanks for the review!!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "105017024639806350689", "name": "Mendy Pickle", "time": 1449680377829, "rating": 5.0, "text": "We have always had great service from Transmatic Transmissions. Mike is fair & honest w us. Being a female, I appreciate that!", "pics": null, "resp": {"time": 1518841815008, "text": "Thanks Mendy! Appreciate you taking time to leave a review!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "114388233041929143771", "name": "Kenneth Gunter", "time": 1445450499250, "rating": 5.0, "text": "I have dealt with many auto and transmission shops in the past and I have to say this is one of the better shops I have ever dealt with.  I have had them install gears as well as transmission work and have never had an issue.  They go out of their way to help their customers.  I would definitely recommend them to anyone.", "pics": null, "resp": {"time": 1449591426399, "text": "Kenneth, thank you for the review & your repeat business!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "118036117283792484561", "name": "Jan Mccarson", "time": 1449706425692, "rating": 5.0, "text": "Mike and his family are great people! I wouldn't hesitate to bring my vehicle there for work.", "pics": null, "resp": {"time": 1518842165562, "text": "Thanks Jan for a great review! We appreciate you!!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "113320263632736447326", "name": "jennifer jackson", "time": 1448317597265, "rating": 5.0, "text": "My husband's truck stopped in the road - literally.  He pushed it to the side, called Transmatic and they towed it soon after.  WIthin a day, we had a \"diagnosis\" and an estimate.  Mike showed us every part, how it worked and what was wrong.  He was very thorough.  I thought the price was very fair considering it was a 4 wheel drive truck (and I knew what I had paid to have my \"regular transmission\" Tahoe rebuilt a few years earlier).  We have had no complaints about the job that was done.", "pics": null, "resp": {"time": 1449591449442, "text": "Thank you Jennifer!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "112875627495321861540", "name": "david willis", "time": 1449792563531, "rating": 5.0, "text": "Woukd recommend Transmatic Transmission in Enterprise to everyone I know! They know customer service and how to treat their clients! Hard to find folks these days that truly care AND do a great job! Thanks Mike!", "pics": null, "resp": {"time": 1518842251760, "text": "Thanks Dave for leaving a great review!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "102406325151055145430", "name": "Haley Harding", "time": 1481157849269, "rating": 1.0, "text": "Had an appointment on a Thursday morning for a diagnostic test and when I called around 2pm they said my car was next. Called several times with no response. Finally on Tuesday, five days later, the had ran the diagnostic but informed me that I would need to take my car to another shop to fix it. Very displeased with their service. They kept my car five days and couldn't do a discount or anything. I have no problem paying that but five days just to run a diagnostic is absolutely ridiculous! Will never go back to transmatic transmission due to poor service and rude employees!!", "pics": null, "resp": {"time": 1518841355905, "text": "Haley, So sorry you felt displeased. Yes, you had an appointment with us Thursday morning to leave it with us so we could properly diagnose your vehicle. However, you brought it that afternoon instead. Yes, it took little longer to get to as it would not start. We are closed Sat & Sunday. When Mike could get it running & get it properly diagnosed it was a problem that needed to be repaired elsewhere. He charges a $75 flat rate diagnostic fee as you were told prior to leaving it. Sorry you feel that is unfair. It took him a lot longer than 1 hour to work on the car to get it running and to then diagnose the problem. Hope you were able to get your vehicle repaired."}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "102700167320055270364", "name": "Josh McGowan", "time": 1513883435701, "rating": 5.0, "text": "Good hardworking honest people working here. I would use again", "pics": null, "resp": {"time": 1518840167454, "text": "Thanks, Josh! Glad we could help!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "100485585375878125592", "name": "snooper J", "time": 1444254689115, "rating": 1.0, "text": "These people are dishonest. I am female and took my vehicle there to check on some slipping I have been having on my transmission. I told them IF it needed the fluid change to change it BUT if it need more major work to let me know first. By 4 in the afternoon I didn't hear anything so I called and MIKE said he drove the vehicle and didn't find anything wrong and the fluid was good. So when I went to pick my vehicle up it was in the exact same spot I parked it at and the seat was not even moved. I am really short and MIKE is tall so HE did not check my car and they charged me 75 dollars for nothing and gave me a blank service receipt. I am really disappointed that Mike stooped so low .", "pics": null, "resp": {"time": 1449591391966, "text": "Lupe,\nIt is with sincere apologies that you feel we were dishonest with you.  I spoke with you to let you know that I could not get the problem to show itself and that you could pick up your vehicle.  I am sorry that I was not there when you arrived to get your vehicle. I told you to bring it back by the shop when it was giving you the problem and I would be more than happy to drive it again without charge as sometimes the problem will not show itself.  I was trying to help you and not take advantage of you as had I charged you more and serviced a transmission that is already having problems it would not fix the problem and could possibly make it worse for you.  I did charge you a diagnostic fee for the time I took to test drive your car and to scan it for problems. I am sorry that you feel your car was not moved.  I can assure you that in fact it was moved. As in the email my wife sent you we do value our customers and would have liked an opportunity to have made this right or talked further with you.  We did speak to our employee for not making the ticket note that a diagnostic fee was what you paid $75 for. Sorry for the delay in response as we usually are not checking online reviews. This was brought to our attention by Google. Again, our deepest apologies.\n\nMike"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "109037649011136812661", "name": "Keith Kraker", "time": 1478102066309, "rating": 4.0, "text": "Very busy shop and hard to get in. A testament to what people thing about the quality of this shop, however, plan at least a month in advance if you need any work done. Called/stopped in four weeks in a row and was told every time to call back a week later. Was never able to have them take a look at my car, much less fix it. Mike was very polite in person but a little brusque on the phone.", "pics": null, "resp": {"time": 1478107224169, "text": "Your business is appreciated. We will work to fix this and sorry for any inconvenience. Call me if there is anything I can do to help you out if you haven't been able to get your car in anywhere else. Most times the waiting is not a month. We have been blessed to be busy lately. We strive to do quality work and due to limited parking we do not like to take vehicles in until we are ready to work on them. Thank you for your review & again call if I can do anything."}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "104742775076058321207", "name": "Jennifer Moseley", "time": 1517248994839, "rating": 5.0, "text": "These people are excellent to do business with; forth right and honest! I would definitely recommend them for any transmission work you may need.", "pics": null, "resp": {"time": 1518840128537, "text": "Thank you for the recommendations Jennifer!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "106318480567975496437", "name": "Kathy Anderson", "time": 1449677886127, "rating": 5.0, "text": "The people here are very friendly and trustworthy, know their business, work done in a timely manner and explains in detail.Thanks", "pics": null, "resp": {"time": 1518841639288, "text": "Thank you Kathy for taking time to give our business a good review!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "105167219201659020965", "name": "Christine Joiner", "time": 1449853121308, "rating": 5.0, "text": "Very knowledgeable, helpful and reasonably priced with excellent service\nWill be the first place I'll call!!!", "pics": null, "resp": {"time": 1518842304222, "text": "Thanks Christine!! We are here to help!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "103142525162719308180", "name": "Charmayne Sanders", "time": 1449677859055, "rating": 5.0, "text": "These are honest, trustworthy people and do great work! Wouldn't go anywhere else!", "pics": null, "resp": {"time": 1518841594625, "text": "Thanks, Charmayne for a great review!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "117288871297337837786", "name": "Mills Smith", "time": 1449714735863, "rating": 5.0, "text": "Friendly and helpful service.  Thanks guys!", "pics": null, "resp": {"time": 1518842192571, "text": "Thanks Mills!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "103927580926104975317", "name": "Dhannon Thomas", "time": 1448318843030, "rating": 5.0, "text": "Mike and all his employees are very good!", "pics": null, "resp": {"time": 1449591521190, "text": "Thank you Dhannon!  We do not mind at all helping you & your Grandmother out with her car needs."}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "118302399125499334970", "name": "Jean Munoz", "time": 1465618095755, "rating": 5.0, "text": "Responsible person can trust on his knowledge", "pics": null, "resp": {"time": 1518842381238, "text": "Thanks Jean!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "103505957668836212762", "name": "John Hodgson", "time": 1450017505933, "rating": 5.0, "text": "Great expedient service.", "pics": null, "resp": {"time": 1518842332605, "text": "Thanks, John! Glad we could help!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
{"user_id": "105458751191054613027", "name": "Yancey Del Rio", "time": 1449777834222, "rating": 5.0, "text": "Wonderful, honest people!!!!  Great service all around!!!!", "pics": null, "resp": {"time": 1518842209708, "text": "Thanks Yancey!!"}, "gmap_id": "0x88926ef73ff8ed89:0xb716e49d4f6fffb8"}
