{"user_id": "102430034200774805127", "name": "Sarah Andrews", "time": 1614708201337, "rating": 5.0, "text": "The staff is very knowledgeable. I began this journey with some underlying immune system issues. I have been getting IV vitamin infusions for over 3 years now (and ozone therapy for the past year). I literally feel like a new person. I can’t speak highly enough of the staff and especially nurse Stephanie, she is my favorite. I’m not the easiest stick, but she starts my IV effortlessly each time. Highly recommend this clinic!", "pics": null, "resp": {"time": 1614709409559, "text": "Thank you so much Sarah!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "101331390932875267423", "name": "Kelley Norris", "time": 1617915253525, "rating": 5.0, "text": "I started with Vital Force in January 2021.  As a Registered Nurse, you better believe I did some research and asked questions prior to starting.  Joey was instrumental in my decision make an appointment.  He answered a lot  of question before I ever agreed to come in.  The day I went for my consultation, I was at the end of my robe.  I felt horrible. A full 2 years of my body aching bone deep, I didn't have the energy to get beyond half a day. I knew my hormones were way out of balance.  I also knew something was more wrong than being a 50yr old menopausal woman who had to live with it.  The program was explained in detail.  Once my lab work came back.  I mean an extensive panel of labs!  The proof was right there in front of me.  The Team at Vital Force tailored a program to fit my needs.  It took about 3 weeks of taking supplements and IV infusion therapy then I noticed a huge change in my self. Each week, I was better than the last.  I HAVE MY LIFE BACK !!  I feel better than I have in years.  If you don't take time to take care of yourself, you body will make you do it !  If you are in doubt about whether Vital Force is right for you , GO, meet with the team and let them help you be the best version of yourself.", "pics": null, "resp": {"time": 1617916241043, "text": "That's amazing Kelley!  Thank you so much for your kind words!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "115919819234471758444", "name": "michael “shane” palmer", "time": 1626633705505, "rating": 5.0, "text": "This by far is the best place i have been to. They got me on a program that has worked perfect for me. They are very informative, answered all my question, and got my body back on track. I would highly suggest you make an appointment and get your health back.", "pics": null, "resp": {"time": 1626635563166, "text": "Wonderful! Thank you Shane!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "108567957087840596231", "name": "Virginia Dickey", "time": 1614705860989, "rating": 5.0, "text": "review: I was lucky to find vital force. I had trouble finding vitamine C. the receptionist Christian is friendly and knowlegable. The nurse Stephanie does the best job with my infusion. I think she needs a raise.", "pics": null, "resp": {"time": 1614709399699, "text": "Thank you so much for sharing your positive experience"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "110312423157994817811", "name": "Trevor Clark", "time": 1615347937252, "rating": 5.0, "text": "I recieved IV's of Vit C & ozone here for 5 months, for post covid lung swelling, aka long covid. This therapy is helping a lot! Also I want to thank nurse Stephanie for her excellent venipuncture skills! I am type 1 diabetic and have had many many IV sticks in my life. So I am a pretty harsh judge of IV nurses! I never worry about digging or painful IV issues when I go to Vital Force, it is always an easy experience.", "pics": null, "resp": {"time": 1617916281447, "text": "Thank you so much Trevor!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "103913509925704681494", "name": "Amasico Rainer", "time": 1611066333595, "rating": 5.0, "text": "I was in pain and confused about what was going on with me. After my first consultation, Dr Russell and his staff assured me they could help. After my evaluation, they explained what was happening and the best methods to treat me. Three weeks in and I feel like a new human being. The staff is knowledgeable, helpful, and always welcoming.  Anyone out there confused and looking for answers please contact Dr Russell and his staff.....", "pics": null, "resp": {"time": 1611069504198, "text": "So wonderful ! Thank you Amasico!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "101998139273764485768", "name": "Geoff Lay", "time": 1614377398667, "rating": 1.0, "text": "Money is their mantra. Your health is how they manipulate you out of your money.  They promise you, you’ll feel better but it’ll cost you thousands and then guess what— you never feel better. Do yourself a favor and go to HIMS.COM $35 annually for testosterone in comparison to these guys $300 monthly— you can also get your growth hormone on HIMS.COM, too!! Save yourself the money and bad experience!!", "pics": null, "resp": null, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "107225392647957556079", "name": "Marvin Brand", "time": 1606609907746, "rating": 5.0, "text": "I was clueless  on what was going on with me personally and with my strength because I powerlift. So I got in touch with vital force to set up an appointment to take care of my issues I was having. I was very impressed with how Knowledgeable, polite and honest everyone there was, the staff made me feel like family, the issues I was having are in process of getting fixed. Little do vital force know is that they really saved my life. I’m thankful to meet a great family like vital force, and I would encourage everyone without a shadow of doubt to go There. I promise you won’t regret it. They will get you right!!", "pics": null, "resp": {"time": 1606610736728, "text": "Thank you so much Marvin!  It's a pleasure working with you and we are excited to help you get better every day!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "110312423157994817811", "name": "Trevor Clark", "time": 1615347937252, "rating": 5.0, "text": "I recieved IV's of Vit C & ozone here for 5 months, for post covid lung swelling, aka long covid. This therapy is helping a lot! Also I want to thank nurse Stephanie for her excellent venipuncture skills! I am type 1 diabetic and have had many many IV sticks in my life. So I am a pretty harsh judge of IV nurses! I never worry about digging or painful IV issues when I go to Vital Force, it is always an easy experience.", "pics": null, "resp": {"time": 1617916281447, "text": "Thank you so much Trevor!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "102107753102309292150", "name": "Sandra Cunningham", "time": 1614786979955, "rating": 1.0, "text": "They dig the needle in your arm - I've never been afraid of IV's up until this experience. A total of four unsuccessful sticks.----I visited 1580 Montgomery HWY St14B- beside the boxing gym ---Isnt that right??--- My madian name was listed at the time of visit. But listen you guys are rude and in violation of HIPPA. I'd rather spare myself of the bad energy of a second visit. Thank you for your response. You really should \"stick\" to your own protocol.", "pics": null, "resp": {"time": 1614702041901, "text": "Hi Sandra, you must have the wrong clinic. We are very specific with our I.V. Protocols. Our policy is that we do not stick anyone more than twice in the same day. We also ask patients who book an appointment with us about their hydration habits to make sure everyone has a pleasant experience. If we do ever have someone who is difficult to stick we have a protocol we give them to follow before they come back in. Also we do not have anyone by your name who has ever come into our clinic and received treatment"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "101132279473087998588", "name": "Roger Adams", "time": 1614786137660, "rating": 1.0, "text": "I've had an incredibly tough time reaching someone at this facility. They don't return calls and once you do reach someone- they're rude.", "pics": null, "resp": null, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "111092940022091163323", "name": "Patrick Leonard", "time": 1606848082305, "rating": 5.0, "text": "They have been instrumental in helping me get my body fine tuned and running better than it ever has!", "pics": null, "resp": {"time": 1606849163045, "text": "Awesome thank you Patrick!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "104753689267605385702", "name": "wayofthelittleflower", "time": 1597094059857, "rating": 5.0, "text": "Absolutely beautiful and pleasant staff, well informed and provided excellent education about supplements.\nI love using calm and shared information with my husband!!! Thank y’all, for being so helpful👍🏼", "pics": null, "resp": {"time": 1597097782586, "text": "Thank you very much for the kind review!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "105534073761199011831", "name": "Kimberly Johnson", "time": 1614375622263, "rating": 1.0, "text": "Literally, zero calls go through, you can never get anyone on the phone. Terrible customer service.", "pics": null, "resp": null, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "116595072798016777919", "name": "Brittany Blanks-Jefferson", "time": 1572718286473, "rating": 5.0, "text": "The facility was clean and easy to locate. The staff was friendly and welcoming. They were very professional and answered my questions. I felt very comfortable with the nurse Stephanie who placed my IV. They also have wonderful massage chairs and allow you watch Netflix while you’re getting your infusion. I love the experience. I’ll post how I feel about my infusion results in a week or so", "pics": null, "resp": {"time": 1579446958003, "text": "Thank you Brittany"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "116874369094150980790", "name": "Cheryl Lambert", "time": 1580239546298, "rating": 5.0, "text": "Revive Therapy and Wellness gives the 5 star treatment!!! The staff is friendly, helpful and definitely goes above and beyond. Dr. Russell and his staff are dedicated to helping each one of their patients. After several years of struggling with my weight stemming from hormone and thyroid issues, Dr. Russell has helped me get to the root of my problems and I have already dropped 40lbs. I look forward to continuing to work with Dr. Russell and his staff. I highly recommend.", "pics": null, "resp": {"time": 1580300884701, "text": "Thank you so much Cheryl!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "117548616063925923413", "name": "Brian Miller", "time": 1584592042663, "rating": 5.0, "text": "They have a excellent service and a knowledgeable staff. It is a very pleasant experience and I am recommending all my friends go get the Ozone/Vitamin IV treatment. It's Wonderful 😁", "pics": null, "resp": {"time": 1584632669846, "text": "So glad you enjoyed the Ozone and Vitamin IV treatments!  Thank you Brian!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "117450458609287050700", "name": "Jason Hooper", "time": 1576012850399, "rating": 5.0, "text": "I discovered Revive Therapy & Wellness a little over one year ago and the results I have experienced personally have been out of this world! From treating common illnesses, getting that extra vitamin boost or regulating my hormone levels - Revive has been there for me the whole way as they have gone above and beyond to not only provide care for me but also to educate me to take the healthiest steps forward for personal health care helping me become the best me I could be!\n\nGo see them and let their staff help you live your best life now!", "pics": null, "resp": {"time": 1577474689780, "text": "Thank you!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "114646977743612301608", "name": "Terry Hall", "time": 1578949322553, "rating": 5.0, "text": "Love the people here. Very informative and they focus on you. I’m doing wellness plan and so far everything is great. I should be the most well person in my family.", "pics": null, "resp": {"time": 1578953000290, "text": "Thank you so much Terry!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "110815138039792952902", "name": "Jabari Mosley", "time": 1575914146896, "rating": 5.0, "text": "I absolutely love this place!! The staff and the doctor are great people and make you feel so comfortable. All of the treatments that I have tried are well worth it. I would recommend them to anyone.", "pics": null, "resp": {"time": 1579380940384, "text": "Thank you Jabari!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "111781285622574850625", "name": "Missywehby@yahoo.com MiWe8384", "time": 1576702082665, "rating": 5.0, "text": "Ready to start taking the best care of myself that I can! Every person here was friendly and welcoming. Facilities are clean and comfortable. Looking forward to a journey to better health with Revive!", "pics": null, "resp": {"time": 1577474598371, "text": "Thank you Missy!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "100476617768962357382", "name": "luis sayago", "time": 1574884875252, "rating": 5.0, "text": "Wonderful experience!! great solutions for your health! I highly recommend.\n\nI have celiac disease and it help my immune system a lot.\n\nThank you.\n\nLuis", "pics": null, "resp": {"time": 1579446918319, "text": "Thank you Luis!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "102190068220830575418", "name": "Hunter Freiberg", "time": 1575911164283, "rating": 5.0, "text": "Everyone is super friendly and knowledgeable. I asked lots of questions and they were all carefully answered. I would recommend anyone check them out if you want to feel better and live a better life", "pics": null, "resp": {"time": 1579380960897, "text": "Thank you Hunter!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "103876248276051961553", "name": "Paradise Parker", "time": 1536204707214, "rating": 5.0, "text": "Revive is incredible! Highly recommended. Very beautiful and clean atmosphere combined with an awesome staff that makes you feel comfortable and welcome. I've never had a vitamin infusion before I came here and I'm amazed at the results! I feel like a new person! To make my experience even greater, they took my blood work to see exactly what I was lacking... now I'm able to get specifically what my body needs in my future bags! Go check them out!", "pics": null, "resp": {"time": 1551205141822, "text": "Thank you Paradise!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "101117813400217927665", "name": "Tracie Eddings", "time": 1575994287823, "rating": 5.0, "text": "This is the MOST AMAZING process to rebuild the body you can do.  I recommend it once every 2 weeks.  Whooooo.  Feeling 28 again.. Each wonderful staff member you encounter is AMAZING", "pics": null, "resp": {"time": 1579380910155, "text": "Thank you Tracie!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "110399188013416054759", "name": "mylivecoral", "time": 1607373340703, "rating": 5.0, "text": "Great business with great results, highly recommend.", "pics": null, "resp": {"time": 1607374082356, "text": "Thank you so much!  We appreciate you!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "108797148572277562527", "name": "Crechale Mayfield", "time": 1590008972472, "rating": 4.0, "text": "Great experience! Friendly knowledgeable staff. I'll definitely be back!!", "pics": null, "resp": {"time": 1590079537474, "text": "Thank you Crechale!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "100694942903329035037", "name": "Clay Dunbar", "time": 1551204134953, "rating": 5.0, "text": "Great all around. This is comprehensive preventative medicine. It’s not a doc in the box or wholesale vitamin bag place so don’t get in a hurry but your life will get better if you take the time and do the stuff. Really nice staff. DR’s Russell are great and really have great solutions. Their vitamins are best sourced and most effective.", "pics": null, "resp": {"time": 1551204982980, "text": "Thank you so much Clay!  Appreciate your kind words."}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "112046033940387810992", "name": "Alexis Pogue", "time": 1554067682664, "rating": 5.0, "text": "Dr. Ryan Russell has been every bit of amazing to me!! I live in Kansas, so everything we do is out-of-office work.\nI reached out to Ryan a while back saying I was interested in Revive helping me get back on track after a year of dieting for competition prep left me knowing my health needed to be improved.\nHe was so responsive from the get-go and the next day took the time to have a phone consult with me to discuss my concerns and goals.\nAll new-patient forms were sent to me Tuesday morning by Alisha, and we were able to easily get my blood drawn in Kansas and faxed back over to them!\nAs soon as results came in I got a call from Ryan to discuss my parameters and what all we could do to get everything back in check. Between vitamins, supplements, and prescriptions he has taken the BEST care of me and has been there for me to make sure we get me at my best self!!\nI really can’t say enough about Revive, Ryan, and the rest of the staff - I trust them with my health even though I’m states away. Ryan - thank you!!! I could not be on the path I am without you!", "pics": null, "resp": {"time": 1570480306164, "text": "Thank you !"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "112688019377961958319", "name": "Joey Chiofalo", "time": 1536715230911, "rating": 5.0, "text": "Revive is one of the best and most professional places that I have been to.  Best IV bags around and they have all of the trace minerals that you need to function on a high level each day and feeling great. Me and my girlfriend both have been taken care of by Dr. Ryan Russell and Dr. Gary Russell and they have gotten us everything that we needed to feel healthy and to function at a healthy level. If you are an athlete, bodybuilder, powerlifter, regular person, even someone who just works out to stay in shape, etc., then this is a perfect place for you to go and get infusions done. They will put together a customized list of things that fit you and only you to put you in a healthy state. Highly recommended.", "pics": null, "resp": {"time": 1551205059876, "text": "Thank you so much Joey"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "109278915369518121719", "name": "rmq92", "time": 1605040304029, "rating": 5.0, "text": "Exactly what Birmingham needed! Great services!", "pics": null, "resp": {"time": 1606610754101, "text": "Thank you!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "103922958705284722165", "name": "Justin Walmsley", "time": 1575992217115, "rating": 5.0, "text": "I have been coming here for over a year now to get treatment for my hormonal issues and they have been extremely helpful in getting it corrected as well as recommending any vitamins I am deficit in and setting up a plan to keep me going in the right direction. I highly recommend coming here even if it is just to get some blood work done to see what you need to work on to be healthy.", "pics": null, "resp": {"time": 1579380919297, "text": "Thank you Justin!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "116722117260852914188", "name": "Reed Warner", "time": 1595451518988, "rating": 5.0, "text": "The Doctor and his staff are excellent. Recommendations have been spot on and helped me  tremendously.", "pics": null, "resp": {"time": 1595455437197, "text": "Thank you Reed!  Glad we are able to help!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "106559281149072871347", "name": "Todd Cook", "time": 1536290862344, "rating": 5.0, "text": "This place is AWESOME! Super professional and knowledgeable staff. By far the nicest and cleanest place of business I’ve been in! Don’t waste your time with the competitors...REVIVE is IT!! Thanks for taking such GREAT care of me and my family. We will continue to support you guys.", "pics": null, "resp": {"time": 1551205122851, "text": "Thanks Todd!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "104985839612777976454", "name": "Susan Pierce", "time": 1581456351798, "rating": 5.0, "text": "Loved the options of adding nutrients. The atmospheric is healing and extremely friendly staff.  Loved it!", "pics": null, "resp": {"time": 1581460013147, "text": "Thank you so much Susan!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "118252225057870486475", "name": "Mureen Perkins", "time": 1560541113978, "rating": 5.0, "text": "Amazing staff and personalized attention. I feel healthier and have more energy than I have in years. Well worth the investment in myself. Highly recommend!", "pics": null, "resp": {"time": 1560541907429, "text": "Thank you Mureen!  We appreciate you!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "114214685326234351116", "name": "josh kilgore", "time": 1576167125876, "rating": 5.0, "text": "I can’t brag on these guys enough! Ryan has been so helpful in getting me back on track! Give these guys a shot you won’t regret it!", "pics": null, "resp": {"time": 1577474651756, "text": "Thank you Josh!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "106272516981007800831", "name": "Mara Okshteyn", "time": 1582671687567, "rating": 5.0, "text": "We are blessed to have Revive in town!\nI had a bad reaction to dental anesthetics and getting a surgery recovery bag infusion with Vitamin C and gluth\\athione helped me tremendously! I already had two infusions and will be getting them after each dental treatment.\nYesterday I had an ALA (alpha-lipoic acid) infusion, which is a new addition to the practice. I had a wonderful sense of warmth and relaxation during the infusion, and it helped to soothe bad neuralgic pain after the dental treatment.\nALA has many health benefits, just ask Dr. Russell if it's right for you.\nThank you Dr. Russell for being so helpful, considerate and caring. I really appreciate what you have done for me.\nStephanie is a great nurse with easy hands, she makes the treatment more comfortable and pleasant.\nAlisha and Amber have been amazing, sweet and helpful.\n\nI love you guys!", "pics": null, "resp": {"time": 1582675563954, "text": "Thank you so much Mara!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "106171577317452305883", "name": "RUmiko Forrester", "time": 1575987010711, "rating": 5.0, "text": "Dr. Russell is awesome and knowledgeable. The staff is awesome and are people's  people.I would definitely recommend and will be going back!!", "pics": null, "resp": {"time": 1579380930866, "text": "Thank you Rumiko!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "116290259579508680284", "name": "Garret Graham", "time": 1579373942353, "rating": 5.0, "text": "Absolute pleasure visiting revive therapy the staff is overwhelmingly nice and helpful and I will definitely be returning.", "pics": null, "resp": {"time": 1579380872173, "text": "Thank you Garret!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "105569581960217548538", "name": "starr howard", "time": 1579374185524, "rating": 5.0, "text": "First time coming here and we will definitely be coming back! The people that work here are so nice and have an abundance of knowledge about what they do!", "pics": null, "resp": {"time": 1579380859942, "text": "Thank you so much for your kind words Starr"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "106298094328636003173", "name": "Olivia M", "time": 1536373781222, "rating": 5.0, "text": "Highly recommend Revive and staff! I had never had an IV infusion before, and after trying it rested better than I had in months, and woke up refreshed and feeling amazing. The results left me feeling great and realizing the difference it made in my body with the vitamins and infusion mix it needed. The staff is incredibly friendly with an inviting and clean atmosphere. I would say if you are skeptical or unsure, at least call and give it a try, you will be glad you did!", "pics": null, "resp": {"time": 1551205076642, "text": "That's wonderful Olivia!  Thank you!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "111480102941170240549", "name": "Greg Patterson", "time": 1536329535199, "rating": 5.0, "text": "Great people to work with who care about your health and well being. My journey to better health began in Dec 2017 at 320 lbs and Sept 2018 I’m now 265 and still going. I appreciate the help and encouragement these guys have provided and look forward to the future. Just commit to getting started and these guys will help you do the rest.", "pics": null, "resp": {"time": 1551205090208, "text": "Outstanding Greg!  Appreciate the review!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "111433196324509937486", "name": "Chris Needham", "time": 1548049386755, "rating": 5.0, "text": "Super nice people. Found some nutrition items to fix and allergies to avoid that I needed to know about ! You have a dream team here . Great mix of talent.  Add in stem cells and massage therapy and you'll have everything.", "pics": null, "resp": {"time": 1548079111785, "text": "Thank you for taking the time to provide these kind words Chris. We really appreciate you."}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "116330949750240470235", "name": "Ginger Rueve", "time": 1578949650242, "rating": 5.0, "text": "You will not find a more fabulous staff! Everyone is dedicated to helping you feel your best! Mind and Body!!!", "pics": null, "resp": {"time": 1579011877815, "text": "Thank you so much Ginger!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "114200582089074900917", "name": "Kristen Suddeth", "time": 1556813539444, "rating": 5.0, "text": "After over two weeks of being sick and the medicines prescribed to me were not helping, Dr. Russell had me come in for a Super Immune IV bag.  I was skeptical but desperate to feel better.  I left feeling a little better but woke up the next morning at 90%! I could not believe it.  I am now looking into more holistic treatments for the future because of Dr. Russell.  His staff is super sweet and caring.  10/10 will go back!", "pics": null, "resp": {"time": 1556819695663, "text": "Thank you for the great review Kristen! We enjoy having you as a patient in our clinic."}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "106176115965115548100", "name": "Heaven Sparks", "time": 1570478750411, "rating": 5.0, "text": "Professional and knowledgeable staff! Good supplements to choose from for your needs and goals! And of course the best part the reviving IV’s!!", "pics": null, "resp": {"time": 1570480221258, "text": "Wonderful!  Thank you so much Heaven!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "116875394425162637845", "name": "Chris Mayo", "time": 1575913205706, "rating": 5.0, "text": "Dr. Russell really takes pride in his client care and success.  Top notch practice", "pics": null, "resp": {"time": 1579380949346, "text": "Thank you Chris!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "105645885384594177044", "name": "eNVy Salon", "time": 1576951219252, "rating": 5.0, "text": "The staff  is so friendly and makes you feel comfortable , I really like how they all explain everything fully!", "pics": null, "resp": {"time": 1577474543024, "text": "Thank you!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "110213605733730205543", "name": "Faith Batchelor", "time": 1576953221313, "rating": 5.0, "text": "Awesome staff and I always feel so much better after leaving. Thankful for these guys!", "pics": null, "resp": {"time": 1577474534179, "text": "Thank you Faith!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "105188450152077565877", "name": "Lisa Gaines", "time": 1560975659946, "rating": 5.0, "text": "My health and daily life has been completely changed after beginning with Revive.\nI suffered with headaches , migraines and  regular sinus infections for years and Since I have begun this program of bimonthly infusions (specifically for my body’s needs), the supplements my body needed and diet changes Revive  suggested I have only had one headache, NO migraines and NO sinus infections for four months now. I am now even sleeping better as they discovered my magnesium levels were low and they added that supplement at bedtime . After three months they retested my bloodwork and Everything has been greatly improved and they tweaked things again as to the changes.\nThis has been a life changer for me and I am shouting it to anyone who will listen.\nAlso, I have fallen in love with each staff member as the whole Revive team makes you feel so at home and cared for.  They are always positive and patient with any questions I have had. They take such personal interest in each patient.\nI can’t say enough positive about REVIVE!\nThis has been Life changing for me!!!!", "pics": null, "resp": {"time": 1561047653205, "text": "Thank you Lisa!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "110039486717714290292", "name": "STEVE HENDLEY", "time": 1576027265977, "rating": 5.0, "text": "My experience here was great. I will  recommend Revive to everyone  I know . The staff were very helpful and professional .. Left feeling refreshed and energized.", "pics": null, "resp": {"time": 1577474677268, "text": "Thank you!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "112555931607678705447", "name": "Marshelle Harris", "time": 1573922530902, "rating": 5.0, "text": "This a wonderful place to come get revived. Great staff and clean facility.", "pics": null, "resp": {"time": 1579446934146, "text": "Thank you Marshelle!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "109545939977063802331", "name": "PJ Littrell", "time": 1564179394962, "rating": 5.0, "text": "Very awesome experience. The people here are amazing and what makes it a great place! Well worth the money!! Highly recommended!", "pics": null, "resp": {"time": 1564205058007, "text": "Thank you so much for your kind review PJ!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "106564868089670897980", "name": "Lyndzee Buckelew", "time": 1580153195457, "rating": 5.0, "text": "Friendly staff, very knowledgeable, highly suggest the IV and a full panel blood work!", "pics": null, "resp": {"time": 1580181741911, "text": "Thank you Lyndzee!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "115132190306340932729", "name": "Wayne Alford mGuy", "time": 1536189064994, "rating": 5.0, "text": "Beautiful facility with very professional staff. Drs Ryan and Gary Russell are top notch. Alternative medicine works and is here to stay. Thank God!!! Highly recommend the hormone therapy, IV vitamins and chiropractic care. Easy and convenient.", "pics": null, "resp": {"time": 1551205149471, "text": "Thank you Wayne!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "110476757209408602866", "name": "Sharon punzel", "time": 1549580364607, "rating": 5.0, "text": "If you want to feel better go visit Revive Wellness.\nThey are treating my husband, daughter, son and myself. Felt results within days of following their recommendation. IV infusions make you feel good immediately.", "pics": null, "resp": {"time": 1551205195372, "text": "Thank you so much Sharon!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "106261468369957617661", "name": "Amark Guy", "time": 1563757017244, "rating": 5.0, "text": "Drs. Russell and all the staff are wonderful. They are very knowledgeable, compassionate and patient with explaining any protocols, diets and/or supplements. They are all very accommodating with scheduling visits.", "pics": null, "resp": {"time": 1563762168360, "text": "Thank you!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "100053227163903684686", "name": "Vernee Kimber", "time": 1554262471478, "rating": 5.0, "text": "I tried the vitamin and energy 💧IV therapy 💉earlier today at Revive Therapy and Wellness Center in Hoover. The staff was very warm and inviting especially Alicia, that’s my new homegirl. I enjoyed my conversation with my personal nurse and appreciated her making sure I was comfortable. They were very knowledgeable and took time to help me choose the plan that my body needed. I love the setup with the big screen tv, and comfortable massaging chair. It took about an hour from signing in to checking out. I am very pleased so far with how I feel and I will be returning. You should check them out. Ask for Alicia!!!! I highly recommend!!!!", "pics": null, "resp": {"time": 1570480300486, "text": "Thank you!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "117876328105037892159", "name": "Wesley Simmons", "time": 1579902547824, "rating": 5.0, "text": "Great staff! On the right road to feeling great!", "pics": null, "resp": {"time": 1580181750363, "text": "Thank you Wesley!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "117094669889910096441", "name": "Sarah Preston", "time": 1550233735427, "rating": 5.0, "text": "Revive is amazing! I have Hashimoto's and subsequently hypothyroidism. I've struggled with it for quite some time, even seeing an endocrinologist on a regular basis. Even on medication, I've never been able to get away from the feeling of exhaustion. Revive did extensive lab work, found issues that my endocrinologist wasn't addressing, and put me on the path to fixing them. I feel better than I have in five years, and it's all thanks to them. They're friendly, attentive, and very professional.", "pics": null, "resp": {"time": 1551205007815, "text": "Thank you Sarah!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "107061332399327940373", "name": "Misty Smith", "time": 1536292175977, "rating": 5.0, "text": "Beautiful clinic! Love Dr Ryan Russell and Dr Gary Russell! They are amazing with the patients, and they always go above and beyond! I’ve never had a negative report from a referral. They really are brilliant, and they will assist you in finding your optimal physical, mental, and sexual health thru vitamin infusions adjusted for your specific needs and HRT! I enjoy being a patient, and I do not hesitate to refer my own clients to them!", "pics": null, "resp": {"time": 1551205114554, "text": "Thank you so much Misty!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "110625578698491022845", "name": "Tyler Rutledge", "time": 1571500160747, "rating": 5.0, "text": "Awesome staff and comfortable setup! I will definitely be back!", "pics": null, "resp": {"time": 1579446969144, "text": "Thank you Tyler"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "110429625828195424401", "name": "Bethany Hunley", "time": 1536175452455, "rating": 5.0, "text": "I had an absolutely wonderful experience here! My IV cocktail made me feel amazing - refreshed, relaxed and hydrated! Plus, while you are receiving your treatment, you get to sit in a full-body  massage chair and watch whatever you would like on Netflix! As a mom of two littles, this was such a relaxing and rejuvenating experience. Highly recommended!", "pics": null, "resp": {"time": 1551205155529, "text": "Thank you Bethany!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "104487797256268445273", "name": "Becky Tomlin", "time": 1563666082867, "rating": 5.0, "text": "The staff is amazing. I love the clean relaxing environment!", "pics": null, "resp": {"time": 1563667336137, "text": "Thank you Becky!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "104583155464513190877", "name": "Pablo & Mitch Bernheim", "time": 1548197138174, "rating": 5.0, "text": "I had my first infusion a week a good and it was great the staff was very friendly and made feel very comfortable I can't wait to go back", "pics": null, "resp": {"time": 1548265130727, "text": "Thank you for your kind words, Pablo! We appreciate your business!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "102170216141055316817", "name": "PHYLLIS JOHNSON", "time": 1567271039037, "rating": 5.0, "text": "Alpha Female per Dr. Russell 🌺No Intimidation Here WooYahhh✈️", "pics": null, "resp": {"time": 1570480294489, "text": "Thank you Phyllis!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "118199272173061397732", "name": "jonathan lark", "time": 1593560956674, "rating": 5.0, "text": "Love the IV Therapy,  not sure about new front staff. Miss old staff", "pics": null, "resp": {"time": 1568478276750, "text": "Thank you Jonathan!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "118178230784665009751", "name": "Jason Hooper", "time": 1576009684626, "rating": 5.0, "text": "Revive Therapy & Wellness is your one stop shop for all things wellness! Whether you are looking for a healthy vitamin solution to feel better and improve your immunity function, a comprehensive plan to balance your hormone levels or just a desire to look and feel healthier - Revive Therapy & Wellness is the solution to your all your healthcare needs!", "pics": null, "resp": {"time": 1551205021807, "text": "Awesome!  Appreciate your review Jason!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "105957219787919138996", "name": "John", "time": 1601997500391, "rating": 5.0, "text": "Great team and service", "pics": null, "resp": {"time": 1601998414800, "text": "Thank you so much John!  We love helping our clients feel their best in every way!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "102626244933016082531", "name": "Will Eaton", "time": 1536157632953, "rating": 5.0, "text": "Live healthy with professional medical IV Infusions and detailed bloodwork making sure your body is tip top notch", "pics": null, "resp": {"time": 1551205171468, "text": "Thanks Will!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "102103543337847078707", "name": "Lauren Thomas", "time": 1536157552683, "rating": 5.0, "text": "The office is immaculate, and the staff is great! Dr. Russel is knowledgeable, and the vitamin infusion didn’t hurt at all!", "pics": null, "resp": {"time": 1551205182664, "text": "Thank you so much Lauren!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "106357640136893195047", "name": "Daniel Douglas", "time": 1536162192244, "rating": 5.0, "text": "Dr. Russell is great and the facility is awesome! I will definitely be going back.", "pics": null, "resp": {"time": 1551205165893, "text": "Thank you Daniel!  Really appreciate you"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "107208780235714116038", "name": "Karri Duncan", "time": 1570461542474, "rating": 5.0, "text": "Excellent staff! Very knowledgeable!!", "pics": null, "resp": {"time": 1570462962771, "text": "Thank you Karri! Looking forward to seeing you again!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "110684336737959879152", "name": "Hanna Hallman (Dancing Wolf)", "time": 1536319752627, "rating": 5.0, "text": "These guys have helped my husband, Mike, start to feel like himself again. After being diagnosed with chronic kidney disease, and noticing it worsening (as to be expected) over time, he had two Chelation therapy treatments and has noticed a huge increase in energy levels and just an overall feeling of improvement. If you can’t travel to a location, they can also work with you to figure out a care plan that will work for you. We can’t thank Dom and Ryan enough at Revive! This is just the beginning.", "pics": null, "resp": {"time": 1551205104211, "text": "Thank you Hanna!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "104447641288590355333", "name": "Evan watkins", "time": 1536281991113, "rating": 5.0, "text": "Friendly staff and good service! Great product that helps with your wellbeing!", "pics": null, "resp": {"time": 1551205130805, "text": "Thank you for the kind review Evan"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "101753345764831955108", "name": "COREY BRAXTON", "time": 1582679674418, "rating": 5.0, "text": "AWESOME Experience with their entire team!!!", "pics": null, "resp": {"time": 1582741959592, "text": "Thank you Corey!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "106520580187053916341", "name": "shelby stephenson", "time": 1568048586107, "rating": 5.0, "text": "Knowledgeable and friendly staff, this place is great.", "pics": null, "resp": {"time": 1568049958539, "text": "Thank you Shelby!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "116682773701968421699", "name": "Ryan Valentz", "time": 1576256308607, "rating": 5.0, "text": "Awesome staff great results!!!", "pics": null, "resp": {"time": 1577474645948, "text": "Thank you!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "105262439932825703071", "name": "John Rutledge", "time": 1567804935717, "rating": 5.0, "text": "Great staff and exceptional service", "pics": null, "resp": {"time": 1567806410697, "text": "Thank you John"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "118413521241098126775", "name": "Eve Emmett", "time": 1585258730984, "rating": 5.0, "text": "They're Great 😍😍😍", "pics": null, "resp": {"time": 1590079558633, "text": "Thank you!!"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "106334441004794863751", "name": "George Wehby II", "time": 1545412819700, "rating": 5.0, "text": "Merry Christmas", "pics": null, "resp": {"time": 1551205040071, "text": "Thank you!  You too!  (a little late = )"}, "gmap_id": "0x888919d50c6f52f1:0x5d1c7bf0d93afa0d"}
{"user_id": "107947239833555799493", "name": "Bilal", "time": 1527403873983, "rating": 1.0, "text": "Therapist sucks and unprofessional. Avoid if you want to get better.", "pics": null, "resp": {"time": 1527436435580, "text": "I must say  I am shocked by this review as I haven't seen this client in months. He came in twice and didn't indicate in any fashion there was a problem. He complained about several therapists so maybe I shouldn't be shocked that he didn't address me directly. While I cannot say what the nature of his dissatisfaction was, I can say that he remained over 3 hours after his session discussing his life and I was not compensated for this time. He could have discussed whatever he was dissatisfied with at that time instead of waiting  months to leave an unhappy review. I cannot say what it was that he wanted and didn't receive only that I strive to address and care for any issues I am made aware of. I can only wish him the best in finding the therapist that is perfect for him."}, "gmap_id": "0x88891aee93b6d0bf:0xd53db019ec15cd9d"}
{"user_id": "111764342454987168721", "name": "Jason Shafer", "time": 1525676897280, "rating": 1.0, "text": "Very painful experience", "pics": null, "resp": {"time": 1525684964296, "text": "I have never seen you before. You have reviewed the wrong location of Healing Hands."}, "gmap_id": "0x88891aee93b6d0bf:0xd53db019ec15cd9d"}
{"user_id": "117091792407938180296", "name": "Brittany Hook", "time": 1618142619991, "rating": 5.0, "text": "I love Fit4mom! I've never been the type of person to workout and stick with it, but I've been with Fit4mom for almost 2 years! I love to have been able to workout before, during and after pregnancy. I love how the instructors work with whatever stage of life you're in! My 5 year old loves the playgroups and has made so many new friendships, and so have I! I recommend Fit4mom 100%!!", "pics": null, "resp": null, "gmap_id": "0x886265b43ff175cb:0xe47efceeb369ac92"}
{"user_id": "106671704751642768738", "name": "Michelle Schmitt", "time": 1618088381833, "rating": 5.0, "text": "Consistently working out on my own has always been a challenge. A friend invited me to my first class almost two years ago. I've been with them ever since. Fit4Mom Madison offers different classes at different times of day to accommodate the busy mom life. Moms are supported at all stages of motherhood. There are fun Mom Nights Out and play groups to help build community. They partner with local businesses and are growing to make exercising more accessible. I am very grateful to have found them.", "pics": null, "resp": null, "gmap_id": "0x886265b43ff175cb:0xe47efceeb369ac92"}
{"user_id": "111948651488512414199", "name": "Stacey Roy", "time": 1618269466631, "rating": 5.0, "text": "I joined Fit4Mom Madison while on maternity leave with my youngest over four years ago and I can't get enough! Fit4Mom Madison is for EVERY mom through every season of motherhood, pregnancy and beyond. I wish I had Fit4Mom through my pregnancies and other children's baby years.\nWorkouts are for every skill level, with knowledgeable instructors to help guide and modify as needed. Classes range from early morning solo time to stroller classes with kiddos to evening virtual classes.\nThis is a no judgment, safe space with amazing mamas. Build relationships and friendships. Give your kids the opportunity for socialization and learning at play groups. Do something for you by going to workouts without kids. Enjoy Mom Nights Out, Book Club, and give back through various charities Fit4Mom supports throughout the year to help meet local needs in the community.", "pics": null, "resp": null, "gmap_id": "0x886265b43ff175cb:0xe47efceeb369ac92"}
{"user_id": "103470752080073011911", "name": "Ashley Jacob", "time": 1618087384095, "rating": 5.0, "text": "Stroller Strides classes are one of my favorite activities to do with my kids. The classes are so welcoming to everyone and it is so nice to be able to have a conversation with another mom while going through the workout. My kids also enjoy going to playgroup after class.", "pics": null, "resp": null, "gmap_id": "0x886265b43ff175cb:0xe47efceeb369ac92"}
{"user_id": "113289820567369503960", "name": "Maggie Butler", "time": 1618278843515, "rating": 5.0, "text": "I LOVE Fit4Mom. It’s truly not just a workout, it’s an entire community of friends that hold you accountable. Forever thankful for this amazing group!", "pics": null, "resp": null, "gmap_id": "0x886265b43ff175cb:0xe47efceeb369ac92"}
{"user_id": "112806857486647005135", "name": "Rebecca Eagly", "time": 1618090910257, "rating": 5.0, "text": "I love everything about Fit4Mom Madison and am thankful every day that I found this group 18 months ago. The owner, all the instructors and fellow mamas are so welcoming and supportive. There are moms at all different fitness levels and at all stages of motherhood. I actually cried after my trial class because I felt so reassured and validated. There are lots of different classes offered on all different schedules, and they are as challenging as you need them to be. I always leave feeling like a million bucks. But F4M is much more than an exercise group. They host playgroups, mom's nights out, book club, run club etc; and everyone just genuinely cares for each other. I highly recommend F4M Madison and only wish I'd found them sooner!", "pics": null, "resp": null, "gmap_id": "0x886265b43ff175cb:0xe47efceeb369ac92"}
{"user_id": "113183336679433486303", "name": "Brianna Fannin", "time": 1618267772777, "rating": 5.0, "text": "I am so grateful for FIT4MOM Madison! I was nervous when I was pregnant that I would not be able to find an inclusive group of mamas to share triumphs and struggles with as I entered into motherhood. Not the case with FIT4MOM Madison! This community of mamas supporting one another is just what I was looking for and it is more than just a workout. You can connect with others at mom's night out, book club, crafts, and so much more! I cannot recommend FIT4MOM Madison enough.", "pics": null, "resp": null, "gmap_id": "0x886265b43ff175cb:0xe47efceeb369ac92"}
{"user_id": "110449411250321822405", "name": "Kathleen Burns Bauman", "time": 1618260317381, "rating": 5.0, "text": "As a new mom in a new town, Fit4mom has been a life saver. The owner, instructors, and other moms are so welcoming, encouraging, and positive. It's so much more than a workout,- it's a sounding board, mental refresher, and social interaction that I so deeply needed. Everytime I leave a class I feel so much better, both physically and mentally.", "pics": null, "resp": null, "gmap_id": "0x886265b43ff175cb:0xe47efceeb369ac92"}
{"user_id": "108123495122239482616", "name": "Margaret Madison", "time": 1620307755215, "rating": 5.0, "text": "The entire staff is awesome!!  So friendly everyone is always smiling and very helpful.  Jonathan, Aston & Bo & the entire staff really have helped me get back to my exercise routine which is very vital to me.  They push me each visit and I push myself!!  I am very grateful!!  They are very professional and know how to get you moving the correct way!!  I cannot tell you how much that means to me!!  Thanks again!!", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "113249181056227068147", "name": "Jerry Ross", "time": 1623441665021, "rating": 5.0, "text": "My second time to be treated at Therapy South (shoulder first and back this time) and I couldn’t be more pleased with the results.   Problems corrected with no surgery and no drugs and that was my goal.   Wonderful, knowledgeable staff that makes you feel so welcome.   I highly recommend Therapy South based on me experience.", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "109944851332081109235", "name": "Joyce Parker", "time": 1620671959830, "rating": 5.0, "text": "I did 6 weeks of therapy for pain in my back, which had been bothering me  for 8 months. All the therapists who worked with me were informative and helpful, and very patient. The atmosphere at Chelsea is calm and relaxing. I highly recommend TherapySouth Chelsea.  My pain is 99% better!", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "108128421748840055128", "name": "Danielle Gardner", "time": 1621001393056, "rating": 5.0, "text": "I have known Robbie since my daughter went to him for many knee & ankle issues as a competitive athlete. Then came me with multiple issues with my ankle, leg, and hip issues. Robbie truly takes time consulting with his patients and getting them back to their daily tasks. With my multiple sclerosis and falls, I needed help getting me stable again. It took a long time and still going to him as needed, but he gives you the individual time you need. When he isn't there, he makes sure that he places you with another PT that can give you the skills & exercises that you need. Also, he helps you to have exercises thru Therapy South online portal when you are done with your therapy sessions to make sure you are continuing improving at home. That is definitely a good source for any patient. I' &m very blessed to have such good health care outside of the hospital.", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "113303847410262210267", "name": "Joan Garrett", "time": 1618533812277, "rating": 5.0, "text": "I’ve been to other therapists, but the therapists at Therapy South are by far the best. They know their stuff, but they’re also friendly and fun to be around.  You’ll definitely feel better after working with them.", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "102593550688676594301", "name": "Kelly O'Neil", "time": 1610475073596, "rating": 5.0, "text": "I highly recommend TherapySouth Chelsea. Bo and his team were very professional and helpful to my knee problem. Everyone I worked with was so nice and personable, at the same time, was very knowledgeable and helpful. If I should ever need any type of physical therapy in the future I will definitely be returning to TherapySouth Chelsea. Thank you so much for the excellent care I received, and for restoring my strength in my knee to fully recover from my previous surgery!", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "104836742700216914957", "name": "David Patterson", "time": 1615765485312, "rating": 5.0, "text": "Following my left knee replacement surgery on December 22, 2020, I chose Therapy South in Chelsea for my physical therapy.  I based my decision on the convenience to my home.  I was very pleased with the professional care I received from my therapist Bo Dawson.  I steadily progressed with  his hands on skills and goals he set for me.   He communicated with me and made sure I understood what outcome I could achieve.  I plan to use Bo or one of the other therapist when I I follow thru on my right knee replacement surgery.", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "109526031491119855152", "name": "Tony Wheeler", "time": 1616090372085, "rating": 5.0, "text": "I highly recommend this clinic!  They are such a great group of people. Bo Dawson was my therapist for the last year but I have worked closely with all of them. As a team, they helped me recover through the most traumatic experience of my life. Bo, Nathan, JB, Robbie, and everyone else... thank you all, for everything!", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "113193997606693259575", "name": "Janet O", "time": 1613606303552, "rating": 5.0, "text": "Although needing physical therapy is not a pleasant situation, the staff here are wonderful and I can’t say one negative thing about my experience with them. JB was my main therapist and he was always pleasant, professional, and encouraging. All the staff are so helpful and I am glad I chose Therapy South Chelsea. If I ever need PT again, I will definitely go back to them.", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "105190462399524809188", "name": "Michael Seymour", "time": 1611938874350, "rating": 5.0, "text": "TherapySouth Chelsea has an amazing staff! They are all very friendly, knowledgable, and hardworking! You can tell they truly care about their clients and want them to get better, not just linger in perpetual therapy. They make you feel like a part of the family, not a patient or customer.", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "114303013061217142310", "name": "Paula Davis", "time": 1616499420259, "rating": 5.0, "text": "Friendly, knowledgeable staff. They were a pleasure to work with and my son recovered quickly. Would definitely use again!!", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "111592655153062000585", "name": "Greg Jordan", "time": 1616106196258, "rating": 5.0, "text": "These guys are great. Caring, professional and very helpful. This is the third time I have used their services. I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "107548883577917115568", "name": "Dave Urech", "time": 1624365533488, "rating": 5.0, "text": "Very clean.  Knowledgeable and caring staff that makes it a bit fun!", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "106040604759204758601", "name": "Matt Mason", "time": 1602708026714, "rating": 5.0, "text": "The staff are knowledgeable and extremely personable. They ask good questions, explain how the body is working or why it's not working so well, and how to get you moving in the right direction. If you like, they'll print out exercises so you don't forget any home workouts that they encourage you to maintain. They're even on the ball administratively and do a great job helping you schedule your visits. I don't normally write online reviews but they really are the total package. I wrote this as a small thank you for the great experience I've had.", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "107635788586300257086", "name": "Alex ellison", "time": 1605552544665, "rating": 5.0, "text": "I am beyond impressed with my experience at therapy south and with my PT Bo. I was sent there with some strange symptoms post c-section. It turns out my issue was not physical therapy related but Bo called my physician to make sure I was seen immediately. He has since followed up twice to check on my progress. I really appreciate the extra care this team takes especially since I was only in need of an evaluation.", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "102862838593642216460", "name": "Tanya Adams", "time": 1614210981919, "rating": 5.0, "text": "I highly recommend TherapySouth. They are a very caring staff!!! They do a great job!!! Thank you soo much for helping me!!!!", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "101511964465920115299", "name": "Monica Steelreath", "time": 1599423053534, "rating": 5.0, "text": "I had a great experience at TherapySouth in Chelsea, AL. The Physical Therapists and Assistants were all professional and nice. I had a total knee replacement and I felt that the staff had an interest in my healing process. Hannah always greeted me with a smile. Nathan and Abby adjusted my needs for a speedy recovery. I would definitely recommend TherapySouth Chelsea for your Physical Therapy needs.", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "104189312930261530044", "name": "Seth Boman", "time": 1622772553074, "rating": 5.0, "text": "Friendly staff! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "112157699297722824216", "name": "Shirley Robinson", "time": 1598543878688, "rating": 5.0, "text": "The treatment and care I received at Therapy  South in Chelsea after a total knee replacement was excellent.  All personnel  were friendly and  caring.  Special  thanks to   Mitchell  as he worked  more  closely with my  treatment.  I  would  definitely  recommend  this facility  for your  physical  therapy.", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "107559021047611215063", "name": "Myra Shaw", "time": 1589926513875, "rating": 5.0, "text": "I am so appreciative and thankful for the support I received at Therapy South! I was always greeted by my name and with a smile from Hannah! Nathan, my therapist was not only knowledgeable but supportive and encouraging as I worked to get back “back to walking on two feet”. If I ever need PT again, I will be sure to go back to Therapy South!", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "110507921140228601241", "name": "Ariana Mejia", "time": 1599599388784, "rating": 5.0, "text": "My experience with everyone at TherapySouth Chelsea was absolutely amazing. My physical therapist was Bo, and I really appreciate how knowledgeable and personable he was. I highly recommend TherapySouth Chelsea!", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "113885818014760709421", "name": "Rodney Perkins", "time": 1597339325587, "rating": 5.0, "text": "I had the greatest experience at the Chelsea, Al Therapy South location. Nathan and Bo are what  true customer service is like, these therapists not only got me going again they made my visits a dream. I strongly recommend these guys if anyone needs physical therapy. 👍🏽👍🏽👍🏽👍🏽👍🏽", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "101635323973965017480", "name": "Pat Thienpont", "time": 1603585801151, "rating": 5.0, "text": "Therapy South is clean and all the people I have come in contact with are very nice and professional. I have already recommended them to several of my friend’s.", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "107062520838159502809", "name": "Pat Lonvworth", "time": 1595350436273, "rating": 5.0, "text": "TherapySouth Chelsea and Robby Head are top of the line!  Robby is very professional.  He  helped me during my recovery from hip replacement surgery.  With his caring guidance and mastery of his profession (he has his Doctorate in Physical Therapy and over a decade of experience), I regained my strength, balance, and agility.\n\nI have already recommended Robby to a friend who also had hip replacement surgery.  That friend agrees with my assessment of Robby.  She is very happy with his service.  She in turn recommended her husband who suffers with back issues to Robby.  All three of us are so happy to work with Robby.\n\nRobby is a young man of high character, professionalism, and wisdom.\n\nPat Longworth Krauser", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "102597253357535207892", "name": "William Chesser (Kenny)", "time": 1604850955090, "rating": 5.0, "text": "Everyone there are knowledgeable and there is no wait time for appointments", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "117220225979748591899", "name": "Elisabeth O'Dell", "time": 1573689120988, "rating": 5.0, "text": "Awesome place for physical therapy! Everyone has the knowledge, expertise, support and guidance to help you through the rehabilitation process....I know, I was a patient and ALL of the staff helped make my recovery a hard, but extremely wonderful experience!! Came in with a walker and left walking on my own two feet. Many thanks and extremely grateful for all of their help and support, especially my PT Bo Dawson!!! They ROCK!", "pics": null, "resp": {"time": 1576012947384, "text": "Thank you Elisabeth! I'm glad you are doing so much better!"}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "105723298168059155504", "name": "Phyllis Mayfield", "time": 1597953732763, "rating": 5.0, "text": "The PTs and assistants are all friendly and professional.  They take a personal interest in the clients.  The facility is clean and they follow the state guidelines for COVID-19.  Nathan, the therapist working directly with me is very knowledgeable and exhibits a true desire for me to improve.", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "105933354528537057907", "name": "Roy Coffey", "time": 1579823150899, "rating": 5.0, "text": "Thank you to all the staff at Therapy South, I am very pleased with my care. Thank you Bo for your exceptional knowledge of what needed to be done so I could avoid knee surgery. Thank you also for be a very kind young man,  I am very grateful. I highly recommend Therapy South, all the staff were very caring and knowledgeable. Martha Coffey", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "116515205228955713105", "name": "Jeffrey Chick", "time": 1577829405223, "rating": 5.0, "text": "Professional, personable, and friendly, showing me great care and concern. And, best of all, Bo got my shoulder straightened out! The exercises he gave me to do at home were very effective! I will be taking all of my future PT needs to Therapy South!", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "100040955661031378711", "name": "Lena Davis", "time": 1574284963659, "rating": 5.0, "text": "I highly recommend Therapy South in Chelsea. The staff is friendly, knowledgeable and caring. When I arrived for each appointment, I was asked how my ankle felt, any issues I was having and then I was told what was going to be done that day for therapy. My therapist Bo Dawson was super to work with!", "pics": null, "resp": {"time": 1576012896217, "text": "Thank you Lena! We really enjoy getting to know each of our patients and creating a plan that will help our patients achieve their personalized goals!"}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "115436584936460727434", "name": "Geneva Talmadge", "time": 1601061704593, "rating": 4.0, "text": "I actually ate at Joseph's table and loved it", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "110069948011627987699", "name": "Danny Cox", "time": 1583344654257, "rating": 5.0, "text": "What I liked most was the constant attention and the one on one care I received. They stayed on top of my progress and showed attention to detail. If and when I need therapy care I will return to TherapySouth Chelsea for that care.", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "102118779811101487741", "name": "Pat and Emily Dubay", "time": 1575611057328, "rating": 5.0, "text": "My experience at Therapy South Chelsea was with Bo, Nathan and Mandy.  They were all great to work with and very professional and helped me out tremendously.  The facility is very nice and clean.\nI really appreciate them getting me on the road to feeling better.", "pics": null, "resp": {"time": 1576012724936, "text": "Thank you Pat and Emily for your kind words! We love seeing our patients get back to doing the things they love!"}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "103331909704203016193", "name": "C Kiser", "time": 1570663964657, "rating": 5.0, "text": "Following full ankle reconstruction, a tendon graft and heel re-positioning, Therapy South and my primary therapist, Bo Dawson, did a fantastic job of helping me regain my range of motion, flexibility and function. I have used Robby Head's team at the Chelsea location on several occasions over the years and was satisfied each and every time. Highly recommend them!", "pics": null, "resp": {"time": 1576013056974, "text": "Thank you for your kind words! I'm glad you are doing so well!"}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "110457821558532191746", "name": "Robbie Kirk", "time": 1583495668835, "rating": 5.0, "text": "Caring and personable staff. Patient-centered treatment plan, not just a standardized generic approach. Therapists are constantly researching and learning new innovative methods, especially their occupational hand therapists. I had an unusually difficult tendon repair on my left hand. Three total surgeries due to severed tendon, subsequent rupture, then finally a bizarre autoimmune rejection of the deep tissue stitches. These folks never gave up! They researched ideas to help me improve my flexion and thanks to their efforts, I have finally regained my ability to play the guitar. I will forever be indebted!", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "108976655508022057266", "name": "Ann Limbach", "time": 1571262161860, "rating": 5.0, "text": "When I first struggled to get out of the car for my first PT appointment and my therapist, Bo Dawson, came to help me get out of the car, I thought my total hip rehab was going to be a long difficult process.  Now, 8 weeks post surgery, I am walking normally without even a cane!  My treatment was individualized and personal with achievable challenges and goals injected with humor to relieve any stress.  I saw this happening with other patients as well and the smiles were infectious!  Recovery from surgery is not easy but the team at Therapy South Chelsea makes it a positive, achievable experience!!", "pics": null, "resp": {"time": 1576013005040, "text": "Thanks Ann! We love serving the people in the Chelsea area!"}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "112508117086624453184", "name": "Ron Owen", "time": 1579985178091, "rating": 5.0, "text": "I was very pleased with the attention and care received from the staff that worked with me (Bo, Nathan and Abby).  They all are very knowledgeable and helpful.  Bo's plan of action really helped and the home exercises are simple and should keep the progress that has been made!  I highly recommend TherapySouth CHELSEA.  This was actually my 2nd series of visits... The 2nd issue was a doctor referral in hopes to delay or avoid the need for a knee replacement.  When PT was suggested, I requested TherapySouth CHELSEA because of the care that I received before, not to mention the location for me is absolutely perfect!", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "101318348329076722509", "name": "Ronnie Nabors", "time": 1574696923336, "rating": 5.0, "text": "TherapySouthChelsea made my recovery so easy it almost seems like it never happened. I destroyed my shoulder and had a lot of repair work on it. The professionals here are all caring, and great at their job, I had the pleasure of working with them all over the 3 months of rehab. I used to joke they had to draw straws to see who got stuck with me LOL. If knowing that someone cares about you as well as your healing, this is where you need to be. Thanks again to all my friends there, may you be well.", "pics": null, "resp": {"time": 1576012803364, "text": "Thank you Ronnie! I'm glad your experience was such a good one!"}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "112465199147000709519", "name": "Robert Craig", "time": 1550282240926, "rating": 5.0, "text": "Everyone at Therapy South in Chelsea has been wonderful!  My primary Therapist has been great!  She makes sure I accomplish all the stretches and pulls I need get these muscles back in shape.  Amanda Spalding has lots of experience and will work you over as you improve. Great group!", "pics": null, "resp": {"time": 1553011751440, "text": "Thank you for your kind words Robert!"}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "116492109900725292310", "name": "Fred Kendrick", "time": 1552754326281, "rating": 5.0, "text": "Therapy South Chelsea was amazing with my Physical Therapy / Recovery from Total Knee Replacement.  Robby and his entire staff did a phenomenal job from getting my range of motion back to all the strength training.  Very grateful for all of there hard work and support for their patients.", "pics": null, "resp": {"time": 1553011803681, "text": "Thank you for the kind words Fred! Glad you are doing so well!"}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "113258715415254154063", "name": "John McPherson", "time": 1542987745347, "rating": 5.0, "text": "My experience at Therapy South was excellent. Amanda’s (my PT)  knowledge of the problem and solution produced almost immediate relief. The scheduled treatments went well with a clear plan until complete recovery was accomplish. The staff and other employees were always courteous and helpful.\n- John", "pics": null, "resp": {"time": 1553011698528, "text": "Thank you John! Thankful you are back to doing the things you love to do!"}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "115219049103704315781", "name": "Paula Tolbert", "time": 1531744723414, "rating": 5.0, "text": "Therapy South is an excellent provider and work with each client to meet each specific need.  The physical therapists truly care for the clients by listening - really listening and taking time to understand what issue needs to be dealt with.  They then create individualized plans that will improve the clients issues.  I highly recommend Therapy South!", "pics": null, "resp": {"time": 1533157270840, "text": "Thank you Paula! Glad you are doing so well!"}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "102523433993113892731", "name": "Jenny Riddle", "time": 1539873983180, "rating": 5.0, "text": "The entire staff is friendly, professional, and truly cares about helping you get better. The atmosphere is cheerful, and I'm always in a better mood when I leave. I have full confidence in all of the therapists abilities, and they've treated my shoulder well. I'm also now a big fan of dry needling, when it can help! They are like physical magicians :)", "pics": null, "resp": {"time": 1553011525782, "text": "Thanks for your kind words Jenny! We love our patients and love seeing them achieve their goals!"}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "100699889089414631025", "name": "Matt Jons", "time": 1541024660153, "rating": 5.0, "text": "The crew at Therapy South Chelsea is fantastic. I would recommend anyone needing PT that lives in the Chelsea area, to go here if you want the very best recovery and overall experience. I had a serious injury & surgery and am very active in life sports. The staff knew they had to get me back in peak shape so I would be able to compete and enjoy sports again. I want to give a special thanks to Erick for helping me get thru this process. It was not easy, but he knew what I needed and encouraged me to be patient and assured me that I would achieve a total recovery. Also, the receptionist, Hannah,  is very efficient & pleasant to work with. A business is only as good as their people and their ability to work as a team. This place is A+ in the people & teamwork department.", "pics": null, "resp": {"time": 1553011645352, "text": "Thank you Matt! We strive to give patients the best quality of life by providing exceptional care while they are with us!"}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "117565042124949569730", "name": "Joanne Williamson", "time": 1571166933972, "rating": 5.0, "text": "The team was very professional and knowledgeable. I would recommend them to anyone needing therapy.", "pics": null, "resp": {"time": 1576013018607, "text": "Thank you Joanne!"}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "112777812915396252364", "name": "Donald Slee, Jr", "time": 1526188603298, "rating": 5.0, "text": "I have chosen Therapy South Chelsea for the second time in two years to provide me with therapy services to assist me with recovery from my second total knee replacement.  My first experience (in February 2016) led me straight back to the team at Therapy South Chelsea in February 2018 for therapy to assist in recovery from my final total knee replacement.\nI was very impressed with the level of expertise, quality of service and the professionalism of the Director (Robby Head), Therapists (Abby and Erick) and the Office Administrator, Hannah, who assisted me with \"juggling\" sometimes last minute appointments due to a difficult work schedule.\nFollowing my surgery, I was quickly put into a program which aided in restoring full mobility and avoided what I have heard is typical \"stiffness\" due to the formation of scar tissue.\nI can recommend, without any hesitation or reservation whatsoever, Therapy South Chelsea as the premier provider of Physical Therapy in our area.", "pics": null, "resp": {"time": 1526409240895, "text": "Thank you so much for your kind words Don! We are thankful to have been able to get you going after both of your surgeries."}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "104798592392179622716", "name": "Kris Findlay", "time": 1599330840762, "rating": 5.0, "text": "Very helpful!", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "114269398526967939843", "name": "Billy Studdard", "time": 1524240171520, "rating": 5.0, "text": "The entire staff of Therapy South is both professional and friendly. While the mechanics of rehab may not always be pleasurable the environment in which you rehab can be, Therapy South in Chelsea is a pleasurable place in which to rehab because of the quality of the people who work there. They are professional yet a joy to be around. I would recommend them and will use them again in the future as the need arises.", "pics": null, "resp": {"time": 1525206051724, "text": "Thank you for your kind words Mr. Studdard! We enjoy working with you!"}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "102065235131184574700", "name": "Ryan Jones", "time": 1497382281803, "rating": 5.0, "text": "Definitely had a great experience at this Therapy South location. Robbie was wonderful to work with, as well as all of the other staff that I was fortunate enough to work with. If you need physical therapy in the area, this is THE place to go!", "pics": null, "resp": {"time": 1576013093177, "text": "Thank you Ryan!"}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "100515491261477921982", "name": "Elizabeth Cooley", "time": 1521739303655, "rating": 5.0, "text": "TherapySouth Chelsea is where I would recommend anyone, post-surgery or with chronic pain, to go for physical therapy. The therapist are phenomenal in all areas of their field. They listen and work with you according to what is going on with your body. I've done my physical therapy after ACL replacement surgery and my knee is stronger than it has ever been. I'm currently doing therapy on lower back issues and I'm getting better each day. I've even got my mom going for pain management. This is the place to go for physical therapy. I think of the physical therapist and Hannah, Kelly and Andrew as if they were my family, that is just how much they care. I feel so blessed that they are located in Chelsea, AL.", "pics": null, "resp": {"time": 1525206136103, "text": "Thank you Elizabeth! You were a pleasure to work with and we are happy to have helped you achieve your goals!"}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "100412380087893230523", "name": "Clark Kelley", "time": 1579452866749, "rating": 5.0, "text": "Every one was great and professional", "pics": null, "resp": {"time": 1579918483396, "text": "Thank you!"}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "103752303464334075097", "name": "Ashley Arrowood", "time": 1530274522592, "rating": 5.0, "text": "My journey with physical therapy began during the most painful time in my life to date.  I never imagined the experience would become so personal.  At my first visit, I met with Robby to discuss all my issues.  He has a genuine nature, a respect for where you are in the process, and a drive to see you return to wellness.  He took the time to evaluate me and was methodical in his design of a plan that worked not only in the clinic but could be transitioned to home. He championed me through tough times with kindness, professionalism, and a warmth that led to a trust which is necessary for the recovery process to be successful.  He is a credit to his profession and an asset to TherapySouth.\nThroughout the following weeks, I worked with Abbey.  Abbey is truly a pioneer in her field.  She is focused and attentive during every session, kind, compassionate, knowledgeable, and helpful.  When I was doubtful, she was always there to encourage me, being honest with me about the challenges I would face, yet reassuring me that I would one day be able to return to a life filled with many athletic endeavors.  Abbey is understanding and genuinely takes a personal interest in how you're feeling.  She always made sure to explain every exercise in depth and also how it would aid in my progress going forward.  I feel lucky to have been guided by Abbey along my PT journey, for it was her encouragement that pushed me through when I was at my lowest.\nHannah is also extremely helpful and efficient.  Being the face you see when you first walk in, she is cheerful and always greets the patients by name.  TherapySouth has an amazing team and, more importantly, great teamwork.  It is modern and very nice, clean, and an extremely well-run practice.  I couldn't be happier with my experience with something I wasn't at all looking forward to.\nThank you to the TherapySouth team for always answering my questions with interest and patience.  You guys have truly made my recovery a more pleasant experience.", "pics": null, "resp": {"time": 1533157199314, "text": "Thank you so much for your kind words Ashley! I am thankful you are doing so well!"}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "100085734029481546774", "name": "charles lewis", "time": 1525975994119, "rating": 5.0, "text": "Love you guys!!", "pics": null, "resp": {"time": 1526422026759, "text": "Thanks Mr. Lewis! Glad you are doing well!"}, "gmap_id": "0x88893ef66a006d49:0x48ce7dc1643b8e0a"}
{"user_id": "103027418305947659454", "name": "Sarah Agnew", "time": 1568640289312, "rating": 5.0, "text": "Saturday mornings meeting r great.\nI have enjoyed weight watchers more than I thought. Great recipes on the app.. get to eat foods without feeling guilty.\nLost 13.8pounds in six weeks.", "pics": null, "resp": null, "gmap_id": "0x886212e2d0398d8d:0xbbc1baf0e56a0c21"}
{"user_id": "106532845583021204637", "name": "Julie Cronan", "time": 1610132595863, "rating": 5.0, "text": "Great experience", "pics": null, "resp": null, "gmap_id": "0x886212e2d0398d8d:0xbbc1baf0e56a0c21"}
{"user_id": "116861899108129736253", "name": "David Newton", "time": 1484951575686, "rating": 5.0, "text": "Very nice! Have lost over 10 pounds with their help.", "pics": null, "resp": null, "gmap_id": "0x886212e2d0398d8d:0xbbc1baf0e56a0c21"}
{"user_id": "102655866909899961645", "name": "Lorna Light", "time": 1534435107417, "rating": 5.0, "text": "Great meeting on Thursday mornings!", "pics": null, "resp": null, "gmap_id": "0x886212e2d0398d8d:0xbbc1baf0e56a0c21"}
{"user_id": "103808614851548499970", "name": "Lindsey Pourciau", "time": 1607606642850, "rating": 5.0, "text": "Their team was quick to get me in to be seen. Chris took so much time to hear about my issues, be proactive about treating, and providing me information to use at home! Very pleased with the service and care!", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "117529081689069121055", "name": "Alison Singerhouse", "time": 1595514223274, "rating": 5.0, "text": "Chris Allison and Andrew Darwin are excellent physical therapists. Best in the area as far as I am concerned. I send many patients over there for care and they are always happy. They are professional and educated you on what you are doing and why you are doing it. Also excellent at relieving pain associated with therapy. I surely appreciate them for all they do for me!", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "117005738503826478939", "name": "Stephen Sistrunk", "time": 1597096542766, "rating": 5.0, "text": "I have been to see Andrew Darwin now for a knee surgery rehab and two unrelated back issues. On all three occasions, he has gotten me feeling better and back in action much quicker than I would've expected. This guy is very skilled! Across the board, the service and treatment at the Riverchase office is top notch. I would highly recommend going there for your rehab needs.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "113222453861638367832", "name": "gary dutton", "time": 1595433540154, "rating": 5.0, "text": "Chris Allison is the best. My boys play baseball and have been seeing him at the clinic for the past several years for normal recovery and rehab. He has great knowledge, cares about and communicates great with his patients.  He is very innovative with therapy.  Chris and the clinic also are very accommodating in working with their patients in regards to scheduling.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "115279440124760904901", "name": "Jo Nicholas", "time": 1607449455877, "rating": 5.0, "text": "Andrew is very knowledgeable, efficient, and patient. Highly recommend. Appointments are easy to make, building way to find.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "117200350153968341184", "name": "Robert Scott", "time": 1609499780542, "rating": 5.0, "text": "The Therapists are the greatest. Even though I’m a terrible patient and complain constantly, they continue to work with me. The improvements are obvious, and I am so grateful for the results.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "104167054222556597792", "name": "Morgan Henderson", "time": 1602077958934, "rating": 5.0, "text": "I come to get dry needled in my upper back and neck and always feel so much better afterwards. Chris does a great job!", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "105128039031592339842", "name": "Avione Allgood", "time": 1595432206127, "rating": 5.0, "text": "Amazing!!! They make treatment and rehab enjoyable and interesting instead of overly repetitive. The best part it always and actually works. Great team at Therapy South", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "115776338185681827968", "name": "Sherri Dunn", "time": 1604333713855, "rating": 5.0, "text": "The staff is great! So convenient to my work and home!", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "104373042946427247619", "name": "Brandon Hoggle", "time": 1574881247608, "rating": 5.0, "text": "These guys are awesome! I had injured my shoulder in a softball accident and needed to do some basic rehab. Andrew and Chris quickly identified exercises, along with dry needling, to expedite the healing process. I’ve seen steady improvement since my last visit with them and wouldn’t hesitate to pay them another visit when/if needed. Highly recommend!", "pics": null, "resp": {"time": 1575066908716, "text": "Thanks for the food truck schedule!  Our pleasure man!"}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "111789828152106361692", "name": "Barry Harrison", "time": 1576514207395, "rating": 5.0, "text": "Therapy South has been great ! Chris and Andrew have both been amazing. After my first session Chris messaged me to check and see how I was doing. Andrew and  Chris both really showed me they  genuinely care and wanted to get me back to my training. It isn’t a cooking cutting place where they treat everyone the same , I felt that each time I was in there that they had a personalized workout just to help me with my sport. (MMA) I recommend them to anyone even if  it’s for your grandma just wanting to walk better or if you’re a pro athlete !! I think everyone there is great and they  even make it fun !", "pics": null, "resp": {"time": 1576532916873, "text": "Cool man. We loved having you!"}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "107878770197463041733", "name": "Valley Tax Partners", "time": 1575668472328, "rating": 5.0, "text": "I was referred by a friend and am so grateful. All the staff is friendly and attentive. Chris and Andrew have been great to work with to figure out what is going on with my situation. Looking forward to getting better but still continuing to be a patient and benefiting from all the services they offer.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "103431126689693713446", "name": "Kaitlyn Poff", "time": 1580910685891, "rating": 5.0, "text": "Chris Allison is so great! He worked me in very quickly for shoulder pain. He is super knowledgeable and works well with athletes! I do CrossFit and it was nice to have someone who relates to the sport and could me advice on what and what not to do that pertains to what I do in the gym. Will definitely be going back in the future!", "pics": null, "resp": {"time": 1580999263603, "text": "Appreciate you seeing us!"}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "111586634186522278116", "name": "Stacy BARRENTINE", "time": 1595393797370, "rating": 5.0, "text": "The first time I used TherapySouth Riverchase was 4 years ago when I tore my ACL and meniscus. Chris and Lauren were amazing at getting me back on my feet. The latest issue was for a strained muscle in my shoulder which Garrett Hawkins helped get me prepped and ready for dry needling. He was very helpful with any questions or concerns I had before and after the procedure. I have and will always recommend the Riverchase location to my friends and family because they truly care about you and work hard to help you properly overcome an injury.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "105835516844662850460", "name": "Jesse Masters", "time": 1570913125694, "rating": 5.0, "text": "Recently hurt my back squatting during a workout. I have never had an experience with physical therapy and was skeptical of some techniques such as dry needling. Andrew took a holistic approach to treatment and made sure that I was educated about the anatomy, techniques and recovery. As a former athlete, it’s important to be treated by a professional with the same eagerness that I have to get me well. Incredible experience and noticeable results after my first session. I would highly recommend seeing Andrew Darwin!", "pics": null, "resp": {"time": 1570916647235, "text": "Glad you came !!  Look forward to seeing back on the squat rack."}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "101336521605933916743", "name": "Garrett Hawkins", "time": 1595516366868, "rating": 5.0, "text": "Lauren was very polite when I came in. Chris and Andrew were extremely knowledgeable, upbeat, and helpful. I wouldn’t want to go any other clinic.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "105912064822742070807", "name": "Baker Chambliss", "time": 1595964147413, "rating": 5.0, "text": "Awesome personalized care. Getting my hip back on track again!", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "108961574381916317462", "name": "Keith Dukes", "time": 1597151771814, "rating": 5.0, "text": "Great facility. The team is very knowledgeable, thorough, and friendly.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "112170427383488451208", "name": "David Wolnski", "time": 1569887261273, "rating": 5.0, "text": "Andrew Darwin is incredible! As an active athlete eager to get back to work, Andrew sold me on his effective aggressive style of PT to get me back to work safely. Well it has worked! Go see him!!", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "100456691476052096711", "name": "Brock Hill", "time": 1595358475452, "rating": 5.0, "text": "I’ve been to multiple pt clinics and therapy south Riverchase has by far been my favorite experience!", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "101696997589422466203", "name": "Richard Key", "time": 1570118566449, "rating": 5.0, "text": "The therapists here were truly interested in my wellbeing. The exercises exactly what I needed to help me with my goals. I would recommend TherapySouth in Hoover to anyone.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "111558048076473397000", "name": "Kim Cullum", "time": 1553438944869, "rating": 5.0, "text": "I went to the Riverchase location of Therapy South for issues with my lower back.  I selected it based on positive reviews and I was not disappointed!  I received treatment over 4 weeks that included dry needling that really helped.  Chris gave me the tools I needed to keep myself healthy with stretches to do on the tennis court before I play along with exercises that I can easily do at home.  I would definitely recommend Therapy South for treatment.", "pics": null, "resp": {"time": 1553441775462, "text": "Thanks Kim!  Enjoyed having you!"}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "111251715819296335123", "name": "Ramsey White", "time": 1560535877183, "rating": 5.0, "text": "Andrew did an excellent job dry needling my calves after I jumped back into running post college. I would highly recommend working with him if you are a competitive athlete wanting to improve your body’s overall health", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "105444104457124247200", "name": "Frankie shine III", "time": 1595649838588, "rating": 5.0, "text": "Outstanding group of professionals with superior experience and results.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "109895327439317669538", "name": "Davis Looney", "time": 1560624021250, "rating": 5.0, "text": "Go see Andrew!!! I went to see him for a dry needle treatment, and it was so helpful. I was having neck/back pain, and after spending time with Andrew, I had immediate relief, and I  continued to get better over the next day or two after I left. I highly recommend him!", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "114509017030582449996", "name": "Christen Colvert", "time": 1559339484721, "rating": 5.0, "text": "They were so attentive and got to the root of the problem I’ve been dealing with on and off for a couple of years now. After he worked on my shoulder and dry needled I had instant relief and more mobility. When I had seen chiropractors I got relief but the issue came back or never really went away.", "pics": null, "resp": {"time": 1560028064434, "text": "Thanks for makin the drive over!  We really appreciate you."}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "100714037139933843603", "name": "Courtney Callahan", "time": 1561139937872, "rating": 5.0, "text": "Chris Allison is very knowledgeable and a pleasure to be with. I got such great results from coming here!", "pics": null, "resp": {"time": 1561142466753, "text": "Thanks Courtney!  Pleasure is all ours."}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "111033572184629807295", "name": "Summer Smith Lee", "time": 1516383116006, "rating": 5.0, "text": "Chris and Corey are the best around!! I workout next door to their office and they are so welcoming and helpful every time I come in. I have referred many people to them and will continue to! They are so knowledgeable and have kept me active with recovery techniques and dry needling. They are also fun and just the best guys you’ll ever meet!", "pics": null, "resp": {"time": 1516384637601, "text": "Thanks Summer!  It was a pleasure working with you!"}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "102348783371063377061", "name": "Jim Callison", "time": 1461978907353, "rating": 5.0, "text": "Chris and Corey are awesome and I would recommend to anyone.  I used them pre and post hip replacement and they have been very helpful in my recovery.  I started with Chris, who did a great job of assessing my condition and working with me.  I have also used Corey and find him to be excellent as well.  They listen to you and value your input and adjust as needed.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "111224598190188859724", "name": "Jacob (Jake) Fagan", "time": 1563556325013, "rating": 5.0, "text": "Came to see Andrew after soreness from working out. He dry needled, scraped, and cupped. Definitely worth the visit. If you are sore, tight, or injured, see Andrew at Therapy South Riverchase.", "pics": null, "resp": {"time": 1563882720486, "text": "Andrew is great. Thankyou for comin in!"}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "108079561827483602377", "name": "Wendy Malone", "time": 1514565961974, "rating": 5.0, "text": "Great facility.  The staff is awesome and used a variety of techniques to work with me to help with my back, knee and foot issues.  I love the way they explain the treatment and text exercises for me to do at home.  Keep up the great work!!!", "pics": null, "resp": {"time": 1516219198307, "text": "Will do!  Thank you!"}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "104739109094693790373", "name": "Deanna Dupree", "time": 1551298050629, "rating": 5.0, "text": "I have received excellent individual therapy for my rehab. The office is ran on schedule I have never waited to be seen. The entire staff works as team. The therapist assigned to me has been wonderful to work with and I would highly recommend him ( Andrew)\nD. Dupree", "pics": null, "resp": {"time": 1563882793897, "text": "We really appreciate you!  I give you 5 stars!"}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "115899016180746398974", "name": "Boo Bailey", "time": 1522967613791, "rating": 5.0, "text": "Chris Allison and staff at Therapy South helped me completely get back to normal life after having “frozen shoulder”. I only had 30% mobility of my left arm and it was very painful, especially during the night. Today I finished my therapy and now have complete mobility of my arm and was able to go on a planned family vacation. Thank you Chris and all the staff❣️❣️", "pics": null, "resp": {"time": 1523371060018, "text": "Pleasure was ours. Thank you for buying into the process!"}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "110460614336174926283", "name": "Matthew Kilgore", "time": 1537798231402, "rating": 5.0, "text": "I always feel better when I leave here. My body feels aligned and back to normal after therapy here. I highly recommend Therapy South.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "111461524412163158011", "name": "Jan Bradford", "time": 1529614923955, "rating": 5.0, "text": "Such a great group of professionals.  I tried therapy and have had excellent results.  The caring attention and success were outstanding.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "108801915013799819202", "name": "Crystal Knezek", "time": 1533301020899, "rating": 5.0, "text": "I came in after I tore my rotator cuff. I was super disappointed and frustrated that it wasn't healing and I had lost so much strength. Chris and his team have been patient, understanding, and willing to push me. He was great about really getting to the core of my weakness and creating a plan to help me get back to normal. I trust and respect the whole team here and will recommend them to my friends.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "116678502862263463004", "name": "F Blanchard", "time": 1515199294980, "rating": 5.0, "text": "Great place to go for physical therapy! Chris, Corey, and the entire staff is friendly and professional. I had surgery for rotator cuff tear.   Doctor installed a shoulder anchor and instructed me to keep immobilized for 10 days before starting therapy.  The 1st day of therapy, I could not move my arm.  I had to wear a pillow sling for 6 weeks.  After 12 weeks I have total movement back and am now working on weights to strengthen. If you need any therapy, this is the best location.", "pics": null, "resp": {"time": 1516219172105, "text": "Glad your shoulder is doing so well.  It was a pleasure working with you!"}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "117043701161222331296", "name": "Dana Duell", "time": 1449767368756, "rating": 5.0, "text": "The team at Therapy South Riverchase are excellent.  They are helpful and have offered me a lot of relief.  They have been informative and patient with teaching me the exercises that will aide me in reaping the best results health wise.  I would highly recommend them to friends, family and anyone who might need help along the way to feel better.", "pics": null, "resp": {"time": 1449767888409, "text": "Thank you Dana!  It was a pleasure working with you."}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "114138934076821801867", "name": "Dakota Goodwin", "time": 1486760262374, "rating": 5.0, "text": "I'm a massage therapist and have been experiencing issues with my right shoulder/neck/hand due to an impingement on some nerves.referred from a client,I tried dry needling for the first time and I cannot believe the amount of relief I have in my arm after one session. I'm able to use it like normal and finally able to sleep without my hand going numb.ill definitely be back and will be referring anyone I think may benefit from this type of therapy.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "105771563670940997269", "name": "Jonna Wallace", "time": 1457562802128, "rating": 5.0, "text": "I had a car accident in December 2015 and have been going to Therapy South for a neck/hand/nerve injury.  Chris and Corey are both excellent!  I have nearly fully recovered and credit my recovery to their expertise in the field. They are attentive and kind.  I've been impressed with watching them treat a diversity of people and injuries from athletes to senior adults.  Lauren is a great billing admin too.  Will hate to say goodbye!", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "105100900896704194457", "name": "Darla McMullen", "time": 1545412990747, "rating": 5.0, "text": "Wonderful staff! They have a wide selection of equipment to help and all the therapists are very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "113022143956643161246", "name": "Amecha Franks", "time": 1549896754085, "rating": 5.0, "text": "Andrew, Chris and Madison are just wonderful!! They listen to you and structure a plan to get you to where you need to be! Highly recommended!!", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "108885995092640950716", "name": "Matt Howard", "time": 1453470907587, "rating": 5.0, "text": "Chris is great! Any time he has something open he always makes time for me. He cares about all clients and isn't somebody that just sees you and then ushers you out. He takes time to explain things and tells you ways that you can help yourself. All his treatments have worked wonders on me and I will continue to see him regularly.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "109158602344631975711", "name": "Scottie Hawkins", "time": 1595361750298, "rating": 5.0, "text": "Chris, Andrew & Garrett took care of me !!!!\n\nThank you guys", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "117929319293118491299", "name": "John Tipton", "time": 1466553854057, "rating": 5.0, "text": "I don't always fall off of my motorcycle, but when I do I head to this Therapy South location. The doctors and staff are fantastic. Scheduling is painless and flexible. Dr Chris explained the mechanism and anatomy behind each treatment and excercise. Shoulder was 20/100 before treatment and today every bit of 95/100.\n\nThanks to the team.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "105268472456195406129", "name": "Kayla Anthony", "time": 1463086781371, "rating": 5.0, "text": "One word to describe this place- AWESOME!!   Chris and his whole staff are excellent! They always take great care of me and the service is always amazing!  I highly recommend them!!  😃", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "116870611842372471892", "name": "Brayden Blythe", "time": 1514411638463, "rating": 5.0, "text": "The staff helped me fully recover from ACL reconstruction. Could not have done it without their hard work and dedication to make me better.", "pics": null, "resp": {"time": 1516219237509, "text": "So glad to hear you fully recovered following your ACL surgery.  It was a pleasure working with you!"}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "102633105624105290593", "name": "Brice Jackson", "time": 1544211160636, "rating": 5.0, "text": "Chris & Andrew are fantastic! Thank you both for your kindness & expertise.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "103875396266463020114", "name": "Corbin Ellard", "time": 1510802610901, "rating": 5.0, "text": "Absolutely love this place! Chris and Corey did a great job. I was having trouble with my left elbow, which was such an uncomfortable spot on my arm and they got it all sorted out. They will be the only place I refer people to when it comes to PT", "pics": null, "resp": {"time": 1516219301639, "text": "Thank you Corbin!"}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "116220198338802517401", "name": "Brian Black", "time": 1493137299149, "rating": 5.0, "text": "Great Staff! Recovering from hand surgery and they have been great! Would definitely recommend them for physical therapy!", "pics": null, "resp": {"time": 1516219321630, "text": "It was a pleasure working with you Brian!"}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "105476465311287767201", "name": "tesla nichole", "time": 1452270740421, "rating": 5.0, "text": "I visit TherapySouth Riverchase periodically to receive Dry Needling therapy. The entire staff is so nice and professional, and the facility is clean, open and welcoming. Chris always takes great care of me each visit. If you're looking into physical therapy I highly recommend Chris Allison and the entire staff at TherapySouth Riverchase!", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "108021794489069090504", "name": "lauren philen", "time": 1449698184388, "rating": 5.0, "text": "I had an excellent experience at TherapySouth Riverchase.  Chris and Corey were both very knowledgeable and helped me tremendously in my recovery.", "pics": null, "resp": {"time": 1449700610064, "text": "Lauren, that is great to hear!  We are excited that your goals for physical therapy were met."}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "100044308664108215673", "name": "Christina Van Der Hulst", "time": 1453471000741, "rating": 5.0, "text": "Service is great! Very attentive and always happy to answer any questions/concerns! Highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "115487842189962712249", "name": "Katrina Chapman", "time": 1513713243362, "rating": 5.0, "text": "I had two surgeries before the age of 20 because of wear and tear from over a decade of swimming. Both were done by the same surgeon. My first surgery was in November of 2015. I did physical therapy at another Hoover clinic (not a therapy south) and I grew to hate physical therapy, physical therapists, anything associated with them. I honestly believed the profession was a crock because of the poor care I had received at that clinic. I didn’t know any better! My hip never got better, it was much weaker than before, and three years later, is still in pain and lacking the function I had prior. My skepticism towards physical therapy as it turns out, was just because I went to the wrong place. After a shoulder surgery in May of 2016, I was referred to Chris and Corey from a friend and my outlook could not be more different now. Not only did they cater my shoulder rehab to my specific sport (weightlifting), they also helped me repair my hip and alleviate some of my pain. I’m a true believer in physical therapy now, even going as far as changing my career path so I can also change someone’s outlook. Chris and Corey go above and beyond for you and Lauren is always a friendly face when I come into the office. I can’t say enough good things. Thanks y’all!", "pics": null, "resp": {"time": 1516219277334, "text": "Thank you, thank you!  It was a pleasure working with you!"}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "105927094514513555838", "name": "Melissa Bryant", "time": 1450293882212, "rating": 5.0, "text": "I could barely walk and had pain every day. I came to Therapy South Riverchase and Chris and Corey helped me progress all the way to running marathons! Thank you so much!", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "113413478359929518307", "name": "John Hunt", "time": 1563878498853, "rating": 5.0, "text": "Chris and the staff are committed to getting you back to break condition.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "112698374087566472433", "name": "Matt Snow", "time": 1515531190192, "rating": 5.0, "text": "Friendly staff, clean facility, professional care!", "pics": null, "resp": {"time": 1516219138829, "text": "Thanks Matt!  It was a pleasure working with you!"}, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
{"user_id": "100751711138529710628", "name": "Logan McNaughton", "time": 1450749257757, "rating": 5.0, "text": "I have been to Therapy South for multiple injuries and the team there is always welcoming and make you feel at home every time.", "pics": null, "resp": null, "gmap_id": "0x888923ac8d1863db:0xd11a9aac4595e8b6"}
