{"user_id": "108693291267328469466", "name": "R R", "time": 1626544520402, "rating": 1.0, "text": "Went into the store looking for crutches for my wife that injured her foot.. granted this was a Saturday, so I’m sure they weren’t expecting much business. As I walked in, there were 2 young girls behind the counter eating lunch. they looked up to see me walk in, and that was the extent of it..  didn’t even acknowledge that I was there with a simple “hello” or “can we help you?”. I walked up to the counter and stood there waiting to be acknowledged so I could ask for assistance, and they just continued to eat and decided I was not worth turning around for.. so after a few moments I decided that this was their customer service at their best and I was just going to have to find it myself.. I finally found the crutches behind me near the entrance (couldn’t see them as I entered the store) as I searched for the right size for my wife, I noticed the size I needed was not marked, but a pair that was in the “adult” slot with no indication of the size.. I finally got there attention by asking “can you tell me what size these are”.. I guess they REALLY weren’t concerned about me when she responded “oh those are $25”. I said “ok.. but what size are these?” She walked over and said “what size do you need?” I told her 5’5 (adult) she looked through them, I guess thinking I was too dumb and hadn’t thought to do the same.. and said “we have some in the warehouse, but it’s closed, but you can come back on Monday and get them”.  I asked what about these that aren’t marked (clearly looking like the size I needed) oh those are the display, again confirming that she could have the crutches for me on Monday. She was never in her reply’s but I felt like I wasn’t worth their time. I’m a RN at a nearby hospital and you can be sure I’ll be more than happy to pass along my experience with this DME store! Wouldn’t recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eee0fcb1f:0x9f7e08af1a1aa122"}
{"user_id": "106435090699370075839", "name": "Wendy James", "time": 1572900089752, "rating": 5.0, "text": "Kind and caring service! Kaley went above and beyond to help us with our last minute, emergency needs. We will always, highly recommend these friendly and professional folks!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eee0fcb1f:0x9f7e08af1a1aa122"}
{"user_id": "114666535871615942799", "name": "Helen Nixon", "time": 1487264711792, "rating": 5.0, "text": "Well stocked, well supplied and knowledgeable people. Everyone very friendly and helpful. They take the time to make sure you have the right item to fit your needs.", "pics": null, "resp": {"time": 1487266607217, "text": "Helen, we very much appreciate your kind words.  Glad our team could help meet your needs.   I'll pass on your feedback to our SME team members.  Thank you."}, "gmap_id": "0x889a4d2eee0fcb1f:0x9f7e08af1a1aa122"}
{"user_id": "102293453306770412596", "name": "William Elliott", "time": 1537546925948, "rating": 1.0, "text": "Absolutely horrible service. I am stuck at a rehab center awaiting delivery of a special walker to go home. I had this ordered 3 days ago. I was promised that it would be here early this morning. Again disappointed. Inquiring again, I was told that it would be delivered when they got around to it. Totally unacceptable. Saad’s has deplorable health services along with a horrible supply company.", "pics": null, "resp": {"time": 1537557563945, "text": "Mr. Ellliot, we understand the frustration that can come from expectations not met. We have looked into your delivery and found that we first received the order and delivered the equipment within the same morning.  We would appreciate a chance to discuss the matter to understand how we could have helped as we work hard to provide same day home and facility delivery for our customers."}, "gmap_id": "0x889a4d2eee0fcb1f:0x9f7e08af1a1aa122"}
{"user_id": "110144874767875202857", "name": "Jill Mattson", "time": 1498660070659, "rating": 5.0, "text": "Wheelchair rental was easy and quick. $30 for the week", "pics": null, "resp": {"time": 1498661289144, "text": "Thank you for the review and your choice to let us serve you.  We are here to help if you need anything else.\n\n-Phillip"}, "gmap_id": "0x889a4d2eee0fcb1f:0x9f7e08af1a1aa122"}
{"user_id": "109266193797410791492", "name": "John rohman", "time": 1498502714244, "rating": 5.0, "text": "Very helpful, thanks again", "pics": null, "resp": null, "gmap_id": "0x889a4d2eee0fcb1f:0x9f7e08af1a1aa122"}
{"user_id": "114771975973941631784", "name": "Michelle Hancock", "time": 1617810688127, "rating": 5.0, "text": "The ladies that helped me at this place are awesome. I had a situation where I needed my new bipap machine at the last minute due to changes I found out about in my insurance. I was going to have to pay more for my equipment if I did not get it that day. Megan and Savannah hit a home run and were able to squeeze me in and had the exact equipment in store that I wanted! They normally need more than a day to handle new equipment, but told me they were willing to try due to my situation and they really worked hard to make this all happen. I highly recommend using McAbee Medical as their employees really care about their customers.", "pics": null, "resp": null, "gmap_id": "0x8862869e443c0ca3:0xf6fef2b894ed7d1c"}
{"user_id": "107138918961801353660", "name": "Irfan Rashid", "time": 1620506342713, "rating": 1.0, "text": "Terrible experience. Will not recommend this place to anyone. Purchased a compression stocking for $80 and it ripped 10 minutes later when putting it on. Went back to the store 10 minutes later and they refused to refund or exchange for an identical pair. Not good customer service at all.", "pics": null, "resp": null, "gmap_id": "0x8862869e443c0ca3:0xf6fef2b894ed7d1c"}
{"user_id": "100707286428916198066", "name": "randee deason", "time": 1608412980500, "rating": 1.0, "text": "Would not recommend, employee seemed stressed and not engaged upon first contact. It was over a month after I heard back from them.", "pics": null, "resp": null, "gmap_id": "0x8862869e443c0ca3:0xf6fef2b894ed7d1c"}
{"user_id": "116437292437623067167", "name": "Donna Turcotte", "time": 1587484405447, "rating": 1.0, "text": "Wouldn’t fill a stocking prescription without talking to my dr. There was no reason to talk to my dr. Went down the road and had no problems walked out with my stockings. Should have known better by the way they treated my husband when he was alive. Not very nice people.", "pics": null, "resp": null, "gmap_id": "0x8862869e443c0ca3:0xf6fef2b894ed7d1c"}
{"user_id": "106322593233779536347", "name": "Kevin Breuers", "time": 1518718274561, "rating": 1.0, "text": "Went to them for a CPAP.  If you want a company that does not return calls, and forces you to track down clinical data while requiring you to also serve as the middle liasion for the Dr and insurance company, this company is for you.  If you want a company to do all this for you and fit and give you your CPAP in a day, go to Southern Medical Equipment in Huntsville.", "pics": null, "resp": null, "gmap_id": "0x8862869e443c0ca3:0xf6fef2b894ed7d1c"}
{"user_id": "107224779953510952884", "name": "Pat Killian", "time": 1619015945648, "rating": 5.0, "text": "The BEST place in fort Payne for supplies and the BEST staff - - -", "pics": null, "resp": null, "gmap_id": "0x8861d7d4ccd29ef9:0x31477a502f6f0d1c"}
{"user_id": "104497264889036358944", "name": "Richard Hartline", "time": 1492547651716, "rating": 5.0, "text": "They have a very good selection of just about anything a person needs for home health care. The prices are fair and the staff is very friendly and helpful.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMSGKhQvLSg7R6I_LXP-gtSHr3dfKmrD8-ATKQz=w150-h150-k-no-p"]}], "resp": {"time": 1499786202285, "text": "Thank you so much for the kind review. Hope to see you soon!"}, "gmap_id": "0x8861d7d4ccd29ef9:0x31477a502f6f0d1c"}
{"user_id": "101540822407172250453", "name": "Drew Taylor", "time": 1590766579330, "rating": 5.0, "text": "This family-owned business proves time and time again that they put their customer's first. They're the best Medical Supply company in Fort Payne, Al - Hands down!", "pics": null, "resp": {"time": 1526651168159, "text": "Thanks for the review Drew Taylor!"}, "gmap_id": "0x8861d7d4ccd29ef9:0x31477a502f6f0d1c"}
{"user_id": "117695963417381518386", "name": "Beverly Dean", "time": 1502216400929, "rating": 5.0, "text": "Have used them for years. Always very helpful. Highly recommend.", "pics": null, "resp": {"time": 1502218677127, "text": "We thank you so much for the kind words! Thank you!! See ya soon!"}, "gmap_id": "0x8861d7d4ccd29ef9:0x31477a502f6f0d1c"}
{"user_id": "106951458073798745489", "name": "Candice Wilbanks", "time": 1502454823346, "rating": 1.0, "text": "Caught them in a lie about something trivial like when they actually ordered what I needed. Its been over a week and a half and still haven't heard from them on item. I would not recommend these people at all.", "pics": null, "resp": {"time": 1502834009210, "text": "Candice,\n\nThank you so much for bringing this matter to our attention. I apologize for the unpleasant experience with our company. This is never our intention. I have followed up on the order and found your product was ordered on August 4th, (the morning after you were in) directly from the manufacturer. The item was backordered when our shipment arrived meaning it actually had to be made rather than just being packed and shipped. Unfortunately the backorder involved two weekends which did add time to the order. I sincerely apologize for your inconvenience and for our failure in communicating more specifically to you regarding your backorder. Again, thank you for your feedback and I apologize once again.    Beth Westmoreland owner"}, "gmap_id": "0x8861d7d4ccd29ef9:0x31477a502f6f0d1c"}
{"user_id": "109818712454173995648", "name": "Alissa Lapidus", "time": 1622053286098, "rating": 5.0, "text": "From the first phone call to delivery to picking up the equipment; this company shows they CARE! Wonderful friendly empathic and compassionate staff from start to finish. Wouldn’t it be great if all businesses ran this way? Class act!", "pics": null, "resp": {"time": 1623278505088, "text": "Thank you for the great review.  We appreciate you allowing us to serve you and please let us know if we can be of any help in the future."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "113571891123133732803", "name": "Margaret Huang", "time": 1611949730600, "rating": 5.0, "text": "It is so true as everyone described here! These guys go above and beyond to server their customers! I rented a scooter when I fractured my foot. The scooter quality is excellent, and it has a very good brake system! I highly recommend this shop to everyone!", "pics": null, "resp": {"time": 1623278605941, "text": "Thank you for letting us know how the equipment worked out for you.  We appreciate your comments and  wish you all the best with your healing process."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "107508978388063448091", "name": "Slick Rick", "time": 1605132560080, "rating": 5.0, "text": "I broke my ribs and standing/sitting was an excruciating experience.  These guys got a lift chair out to me the very next day.  The delivery guys were super helpful, and it was clear that I was their priority.  They moved furniture to another room to make space for the new chair, set everything up, explained and demonstrated the chair operation and stayed until I was operating it myself and happy with it.  Their patience and kindness made a very difficult time easier, and I am thankful.", "pics": null, "resp": {"time": 1623278911478, "text": "Thank you for the nice comments about our service folks.  I apologize for not responding to your post sooner.  We hope all went well with your rib recovery."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "104931108721210343855", "name": "Samantha Culman", "time": 1607135334386, "rating": 5.0, "text": "Great prices and great customer service. Highly recommend.", "pics": null, "resp": {"time": 1623278750931, "text": "I must apologize for taking so long to reply to your great comment.  Thank you and let us know if we can be of help in the future."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "115997537981158139224", "name": "Roger Schooley", "time": 1595692576410, "rating": 5.0, "text": "Excellent service with friendly and helpful staff. I called four different medical supply stores and attention medical had the best price and availability. Well pleased with service and will be my first choice in the future.", "pics": null, "resp": {"time": 1598395750063, "text": "Thank You for sharing your review.  Glad we could help and please let us know if we can help in any way in the future."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "103168819175630461771", "name": "Gwendolyn Horton", "time": 1611339567899, "rating": 5.0, "text": "Super nice.  If they cant help u out, they will point u in the right direction.", "pics": null, "resp": {"time": 1623278667874, "text": "Thank you for the nice comment any my apologies or my delay in responding to our comment."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "111843709049603020338", "name": "Nathan Wienhoff", "time": 1581599073620, "rating": 5.0, "text": "These guys go above and beyond to make sure the customer is taken care of.  I am extremely pleased with the level of service and compassion that David provided.  Highly recommend this place.  Most pleasurable experience I've ever had at a medical supply place, hands down.  👍👍", "pics": null, "resp": {"time": 1581608848609, "text": "Thank you for your kind words and if there is anything we can help with in the future, please let us know."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "102384770193649363783", "name": "Mary Herrington", "time": 1607655376480, "rating": 5.0, "text": "Great company very friendly and helpful.", "pics": null, "resp": {"time": 1623278705464, "text": "We appreciate your nice comment and my apologies for taking so long to post a response."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "105140773886955672363", "name": "Zach Pugh", "time": 1525745706897, "rating": 5.0, "text": "Great customer experience. Came in and was greeted and helped right away. Very helpful, courteous, and informative. I came in for some work shoes. The size I needed wasn’t in stock so they had to order some in but they came in really quick and work great.", "pics": null, "resp": {"time": 1525779674888, "text": "Thank you for allowing us to earn your business and for your review."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "111041257124089777494", "name": "Boyd Berryhill", "time": 1542052483260, "rating": 5.0, "text": "I have been a loyal customer for years. They have a friendly staff and GREAT customer service. Anytime I need something, I can count on expert knowledge and a caring attitude. Thank you for being here!", "pics": null, "resp": {"time": 1549907844454, "text": "Thank you for your review and king remarks."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "116975133388149727020", "name": "Marie Marlin", "time": 1573163580966, "rating": 5.0, "text": "Pleasant efficient staff and reasonable prices.  You’ll be glad you came.", "pics": null, "resp": {"time": 1573232583244, "text": "Thank You and please let us know if we can ever be of service."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "108411640472289600309", "name": "Renee Holder", "time": 1555441598590, "rating": 1.0, "text": "One of the worst companies I've ever had the displeasure of working with. Denying a completely  Handicap the right to a bed and wheelchair when she cannot move whatsoever on her own. This company is ridiculous!!!  She has Tricare and Medicare.  And they are worried that they will not get their money?!!! And this is a quote from a representative from their business.  If I could leave 0 stars, I would.", "pics": null, "resp": {"time": 1556229316196, "text": "Dear Ms. Holder.  I am very sorry you feel that our company is not providing the hospital bed and wheelchair because of being “worried that they will not get their money”.  That is not the main issue in this case, however.  Being paid for the equipment is important to us but most importantly is the medical necessity for the items provided.  Medicare has specific guidelines that we must follow in providing equipment that is ordered and if we do not follow them, not only payment is not received but it opens us up to potential Fraud and Abuse issues with Medicare for billing items that the medical records do not support.  Our Store Manager, myself and another clinical person reviewed the records and documents we have received from the physician’s office who is ordering the equipment and what we have so far, does not show medical necessity for the bed and chair.  We have asked for records that do support it and as of date, not received anything that does.  It is not our desire to withhold needed equipment from anyone who needs it, but we are compelled to follow established guidelines that support it which as of now, not supported by records in our possession.  We would be happy to schedule a meeting with the customer and/or yourself, if you are a designated representative, to provide a copy of the medical necessity requirements and discuss how the records we have compares to the requirements.  Please feel free to contact our local store and let us know when a good time would be.  Again, I am sorry for how you feel but we are not intentionally trying to cause stress for you or the customer.  We are simply following the medical policy established by Medicare."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "108615189785732703484", "name": "Brandi Mason", "time": 1557511813270, "rating": 5.0, "text": "Great selection and customer service mindset, kind and attentive to your specific needs.", "pics": null, "resp": {"time": 1558470382702, "text": "Thank You fr your review.  Please let us know if we can be of help in any way."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
