{"user_id": "111250228557118688583", "name": "brady odem", "time": 1601589232133, "rating": 5.0, "text": "I've been in the store multiple times over last year since I was diagnosed with extreme sleep apnea, I was put straight to bi pap. The guy Steve runs that depth and he has always helped me with all the little things that occur, some of us are rollers, but they always seem to have what I need", "pics": null, "resp": null, "gmap_id": "0x887d49e39eb8e379:0x6ee559163b229770"}
{"user_id": "106740279232047359746", "name": "James Montgomery", "time": 1606244664787, "rating": 4.0, "text": "Nice people,  friendly atmosphere.", "pics": null, "resp": null, "gmap_id": "0x887d49e39eb8e379:0x6ee559163b229770"}
{"user_id": "105158485302277604910", "name": "monkeytoe007", "time": 1588306604240, "rating": 5.0, "text": "Very helpful and patient with me.", "pics": null, "resp": null, "gmap_id": "0x887d49e39eb8e379:0x6ee559163b229770"}
{"user_id": "118050336790803668618", "name": "Leanna White", "time": 1486650711750, "rating": 5.0, "text": "Love the people and the service... Thank you all!!", "pics": null, "resp": null, "gmap_id": "0x887d49e39eb8e379:0x6ee559163b229770"}
{"user_id": "108693291267328469466", "name": "R R", "time": 1626544520402, "rating": 1.0, "text": "Went into the store looking for crutches for my wife that injured her foot.. granted this was a Saturday, so I’m sure they weren’t expecting much business. As I walked in, there were 2 young girls behind the counter eating lunch. they looked up to see me walk in, and that was the extent of it..  didn’t even acknowledge that I was there with a simple “hello” or “can we help you?”. I walked up to the counter and stood there waiting to be acknowledged so I could ask for assistance, and they just continued to eat and decided I was not worth turning around for.. so after a few moments I decided that this was their customer service at their best and I was just going to have to find it myself.. I finally found the crutches behind me near the entrance (couldn’t see them as I entered the store) as I searched for the right size for my wife, I noticed the size I needed was not marked, but a pair that was in the “adult” slot with no indication of the size.. I finally got there attention by asking “can you tell me what size these are”.. I guess they REALLY weren’t concerned about me when she responded “oh those are $25”. I said “ok.. but what size are these?” She walked over and said “what size do you need?” I told her 5’5 (adult) she looked through them, I guess thinking I was too dumb and hadn’t thought to do the same.. and said “we have some in the warehouse, but it’s closed, but you can come back on Monday and get them”.  I asked what about these that aren’t marked (clearly looking like the size I needed) oh those are the display, again confirming that she could have the crutches for me on Monday. She was never in her reply’s but I felt like I wasn’t worth their time. I’m a RN at a nearby hospital and you can be sure I’ll be more than happy to pass along my experience with this DME store! Wouldn’t recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eee0fcb1f:0x9f7e08af1a1aa122"}
{"user_id": "106435090699370075839", "name": "Wendy James", "time": 1572900089752, "rating": 5.0, "text": "Kind and caring service! Kaley went above and beyond to help us with our last minute, emergency needs. We will always, highly recommend these friendly and professional folks!", "pics": null, "resp": null, "gmap_id": "0x889a4d2eee0fcb1f:0x9f7e08af1a1aa122"}
{"user_id": "114666535871615942799", "name": "Helen Nixon", "time": 1487264711792, "rating": 5.0, "text": "Well stocked, well supplied and knowledgeable people. Everyone very friendly and helpful. They take the time to make sure you have the right item to fit your needs.", "pics": null, "resp": {"time": 1487266607217, "text": "Helen, we very much appreciate your kind words.  Glad our team could help meet your needs.   I'll pass on your feedback to our SME team members.  Thank you."}, "gmap_id": "0x889a4d2eee0fcb1f:0x9f7e08af1a1aa122"}
{"user_id": "102293453306770412596", "name": "William Elliott", "time": 1537546925948, "rating": 1.0, "text": "Absolutely horrible service. I am stuck at a rehab center awaiting delivery of a special walker to go home. I had this ordered 3 days ago. I was promised that it would be here early this morning. Again disappointed. Inquiring again, I was told that it would be delivered when they got around to it. Totally unacceptable. Saad’s has deplorable health services along with a horrible supply company.", "pics": null, "resp": {"time": 1537557563945, "text": "Mr. Ellliot, we understand the frustration that can come from expectations not met. We have looked into your delivery and found that we first received the order and delivered the equipment within the same morning.  We would appreciate a chance to discuss the matter to understand how we could have helped as we work hard to provide same day home and facility delivery for our customers."}, "gmap_id": "0x889a4d2eee0fcb1f:0x9f7e08af1a1aa122"}
{"user_id": "110144874767875202857", "name": "Jill Mattson", "time": 1498660070659, "rating": 5.0, "text": "Wheelchair rental was easy and quick. $30 for the week", "pics": null, "resp": {"time": 1498661289144, "text": "Thank you for the review and your choice to let us serve you.  We are here to help if you need anything else.\n\n-Phillip"}, "gmap_id": "0x889a4d2eee0fcb1f:0x9f7e08af1a1aa122"}
{"user_id": "109266193797410791492", "name": "John rohman", "time": 1498502714244, "rating": 5.0, "text": "Very helpful, thanks again", "pics": null, "resp": null, "gmap_id": "0x889a4d2eee0fcb1f:0x9f7e08af1a1aa122"}
{"user_id": "114771975973941631784", "name": "Michelle Hancock", "time": 1617810688127, "rating": 5.0, "text": "The ladies that helped me at this place are awesome. I had a situation where I needed my new bipap machine at the last minute due to changes I found out about in my insurance. I was going to have to pay more for my equipment if I did not get it that day. Megan and Savannah hit a home run and were able to squeeze me in and had the exact equipment in store that I wanted! They normally need more than a day to handle new equipment, but told me they were willing to try due to my situation and they really worked hard to make this all happen. I highly recommend using McAbee Medical as their employees really care about their customers.", "pics": null, "resp": null, "gmap_id": "0x8862869e443c0ca3:0xf6fef2b894ed7d1c"}
{"user_id": "107138918961801353660", "name": "Irfan Rashid", "time": 1620506342713, "rating": 1.0, "text": "Terrible experience. Will not recommend this place to anyone. Purchased a compression stocking for $80 and it ripped 10 minutes later when putting it on. Went back to the store 10 minutes later and they refused to refund or exchange for an identical pair. Not good customer service at all.", "pics": null, "resp": null, "gmap_id": "0x8862869e443c0ca3:0xf6fef2b894ed7d1c"}
{"user_id": "100707286428916198066", "name": "randee deason", "time": 1608412980500, "rating": 1.0, "text": "Would not recommend, employee seemed stressed and not engaged upon first contact. It was over a month after I heard back from them.", "pics": null, "resp": null, "gmap_id": "0x8862869e443c0ca3:0xf6fef2b894ed7d1c"}
{"user_id": "116437292437623067167", "name": "Donna Turcotte", "time": 1587484405447, "rating": 1.0, "text": "Wouldn’t fill a stocking prescription without talking to my dr. There was no reason to talk to my dr. Went down the road and had no problems walked out with my stockings. Should have known better by the way they treated my husband when he was alive. Not very nice people.", "pics": null, "resp": null, "gmap_id": "0x8862869e443c0ca3:0xf6fef2b894ed7d1c"}
{"user_id": "106322593233779536347", "name": "Kevin Breuers", "time": 1518718274561, "rating": 1.0, "text": "Went to them for a CPAP.  If you want a company that does not return calls, and forces you to track down clinical data while requiring you to also serve as the middle liasion for the Dr and insurance company, this company is for you.  If you want a company to do all this for you and fit and give you your CPAP in a day, go to Southern Medical Equipment in Huntsville.", "pics": null, "resp": null, "gmap_id": "0x8862869e443c0ca3:0xf6fef2b894ed7d1c"}
{"user_id": "117425569940566225770", "name": "Cyndy Dowling", "time": 1473018957878, "rating": 2.0, "text": "I was pretty much directed to this merchant by my MD. I had a broken bone in my foot. A friend drove me from my MD visit over to this merchant  and I hobbled inside.  I knew I would need to present my insurance information cards and make a payment.\n\nThe employee desks are situated at the very back of the room beyond the product displays. \"For sale\" reclining and lift chairs are located to the left,  then there is a huge group of walkers, wheel chairs, bathing safety seats etc located in the middle section of the store. Neither employee visible got up when we entered the store.\n\nAn employee called out something to us from the desk area.\n\nMy friend encouraged me to sit in the first reclining chair but as it was a floor product I hesitated to do this and  continued towards the back of the store towards the employees.  One of the employees finally said, \"you can sit in one of those chairs\".\n\nI AM trying to make a long story short.\n\nI ended up buying a cast boot, but they informed me that they did not take my insurance so I paid out of pocket for the item.\n\nThe first boot they tried on me was way too big and they quoted me a price of $89.00 for the item.\n\nIn the end they sold me a higher valued, smaller product at close to the price they originally quoted, so I will give them credit for honoring the price they quoted. That is why 2 stars rather than 1 star. (I think the real reason I got the lower price was because my friend advocated for me regarding the price. I could not hear what was said,  because I was still sitting over against the wall in a recliner,  and my friend was over at one of the staff desks.)\n\nThe staff did not appear to know or understand their products very well and did not really explain much about the boot I bought. They were not gentle or accommodating of my injured foot which was covered in a sock, but swollen and quite painful. The boot was not put on my foot/leg correctly. The tops of the two rigid metal posts that are covered in a hard, rough, scratchy Velcro product were up above the padding of the boot.  After a bit of struggling by the employees, I really just wanted to finish the process and get out of the store. My foot hurt and nothing they were doing was helping at all.  Later, after I got home,  my husband and I looked at the picture on the cast boot box.  The picture clearly showed the boot padding extending up above the two rigid metal posts.\n\nThe posts had already sanded away the skin on both sides of my calf/shin. My husband reassembled the boot correctly and put it back on my foot after putting bandages on the two sores on my calf.\n\nThis store needs to rethink the showroom set up. The employees and their desks should be located near the door.  I realize that their product storage and office space are located at the back of the store but they ARE selling medical devices for customers who probably have some kind of limitation. The employees are the ones who should be making the trek across the store. It might also be a good idea for them to have a wheelchair available just inside the door that they could direct a customer to, if needed,  as soon as they entered.  This would be another advantage to the employees being stationed near the door.\n\nLet me be clear. No one was rude to us, but, no one seemed very concerned either. The first girl who tried to help us must have been new and was not familiar with the  boot products.\n\nThis necessitated a second, presumably more experienced staff member also assisting us. The second staff member was pretty obviously not pleased that she had to become involved and was very abrupt with the first staff member.\n\nAll in all it is not an experience I would repeat.\n\nAfter I got home and was finally comfortable with the cast boot, I looked up cast boots on Amazon and I could have gotten a comparable or even better product at half the price. And, Amazon has great customer service.", "pics": null, "resp": null, "gmap_id": "0x886266179711a56d:0x909b87d6f07bead6"}
{"user_id": "112427367387044258202", "name": "Ivan W", "time": 1512756017403, "rating": 5.0, "text": "Needed a wheel chair and a knee cart for a friend who broke her ankle. All Star personnel were friendly, competent, and helpful, and the equipment was like new. I recommend All Star to others.", "pics": null, "resp": null, "gmap_id": "0x886266179711a56d:0x909b87d6f07bead6"}
{"user_id": "105124345556377776363", "name": "Aaron Page", "time": 1508880473931, "rating": 1.0, "text": "I would give them a negative star but that is not an option.  I actually called down to see if they took Tricare Reserve Select, for CPAP supplies, before driving by.  I was told that they do and I just needed to drop by and pick up my supplies.  Once I got there I am sent to the back to talk to a lady where I am informed that I need to produce a great deal of paperwork besides just the prescription.  I explained that all the other times I have done this, in over 3 other locations in 2 other states, that I never had to go through this.  I was told that I was wrong.  So, I can only assume the that prior times, for over 3 years, has caused for those businesses to eat the cost.  Somehow I am just going to go with these guys have zero clue.", "pics": null, "resp": null, "gmap_id": "0x886266179711a56d:0x909b87d6f07bead6"}
{"user_id": "112100658644692013988", "name": "Peggy Cobb", "time": 1551982387731, "rating": 1.0, "text": "Went today to get a new cpap mask. Sign on the door says “closed until further notice “. I asked someone in the store next door and she said that they have been closed for nine weeks.", "pics": null, "resp": null, "gmap_id": "0x886266179711a56d:0x909b87d6f07bead6"}
{"user_id": "101450159794462300011", "name": "Rick Wienczkowski", "time": 1535141770075, "rating": 2.0, "text": "It was a Friday afternoon the young lady on the phone was very rude I just asked her to check to see if my insurance would cover.... she knew it all ....told me to write a check for $20,000.she was wrong.... Please pray for her", "pics": null, "resp": null, "gmap_id": "0x886266179711a56d:0x909b87d6f07bead6"}
{"user_id": "117568858545609498750", "name": "Lisa Overton", "time": 1624293600231, "rating": 5.0, "text": "I’m very happy to leave my first and only Google review (so far, ever) for this excellent medical equipment company! I came in today and met with Danielle who provided me with new medical equipment and the most thorough and stellar instructions! The experience far exceeded my expectations, as well as the quality and features of the equipment itself. Unfortunately, my visit was necessitated by a medical equipment recall. However, this visit put my mind at ease about my ongoing treatment with the new equipment. If you are looking for fast, friendly, and informed service, I highly recommend ONeal Medical!", "pics": null, "resp": {"time": 1624298689257, "text": "Thank you Lisa, we appreciate you and your kind words!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "104681234738951070867", "name": "Susan Johnson", "time": 1595971146157, "rating": 5.0, "text": "I am so glad ONeal Medical is taking care of business while protecting its customers! Farrah came out to my car, picked up my CPap, took it inside for a checkup, and returned it to me in my car. I had been having problems with it and Farrah fixed the problem! I left happy and with a working machine!🥰", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPqewOpk15gDWxV3-Jhm1vqTrc1fAhe4rwJtaIj=w150-h150-k-no-p"]}], "resp": {"time": 1595975244541, "text": "Thank you Suzan, Farah does a wonderful job and while this time has been challenging for us all, we do also appreciate you mentioning the fine service!  Stay well!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "101088033011776367530", "name": "Shaney Dunn", "time": 1621366770549, "rating": 5.0, "text": "Joe & Woody are like family. Dr. Lee's office has done business with this company for over 20 years. If you call or send a email you will get an immediate response. They are here to deliver top notch quality care. Use  this company , amazing service.", "pics": null, "resp": {"time": 1624298735874, "text": "Thank you Shaney, we try hard every day to be the best we can and appreciate your feedback!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "114654149236723827382", "name": "Steven Lee", "time": 1616079919286, "rating": 1.0, "text": "I am not happy. When I bought my Resmed Airsense 10 CPAP they had a VERY limited selection of masks and I'm not happy with the outside vendor mask they had to special order.\n\nLast night my CPAP died middle of the night...repeated attempts to cycle power failed. Had to pull out old CPAP. Showed up at office when they opened, when they plugged it in it worked, but I'm leaving on a trip and don't trust it. The only option they offered was sending it to Resmed...not really an option if you don't have a backup machine. Previous vendor I used just gave me a replacement machine when I had problems.\nBottom line they have VERY limited selection of equipment and no option for loaner or replacement for a critical piece of medical equipment which is still under warranty. I will be changing CPAP vendors immediately.", "pics": null, "resp": null, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "102873856500315189663", "name": "Philip Robinson", "time": 1608857346921, "rating": 5.0, "text": "A gift for Christmas\nMost of us look to give and receive monetary and presents for Christmas.\nI too look forward to this, why?, because of the system we've been conditioned too.\nWell I received a gift today that beats all those gifts.I Received a gift of friendship\n\nI came to spend Christmas with one of my children . I drove 12 hrs. To get here only to find out at 1130pm. That part of my cpap mask was left at home 12hrs. Away. I went to a late night emergency clinic to find one only to find out they couldn't help. I then went to the emergency room at the closest hospital to find out theirs weren't comparable either. I almost resigned myself to stay up all night fearing to go too sleep.  See sleep Anna is nothing to play with, breathing can stop and kill you so going to sleep is dangerous.\n\nI went on line to see if any of the company's that delt with breathing equipment if they had any emergency after-hours  procedures.God is great. As I glanced through  all the options this one stuck out for the simple reason that they emphasized their care for late-night and emergency needs. My son and I called and left messages hoping that someone would call back.\n\nTheir advertisement said that after 12pm that their recording system would call back in the morning. But being it's a holiday I didn't think anyone would.  But by the grace of God around 1210 I was at the hospital emergency room when I got a call. To my surprise the caller wasn't the on call person but one of the owners themselves.\n\nSee he took the on-call because the on-call person tested positivefor Cov19 and he decided to not put anyone else on call.  He had never before  been on call. He met me at his office 15 minutes later, gave me a complete upgraded mask for  free. Saying no one should be deprived of a goods night sleep.\n\nSo to Michael Harden with ONEAL MEDICAL in Birmingham Alabama, you have given me the best Christmas gift, friendship,commitment,and above all, your word that you would answer anyone who needed help no matter when.\n\nThanks", "pics": null, "resp": {"time": 1608916953736, "text": "Thank you Phillip!  All our best and happy holidays sir!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "114623558906915944218", "name": "Bob Beaty", "time": 1602089834124, "rating": 5.0, "text": "O'neal has been my CPAP supplier/support go-to for several years. They all are friendly and always helpful. During this \"challenging time\" the necessary curbside interaction with masking and social distancing is very professional and courteous.  Farah is very knowledgeable and up to date on multiple CPAP systems and the proper accessories.\nShe quickly re-set my machine's prescription and provided me a status update on my machine.  They are a pleasure to work with.\nB", "pics": null, "resp": {"time": 1602597758618, "text": "Thanks Bob! We appreciate you letting us know about your positive experience!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "114567585681602944469", "name": "Pete Partin", "time": 1582418995250, "rating": 1.0, "text": "My husband has been on oxygen since 2015.  Since 2017 he has repeatedly asked about a portable concentrater.  Repeatedly he was told that he did not qualify and would not qualify until he had been on oxygen for 5 years.  Now he has a doctors prescription for one but they will not submit it to Medicare because he will be \"in the gap\" starting in April and they will not be receiving any reimbursement from Medicare, but  would have to continue providing service regardless.", "pics": null, "resp": {"time": 1582464825544, "text": "Is your husband a current OXYGEN customer of ONeal Medical because we have no way of knowing based simply on a Google review.\n\nRegardless, a 1 star review is simply not warranted based on the policy of YOUR insurance plan.  We aren't happy about Medicare's policy of paying for oxygen, we hear complaints about it frequently and so do other oxygen companies, but ONeal Medical didn't create the \"gap\" and Medicare's low payment rates,\n\nYour insurance plan, Medicare, created this mess, not ONeal Medical.\n\nYes, it is up to our company to provide service for the entire 5 years, yet ONLY get paid for the first 3, and then for 2 whole years (the \"gap) basically free of charge. Bear in mind that over this entire 5 year period, we include:\n-24 hours service\n- maintain the equipment\n- free delivery\n-all tubing and supplies / filters\n-file paperwork on the patient's behalf,\n-and from time to time we even provide free oxygen service for patients who travel.\n\nWe would be happy to assist once the \"gap\" period is over, you have the option of privately purchasing a portable oxygen concentrator, but in no way we did we earn a 1 star review as  we feel your review is more a reflection of Medicare's onerous policy, perhaps your misunderstanding of such, but in no way of our company’s performance.\n\nYou can call our office and ask to speak to one of the owners for a more detailed explanation if you wish, and you can call 1-800- MEDICARE as well.\n\nThe process of getting a portable oxygen concentrator, a fairly complex medical device, is VERY fact dependent, there are significant clinical issues to consider as well, so we would encourage you to contact us again so we can fully explain your options, but a 1 star review, no, that's simply not warranted.\n\nNot at all."}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "102662807047269058970", "name": "Cooper Family", "time": 1582752586627, "rating": 5.0, "text": "The staff is knowledgeable and friendly! They really spend the time to help you understand the equipment and do whatever they can to make you happ!", "pics": null, "resp": {"time": 1582757541418, "text": "Hey thank you!  We appreciate this and will pass along to our staff!  Call if you ever need us!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "110500818666655555266", "name": "Casey Bentley", "time": 1563972245695, "rating": 5.0, "text": "Great family owned business for ALL your DME needs!  Great people.", "pics": null, "resp": {"time": 1565799763692, "text": "Thank you Casey!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "107899614337291875242", "name": "Lauren Stinson", "time": 1550454301849, "rating": 5.0, "text": "Excellent and prompt service from O'Neal Medical! Both gentlemen that came to our home to set up oxygen equipment were courteous, patient and knowledgeable. The support staff were also very friendly and helpful. It was wonderful to work with such professional and personable staff members during a stressful time. I would highly recommend O'Neal Medical!", "pics": null, "resp": {"time": 1565799838745, "text": "Thank you Lauren!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "109257703902066368292", "name": "Clarence Fortune", "time": 1548255961903, "rating": 1.0, "text": "Very poor customer service. Received 4 threatening statements for products paid for 4 months ago. Management refused to come to the phone or come out of the office to discuss this. I insisted on a statement showing my entire payment history which showed a zero balance. After receiving another statement for these same changes, management still refused to discuss this.", "pics": null, "resp": {"time": 1548278602186, "text": "Someone will contact you.  We strive for great customer service."}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "116838303445337895732", "name": "W Smith", "time": 1536880468221, "rating": 5.0, "text": "I was using another Medical Supply in Pelham Al. They were the worst company I've ever encountered. I was looking for a good Medical supply and ran across O'Neal Medical. I gave them a try. They actually repaired my C-Pap mask to fit properly, and I wasn't their customer at that time. In days to come I became a customer of O'Neal Medical, and very glad I did.\nThe people are very courteous and caring. They seem to give you the time needed to get you fitted and make sure your happy. My experience with O'Neal Medical is EXCELLENT.....proud to have found them.\nWalt S", "pics": null, "resp": {"time": 1565799847860, "text": "Thank you!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "101956615004864688548", "name": "Cindy Allen", "time": 1460864421091, "rating": 5.0, "text": "I have been using O'Neal Medical for my CPap needs for the last 5 years. They are very helpful whenever I need them to answer any question that I might have. They also have the supplies that I need on hand. I don't have to wait 6 week like I did at my previous supplier. Thanks O'Neal for taking care of us!", "pics": null, "resp": {"time": 1460991374524, "text": "Thank you for the kind words!  We value each and every customer!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "117675592409946593202", "name": "SAL ROSSI", "time": 1597820741925, "rating": 5.0, "text": "Very professional.", "pics": null, "resp": {"time": 1597837190981, "text": "Thanks Sal, we appreciate you!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "109349567589229709050", "name": "Scott Davis", "time": 1536859508261, "rating": 5.0, "text": "Very responsive to my CPAP needs. Very friendly staff.", "pics": null, "resp": {"time": 1565799858470, "text": "Thank you Scott!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "118440310068789495959", "name": "Ronald Otis Lee", "time": 1583537069399, "rating": 5.0, "text": "My wife and I went to MobilityWorks a few weeks ago to find this well taken care of by it's first and only owner that traded it in but my point is this used van had been well maintained and this dealership made us this wonderful offer that we couldn't refuse.\n\nWe're well pleased by the way Chris and Allen had the few repairs taken care of. They were wonderful.\n\nAll we can tell anybody looking and needing a really good used or new handicap van go by and talk with 2 nice guys Chris and Allen. We'll sure you'll be as pleased with your sale and any repairs needed there.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMRZpuCymEUF9GHIBH8WtSkjLyvmaRTyJbnTimA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM-cmJS2zghD8n5U3muvcJtkQiPfLBf13PLaJjK=w150-h150-k-no-p"]}], "resp": {"time": 1565282755704, "text": "Ronald, we take customer satisfaction very seriously. We’d like to get in contact with you personally to get more details about your review. Please provide your contact info at https://www.mobilityworks.com/review/ so that our Regional Manager can reach out. Thank you."}, "gmap_id": "0x8888df64d073e739:0xb14b1f84bea96dab"}
{"user_id": "103134012100308671704", "name": "Stuart Herring", "time": 1582330880683, "rating": 5.0, "text": "As always, we had good quick service for our van. The staff are very friendly and helpful. Recommended!", "pics": null, "resp": null, "gmap_id": "0x8888df64d073e739:0xb14b1f84bea96dab"}
{"user_id": "112736852768640675836", "name": "Ann Wright", "time": 1567106339081, "rating": 5.0, "text": "Thank you Willy, Chris and Sandy for taking care of all our needs and helping us find the right van for us! Our family is a long time customer of Mobility Works, Bessemer and have come to feel like family! They go above and beyond in all situations!!!", "pics": null, "resp": null, "gmap_id": "0x8888df64d073e739:0xb14b1f84bea96dab"}
{"user_id": "106068983547259977726", "name": "Herbert Smith", "time": 1547389953961, "rating": 1.0, "text": "If you lease from here and your love one past away, in order to break the lease they want you to pay the lease out. Which don't make sense, because you will turn in the vehicle and pay the lease out so the can lease it out to someone else. Getting me some legal representation to handle this. This is how much they like disabled veterans., who lost a child.", "pics": null, "resp": {"time": 1547483634633, "text": "Herbert we are sorry for what you are going through. We've sent this review to our Regional Manager and he will be contacting you."}, "gmap_id": "0x8888df64d073e739:0xb14b1f84bea96dab"}
{"user_id": "112113143030401061012", "name": "ALLEN WILLIAMS", "time": 1492807102943, "rating": 5.0, "text": "I work at Mobility Works.  We help people in wheelchairs gain their independence", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNpbqW9s_HUrw1yy90swYXvXzyFAC23q0N1ptpz=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888df64d073e739:0xb14b1f84bea96dab"}
{"user_id": "112751794040079687671", "name": "John Hollock", "time": 1567864787462, "rating": 5.0, "text": "Chris Wathey and Willy Moulin both did an outstanding job of guiding us through the process of getting our Braunability van through the VA. We truly appreciate all the hard work and tenacity they showed while going through all the steps with VA. We love our new Pacifica van!", "pics": null, "resp": null, "gmap_id": "0x8888df64d073e739:0xb14b1f84bea96dab"}
{"user_id": "106721448981312514374", "name": "SFES PTA", "time": 1524090706712, "rating": 1.0, "text": "As a Special Needs parent, having a company that promises you reliability and great customer service is VERY important.\nI feel as if I was taken advantage of. There has always been minor problems that should have been fixed and they never found time to fix things when I lived 4hrs away and was in the area. I call and email  to ask questions, and never get a response in time. I have asked repeatedly to get a quote on my van to sell back and they don’t even have the decency to call or email me back.\nI would suggest BraunAbility, they seem to have better customer service from what I found out from other special needs families.", "pics": null, "resp": {"time": 1524236332441, "text": "We are very sorry to hear that you were unsatisfied with your recent visit to our Birmingham location. If you could please email us your contact information we will have our Regional Manager reach out to you. You can email us at ask@mobilityworks.com. Thank you."}, "gmap_id": "0x8888df64d073e739:0xb14b1f84bea96dab"}
{"user_id": "100988203341197991143", "name": "James Casey", "time": 1527906815848, "rating": 4.0, "text": "Incredibly helpful and knowledgeable place. If your in need of a handicap accessible vehicle this is the place to go.", "pics": null, "resp": null, "gmap_id": "0x8888df64d073e739:0xb14b1f84bea96dab"}
{"user_id": "115770691652366601348", "name": "William Moulin", "time": 1548201154089, "rating": 5.0, "text": "Best place for handicap needs!", "pics": null, "resp": null, "gmap_id": "0x8888df64d073e739:0xb14b1f84bea96dab"}
{"user_id": "104154151871643809738", "name": "Amy Manley", "time": 1560913132461, "rating": 1.0, "text": "A 2 hr. drive and was told that the van had to be details then was told can't get parts for a van that old.", "pics": null, "resp": {"time": 1561036008776, "text": "Amy customer satisfaction is something we take very seriously. We’d like to get in contact with you personally to get more details about this. Please provide your contact info at https://www.mobilityworks.com/review/  so that our Regional Manager can reach out. Thank you."}, "gmap_id": "0x8888df64d073e739:0xb14b1f84bea96dab"}
{"user_id": "108872593988081191553", "name": "Annette Mooney", "time": 1528744657391, "rating": 4.0, "text": "Have to take the van to be worked on, it's getting old wish we could afford a new one", "pics": null, "resp": null, "gmap_id": "0x8888df64d073e739:0xb14b1f84bea96dab"}
{"user_id": "106785655661428055887", "name": "Rita Jones", "time": 1498753623607, "rating": 5.0, "text": "Always great service.", "pics": null, "resp": null, "gmap_id": "0x8888df64d073e739:0xb14b1f84bea96dab"}
{"user_id": "110185068903599010401", "name": "Joe jones", "time": 1580171191518, "rating": 5.0, "text": "Best services for disability helps Center in North Alabama. We got our van little over a year ago. And they treated us like family and still do anytime we need them. Super fair prices also. I highly recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x88626b34dff67fd1:0xdce7171dd11fad58"}
{"user_id": "109403017597143185094", "name": "Gerrelyne Burnette", "time": 1592592125319, "rating": 5.0, "text": "My family and I have had to experience some health challenges that we never imagined before 6/5/2019. I went into MobilityWorks to inquire about a rental to take my sister who has been mobility challenged since her stroke in 2019 to her party. Tiana Garner went above and beyond customer service. She shared helpful information on A gentleman that had a vehicle to donate that is fully equipped to accommodate transporting my sister. Tiana Garner is a professional that takes her career to heart. In business it’s not about just what you specialize in it is about helping where you can. And that is what she did. God used her to meet a need for a family that wants to make sure their  loved one does not miss her surprise birthday party. Thank you Tiana Garner.", "pics": null, "resp": null, "gmap_id": "0x88626b34dff67fd1:0xdce7171dd11fad58"}
{"user_id": "102313911369212701145", "name": "Bea Godbee", "time": 1552680051222, "rating": 5.0, "text": "Great sales person. Still waiting for the van we bought 4 days ago to be delivered. Hope it gets here the first part of this coming week! Can hardly wait for our wheelchair accessible van with ramp. Open roads, here we come! <3", "pics": null, "resp": null, "gmap_id": "0x88626b34dff67fd1:0xdce7171dd11fad58"}
{"user_id": "112496225417769952847", "name": "NoneofYour Business", "time": 1555711028888, "rating": 1.0, "text": "The Store Manager is a liar and a thief.  She encourages her employees to lie to customers and tell them they need things on their cars that they don't.  She never returns phones calls (or maybe she is never really there most of the time).  This location is much more interested in ways to get your money than it is taking care of its customers.  Find someone else that is honest and more customer service oriented than this place to take your equipment to!  I can't believe this place is still in business and that they haven't had sense enough to get rid of that awful fake-a$$ manager they have.", "pics": null, "resp": {"time": 1555941546423, "text": "NoneofYourBusiness, We take customer satisfaction very seriously. We’d like to get in contact with you personally to get more details about your experience with our Huntsville location. Please provide your contact info at https://www.mobilityworks.com/review/ so that our Regional Manager can reach out. Thank you."}, "gmap_id": "0x88626b34dff67fd1:0xdce7171dd11fad58"}
{"user_id": "103022612287103030791", "name": "Maxi Kaylin", "time": 1561430984639, "rating": 5.0, "text": "The people were so nice.  They had to order a part so I knew it would take longer. But the wrong part was sent so they had to reorder. MobilityWorks called and apologized for the delay.  They seem to want to satisfy their customers.", "pics": null, "resp": null, "gmap_id": "0x88626b34dff67fd1:0xdce7171dd11fad58"}
{"user_id": "114170485169298612099", "name": "Gilbert Jones", "time": 1549369084672, "rating": 5.0, "text": "Being a two time \"Vietnam Veteran and after a very major auto dealership in my local area blew me off on a purchase of a vehicle to accommodate  me and my handicap scooter, however, they did do something right when I was referred by their employee to \"MOBILITY WORKS!\" Scott came to my house in a vehicle which pleased me greatly and between him and Melissa, a way was made shortly thereafter to purchase this vehicle.  Thanks to my \"God\" first and foremost because He alone made it possible for Scott and Melissa to do what they did to accommodate my needs! PTL", "pics": null, "resp": null, "gmap_id": "0x88626b34dff67fd1:0xdce7171dd11fad58"}
{"user_id": "106322501741829671429", "name": "Karen BlueBaird", "time": 1572024452715, "rating": 5.0, "text": "Very knowledgeable and friendly business. Repaired my wheelchair van while I waited.", "pics": null, "resp": null, "gmap_id": "0x88626b34dff67fd1:0xdce7171dd11fad58"}
{"user_id": "114966047025363667956", "name": "Josh LyBrand", "time": 1549729326982, "rating": 5.0, "text": "Mobility Works helped us find exactly what we were looking for!  Scott Grabner is the absolute best and made sure everything was absolutely perfect!  Go see him!", "pics": null, "resp": null, "gmap_id": "0x88626b34dff67fd1:0xdce7171dd11fad58"}
{"user_id": "102841098676283770043", "name": "Londi Foster", "time": 1550808881763, "rating": 5.0, "text": "Scott Grabner was our salesman and this was the best experience we've had with any sales staff.   Very knowledgable and efficient. More importantly, not the aggressive pitch we have frequently experienced. Walked us through the entire process over several days. Melissa was equally proficient and helpfull with the extensive signoff paperwork. Highly recommend this firm.", "pics": null, "resp": null, "gmap_id": "0x88626b34dff67fd1:0xdce7171dd11fad58"}
{"user_id": "109897116715396436750", "name": "James McComb", "time": 1508027587050, "rating": 5.0, "text": "Great people to work with. They have always accommodated my needs for a van.", "pics": null, "resp": null, "gmap_id": "0x88626b34dff67fd1:0xdce7171dd11fad58"}
{"user_id": "114500555354564490416", "name": "Cyndy Akin", "time": 1550849457875, "rating": 5.0, "text": "This is a great company!", "pics": null, "resp": null, "gmap_id": "0x88626b34dff67fd1:0xdce7171dd11fad58"}
{"user_id": "114198234793193017362", "name": "Ben Tipton", "time": 1564176950296, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x88626b34dff67fd1:0xdce7171dd11fad58"}
{"user_id": "106988198857563212997", "name": "sandra whorton", "time": 1518822653456, "rating": 5.0, "text": "Very nice people", "pics": null, "resp": null, "gmap_id": "0x88626b34dff67fd1:0xdce7171dd11fad58"}
