{"user_id": "109818712454173995648", "name": "Alissa Lapidus", "time": 1622053286098, "rating": 5.0, "text": "From the first phone call to delivery to picking up the equipment; this company shows they CARE! Wonderful friendly empathic and compassionate staff from start to finish. Wouldn’t it be great if all businesses ran this way? Class act!", "pics": null, "resp": {"time": 1623278505088, "text": "Thank you for the great review.  We appreciate you allowing us to serve you and please let us know if we can be of any help in the future."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "113571891123133732803", "name": "Margaret Huang", "time": 1611949730600, "rating": 5.0, "text": "It is so true as everyone described here! These guys go above and beyond to server their customers! I rented a scooter when I fractured my foot. The scooter quality is excellent, and it has a very good brake system! I highly recommend this shop to everyone!", "pics": null, "resp": {"time": 1623278605941, "text": "Thank you for letting us know how the equipment worked out for you.  We appreciate your comments and  wish you all the best with your healing process."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "107508978388063448091", "name": "Slick Rick", "time": 1605132560080, "rating": 5.0, "text": "I broke my ribs and standing/sitting was an excruciating experience.  These guys got a lift chair out to me the very next day.  The delivery guys were super helpful, and it was clear that I was their priority.  They moved furniture to another room to make space for the new chair, set everything up, explained and demonstrated the chair operation and stayed until I was operating it myself and happy with it.  Their patience and kindness made a very difficult time easier, and I am thankful.", "pics": null, "resp": {"time": 1623278911478, "text": "Thank you for the nice comments about our service folks.  I apologize for not responding to your post sooner.  We hope all went well with your rib recovery."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "104931108721210343855", "name": "Samantha Culman", "time": 1607135334386, "rating": 5.0, "text": "Great prices and great customer service. Highly recommend.", "pics": null, "resp": {"time": 1623278750931, "text": "I must apologize for taking so long to reply to your great comment.  Thank you and let us know if we can be of help in the future."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "115997537981158139224", "name": "Roger Schooley", "time": 1595692576410, "rating": 5.0, "text": "Excellent service with friendly and helpful staff. I called four different medical supply stores and attention medical had the best price and availability. Well pleased with service and will be my first choice in the future.", "pics": null, "resp": {"time": 1598395750063, "text": "Thank You for sharing your review.  Glad we could help and please let us know if we can help in any way in the future."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "103168819175630461771", "name": "Gwendolyn Horton", "time": 1611339567899, "rating": 5.0, "text": "Super nice.  If they cant help u out, they will point u in the right direction.", "pics": null, "resp": {"time": 1623278667874, "text": "Thank you for the nice comment any my apologies or my delay in responding to our comment."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "111843709049603020338", "name": "Nathan Wienhoff", "time": 1581599073620, "rating": 5.0, "text": "These guys go above and beyond to make sure the customer is taken care of.  I am extremely pleased with the level of service and compassion that David provided.  Highly recommend this place.  Most pleasurable experience I've ever had at a medical supply place, hands down.  👍👍", "pics": null, "resp": {"time": 1581608848609, "text": "Thank you for your kind words and if there is anything we can help with in the future, please let us know."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "102384770193649363783", "name": "Mary Herrington", "time": 1607655376480, "rating": 5.0, "text": "Great company very friendly and helpful.", "pics": null, "resp": {"time": 1623278705464, "text": "We appreciate your nice comment and my apologies for taking so long to post a response."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "105140773886955672363", "name": "Zach Pugh", "time": 1525745706897, "rating": 5.0, "text": "Great customer experience. Came in and was greeted and helped right away. Very helpful, courteous, and informative. I came in for some work shoes. The size I needed wasn’t in stock so they had to order some in but they came in really quick and work great.", "pics": null, "resp": {"time": 1525779674888, "text": "Thank you for allowing us to earn your business and for your review."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "111041257124089777494", "name": "Boyd Berryhill", "time": 1542052483260, "rating": 5.0, "text": "I have been a loyal customer for years. They have a friendly staff and GREAT customer service. Anytime I need something, I can count on expert knowledge and a caring attitude. Thank you for being here!", "pics": null, "resp": {"time": 1549907844454, "text": "Thank you for your review and king remarks."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "116975133388149727020", "name": "Marie Marlin", "time": 1573163580966, "rating": 5.0, "text": "Pleasant efficient staff and reasonable prices.  You’ll be glad you came.", "pics": null, "resp": {"time": 1573232583244, "text": "Thank You and please let us know if we can ever be of service."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "108411640472289600309", "name": "Renee Holder", "time": 1555441598590, "rating": 1.0, "text": "One of the worst companies I've ever had the displeasure of working with. Denying a completely  Handicap the right to a bed and wheelchair when she cannot move whatsoever on her own. This company is ridiculous!!!  She has Tricare and Medicare.  And they are worried that they will not get their money?!!! And this is a quote from a representative from their business.  If I could leave 0 stars, I would.", "pics": null, "resp": {"time": 1556229316196, "text": "Dear Ms. Holder.  I am very sorry you feel that our company is not providing the hospital bed and wheelchair because of being “worried that they will not get their money”.  That is not the main issue in this case, however.  Being paid for the equipment is important to us but most importantly is the medical necessity for the items provided.  Medicare has specific guidelines that we must follow in providing equipment that is ordered and if we do not follow them, not only payment is not received but it opens us up to potential Fraud and Abuse issues with Medicare for billing items that the medical records do not support.  Our Store Manager, myself and another clinical person reviewed the records and documents we have received from the physician’s office who is ordering the equipment and what we have so far, does not show medical necessity for the bed and chair.  We have asked for records that do support it and as of date, not received anything that does.  It is not our desire to withhold needed equipment from anyone who needs it, but we are compelled to follow established guidelines that support it which as of now, not supported by records in our possession.  We would be happy to schedule a meeting with the customer and/or yourself, if you are a designated representative, to provide a copy of the medical necessity requirements and discuss how the records we have compares to the requirements.  Please feel free to contact our local store and let us know when a good time would be.  Again, I am sorry for how you feel but we are not intentionally trying to cause stress for you or the customer.  We are simply following the medical policy established by Medicare."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "108615189785732703484", "name": "Brandi Mason", "time": 1557511813270, "rating": 5.0, "text": "Great selection and customer service mindset, kind and attentive to your specific needs.", "pics": null, "resp": {"time": 1558470382702, "text": "Thank You fr your review.  Please let us know if we can be of help in any way."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
