{"user_id": "105886515355244731840", "name": "Bonnie Shoultz", "time": 1612157550724, "rating": 5.0, "text": "I have not had the pleasure to shop at Lush personally. However, after watching Tim’s videos and his heartfelt love and concern for not only his business, but, other small businesses during this time of uncertainty, I would just love to hug him and pledge my business to Lush!\nTim, your heart is absolutely precious and your Mother would be so proud ❣️", "pics": null, "resp": {"time": 1612198773735, "text": "OMG... you brought tears to my eyes...  it's been such a hard 12 months for so many...  your kindness to take the time to send this is very much appreciated.   Tim"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "113677509565686769062", "name": "Caryn Janecky", "time": 1627006267980, "rating": 5.0, "text": "Highly recommend their class! So fun!", "pics": null, "resp": null, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "114783796166118473344", "name": "Kathleen Kerns", "time": 1611245388210, "rating": 5.0, "text": "I am not local and needed two plant arrangements delivered to two different locations after the loss of a loved one.  I called, and Susan was so helpful - she shared with me in clear detail what my available options were.  Ultimately, I entrusted her with the selection and design.  The recipients sent pictures of the delivered arrangements, and they were exactly what I had in mind!", "pics": null, "resp": {"time": 1611246887211, "text": "Thank you so much for taking the time to tell us about your positive experience.  We are a small local business and are very grateful for you and so happy you are pleased."}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "100609825799829134686", "name": "cross nic", "time": 1558063501532, "rating": 5.0, "text": "The Lilys bloomed today!!!!!!   I live 1,300 miles away and they helped get an arrangement to my mom. It was beautiful and spectacular and made her smile like she deserves, especially on Mother's Day. THANK YOU", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPYVy-N6HpXR8lRIZY6nlcDBANb-E02FgLxKmpU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO5xyNpxhycTNbDgerOLxJAAk_iHdFtb2U_fYa1=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "111128080097405065198", "name": "Carolyn Davis", "time": 1606237058142, "rating": 5.0, "text": "Gorgeous flower arrangements and the best place to stop for one of a kind gifts.  The candles smell delicious.", "pics": null, "resp": null, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "109628111469305384054", "name": "Sonya Bumpers", "time": 1585673283884, "rating": 5.0, "text": "All of my floral designs, aromatic candles and delivery experiences with Lush Home and Garden Event Center have been nothing but exceptional.\nI live in Birmingham and have placed orders over the phone including my payments and the experience was without fault.\nTim Burt, and his amazing staff have gone above and beyond in surprising my Aunts,  Uncles, Girlfriends and Father.\nThanks, for phenomenal customer service and all the love that is put into each order and delivery.\nMy Aunt still smiles about the day of her delivery arrived, the  arrangements was beautiful of course, however she seemed more delighted in the handsome youngman in his apron bring the delivery, this made her day.\nWhen your business is so designed to bring joy and delight to others, it is indeed a pleasure when that if filled to the utmost and the purchaser feels good also.\nTo the Lush Management and Staff.\nI Wish You Enough!\n\nSonya Bumpers", "pics": null, "resp": {"time": 1594999858079, "text": "Wow!   Thank you Sonya... your support over the years means more than you will ever know and taking the time to review us means a lot.."}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "114920233885710075351", "name": "Brock Killingsworth", "time": 1602100025592, "rating": 5.0, "text": "Lush is the best. Always friendly, always great flowers, always fantastic gift ideas.", "pics": null, "resp": null, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "103257903978429048330", "name": "Alexandrea West", "time": 1585670892070, "rating": 5.0, "text": "Lush is my favorite place to shop for everything from candles, to home lighting, to thoughtful and unique gifts. The service is always above and beyond the norm. I appreciate their creative input and always trust that anything I go to them for will be above and beyond my expectations.", "pics": null, "resp": {"time": 1595000033603, "text": "Thank you for taking the time to review us!!  So pleased that you are happy with your experience and we look forward to working with you in the future... we also admire your fabulous work...  Thanks again..."}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "107485734790553593362", "name": "Bobbi Sue Thomas", "time": 1540225821221, "rating": 5.0, "text": "Lush is such a breathe of fresh air in Midtown Mobile. The owner, Tim, is so personable and always so kind. I can always find the perfect gift for any occasion and they always go the extra mile to wrap it beautifully. Cannot say enough good things about this store. It is wonderful!!", "pics": null, "resp": {"time": 1550763347661, "text": "Thank you so much for saying these wonderful things...    As a locally owned business we couldn't make it without the support of our regular customers.  We try hard to go the extra mile with fresh flowers on our gift wrap and walking folks to their car... because we actually love what we do!  So grateful you took the time to rate us!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "115437252287988354194", "name": "Henry Hudson", "time": 1575879804961, "rating": 5.0, "text": "Thank you so much for arranging a last minute beautiful bouquet and delivering it so quickly with just a phone call!! My best friend loves it and it made her smile when her birthday wasn’t going so great.", "pics": null, "resp": null, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "108270428953572181928", "name": "Sarah Baxter", "time": 1585671505899, "rating": 5.0, "text": "Thank you LUSH!! I had a horrible experience from ordering flowers from FTD.com. I purchased $100 bouquet for my cousin, and they sent a dreadful arrangement (that looked like it came from Walmart). I immediately called LUSH to see if they could send the flowers my cousin deserved. I am still in awe of the arrangement Tim and his team created. I will never make the mistake of using anyone other than LUSH again.", "pics": null, "resp": {"time": 1594999933237, "text": "Sarah... Thank you so much for taking the time to review us.  We are so grateful we were able to please you and look forward to working with you again..."}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "114145603636042178482", "name": "Susan Cook", "time": 1575144797933, "rating": 5.0, "text": "Incredible work with an amazing staff!! Perfectly located in downtown Mobile but flexible with punctual deliveries. 10/10 would recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "110080096337279853167", "name": "Luke Boothe", "time": 1531001757279, "rating": 5.0, "text": "I’ve been to Lush numerous times for flowers and gifts and have never had anything that wasn't\nnothing but beautiful. Their arrangements are the best in Mobile. The staff is super friendly.\nKEEP UP THE GOOD WORK LUSH!!!", "pics": null, "resp": {"time": 1550763376773, "text": "Thank you Luke for such a great review!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "105420793776116459034", "name": "Ashley Gunter", "time": 1594990909013, "rating": 5.0, "text": "Absolutely one of the most elegant and beautiful shops in Mobile,Al.", "pics": null, "resp": {"time": 1594999729360, "text": "What a wonderful thing to say.  We will continue to try and live up to your praise!!   Thank you for taking the time to review us!!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "109470761590681385269", "name": "Jillian Rosandich", "time": 1550761442435, "rating": 5.0, "text": "LUSH is a beautifully curated space and such a joy to browse (I could spend hours!), especially thanks to the luxe scented candles and floral arrangements. Tim, the owner, is so kind and really knows his stuff. This is a true midtown destination and a must-stop shop for anyone that loves home decor.", "pics": null, "resp": {"time": 1550763121305, "text": "Oh My Goodness!  Thank you so much for taking the time to express this .  It means so much to me and my team.  As a local business we work hard to be a place everyone enjoys shopping. We want to be known as the \"where did you get that?\" store.   Again your kind words are much appreciated... Tim"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "101660943912617752219", "name": "Courtney Mcdonald", "time": 1514415567807, "rating": 5.0, "text": "I love this place sooo much!! It’s the perfect place for gifts, or home decor! And the customer service is over the top!! I came in the Friday before Christmas for a last minute gift, and everyone so nice, especially for it to have been as busy as it was! I felt like just hanging out for a while and chatting because everyone was just so friendly!! The gift set I purchased was already wrapped really cute but they took the extra time to “spruce” up the bag even more! It’s the little things like that, that make shopping experiences so much better than other places. This is now my go-to spot for gifts and such!! Thanks Lush!! I have been sure to tell everyone about this little hidden gem!", "pics": null, "resp": {"time": 1514421962289, "text": "Wow!! Thank you so much for taking the time to write such a lovely review.  I have a great staff and we love what we do.  This review will make everyone’s day!!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "117229372277656497696", "name": "Jennifer Pool", "time": 1495131428876, "rating": 5.0, "text": "What a wonderful experience! Excellent customer service, amazing flower arrangements and a beautiful store full of wonderful gifts!! I cannot say enough about Lush - Tim and Jonathan were just the best! Lush is a jewel - you must visit!!", "pics": null, "resp": {"time": 1495142695031, "text": "Thank you so much for taking the time to review us and we are so grateful for your kind words...  Next time you are in we want to treat you to one of our Coastal Candles   on us!!!  Thanks again.... Tim"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "115434050811133004986", "name": "Boyd McGehee", "time": 1581870842386, "rating": 5.0, "text": "This store is a gem for the state of Alabama! One of a kind.", "pics": null, "resp": {"time": 1595000150334, "text": "Thank you so much for taking the time to review .  And such an amazing compliment...because i know you are well traveled and to give us such high praise we are very grateful.."}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "117884500759454526803", "name": "sara lee", "time": 1568308095847, "rating": 5.0, "text": "Amazing and different looking arrangements.  Beautiful selection of houseware lighting and furniture too.  I sent their Mardi Gras candle off to my adult kids to remind them of home.", "pics": null, "resp": {"time": 1595000169339, "text": "Thank you so much!!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "114389021212444708620", "name": "Hiram Young", "time": 1533596159537, "rating": 4.0, "text": "I went to a boarding school in the area and Lush is my go to place for corsages for school dances. The ones I got always looked MILES better than those of the same price from other local florists, and the people working the desk and making the corsages will talk to you and look at pictures of your dates dress and your tux and discuss your color and design options.", "pics": null, "resp": {"time": 1533614532564, "text": "Thank you. So happy you were pleased!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "101735178950596529735", "name": "Laila Boucher", "time": 1566591253209, "rating": 5.0, "text": "The BEST service and store in Mobile! I just love my treasures from this store!", "pics": null, "resp": {"time": 1595000201174, "text": "THANK YOU SO MUCH!!  So nice of you to take the time to review us!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "115757145031445845993", "name": "Geaux LSU", "time": 1479316036427, "rating": 2.0, "text": "Gorgeous place with very nice pretty things! But the customer service was not great! Walked in was in awe of how nice the store was...A guy was on the phone he didn't try to acknowledge  my sister-in-law and I ...We stood there for 3 Min and still no \"Give me a sec\", \"It'll be one min\"! I would've understood if he would've just at least \"Hi, how are you\" but nothing was said! So we politely walked out! When we really wanted to purchase things!", "pics": null, "resp": {"time": 1479320781519, "text": "I saw you look through the windows... I checked our cameras and never saw you enter the store... Would love to speak with ... Thanks  Tim"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "116983222159874728447", "name": "Stephen Page", "time": 1530981993369, "rating": 1.0, "text": "I will try post the picture I just took of the wilted sunflowers delivered by \"Lush\". Unfortunate that someone within this company decided to deliver wilted flowers to a funeral. They conveniently left the shops name and address for me to find quickly on Google.", "pics": null, "resp": {"time": 1530999531203, "text": "When the arrangement was delivered yesterday it was fresh and gorgeous. We received a call today from the funeral home that the heat had wilted them. We sent one of our designers out immediately at no cost and completely redid the arrangementNot sure what else we could have done.   Please show that pic."}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "116872832156258744765", "name": "Emma Peace", "time": 1530025596943, "rating": 4.0, "text": "Owner Tim is delightful. He has beautiful items that everyone would love.", "pics": null, "resp": {"time": 1550763414384, "text": "Thank you!   We try so hard and we appreciate your continued support!\n\nTim"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "103873214686493339052", "name": "Rebecca Kramer", "time": 1537118398639, "rating": 5.0, "text": "I received a beautiful arrangement on my birthday this year from my daughter. I can't wait to go purchase something from Lush for her birthday.", "pics": null, "resp": {"time": 1537146785031, "text": "Thank you so much. We really appreciate your business and we  are glad u loved ur arrangement!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "112520132744457246675", "name": "Rob Bright", "time": 1586037247780, "rating": 5.0, "text": "Best store in Mobile & Tim is fantastic!!!", "pics": null, "resp": {"time": 1594999764626, "text": "Thank you Rob..  I appreciate you taking the time to review us!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "113699469425066465803", "name": "BrotherTy Page", "time": 1541555781483, "rating": 5.0, "text": "The best florist in MOBILE!", "pics": null, "resp": {"time": 1550763203804, "text": "Thank you so much for saying that.  We really make it our goal on EVERY arrangement to please the customer and put a smile on their face.  I am grateful for your taking the time to give us such a positive review..  Tim"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "117619087356898424876", "name": "Jack Pierre", "time": 1464123944414, "rating": 5.0, "text": "Fantastic candles and extraordinary floral work", "pics": null, "resp": {"time": 1479320824995, "text": "Thank you so much!!"}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "114672271926039501087", "name": "RegularGamer PlayZ", "time": 1528492131982, "rating": 1.0, "text": "Very rude costumer service! Was told my son could not have a seat in there store! I felt it was a racist comment for sure!!!!", "pics": null, "resp": {"time": 1550763567632, "text": "So sorry you felt that way.  We have signs posted on most every chair to not sit...mostly meant for children...because we sell upholstery off the floor and must keep it \"unused\"   Please don't feel that you were singled out... trust me you were not...  we regular ask folk to please not sit unless they are actually interested in purchasing the chair they wish to sit in."}, "gmap_id": "0x889a4e0c9a4499ef:0x90a7635f2ec01eb"}
{"user_id": "106736756112861494982", "name": "Robert Yoder", "time": 1500258861472, "rating": 5.0, "text": "I know there are a couple of good florists in town, but Sherry is my favorite.  She had always gone the extra mile for me.  I've worked in a school for the last ten years and seen many arrangements come in on Valentine's Day.  I can tell which flowers come from her, because the quality sets her apart.", "pics": null, "resp": null, "gmap_id": "0x88907906e80c3105:0x973ddf6acb01f3f7"}
{"user_id": "115022745302825161386", "name": "tj bailey", "time": 1426350387221, "rating": 1.0, "text": "I ordered flowers on the website, payed with my credit card, then got a call from the shop saying they  needed more money to fill the order. I told them I was not paying anymore money to just cancel the order. The employee told me that they could not and that I would have to cancel the order myself. The website has nowhere to cancel the order on it and the only phone number on the website was the shop.\n\nVery poor customer service.", "pics": null, "resp": null, "gmap_id": "0x88907906e80c3105:0x973ddf6acb01f3f7"}
{"user_id": "117209652938081050845", "name": "Micah Weech", "time": 1550174513763, "rating": 5.0, "text": "Second time ordering flowers here. First time was great. Second time I had a custom arrangement done by Tina. The results were amazing. Her level of artistry left me speachless. The flowers were a hit. Halls has a loyal customer. Get Tina to do your flowers. The quality of work and the high customer service is priceless. Why would I ever order flowers anywhere else? Why would you?", "pics": null, "resp": null, "gmap_id": "0x88891c1cc0d71ac9:0x47cc7571ceab7a7b"}
{"user_id": "113090697091427330856", "name": "Bloom Grow", "time": 1571498641473, "rating": 5.0, "text": "Large area for floral designers to rent and store daily, HUGE greenhouse, great selection of cut flowers, inviting and fun loving staff make this place a pleasure.", "pics": null, "resp": null, "gmap_id": "0x88891c1cc0d71ac9:0x47cc7571ceab7a7b"}
{"user_id": "109708393838984135940", "name": "Brenda Walters", "time": 1366236076691, "rating": 5.0, "text": "They are always very helpful and have wonderfully fresh products.  I enjoy doing business with them.", "pics": null, "resp": null, "gmap_id": "0x88891c1cc0d71ac9:0x47cc7571ceab7a7b"}
{"user_id": "115659540271089457582", "name": "Amberlee Roberts", "time": 1425061968704, "rating": 5.0, "text": "Awesome place super nice always helpful do lots of business with them", "pics": null, "resp": null, "gmap_id": "0x88891c1cc0d71ac9:0x47cc7571ceab7a7b"}
{"user_id": "105918369911347644064", "name": "Lupita cruz", "time": 1574986956372, "rating": 4.0, "text": "So good", "pics": null, "resp": null, "gmap_id": "0x88891c1cc0d71ac9:0x47cc7571ceab7a7b"}
{"user_id": "101577555891064673927", "name": "LORI DAY", "time": 1556286868494, "rating": 5.0, "text": "A+ service. Always have (in stock) what I am looking for. Super friendly and helpful. No need to go anywhere else.", "pics": null, "resp": null, "gmap_id": "0x888c934b705d572f:0xd6d57a140a2b02bf"}
{"user_id": "109439104327682244699", "name": "Markedrick Dawson", "time": 1431042535213, "rating": 5.0, "text": "Service is superb. I've personaly been assisted by Bear and Mickey on numerous occasions. These guys are awesome.", "pics": null, "resp": null, "gmap_id": "0x888c934b705d572f:0xd6d57a140a2b02bf"}
{"user_id": "105781539892335201815", "name": "ROBERT Christopher BURNSIDE SCMA", "time": 1413316709672, "rating": 5.0, "text": "Always helpful and great service!!!!! A+++++", "pics": null, "resp": null, "gmap_id": "0x888c934b705d572f:0xd6d57a140a2b02bf"}
{"user_id": "103589958176205983932", "name": "Gakayla Lockhart", "time": 1455485565654, "rating": 2.0, "text": "Do they deliver?", "pics": null, "resp": null, "gmap_id": "0x888c934b705d572f:0xd6d57a140a2b02bf"}
{"user_id": "103100804199524987209", "name": "Krista Angrisano", "time": 1574714632399, "rating": 5.0, "text": "This place is amazing. We bought flowers here for my wedding and my cousin's also. They have a massive selection for all occasions. Prices are great and T\nthe staff are always so kind and helpful! Definitely worth going to!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN0b9u9f3LwnOdCA7QyWs54Q8GPIc5uhLT-wUA6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPvTewUZfOmLih6oBK7IlyK2tpAirf04wa63puW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPR22pCFd6NmQu_TlkE69UWXqFHDzd1iUgRDEiC=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88890b92f64d2e65:0xc3670068f45015a5"}
{"user_id": "105066214342607505842", "name": "Christine Cole", "time": 1580152971205, "rating": 3.0, "text": "I was a bit disappointed with the selection, but, full disclosure, I didn't call ahead or ask them to order exactly what I needed.\nI was able to find some flowers in the colors needed: yellow and white. But didn't find anything I couldn't have found at Publix or Trader Joe's floral department. I did find some beautiful flowers I could have added, but the prices were very high- not what I consider wholesale.\nThey did have an amazing selection of potted plants and succulents. And all their Christmas was half off, if I hadn't been in a time crunch I would have done all my shopping for Christmas 2020!\nAlso, the sales staff was friendly and as helpful as possible.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN0OP1OGINYtjZ05RcVyKarcgYekVcYWawZYI88=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMEOMM01d21GtlpAbZwsyUug8jtPm-8RUMT7tcY=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88890b92f64d2e65:0xc3670068f45015a5"}
{"user_id": "101337220968736014727", "name": "Jill Dill Vincent", "time": 1604493148565, "rating": 5.0, "text": "When entertaining, I always enjoy going into Davis for beautiful products. Staff always helpful. Very nice and friendly staff; great customer service!!", "pics": null, "resp": null, "gmap_id": "0x88890b92f64d2e65:0xc3670068f45015a5"}
{"user_id": "117496461492754827325", "name": "Nancy Shcnik", "time": 1561209834298, "rating": 1.0, "text": "I’ve been there quite a few times and I feel the employees treat you better if your Caucasian,  from my experience. For example: they’ll walk right by you and speak to the Caucasian customer while you’ve been standing  there waiting. Or they’ll offer assistance to the Caucasian customer and won’t say a word to you, just look at you.  As an African American customer I have decided to take my business to another company where I feel comfortable and where  I am being treated like a human being!", "pics": null, "resp": null, "gmap_id": "0x88890b92f64d2e65:0xc3670068f45015a5"}
{"user_id": "114459859005937163462", "name": "Katie & Alec Photography", "time": 1581693268297, "rating": 5.0, "text": "We got some of our wedding flowers here and have gone back for more since. They are always kind, fabulous, and so knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88890b92f64d2e65:0xc3670068f45015a5"}
{"user_id": "117119126083006553668", "name": "M", "time": 1572033576663, "rating": 1.0, "text": "Very rude. I always have gotten good customer service.  Not today. I guess because they were closing in 10 minutes.", "pics": null, "resp": null, "gmap_id": "0x88890b92f64d2e65:0xc3670068f45015a5"}
{"user_id": "102837907112362647014", "name": "Sweet Sarrai", "time": 1573503243920, "rating": 2.0, "text": "When I went they was somewhat friendly !! I ordered my flowers and when my mom went to pick them up they were really rude!!!! My mom would ask a question and would not answer and ignore her and she is Hispanic speck not so good English but understands very good . A man snatched the flowers from her hands !!  Very rude and disrespectful", "pics": null, "resp": null, "gmap_id": "0x88890b92f64d2e65:0xc3670068f45015a5"}
{"user_id": "104096563679246224463", "name": "Sharon Dozier", "time": 1519350986224, "rating": 5.0, "text": "Great for floral accessories and supplies, fresh flowers and beautiful silks.  Large selection of baskets and containers.", "pics": null, "resp": null, "gmap_id": "0x88890b92f64d2e65:0xc3670068f45015a5"}
{"user_id": "102016864190740708317", "name": "Ann Kreitlein", "time": 1457197851708, "rating": 5.0, "text": "Variety, service, prices.", "pics": null, "resp": null, "gmap_id": "0x88890b92f64d2e65:0xc3670068f45015a5"}
{"user_id": "105829977282092117998", "name": "Patricia Silvey", "time": 1562730387498, "rating": 5.0, "text": "My husband bought roses from this establishment. They are the most beautiful roses I have ever received! Truly amazing job!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPt9YqawR9JswoGuDNLbtIId9xjSoIw_heiZqbS=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "110438248719764660604", "name": "Daniel Munroe", "time": 1590760516382, "rating": 5.0, "text": "Rococo is amazing! My mom loves to be sent flowers so, over the years, I’ve used a lot of different florists but none of them compare to Rococo. I don’t know anything about flowers but I do know that everything Rocco has done for my mother has been above and beyond. This florist has helped me become my mom’s favorite child and I will never use anyone else! Thanks!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "103083752002050393112", "name": "Kellye Sparks", "time": 1518653578189, "rating": 5.0, "text": "Who knew thinking outside the box, meant putting flowers in a box! Thank you Lori for your fresh, fun perspective.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNhbH0CgCGErsSSTu_vHgbG-sUYr6czOH4Z2pT4=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "107131227101613878566", "name": "Matthew", "time": 1599936230203, "rating": 5.0, "text": "Lori has a good eye and newer take on flower & plant arrangements!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "117975654514838470562", "name": "Ken Giery", "time": 1589835508021, "rating": 5.0, "text": "Lori is amazing. Went above and beyond to help me out. This is the place you need when you need flowers and awsome service. Thanks again Lori.", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "113008748501563276998", "name": "James Jones", "time": 1596042961489, "rating": 5.0, "text": "Awesome staff very satisfied with the flower arrangements I received.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMZF01x62R5j9kFT2rD99kzOegJeG-8Lja9Ltsr=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "102055794536141014826", "name": "Victor S.", "time": 1531658243747, "rating": 5.0, "text": "Lori & Co., You did an absolutely beautiful job for my daughter’s wedding at J&D farms! Not being from the area, it’s a little unnerving to work with artisans such as yourself, just not knowing what you’re going to get! Boy am I glad we did! You’re truly an artist! Thanks again for an exceptional job!\nThe Sparks gang!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "107438622568234007127", "name": "Kay Moore", "time": 1503200305876, "rating": 5.0, "text": "Great service, talented owner and beautiful arrangements!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPWN4egnOJze7ddHi5WbK2ZKdhrSrURV5lpab37=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "118076871623881267392", "name": "Hanna True", "time": 1517957048072, "rating": 5.0, "text": "I stopped by Rococo's after a bad experience at another local florist, and boy am I glad that I did! Lori is so helpful and has a unique, creative eye. She took time to look at pictures of the types of arrangements I had in mind, and was very easy to work with. I will definitely be a repeat customer, and I will give her an excellent review any chance I get! Thank you for finally bringing a high quality floral studio to Gadsden, Lori! It's about time!! Just walking in your beautiful studio lifts my spirit :)", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "114497242304926249997", "name": "Deannia Spiller", "time": 1580758340766, "rating": 5.0, "text": "Would not use anyone else!!! Gorgeous, bright and unique flowers. Staff is very friendly", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "100482230679656032455", "name": "Scott Beavers", "time": 1476731964322, "rating": 4.0, "text": "First time costumer. Very pleased of the work. Ordered flowers for my girlfriend and she thought they were amazing. She said they look like they put a lot of work and heart in their work.", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "103249129131866945938", "name": "Lori Clay", "time": 1548528262170, "rating": 5.0, "text": "I was so pleased with Lori's service , I look forward to doing business with her in the future!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "101538667498352790085", "name": "Kenny Lawley", "time": 1527792918509, "rating": 5.0, "text": "AWESOME SHOP!!! Very unquie and creative! The entire place of done well, and a little bit \"outside the box\"! I will diffently use them in the future!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "113061897206546524417", "name": "lee johnson", "time": 1537569334559, "rating": 5.0, "text": "Very unique flowers, the owner is very knowledgeable and friendly. She got us exactly what we wanted and needed!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "103760784239362878261", "name": "Kay Moore", "time": 1537299434191, "rating": 5.0, "text": "I love to just go visit with Lori and enjoy the beautiful colors and arrangements!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "108006920187738328508", "name": "Crystal Anne Casey", "time": 1538060076110, "rating": 5.0, "text": "What an awesome place cannot day enough great things.. love this place..", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "100810014111835622815", "name": "Phyllis Barnett", "time": 1529610500614, "rating": 5.0, "text": "Wonderful  place, Beautiful flowers . Everyone there is very friendly and helpful,  making sure your flowers turn out perfect.", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "116493929882013260180", "name": "Courtney Linam", "time": 1505333526248, "rating": 5.0, "text": "Whatever the occasion, Rococo has the answer to your floral needs! If you need to brighten someone's day, decorate for an event, beautifie a wedding or send a condolence, look no further than Rococo!\nMy first encounter with Rococo was picking up beautiful center pieces for a business after hours event. I was absolutely captivated walking in to her studio! There are so many gorgeous, creative and one of a kind creations in Rococo Studio.\nMy husband has surprised me with a number of arrangements created by Rococo. Fresh flowers to succulent arrangements,it's always made my day and filled my home with happy!\nWhen we planned our wedding, I knew I HAD to ask Lori to make the bouquets, boutanners and hair pieces. They were more beautiful and perfect than I could have ever dreamed! Thank you for decorating my special day!\nIf you haven't visited Rococo Floral Studio, what are you waiting on?? Go now! ☺️💓", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "103198149223233625049", "name": "Nathan Martin", "time": 1517163805612, "rating": 5.0, "text": "Fabulous florist! Very talented staff and friendly too!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "100241161881978384171", "name": "Glen Bryan", "time": 1590608321642, "rating": 5.0, "text": "It is an awesome place", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "101860309363480546007", "name": "Angela Williamson", "time": 1496585530267, "rating": 5.0, "text": "Very talented. Flowers are unique and individualized to each person.", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "113279600396914396307", "name": "Jason Guinn", "time": 1502313142159, "rating": 5.0, "text": "Lori did my grandmothers funeral flowers and hit out of the park. Would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "108811085073104398724", "name": "Amberlee James", "time": 1478640245020, "rating": 5.0, "text": "Love this shop! She will stay in your budget ! Beautiful work!!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "112013831046541882420", "name": "Tami A. McGee", "time": 1508674010294, "rating": 5.0, "text": "Beautiful, creative. My go to florist!", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "113490408509949684387", "name": "deana jackson", "time": 1551835083983, "rating": 5.0, "text": "Friendly and professional staff.", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "107415801216916338030", "name": "Ken Lewis", "time": 1493647766306, "rating": 5.0, "text": "Awesome!!  Best in Alabama.", "pics": null, "resp": null, "gmap_id": "0x888a3ea4cd2ae707:0x902224d69ad6e097"}
{"user_id": "112752587088731821414", "name": "T. Whit", "time": 1621123426576, "rating": 5.0, "text": "Was here today for daughter’s wedding flowers for bridesmaids, and they did not disappoint. Great selection and very helpful. They have more ribbon than you can imagine for custom wreaths or other projects.", "pics": null, "resp": null, "gmap_id": "0x889245dbe111c0af:0x6d183e8d75a932ea"}
{"user_id": "113307398882390781008", "name": "Alyces Floral", "time": 1621164768058, "rating": 5.0, "text": "Great place to shop and Patti and her girls are very helpful", "pics": null, "resp": null, "gmap_id": "0x889245dbe111c0af:0x6d183e8d75a932ea"}
{"user_id": "108110856227077281861", "name": "Jim Glass", "time": 1615302515972, "rating": 5.0, "text": "Great place to go to for most all of your needs.", "pics": null, "resp": null, "gmap_id": "0x889245dbe111c0af:0x6d183e8d75a932ea"}
{"user_id": "103232791406463526746", "name": "James Norris", "time": 1610258425309, "rating": 5.0, "text": "Love the place, staff is extremely friendly.", "pics": null, "resp": null, "gmap_id": "0x889245dbe111c0af:0x6d183e8d75a932ea"}
{"user_id": "108930435461768658302", "name": "Ruth Forster", "time": 1617465598660, "rating": 3.0, "text": "thrift store finds for retail prices.", "pics": null, "resp": null, "gmap_id": "0x889245dbe111c0af:0x6d183e8d75a932ea"}
{"user_id": "101224280169072500017", "name": "sherry kirkland", "time": 1624325030247, "rating": 5.0, "text": "There awesome.", "pics": null, "resp": null, "gmap_id": "0x889245dbe111c0af:0x6d183e8d75a932ea"}
{"user_id": "102746982691423821026", "name": "Bradley Gilbert", "time": 1584948012397, "rating": 5.0, "text": "Great people to work with.", "pics": null, "resp": null, "gmap_id": "0x888971cfa691502b:0xe7880f836be94d5d"}
