{"user_id": "111105185225256582614", "name": "George Melton", "time": 1602690041912, "rating": 4.0, "text": "Pretty good.  First time", "pics": null, "resp": null, "gmap_id": "0x888c932edd10140f:0xfb77c7800fffcc1f"}
{"user_id": "114574550260911019819", "name": "Gerry Sprigg", "time": 1568855058964, "rating": 5.0, "text": "Im a truck driver. I've been here twice. These are good people and I hate seeing them lose their jobs. God bless them all.", "pics": null, "resp": null, "gmap_id": "0x888c932edd10140f:0xfb77c7800fffcc1f"}
{"user_id": "106943754598807222652", "name": "Tony Loe", "time": 1560797411461, "rating": 2.0, "text": "Sunbeam bread has been our favorite for yrs but last several months it has gotten bad   it is stale and dry when we buy it   wife bought a loaf 2 days ago and it is already molded  the bread dry and oid in stores  all stores in Phenix city and Smiths Station al heard other people say the same we will start buying some other brand   sunday afternoon there was no sunbeam in store in Smiths Station  really disappointed in Sunbeam  bad", "pics": null, "resp": null, "gmap_id": "0x888c932edd10140f:0xfb77c7800fffcc1f"}
{"user_id": "108756998788913208516", "name": "Ryan Banks", "time": 1521245175798, "rating": 1.0, "text": "This is one of the nastiest place I've ever seen. Food safety certainly isn't a priority. Employees handle bread with dirty bare hands. There are roaches. Packaged bread is put into trays covered in grease and trash.", "pics": null, "resp": null, "gmap_id": "0x888c932edd10140f:0xfb77c7800fffcc1f"}
{"user_id": "106917445812841515781", "name": "Sylvia Jones", "time": 1588187873025, "rating": 1.0, "text": "I purchased  paleo waffles. When I  opened the packaging I  saw the were way overcooked. Dark brown and black. I heated them to try. Used my maple syrup. Not the kind you buy in a store but right from the farm. Couldn't  eat. Too burned.", "pics": null, "resp": {"time": 1589111339804, "text": "Oh no Sylvia! I'm so sorry the wafflers weren't what you expected. Please contact us at info@liberatedspecialtyfoods.com so we can make your experience a good one."}, "gmap_id": "0x8862648718c55551:0xce4f5681c8f0a83c"}
{"user_id": "109608345574134084135", "name": "Ildiko Mehes", "time": 1589479406319, "rating": 5.0, "text": "I have been purchasing these products for 3 years and cannot say how much we love them, how appreciative we are that they are made with real high quality ingredients and in a dedicated GF facility. They are more expensive and won’t taste like a gluten containing product, or one laden with sugar and additives. But that isn’t what we want to eat. These products definitely fill an important need for those on healthy or specialty diets. Thank you!", "pics": null, "resp": {"time": 1589499668479, "text": "Thank you so much for your kind words Ildiko! We are so pleased you enjoy our products! We appreciate you being a repeat customer!"}, "gmap_id": "0x8862648718c55551:0xce4f5681c8f0a83c"}
{"user_id": "103505636816859111482", "name": "Samantha Hobbs", "time": 1589228493700, "rating": 5.0, "text": "My 9 year old son has been on the SCD for almost a year due to Crohn’s disease. We just recently discovered Liberated Specialty Foods and he LOVES the sugar cookie kiss. Just placed another order for 10 packs! He has done very well on the diet, but seeing him this excited about a ‘treat’ is wonderful. I am doing the diet with him for moral support and I really enjoy the cheddar crackers and graham crackers. Thank you so much. You have new long term customers here!", "pics": null, "resp": {"time": 1589237983723, "text": "Oh Samantha! That just makes our day and we’re SO happy to fill a void for you and your son! From one SCD Momma to another, I see you and will to continue to offer convenient food options for you and your son ❤️"}, "gmap_id": "0x8862648718c55551:0xce4f5681c8f0a83c"}
{"user_id": "106611123227011490361", "name": "Rachel D.S.", "time": 1580700452936, "rating": 5.0, "text": "Fantastic SCD food offerings!  I only wish their products were more widely available in grocery stores.", "pics": null, "resp": {"time": 1589111442564, "text": "Thank you Rachel D.! We're so thankful for you and thrilled you enjoy our SCD food offerings!!"}, "gmap_id": "0x8862648718c55551:0xce4f5681c8f0a83c"}
{"user_id": "101468583095273385750", "name": "Celina Voelker", "time": 1596895344568, "rating": 5.0, "text": "Thank you for making delicious options.", "pics": null, "resp": {"time": 1596965891319, "text": "You're so very welcome Celina! We hope you've enjoyed all of our foods. Thanks so much for the review!"}, "gmap_id": "0x8862648718c55551:0xce4f5681c8f0a83c"}
{"user_id": "103886807764960142143", "name": "Rachel Cruz", "time": 1489774602836, "rating": 5.0, "text": "I just went to this place on my lunch hour. As an upcoming blogger that has a passion for anything health and wellness, I am always on the hunt for places that pride themselves on quality ingredients and that genuinely care about the health of others and our society as whole. I am a pizza lover and the gluten free 8 inch pizza was seriously one of the best pizzas I have ever had. The quality of the ingredients were on point. From the crust to the cheese. I opted out for meat today as I wasn't feeling it so I ordered the veggie pizza.   It was so nice to talk to the owner and pick each others brain and she gave me helpful tips on my health journey as I desire to buy more of my produce and hopefully proteins locally.\n\nI will definitely be back in fact and I can already see myself craving that pizza here in a few days.\n\nIT WAS THAT GOOD!", "pics": null, "resp": {"time": 1589111568114, "text": "Thanks so much for the glowing review Rachel! We appreciate you!"}, "gmap_id": "0x8862648718c55551:0xce4f5681c8f0a83c"}
{"user_id": "105725932686050752699", "name": "June Sigler", "time": 1487106073550, "rating": 5.0, "text": "Excellent specialty bakery! Fantastic place to go if you need gluten free, dairy free or Paleo baked goods. Highly recommended", "pics": null, "resp": {"time": 1589111583550, "text": "Thanks so much for your kind words June! We appreciate you!"}, "gmap_id": "0x8862648718c55551:0xce4f5681c8f0a83c"}
{"user_id": "117143932767419241062", "name": "Jane G", "time": 1498902561745, "rating": 5.0, "text": "I purchased online. For someone on SCD or FODMAP, this is an excellent option.", "pics": null, "resp": {"time": 1589111544408, "text": "Thanks so much for your positive reply Jane! We're so pleased you enjoy our foods!!"}, "gmap_id": "0x8862648718c55551:0xce4f5681c8f0a83c"}
{"user_id": "106711418637317555496", "name": "Kim Reid", "time": 1610386890876, "rating": 5.0, "text": "My Birthday 🎂 Cake was fabulous! 🤯🥳", "pics": null, "resp": null, "gmap_id": "0x887d49ca9d98d4b9:0x5b94ae92134855b1"}
{"user_id": "114631179346777511211", "name": "kathryn wisdom", "time": 1609909169764, "rating": 4.0, "text": "Nice selection", "pics": null, "resp": null, "gmap_id": "0x887d49ca9d98d4b9:0x5b94ae92134855b1"}
{"user_id": "114610798663657237046", "name": "Dave In Alabama", "time": 1604757768785, "rating": 5.0, "text": "Fresh selection", "pics": null, "resp": null, "gmap_id": "0x887d49ca9d98d4b9:0x5b94ae92134855b1"}
{"user_id": "103371327002974652630", "name": "Don Thomas", "time": 1515520882379, "rating": 1.0, "text": "I haven't been there", "pics": null, "resp": null, "gmap_id": "0x8888df12d90a6207:0xbad771dafe99f388"}
