{"user_id": "111251161194423987942", "name": "Shane King", "time": 1603896334095, "rating": 5.0, "text": "The folks are great people and truly love the wildlife they take care of. They have assisted me with 3 various rescues now and each time I have dealt with them, they are knowledgeable, kind, and excited to help the little critters. If anyone has any questions about the local wildlife, these folks are great to talk to. Thank You!", "pics": null, "resp": null, "gmap_id": "0x88926f3f855a8cc5:0x4c353dab444ae80b"}
{"user_id": "115258350249452361530", "name": "Glamazon Amber", "time": 1599264716443, "rating": 5.0, "text": "I have tried for over an hour to find help. These people were the ONLY ones to help me! The guy I spoke too was so sweet and knew a lot about the animal I needed help with.", "pics": null, "resp": null, "gmap_id": "0x88926f3f855a8cc5:0x4c353dab444ae80b"}
{"user_id": "102041885415129619242", "name": "Risha Bowman", "time": 1563277730537, "rating": 5.0, "text": "They genuinely care for wildlife. They are so nice. I am forever thankful to them for taking, in two baby blue jays, to rehabilitate and release in the wild.", "pics": null, "resp": null, "gmap_id": "0x88926f3f855a8cc5:0x4c353dab444ae80b"}
{"user_id": "102075102741283632773", "name": "Michael Burkett", "time": 1568409903090, "rating": 1.0, "text": "I will never take an injured animal to this organization again! Do not give them any wildlife or money!\nI took an injured hawk which didn't receive proper veterinary care and when I questioned why they refused to give out any more information to me about this hawk. They refused my offer to pay all medical costs for the hawk and refused Auburn's offer to take the hawk. How is that giving wildlife a second chsnce?? :(", "pics": null, "resp": null, "gmap_id": "0x88926f3f855a8cc5:0x4c353dab444ae80b"}
{"user_id": "106454486712565345843", "name": "Carrie Ann Mattimore", "time": 1502819499862, "rating": 5.0, "text": "When my son found a baby squirrel that had fallen out of its nest and 2 days earlier I found a very large dead squirrel under the same tree, I put 2 and 2 together and figured that that was its mother. So I phoned a veterinary clinic and they gave me Big Bend wildlife Sanctuary 's phone number. The owners John and Carrie are very nice and helpful. They told me what liquids I could give to the baby squirrel and directions to their location. I checked on the baby squirrel a week later and he is healthy and doing great at their facility! They do accept  contributions but it is not mandatory for them to take in an animal and nurse it back to health. A+", "pics": null, "resp": null, "gmap_id": "0x88926f3f855a8cc5:0x4c353dab444ae80b"}
{"user_id": "116099356946178164558", "name": "Stacey Powell", "time": 1559490400820, "rating": 5.0, "text": "What a special place for injured animals operated & maintained by some amazing people.  I found a injured Blue Jay Bird and the gladly accepted the little beauty.", "pics": null, "resp": null, "gmap_id": "0x88926f3f855a8cc5:0x4c353dab444ae80b"}
{"user_id": "112690544892622222231", "name": "Stacie Diaz", "time": 1499482874584, "rating": 5.0, "text": "I am so in love with this place. They have such big hearts.", "pics": null, "resp": null, "gmap_id": "0x88926f3f855a8cc5:0x4c353dab444ae80b"}
{"user_id": "112958497879559977577", "name": "TimCaddell NonameTaxi", "time": 1504551123206, "rating": 5.0, "text": "They saved the nicest opossum I ever seen from pneumonia.", "pics": null, "resp": null, "gmap_id": "0x88926f3f855a8cc5:0x4c353dab444ae80b"}
{"user_id": "106244088596125617497", "name": "Will Who", "time": 1531248438714, "rating": 5.0, "text": "This place does great work.", "pics": null, "resp": null, "gmap_id": "0x88926f3f855a8cc5:0x4c353dab444ae80b"}
{"user_id": "117096217493338077841", "name": "G Williams", "time": 1499994665241, "rating": 5.0, "text": "They're doing wonderful work here!", "pics": null, "resp": null, "gmap_id": "0x88926f3f855a8cc5:0x4c353dab444ae80b"}
{"user_id": "108758887914495685014", "name": "wolvesdefender", "time": 1502371239756, "rating": 5.0, "text": "selflessness of the people that run and work here", "pics": null, "resp": null, "gmap_id": "0x88926f3f855a8cc5:0x4c353dab444ae80b"}
{"user_id": "108439738314474333555", "name": "pamela “pamelascot” lul", "time": 1530557620695, "rating": 5.0, "text": "They love animals.", "pics": null, "resp": null, "gmap_id": "0x88926f3f855a8cc5:0x4c353dab444ae80b"}
{"user_id": "118045740458175825402", "name": "Mike & Stephanie Freeman", "time": 1548777177538, "rating": 5.0, "text": "We first called the company “Critter Capture” and had them come out to get rid of a squirrel that had made his nest in our gutter. After checking our attic and seeing that the squirrel had not yet made an entrance into our house, they told us there was nothing they could do.  The guy didn’t even have a ladder to check our gutters!\n\nSo we call Jim from Exclusive Wildlife & Pest Control.  He laughed when I told him the previous encounter with the Critter Capture company and then proceeded to get his ladder (that he brought himself!) and take a look at our gutters and ensure that the squirrel had not damaged our roof yet and also took the time to double check our attic. No damage was noted except for the fire pit cover we caught the squirrel tearing up the previous weekend.\n\nJim gave me two options on how to get rid of our furry new houseguest; we could capture him alive and release him elsewhere or set a trap similar to a rat trap that should kill him instantly. After much discussion my husband and I decided on the rat trap since the evenings here have been very cold and the poor squirrel may freeze to death in a live trap. Jim was so very patient as we weighed our options and was able to give me the pros and cons on both methods.\n\nAfter one failed attempt to trap him (the trap caught his tail instead of his neck) Jim text me throughout the evening to reassure me that he would get him the next day and that all would be OK. Jim returned promptly the next morning, set the trap again and was able to get the squirrel instantly. He disposed of everything and cleaned the nest out of the gutter.\n\nJim was so very pleasant to work with I will definitely be calling again if any other squirrel decides to make his home here!\nI would recommend Jim and Exclusive Wildlife to anyone who is looking for good, quality, and prompt service.\n\nThank you Jim!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMBbVC-1NoRZZKkz46lqwpMR0kKMUXVSo0HNWyH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOpMImbqi6WT6TFmbGFntrWu9R1ePdVJL0QITRP=w150-h150-k-no-p"]}], "resp": {"time": 1548888877159, "text": "Thank you Mike & Stephanie Freeman, it was my pleasure helping you rid your home of your unwelcomed guest and it was nice meeting you."}, "gmap_id": "0x889a1b2dea85547d:0x4c0bde02d4614206"}
{"user_id": "103366309176078943651", "name": "Jim R.", "time": 1561308658309, "rating": 5.0, "text": "Wow, what a professional service! From the meet and greet to the finished job. Neet and clean and thorough. 100% satisfied!", "pics": null, "resp": null, "gmap_id": "0x889a1b2dea85547d:0x4c0bde02d4614206"}
{"user_id": "113379450846746276634", "name": "Lynne Casey", "time": 1499700139906, "rating": 5.0, "text": "They came on a Sunday afternoon. Very professional. Did a wonderful job inspecting under a trailer in the mud.  Stayed with it for hours until a huge dead possum was located and removed. I will definitely recommend this company to anyone and everyone. From large to small insect, animal, rodent prevention, inspection or removal. JIM RICHARDS is your man.", "pics": null, "resp": null, "gmap_id": "0x889a1b2dea85547d:0x4c0bde02d4614206"}
{"user_id": "107950158733247526469", "name": "Leslie White", "time": 1557423805901, "rating": 5.0, "text": "Friendly and informative", "pics": null, "resp": null, "gmap_id": "0x889a1b2dea85547d:0x4c0bde02d4614206"}
