{"user_id": "117220656782697557949", "name": "Christopher David Riggs", "time": 1618872889412, "rating": 5.0, "text": "Great products ,pick up was simple and they loaded everything for me.", "pics": null, "resp": null, "gmap_id": "0x8862152700c535ff:0x695716febc20fe54"}
{"user_id": "101078991621172555704", "name": "Jeff Johnson", "time": 1597184634379, "rating": 5.0, "text": "I built a small garage, and needed some siding. I went by and told them what I was doing and they came up with a rough estimate of what I needed. I went back a few days later and purchased the supplies, it actually costs less then what I expected.  The inside sales and warehouse guys were very friendly. If you need vinyl siding, windows or doors, I'd definitely check with them first.", "pics": null, "resp": null, "gmap_id": "0x8862152700c535ff:0x695716febc20fe54"}
{"user_id": "108025918651903664802", "name": "Mark Kelso", "time": 1583534989147, "rating": 5.0, "text": "We have purchased Vinyl Siding and windows and got a good quality product. Delivery unfortunately is unreliable, best to go there and pick it up", "pics": null, "resp": null, "gmap_id": "0x8862152700c535ff:0x695716febc20fe54"}
{"user_id": "111148222165136334007", "name": "Bradley Long", "time": 1561431946061, "rating": 5.0, "text": "Quiet lake front resort. Swimming, boat and jet ski rentals. Community planned activities. Good family fun 👍😀", "pics": null, "resp": null, "gmap_id": "0x8862152700c535ff:0x695716febc20fe54"}
{"user_id": "104767653842573979388", "name": "Sonja Smith", "time": 1592043956284, "rating": 4.0, "text": "Good place to buy materials for your construction needs", "pics": null, "resp": null, "gmap_id": "0x8862152700c535ff:0x695716febc20fe54"}
{"user_id": "108852354214935503513", "name": "Michael Rhyne", "time": 1494337272935, "rating": 5.0, "text": "I'm glad I went to this place to purchase my vinyl siding. My wife was undecided what colors she wanted for her house. One of the guys figured up the amount of siding I needed. The other help my wife pick colors and was very very good at it. They were very friendly and made you feel at home. Even the guys load in the truck were awesome. Their prices cannot be matched!!! And most of what I we needed was in stock. Best Building Material buying experience ever!!!", "pics": null, "resp": null, "gmap_id": "0x8862152700c535ff:0x695716febc20fe54"}
{"user_id": "115572964162498235657", "name": "J. Utell", "time": 1484332580213, "rating": 5.0, "text": "Called in to re-order siding & John is a life saver!!! He took the time to help me find a 1 year old order. I didn't know my color but he worked diligently to help me. I really appreciate his customer service.", "pics": null, "resp": null, "gmap_id": "0x8862152700c535ff:0x695716febc20fe54"}
{"user_id": "118310378427339966706", "name": "Tyson DeAngelis", "time": 1555464266324, "rating": 5.0, "text": "My go to vinyl siding store.  Friendly knowledge staff. If you need vinyl siding, this is the place to go.", "pics": null, "resp": null, "gmap_id": "0x8862152700c535ff:0x695716febc20fe54"}
{"user_id": "107893924860682219546", "name": "Mark", "time": 1610728075205, "rating": 5.0, "text": "In one word: Outstanding. They replaced a storage room set of double doors and I could not be more pleased. Family owned and operated,  their pride shows in their work. Very competitive in pricing. Give them a call & chance to earn your business.", "pics": null, "resp": {"time": 1628710968939, "text": "Thank you very much for the excellent review!!"}, "gmap_id": "0x888c297ba6714557:0x53feaf93c215af70"}
{"user_id": "112040790951061188448", "name": "russell huggins", "time": 1505725868177, "rating": 5.0, "text": "As the owner I believe we are as good as any door installers around!", "pics": null, "resp": {"time": 1628711212662, "text": "Not sure how this got in the wrong location but the reviewer is not the owner..... However, as the owner I must agree with this review. ;-)"}, "gmap_id": "0x888c297ba6714557:0x53feaf93c215af70"}
{"user_id": "107801876224512911920", "name": "Jake Z", "time": 1497205864125, "rating": 5.0, "text": "Great and affordable awning. Fast installation. Looks great and holds up great in bad weather. Also had southern awning enclose my pole barn. Looks great.", "pics": null, "resp": null, "gmap_id": "0x888ccf1f758be753:0x2e6f705c5f6c4883"}
{"user_id": "107226543170799241400", "name": "Penny Ezell", "time": 1615289390458, "rating": 5.0, "text": "Friendly staff!", "pics": null, "resp": null, "gmap_id": "0x888ccf1f758be753:0x2e6f705c5f6c4883"}
{"user_id": "109269460666717723026", "name": "Crystal Hendrix Zabala", "time": 1496938415397, "rating": 5.0, "text": "Had a patio cover installed by southern awning my grandmother loved it so much she got one too!!!", "pics": null, "resp": null, "gmap_id": "0x888ccf1f758be753:0x2e6f705c5f6c4883"}
{"user_id": "108968414664663312243", "name": "Ben Davis", "time": 1516661203222, "rating": 1.0, "text": "NOT GOOD", "pics": null, "resp": {"time": 1527616629287, "text": "Hi Ben can you please call us at 334-297-4647 we are wanting to get some clarification with your post/rating with us. We want all our customers to be satisfied."}, "gmap_id": "0x888ccf1f758be753:0x2e6f705c5f6c4883"}
{"user_id": "103218572676547436329", "name": "Rebecca Bailey", "time": 1555009012060, "rating": 5.0, "text": "I cannot say enough good things about Custom Screen & Windows. Adam was very prompt in answering my email about windows, came to my house, did the most exact measurements of  the three companies I had come to give quotes, and was very personable. Their price was reasonable and he was able to provide exactly what I wanted. My order took three weeks as I ordered 2 high impact (hurricane) pictures windows . It arrived on time and he called me promptly to set up a time for installation. What I loved was that Adam himself showed up for the install. It took them no time at all to install 9 of my 11 windows. Unfortunately they sent the wrong size for my high impact windows. Adam was extremely apologetic and made sure the correct ones were ordered right away. When I offered to pay for the windows I had (as over half the job was completed) he refused saying no the job isn't finished. All my windows are in now and they are amazing. I also know they were installed right as we have had a lot of rain in the last weeks. If you want amazing customer service and high quality windows you cannot do better than this company!", "pics": null, "resp": null, "gmap_id": "0x889a4dcc9e475b4b:0x3d5c2af9d1a7e768"}
{"user_id": "102042708267032477318", "name": "Jimmy B", "time": 1581190188854, "rating": 5.0, "text": "Adam was very prompt and professional. He listened to all of my concerns and provided me with two very thorough estimates.  I was grateful to have a contractor do what they said they were going to do, thank you!", "pics": null, "resp": null, "gmap_id": "0x889a4dcc9e475b4b:0x3d5c2af9d1a7e768"}
{"user_id": "106870534777211389646", "name": "Joyce Goodman", "time": 1581927987572, "rating": 5.0, "text": "The screens fit well and let my cats get fresh air! They love the screens! And they're heavy duty!!", "pics": null, "resp": null, "gmap_id": "0x889a4dcc9e475b4b:0x3d5c2af9d1a7e768"}
{"user_id": "113247514892128245622", "name": "Conrad Bates", "time": 1266527993645, "rating": 5.0, "text": "I had 7 solar screens installed on my house by Custom Screen and Window. Their prices were great and they came out quickly and did the install. Everything went great!", "pics": null, "resp": null, "gmap_id": "0x889a4dcc9e475b4b:0x3d5c2af9d1a7e768"}
{"user_id": "115935445347061768624", "name": "Greg Barnes", "time": 1362082733302, "rating": 5.0, "text": "I've have work for custom screen &window co for 8 months an they really care about there costomers . there out there to do excellent work for you. come give them a try.\nyou will be glad you did.", "pics": null, "resp": null, "gmap_id": "0x889a4dcc9e475b4b:0x3d5c2af9d1a7e768"}
{"user_id": "107514145083316807249", "name": "V. Wayne Thorpe", "time": 1561861779749, "rating": 5.0, "text": "Great product - wonderful people to work with", "pics": null, "resp": null, "gmap_id": "0x889a4dcc9e475b4b:0x3d5c2af9d1a7e768"}
{"user_id": "117971944815185034674", "name": "Amy Amerson", "time": 1573115076918, "rating": 5.0, "text": "Family loved it!", "pics": null, "resp": null, "gmap_id": "0x889a4dcc9e475b4b:0x3d5c2af9d1a7e768"}
{"user_id": "105001899314406652512", "name": "R. Cherri Pitts", "time": 1557870704766, "rating": 5.0, "text": "This company is top notch - their new showroom is beautiful, they rep quality products and multiple price points and are a pleasure to work with.  Over the last 15 years, I've worked on multiple projects with them and highly recommend them if you need help with windows, doors, trim hardware and even specialty items like decorative columns.", "pics": null, "resp": null, "gmap_id": "0x88891608f99bf5ab:0xbd9eed3e7ef6b47c"}
{"user_id": "106478001810102787840", "name": "Mona Thompson", "time": 1440178979609, "rating": 5.0, "text": "Currently working with Holcombe Windows and Doors on a project in Gadsden Alabama.  I'm the designer and located in Little Rock, Arkansas.  Doing business long distance can be tricky.  This firm is making it so easy and a pleasure to work with.  I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891608f99bf5ab:0xbd9eed3e7ef6b47c"}
{"user_id": "112603408615905559428", "name": "Jade Bertovic", "time": 1452954667932, "rating": 5.0, "text": "My husband and I were in desperate need of replacement windows for our new (to us) home. We had been putting off the process and finally bit the bullet when a friend recommended Holcombe Doors and Windows. Before we replaced our windows, our rooms were stifling hot in the summer and freezing in the winter even with the A/C or heat running. Which also meant our power bills were much higher than need be. As soon as we replaced our old windows with new, efficient windows from Holcombe Doors and Windows, we could tell a HUGE difference not only in the appearance, but our rooms were no longer hot in the summer or cold in the winter! Holcombe did an outstanding job helping us decide what windows were right for our home and completing the job. Their customer service and install team were professional, friendly and helpful. We are beyond pleased with the job Holcombe did for us, and will definitely be using them again!", "pics": null, "resp": null, "gmap_id": "0x88891608f99bf5ab:0xbd9eed3e7ef6b47c"}
{"user_id": "103930415208278267461", "name": "Glyna Humm", "time": 1440260282637, "rating": 5.0, "text": "We called Holcombe Doors & Windows to replace our bay window in the kitchen.  They were very responsive and sent someone right out to give us a quote which was very competitive. The job from start to finish was a great experience.", "pics": null, "resp": null, "gmap_id": "0x88891608f99bf5ab:0xbd9eed3e7ef6b47c"}
{"user_id": "111172777791317057828", "name": "Hillary Pody", "time": 1459350794480, "rating": 5.0, "text": "I would definitely recommend Holcombe Door and Window. Love my front door and new hardware. Friendly, knowledgable staff who were a pleasure to work with.", "pics": null, "resp": null, "gmap_id": "0x88891608f99bf5ab:0xbd9eed3e7ef6b47c"}
{"user_id": "100396232280119942568", "name": "Christie Wood", "time": 1463000932863, "rating": 5.0, "text": "I have recently replaced all of my windows in my home.  We checked with a few different companies before choosing Holcombe Doors and Windows.  I am so glad we found them.  We love our new windows and the service was great.  I would recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891608f99bf5ab:0xbd9eed3e7ef6b47c"}
{"user_id": "118365860838167007217", "name": "Fulton Ramsay", "time": 1567475788584, "rating": 5.0, "text": "Quality products.", "pics": null, "resp": null, "gmap_id": "0x88891608f99bf5ab:0xbd9eed3e7ef6b47c"}
{"user_id": "115524788312088266725", "name": "Jack Lolley", "time": 1605917797699, "rating": 4.0, "text": "Took a long time to replace one of my windows but other than that a fine place to do business", "pics": null, "resp": null, "gmap_id": "0x8892922e6a6f50a3:0x76b9a6d0496d513f"}
{"user_id": "114294111683902031962", "name": "Larry Smith", "time": 1613679005862, "rating": 1.0, "text": "They was no help at all they suck", "pics": null, "resp": null, "gmap_id": "0x8892922e6a6f50a3:0x76b9a6d0496d513f"}
{"user_id": "109641902485784293448", "name": "Robert Bozett", "time": 1600446810421, "rating": 4.0, "text": "Missed my turn & Google sent me thru a pig trail .but, I did get there fine.", "pics": null, "resp": null, "gmap_id": "0x8892922e6a6f50a3:0x76b9a6d0496d513f"}
{"user_id": "112756384611647197793", "name": "J.D. Smith", "time": 1617363569604, "rating": 4.0, "text": "Great customer service.", "pics": null, "resp": null, "gmap_id": "0x8892922e6a6f50a3:0x76b9a6d0496d513f"}
{"user_id": "107007400569947344414", "name": "FAST AZ SERVICES", "time": 1606961116837, "rating": 5.0, "text": "Really great company and friendly staff", "pics": null, "resp": null, "gmap_id": "0x8892922e6a6f50a3:0x76b9a6d0496d513f"}
{"user_id": "106962065058489173162", "name": "cynthia benton", "time": 1591449303338, "rating": 5.0, "text": "Bobby goes above and beyond make sure customer is taken care of ,friendly service great prices.", "pics": null, "resp": null, "gmap_id": "0x8892922e6a6f50a3:0x76b9a6d0496d513f"}
{"user_id": "100878321416187765045", "name": "Mark Black", "time": 1572452948241, "rating": 5.0, "text": "Where can I visit ABC they are great folks very helpful for a novice", "pics": null, "resp": null, "gmap_id": "0x8892922e6a6f50a3:0x76b9a6d0496d513f"}
{"user_id": "102962539485431062846", "name": "Dan Carr", "time": 1547158788055, "rating": 5.0, "text": "ABC I by far the best supply house for roofing materials Hands down. And very friendly and helpful 😎", "pics": null, "resp": null, "gmap_id": "0x8892922e6a6f50a3:0x76b9a6d0496d513f"}
{"user_id": "111914417804779950942", "name": "Kenny Metz", "time": 1516024142916, "rating": 5.0, "text": "A Great Company to do Business With !", "pics": null, "resp": null, "gmap_id": "0x8892922e6a6f50a3:0x76b9a6d0496d513f"}
{"user_id": "110935803844914543065", "name": "Matthew Hyzny", "time": 1543422378151, "rating": 4.0, "text": "Very good  Service", "pics": null, "resp": null, "gmap_id": "0x8892922e6a6f50a3:0x76b9a6d0496d513f"}
{"user_id": "114234627049560676104", "name": "Charlie Turner", "time": 1571329445115, "rating": 5.0, "text": "Very professional", "pics": null, "resp": null, "gmap_id": "0x8892922e6a6f50a3:0x76b9a6d0496d513f"}
{"user_id": "109822923930250134722", "name": "Kentrell Franklin", "time": 1553814816965, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x8892922e6a6f50a3:0x76b9a6d0496d513f"}
{"user_id": "108978323745938422463", "name": "Dorothy Jensen", "time": 1616003749280, "rating": 5.0, "text": "Ray and Abe did a wonderful job installing drapery panels and plantation shutters.  This is our third purchase from Budget Blinds, and every time we have appreciated the professional and friendly service.", "pics": null, "resp": {"time": 1616007701093, "text": "Thank you so much for your kind words and continued business. We really appreciate it!"}, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "112879763318610356570", "name": "Mike Lovell", "time": 1604090077219, "rating": 5.0, "text": "We are new to the area and updating our home here in Gulf Shores. We had 4 sets of French doors that had older drapes that were past their prime. We called this company and Alex came to our home. His professionalism and knowledge of the products was very impressive. We came to an agreement on product and price which was more than fair in my opinion. Alex ordered our new shades which were all odd sizes and had to be custom cut. Our installer, Abe came out as soon as they came in and did a great job taking the old drapes down and installing our shades. This is a first class company, and I highly recommend them.", "pics": null, "resp": {"time": 1604096852664, "text": "Thank you so much for the review and choosing us for your window treatments in your home!"}, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "113476470829819000247", "name": "Robert Bois", "time": 1591969644634, "rating": 5.0, "text": "We decided on Plantation Shutters for our new construction home in Foley. We went with Budget Blinds primarily because of their very good reputation and the fact that their salesman, Alex, was so knowledgeable and he was able to guide us through many decisions we needed to make to get the end product we thought we were looking for. Naturally we had to wait a few weeks as each of our blinds needed to be custom made. However, in the mean time, Alex installed temporary blinds in our home that worked wonderfully and held us over till the day of install. The install was done by Abe and Cameron and simply put, I don't think we could have asked for anyone better in terms of skill, professionalism, and personality.  BOTTOM LINE: We simply could not be happier with the quality of the product, the install, and the LOOKS! Thank you ever most kindly Budget Blinds!", "pics": null, "resp": {"time": 1591980633718, "text": "Thank you so much for the review! We love the great team that we have and appreciate hearing your kind words. It was a pleasure installing your window treatments."}, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "111971183022862613960", "name": "Dottie Lee", "time": 1602196255418, "rating": 5.0, "text": "We love our new plantation shutters from Budget Blinds.The customer service from them is awesome.From our great salesman Alex to our great installers Abe and Dennis. They treat you like family and are so attentive to detail. Five stars!", "pics": null, "resp": {"time": 1602197627984, "text": "We are so happy you love your new shutters! Thank you for choosing us for your window treatments."}, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "115859510479911204956", "name": "Peggy Barton", "time": 1599237938766, "rating": 5.0, "text": "We had living room blinds installed by Phil and Cam.  They were awesome.  They worked hard, were very polite, punctual, and very efficient.  They both wore masks, took their shoes off on the carpet, and cleaned up afterwards.  They did an amazing job!!!!", "pics": null, "resp": {"time": 1610491795721, "text": "Thank you so much!"}, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "103852104817905771568", "name": "Mary Bynum", "time": 1596128129313, "rating": 5.0, "text": "Thanks to Budget Blinds of Baldwin County for installing all of our home window treatments! Absolutely first class service from ALL team members!\nDennis, Ray, Austin, Phil, truly represent th a \" A\" team !!! We highly recommend them, Harry & Frances B.", "pics": null, "resp": {"time": 1596217935183, "text": "Thank you so much for your review! We hope you have a great weekend."}, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "114351652274791896749", "name": "Paula Rigsby", "time": 1579877325788, "rating": 5.0, "text": "This is the second time we have used Budget Blinds.  Phil was great to work with and gave me great ideas.  The installers were here yesterday and installed shutters and shades.  They were very professional, efficient and respectful.  I highly recommend Phil and Budget Blinds!", "pics": null, "resp": {"time": 1579887589487, "text": "Thank you so much, Mrs. Rigsby!"}, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "115716086612215770047", "name": "Sheri Hines", "time": 1591640581356, "rating": 5.0, "text": "Phil was amazing! Helped us select the perfect blinds for our master bedroom with four giant windows and french doors. The finished look is beautiful and just what we wanted. The process was easy from requesting an inital visit through to installaion. Phil is friendly, courteous, communicative, timely, and most of all a joy to work with. I fully receommend Budget Blinds of Baldwin County.", "pics": null, "resp": {"time": 1591654901383, "text": "Thank you for your review! It was a pleasure working with you."}, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "113427799897744993378", "name": "Lundy Wilder", "time": 1528306168480, "rating": 5.0, "text": "Ask for Alex ! The others at Budget Blinds may be great also but I KNOW that Alex is !  I finally had my home-made goofy shades in my bedroom replaced with beautiful sleek roller shades. Alex was great at helping me find some that blocked most of the hot summer sun but allowed me to see the trees and what was going on outside. The color is a perfect match for my walls and it turned out to be the less costly line they carry, which was a bonus.\nAlex is punctual and returns calls and took my old plastic straw shades off to put in their recycle bin and he removed all packaging when he left.\nHe has a great attitude and is a pleasure to be around. Great experience all around.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "108916480485685364055", "name": "Lindsay Pileggi", "time": 1459462053500, "rating": 5.0, "text": "Budget Blinds is the best!  I was contacted within a day of submitting a Request Online through their website.  They set up an appointment with a Consultant to meet at my house.  The Consultant Phillip was on time, friendly, professional, and very knowledgeable.  He was able to go through the various options of Blinds available for purchase, and gave me comparisons on pricing and quality of each selection.  Working with Budget Blinds was the best experience.  And the best part, Pricing was not outrageous!  Why try to hunt someone down at your local hardware store?  Call Budget Blinds and let them come to you.  It's so easy!  I will be contacting them again when I'm ready to get blinds for my sun room.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "115969559339054919550", "name": "Sandy Bookout", "time": 1471005353483, "rating": 5.0, "text": "We have used Budget Blinds in Birmingham several times. So, when we moved to Gulf Shores I went in search of a Budget Blinds close by. And there they were! We have used them twice here and both times have had a wonderful experience. They are easy to schedule an appointment with and they always show up on time. The sales reps are knowledgeable  and very easy to work with. On the day of the install it was pouring down rain. They came to my door, took off their shoes, and got right to work. Wonderful team! Wonderful product. Thanks!\nSandy B.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "106204751617740061875", "name": "Sean Ferrell", "time": 1430243718909, "rating": 5.0, "text": "We have used Budget Blinds multiple times. We love the woven shades in our home so much, we decided to use their products again in our office! Val has awesome knowledge of their products, and recommended a perfect treatment for our windows in our budget! Their customer service and installation team go above and beyond with their kindness and professionalism. We will definitely use them again!", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "105164136374732045318", "name": "Jane Breaux", "time": 1492190696789, "rating": 5.0, "text": "Highly recommend BB for all your window covering needs! I really enjoyed working with highly competent design specialist Phil Duke who was able to help me select the PERFECT style of drapes and blinds without breaking my budget, and perfect installation of them too! They took plenty of time with me, no high pressure sales, and let me decide what was best for the space! I look forward to working with Phil and BB again in the future for more great blinds!", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "108713351276123815517", "name": "Chi EK", "time": 1432438845102, "rating": 5.0, "text": "Very professional and competent at their job. Our blinds were hung with the utmost care and concern. We even received hands on review on how to take care of them, removal and putting back if and when necessary. Thank you for a job well done. We would use them again.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "106395936260783352377", "name": "Rick Johnson", "time": 1507745192915, "rating": 5.0, "text": "Shopped quite a bit looking for professionalism, price, and quality.  Look no further.  Budget Blinds has a superior product and team.  Alex consulted us on the right blinds and shutters, and personally installed them.  They not only look great, they really set the look of the house off.  Hats off to Alex and the whole Budget Blind Staff!", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "108080950047668461498", "name": "Anya Babb", "time": 1551647907074, "rating": 1.0, "text": "We used them twice. The first time everything was perfect. On our second home the shutters were horrible they used a bunch of caulking that cracked and let a lot of light through. Paid nearly 6 grand and regret it.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "105609024235913540067", "name": "Darleen Hatt", "time": 1492181868874, "rating": 5.0, "text": "The solar shades are perfect and Phil Duke is a Master installer and artist if you can consider installing blinds an art as well as a science and I do.  I could not ask for a better job, nicer sun shades, or better services.  Thank you, Darleen Hatt", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "101413749227133665832", "name": "Angie Monteleone", "time": 1499368028359, "rating": 5.0, "text": "Love my new cellular shades.  This company is great, from the office, to the salesman and finally the installer.  Very friendly and professional.  I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "115983538834734122566", "name": "Patricia Cooper", "time": 1462800523847, "rating": 5.0, "text": "Excellent product and excellent service.  Installers arrived right on time and were neat and courteous.  I would definitely recommend Budget Blinds of Baldwin County.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "101527976014087757105", "name": "Ann Rasmussen", "time": 1448593852540, "rating": 5.0, "text": "The people we dealt with were very professional, knowledgable and courteous. The products we purchased- sun shades and shutters, are of a great quality. I would definitely recommend them, and Budget Blinds of Baldwin County, to anyone interested in window treatments.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "104995725109817627712", "name": "susan Storey", "time": 1484337007263, "rating": 5.0, "text": "Phil did a great job with the design, fabric choice and a professional job with the installation.  MUCH appreciated, and highly recommend Phil and Budget Blinds to anyone with window treatment needs.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "111987343138570712556", "name": "Linda “Linds” Johnson", "time": 1457121193507, "rating": 5.0, "text": "We have been very pleased with both professionalism and quality of their product.  A good value that offers a wide variety of options.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "100234288086796462534", "name": "Jeff Hosterman", "time": 1499460628449, "rating": 5.0, "text": "Solid attentiveness, advice and pricing from beginning thru install.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "108012343499434313511", "name": "lynn bobik", "time": 1527801257263, "rating": 5.0, "text": "Knowledgeable,  helpful staff.  Fair prices.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "115925213177071478585", "name": "Christian Urbach", "time": 1428691605905, "rating": 5.0, "text": "I recently worked with Dan and Val and I couldn't have had a more pleasant experience. They were very helpful and professional throughout the whole process!", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "107127495536824660234", "name": "Annette Sebastian", "time": 1433354736483, "rating": 4.0, "text": "Installers were very professional and polite!  Thank you!", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "115761310714323636849", "name": "Linda Ericson", "time": 1628783292110, "rating": 5.0, "text": "Alex and his team are the BEST!  They have replaced all the window coverings in our home and every installation is PERFECT!  The prices are the most competitive we have found in Baldwin County.  You cannot make a mistake calling Alex for your window projects!", "pics": null, "resp": {"time": 1628785544331, "text": "Thank you so much for your kind words! It was a pleasure meeting you yesterday :) - Phil"}, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "115011318000617573997", "name": "Myra Koch", "time": 1619636987170, "rating": 5.0, "text": "they are simply the best.  they know their biz...do it well....price it right....retain quality staff who are proud of the job they do....It ALL shows!  I have never been disappointed in 16 years & neither will you be.", "pics": null, "resp": {"time": 1619645033196, "text": "Thank you Mrs. Koch!! We appreciate your business and you taking the time to review our company."}, "gmap_id": "0x889a41aac6a3b7ed:0xab1aab6f7b497035"}
{"user_id": "100252692400405620178", "name": "Chad Bartz", "time": 1610403290743, "rating": 5.0, "text": "The people at Eastern Shore Glass are professional and committed to excellent quality work. I highly recommend them for commercial or residential projects", "pics": null, "resp": null, "gmap_id": "0x889a41aac6a3b7ed:0xab1aab6f7b497035"}
{"user_id": "114260614580651667902", "name": "harry smith", "time": 1595169834577, "rating": 5.0, "text": "Eastern Shore Glass has completed multiple jobs for my company. I couldn’t be happier with the results. The installers are knowledgeable, excellent time management and the office staff have answered any questions I have. Thanks Sarah, Chet and the rest of the crew! I would highly recommend this company...", "pics": null, "resp": null, "gmap_id": "0x889a41aac6a3b7ed:0xab1aab6f7b497035"}
{"user_id": "104827577981621507650", "name": "Timothy Tatum", "time": 1601987777036, "rating": 5.0, "text": "A great and affordable business that provides their customers with top tier high quality glass and frames. Whether you're remodeling your home, or just need a new mirror, Eastern Shore Glass is hands down the GO TO business for all your glass needs.", "pics": null, "resp": null, "gmap_id": "0x889a41aac6a3b7ed:0xab1aab6f7b497035"}
{"user_id": "107114552701385621042", "name": "Pam Wiggins", "time": 1591722652944, "rating": 5.0, "text": "Everyone professional, courteous and definitely strive to to give great customer service. I highly recommend Eastern Shore glass for all your glass needs.", "pics": null, "resp": {"time": 1591794340876, "text": "Thank you Mrs. Wiggins for taking the time to review our company! We appreciate the kind review."}, "gmap_id": "0x889a41aac6a3b7ed:0xab1aab6f7b497035"}
{"user_id": "117247847872067078052", "name": "Kristen Klutes", "time": 1572563643186, "rating": 5.0, "text": "After contacting Ryan, our glass shower door was assessed and repaired right away. So impressed! Very professional with excellent follow up!", "pics": null, "resp": null, "gmap_id": "0x889a41aac6a3b7ed:0xab1aab6f7b497035"}
{"user_id": "107618630196288123419", "name": "Darrell Davidson", "time": 1584021634872, "rating": 5.0, "text": "Great service, friendly and helpful. You improved to 5 stars by simply responding and showing that you care enough to follow reviews.", "pics": null, "resp": {"time": 1584017911114, "text": "Thank you for the feedback, Mr. Davidson! Please let us know what we can do to improve to be five stars."}, "gmap_id": "0x889a41aac6a3b7ed:0xab1aab6f7b497035"}
{"user_id": "107132862411610788415", "name": "Jeffrey Mosley", "time": 1548879451192, "rating": 5.0, "text": "I recently had a custom frameless shower door installed and it turned out great!  The entire process was a breeze.  The installers were friendly, professional and left the place spotless.  Highly recommended!!  Great job by the whole team!!", "pics": null, "resp": null, "gmap_id": "0x889a41aac6a3b7ed:0xab1aab6f7b497035"}
{"user_id": "103597495950551485680", "name": "Katherine Nelson", "time": 1520534593585, "rating": 5.0, "text": "Most excellent service I have ever received. Every employee I spoke with was very polite and knowledgeable. I will definitely be using Eastern Shore Glass for all of my projects in the future.", "pics": null, "resp": null, "gmap_id": "0x889a41aac6a3b7ed:0xab1aab6f7b497035"}
{"user_id": "103755766868982790146", "name": "John Reynolds", "time": 1520372109644, "rating": 5.0, "text": "Professional service and high quality work. They were able to do it for less and in a quicker time than another place had quoted me. Thank you!", "pics": null, "resp": null, "gmap_id": "0x889a41aac6a3b7ed:0xab1aab6f7b497035"}
{"user_id": "100474829731848243000", "name": "Richard Cohen", "time": 1507302537744, "rating": 5.0, "text": "Quick and professional service. Staff is very friendly! I have used them to install glass at my house on the bay and at my regular home. They get it done right, and I will continue to use and recommend them.", "pics": null, "resp": {"time": 1507308490984, "text": "Thank you, Mr Cohen for the review and for your patronage!"}, "gmap_id": "0x889a41aac6a3b7ed:0xab1aab6f7b497035"}
{"user_id": "104853145951472600310", "name": "Kelly Davis", "time": 1521212427219, "rating": 5.0, "text": "Just used them to finish my dream bathroom and they did an incredible job on my shower glass! Couldn’t be happier with the result and the service. Thank you Sarah for working with my hectic schedule and being patient with me!", "pics": null, "resp": null, "gmap_id": "0x889a41aac6a3b7ed:0xab1aab6f7b497035"}
{"user_id": "101088523094437663771", "name": "Carla Gwin", "time": 1573162551599, "rating": 5.0, "text": "Did exactly what I ordered. Fair drive, quick service.", "pics": null, "resp": null, "gmap_id": "0x889a41aac6a3b7ed:0xab1aab6f7b497035"}
{"user_id": "105406887096204434694", "name": "Jeff Galway", "time": 1505589231514, "rating": 5.0, "text": "The windows (x4) were delivered and installed on schedule.  The workmanship and the windows are exceptional and greatly appreciated.  I will use them again.", "pics": null, "resp": null, "gmap_id": "0x889a41aac6a3b7ed:0xab1aab6f7b497035"}
{"user_id": "106966586805243563557", "name": "Cathy King", "time": 1507184043907, "rating": 1.0, "text": "It took them a month to cut one piece of glass for my coffee table.  I finally got it today: the first attempt  of there's they did a sketch and when they delivered the glass, it would not fit twice & now it has a nic in it! Worst service and workmanship ever.  I am calling", "pics": null, "resp": {"time": 1507217492973, "text": "Mrs. King, I apologize that you are dissatisfied with your product. We were unaware that there was a defect in your tabletop. We would love the opportunity to make this right, please reach out to us when you are available so that we can provide you with a perfect product."}, "gmap_id": "0x889a41aac6a3b7ed:0xab1aab6f7b497035"}
{"user_id": "117479157415810335666", "name": "Steven Peyer", "time": 1505058230774, "rating": 5.0, "text": "They cut a table top glass, fit perfect, nice job! People were really nice.", "pics": null, "resp": null, "gmap_id": "0x889a41aac6a3b7ed:0xab1aab6f7b497035"}
{"user_id": "108917160972794165232", "name": "opal dyer", "time": 1520370168611, "rating": 1.0, "text": "Not professional messed up a job and not timely at repairing it", "pics": null, "resp": {"time": 1520371274920, "text": "I see your name is Opal Dyer, we show that our company has never done business with you before. Please let us know what job you are referring to, we would love an opportunity to make it right."}, "gmap_id": "0x889a41aac6a3b7ed:0xab1aab6f7b497035"}
{"user_id": "100134809062435535632", "name": "benn hollinger", "time": 1582731700127, "rating": 5.0, "text": "Extremely professional!", "pics": null, "resp": null, "gmap_id": "0x889a41aac6a3b7ed:0xab1aab6f7b497035"}
{"user_id": "113886944677534831427", "name": "Karyn Bowen", "time": 1620769687735, "rating": 5.0, "text": "I am so pleased with my new shades. Donna was easy to work with and very helpful. Installation guys were pleasant and had them installed quickly. I’ve worked with them before and will definitely work with them again when the need for something else.", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "111823150342230088946", "name": "Azziza S", "time": 1620704306892, "rating": 5.0, "text": "The salesman was wonderful and so helpful.  We weren't sure exactly what we wanted and he steered us to the right choice. He could've steered us another way and made more money but the look wouldn't have been as good.\n\nThe installers were fantastic and professional.  Our new blinds look so good in our home and really set off the windows.  I'm so glad we came to this business instead of going to Lowes or Home Depot!", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "100018288749737523602", "name": "Google User", "time": 1402422213789, "rating": 5.0, "text": "My blinds and shutters were delivered and installed this week. I just wanted you to know how very pleased I am with them. They fit perfectly and the quality is outstanding. However, more than this I waned you to know how impressed I was with your installer and his assistant. He was very courteous and professional. He went out of his way to make sure I was pleased with every window. His assistant was very nice and took great care to make sure that each area they were working in was cleared of all packing material. They worked very well together as a team.\n\nBeing in the business world as long as I have makes me very appreciates of good employees and customer service. You have both.\n\nThank you again for a pleasant buying experience with your company.", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "105942597259848109953", "name": "A Google User", "time": 1398363237862, "rating": 5.0, "text": "Just a quick note to say thanks so much for the new blinds! From start to finish I had a great experience. The sales person, David, was prompt and made me feel at ease about choosing the right blinds for me. And he wasn't pushy, which I really appreciate! The blinds came in earlier than expected and the installation was less than 20 minutes. The blinds look great, thanks again!", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "115736575255568178253", "name": "Stephani Shields", "time": 1506545608646, "rating": 5.0, "text": "I can’t say enough good things about this company. Donna came out and handled everything and even recommended a plantation over 3 shades in our master bathroom and I can’t thank her enough she was soooo right! My house looks amazing and the installers were quick and precise and friendly. I will gladly recommend them anytime anyone asks. 10 stars!", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "113077487335293447631", "name": "A Google User", "time": 1395332574482, "rating": 5.0, "text": "Donna Tanory recently assisted me in choosing drapes for a guest bedroom in my home.  She was a tremendous help to me in selecting fabric and lining material and also a drapery rod.  Not only is she very knowledgeable about different fabrics, she is an absolute pleasure to work with.  I highly recommend her for all your window treatments.", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "116850906182035812098", "name": "A Google User", "time": 1403801830165, "rating": 5.0, "text": "Love Budget Blinds! Did downstairs in 2006. Called them back to finish second floor in 2014. Good Product, Good service", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "114407873212961749674", "name": "Jan Parks", "time": 1474548068228, "rating": 5.0, "text": "This was just what I wanted.  Donna came to my home,  gave me advice about my windows,  and answered all my questions. After they were ordered,  the blinds came on time and fit the space beautifully. The price was almost the same as the big box stores and maybe a little less. But it was much less hassle!", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "100726789451162744369", "name": "Google User", "time": 1410900954640, "rating": 4.0, "text": "Budget blinds is kinda like my family. I have used their services for 12 years. They are so friendly & helpful every time I call! Wonderful Service!", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "109508905244994846900", "name": "Raquel", "time": 1551902081617, "rating": 1.0, "text": "We have blinds that the builder installed when we purchased our home in 2015. One of the blinds doesn’t close all the way, so I assumed it needed to be replaced. Called this company because it was the first one to come up in google. The representative who answered the phone asked if they installed the blinds, I explained that we purchased the home with the blinds and didn’t have any information on who installed and catching up with DR Horton is like chasing a rabbit. She wanted to look up my address so I gave it to her, she says nothing came up and then she repeats again that they do not repair any one else’s blinds. Ok, so since I don’t know who, what’s wrong with charging a service charge to come repair or get a sale on new blinds. Very poor customer service and what business turns away a new paying customer.", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "115902772669523997026", "name": "A Google User", "time": 1400278122743, "rating": 5.0, "text": "I am very satisfied with the installation and the Design Consultant. They were professional and friendly. I highly recommend them-the installers and the Design Consultant", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "101951677865085550085", "name": "Alona Homann", "time": 1394225600117, "rating": 5.0, "text": "Very nice Staff!  Excellent Product!\n\nThank you David for coming to my office to match colors.", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "104925417680619572083", "name": "luke hall", "time": 1494532871955, "rating": 5.0, "text": "Donna was fantastic to work with making it easy for us to choose the right shades for our home. Highly recommend Budget Blinds.", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "107515224493543147231", "name": "Sri Sade", "time": 1393371585812, "rating": 5.0, "text": "We appreciate the prompt service and professional installation. Will definitely contact for future blinds needs", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "104439817188239777571", "name": "Stahl Carreras", "time": 1397236842436, "rating": 4.0, "text": "Excellent experience-friendly & courteous. Easy to work with.", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "104474460738333955404", "name": "J. Casper", "time": 1411584110648, "rating": 5.0, "text": "We really like our cellular shades & vertical blinds that were installed in 2012. We have noticed a significant decrease in our power bill since they were installed.", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "102663306755810225207", "name": "A Google User", "time": 1408985676306, "rating": 5.0, "text": "I could not be more pleased with my shutters. The store was recommend by a friend and from the first phone call to the day they were installed everything was very professional", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "101581036909569694638", "name": "Tracy Duncan", "time": 1549735947415, "rating": 1.0, "text": "Horrible customer relations.", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "116629525244195226316", "name": "Franklin Rodgers", "time": 1625177253561, "rating": 5.0, "text": "Awesome prices,great service! Good people to deal with.", "pics": null, "resp": null, "gmap_id": "0x88928e09fb5f7259:0xa7a7dce6e13e79e"}
{"user_id": "110220622157826258644", "name": "Walter Boles", "time": 1619042516063, "rating": 5.0, "text": "These guys are too notch! Barry has been has been just awesome to work with on a couple of very large orders A real southern straight shooter..", "pics": null, "resp": {"time": 1619090663795, "text": "Thank you for your review, we are glad you chose The Woodpile for  your building supply needs."}, "gmap_id": "0x88928e09fb5f7259:0xa7a7dce6e13e79e"}
{"user_id": "110849376021120076813", "name": "King Lewis", "time": 1616544440737, "rating": 5.0, "text": "If you want quality and great service, stop on by Woodpile, the only place you need to go for all your home and construction needs.", "pics": null, "resp": null, "gmap_id": "0x88928e09fb5f7259:0xa7a7dce6e13e79e"}
{"user_id": "113691790290732294030", "name": "Ronald French", "time": 1610145791198, "rating": 5.0, "text": "This place is awesome. They have a very good selection of lumber that you can't find @ the big box stores.", "pics": null, "resp": {"time": 1611770092707, "text": "Thank you"}, "gmap_id": "0x88928e09fb5f7259:0xa7a7dce6e13e79e"}
{"user_id": "115341424443815165799", "name": "Jason Tew", "time": 1621956522425, "rating": 4.0, "text": "Nice and helpful staff and great products.", "pics": null, "resp": null, "gmap_id": "0x88928e09fb5f7259:0xa7a7dce6e13e79e"}
{"user_id": "108013064810673936606", "name": "Mark Smith", "time": 1568472748344, "rating": 5.0, "text": "Awesome place, costumer service is excelent!!\nPrices are really good.. And most important thing, construction material is always delivered on time.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM8_91EV7TdjWKPwxalD-gnM1QDpzuwnyq_wp3U=w150-h150-k-no-p"]}], "resp": {"time": 1568553541689, "text": "Thank you"}, "gmap_id": "0x88928e09fb5f7259:0xa7a7dce6e13e79e"}
{"user_id": "109175185034606864577", "name": "Donna Morris", "time": 1626056365999, "rating": 5.0, "text": "They have every thing when it comes to lumber!!  Friendly staff!!", "pics": null, "resp": {"time": 1626057196377, "text": "Thank you for your review. We appreciate your business."}, "gmap_id": "0x88928e09fb5f7259:0xa7a7dce6e13e79e"}
{"user_id": "111736966986419234890", "name": "Tami Smith", "time": 1568472411938, "rating": 5.0, "text": "Great Company, recommend to anyone building or remodiling.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP-YM98ZRr7jrna2so8c4Cc-VMWJfI4Qehd4AOz=w150-h150-k-no-p"]}], "resp": {"time": 1568553569072, "text": "We are so happy for your feedback"}, "gmap_id": "0x88928e09fb5f7259:0xa7a7dce6e13e79e"}
{"user_id": "102623498723362258312", "name": "Edgar Alcantar", "time": 1575987508456, "rating": 5.0, "text": "Almost anything you can look forward to home repairs and new construction, visit us and you wil not regret", "pics": null, "resp": null, "gmap_id": "0x88928e09fb5f7259:0xa7a7dce6e13e79e"}
{"user_id": "110316305573707005724", "name": "LD Henderson", "time": 1532140505005, "rating": 5.0, "text": "They have some really nice cedar grill tables. People are really friendly there.", "pics": null, "resp": null, "gmap_id": "0x88928e09fb5f7259:0xa7a7dce6e13e79e"}
{"user_id": "108096346943847105604", "name": "Tim Sowell", "time": 1580604962525, "rating": 5.0, "text": "I live in Florida and purchase all my lumber supplies from the wood pile", "pics": null, "resp": {"time": 1580597661854, "text": "We put customer experience and satisfaction as our priority, and your review reaffirms the hard work we put in every day. Our team thank you."}, "gmap_id": "0x88928e09fb5f7259:0xa7a7dce6e13e79e"}
{"user_id": "101610343214816881360", "name": "Paul Meyers", "time": 1517455665488, "rating": 4.0, "text": "Interesting place.  Helpful staff.", "pics": null, "resp": null, "gmap_id": "0x88928e09fb5f7259:0xa7a7dce6e13e79e"}
{"user_id": "115873338945682249226", "name": "Sharon Vickers Hoefle", "time": 1593523769480, "rating": 4.0, "text": "Awesome service", "pics": null, "resp": null, "gmap_id": "0x88928e09fb5f7259:0xa7a7dce6e13e79e"}
{"user_id": "107543237499568514148", "name": "Brandon Whitlock", "time": 1532534007853, "rating": 2.0, "text": "Waste of time. Very limited inventory. Appears almost everything has to be ordered.", "pics": null, "resp": {"time": 1532639396348, "text": "I'm sorry to hear about your bad experience. One of our strengths is being able to get the customer exactly what they need and a lot of the time, that requires special orders. We'd love to hear from you again on how we can assist you on you project!"}, "gmap_id": "0x88928e09fb5f7259:0xa7a7dce6e13e79e"}
{"user_id": "105568490170226719519", "name": "Aunt Mimi", "time": 1524759617183, "rating": 5.0, "text": "Awesome deal on siding and windows!  Hap & Pete were great, and their crew did a wonerful job!  They also insulated my grandmothers house years ago!  I would recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4e3448aa6c81:0xcc22dc6f0806813"}
{"user_id": "109192686395650606095", "name": "Brian Kelly", "time": 1624465649507, "rating": 5.0, "text": "These folks are the best. Incredibly professional, prompt, and excellent work. Great prices. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888923b7ad0ad35d:0xd117371d3673aaad"}
{"user_id": "108172209452434339858", "name": "Cindi Glenn", "time": 1599587530375, "rating": 2.0, "text": "They were hired to move large mirrors from one location to another.  Told me it would not be a problem.  Once they started putting them up one fell off the wall!  They then told me that they could not put the rest of them up.  They only accomplished putting up 4 out of 15.  They wanted to charge me full price but I refused to pay.", "pics": null, "resp": null, "gmap_id": "0x888923b7ad0ad35d:0xd117371d3673aaad"}
{"user_id": "107980621283781275502", "name": "Ryan Turner", "time": 1605733442683, "rating": 4.0, "text": "Over the Mountain did a great job once we got them out to our house.  Make sure you speak to the installers and not the people answering the phones", "pics": null, "resp": null, "gmap_id": "0x888923b7ad0ad35d:0xd117371d3673aaad"}
{"user_id": "105212769982257353663", "name": "Eugene Jackson", "time": 1617916436045, "rating": 5.0, "text": "Great place to buy glass", "pics": null, "resp": null, "gmap_id": "0x888923b7ad0ad35d:0xd117371d3673aaad"}
{"user_id": "107528720521465974050", "name": "Trent Daniels", "time": 1515636360405, "rating": 5.0, "text": "Excellent service! My glass shelf to the China cabinet unfortunately broken during transportation and Over the Mtn Glass were able to replace it within 2 weeks", "pics": null, "resp": null, "gmap_id": "0x888923b7ad0ad35d:0xd117371d3673aaad"}
{"user_id": "109925254215265127109", "name": "Tom Rodgers", "time": 1487266452960, "rating": 5.0, "text": "I have done business with OTM glass for years. Great Company.", "pics": null, "resp": null, "gmap_id": "0x888923b7ad0ad35d:0xd117371d3673aaad"}
{"user_id": "100044781463716624485", "name": "Rob Hoffman", "time": 1487893602482, "rating": 5.0, "text": "Awesome company. Has always taken care of me.", "pics": null, "resp": null, "gmap_id": "0x888923b7ad0ad35d:0xd117371d3673aaad"}
{"user_id": "102733428738990854533", "name": "wittmsv", "time": 1566156582545, "rating": 5.0, "text": "Fair prices, great employees", "pics": null, "resp": null, "gmap_id": "0x888923b7ad0ad35d:0xd117371d3673aaad"}
{"user_id": "106546890135595227962", "name": "Meagan McCoy", "time": 1621007054677, "rating": 5.0, "text": "I have been working with the Shoals team for over 5 years now and would highly recommend them to anyone who is need of their products, materials or guidance. This family-owned business has customer service that is second to none and I always feel like a part of their family, not just a customer. They have an incredible amount of knowledge and expertise and I will be a customer for life!", "pics": null, "resp": null, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "103215618110960779750", "name": "Denise Smith", "time": 1620959826033, "rating": 5.0, "text": "Very knowledgeable and efficient. Friendly and very neat. Did a great job with the glass. I will gladly refer Shoals Products with my friends and family.", "pics": null, "resp": null, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "112446450564593222965", "name": "Cliff Camp", "time": 1602446641196, "rating": 5.0, "text": "This place has the best customer service I have ever experienced. My order was made clear to me that I had no questions at all. My order came and everything was exactly as we discussed. They will have my business for now on above anywhere else.", "pics": null, "resp": {"time": 1602466511437, "text": "Thank you so much for the kind review.  We truly appreciate your business."}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "112983484975577828709", "name": "steven skipworth", "time": 1603163195770, "rating": 5.0, "text": "The whole Shoals Products team is very knowledgeable and helpful in all aspects of their products. For over 20 years there is one thing that has kept me as a dedicated customer and that is integrity.  Those little things that don't normally show up in a business plan are the things that keep a persons trust. Thanks Shoals Products.", "pics": null, "resp": {"time": 1603239670070, "text": "Thank you for the positive review"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "107021533492402846214", "name": "Namc Namc", "time": 1602809452521, "rating": 5.0, "text": "Excellent customer service!  It is rare these days to find a business that treats their customers like friends and family.  Very knowledgeable about their products and offer great advice that is only available from someone who has been in business a long time.  I will be a repeat customer.", "pics": null, "resp": {"time": 1618410985683, "text": "Thank you so much! We appreciate you!"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "106505367360382739803", "name": "Bo Bryan", "time": 1595979299969, "rating": 5.0, "text": "I’ve been knowing Jon and Joanna for close to 20 years and they have been wonderful customers and friends of mine. They do a great job representing the products I have sold them over the years as well as the many others they sell. Give them a call in Muscle Shoals, AL for your building product needs.", "pics": null, "resp": {"time": 1596043313539, "text": "Thanks Bo! We appreciate all you do for us!"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "108448178669215630315", "name": "Patrick Burt", "time": 1611674302395, "rating": 5.0, "text": "They are always able to get what I need great job.", "pics": null, "resp": {"time": 1611680378990, "text": "Thank you Patrick for the review.   We appreciate it."}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "111141376434810730593", "name": "Bodie W", "time": 1620926373915, "rating": 5.0, "text": "If you need vinyl siding, soffit or shutters this is the place to go.", "pics": null, "resp": {"time": 1620929691607, "text": "Thanks you Bodie.  Been a pleasure"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "112515674951620640289", "name": "Julian Burgos", "time": 1602809947155, "rating": 5.0, "text": "I love the awesome customer service , also following they have a amazing delivery service. I have used all there products for my remodels and new projects . There’s supply’s are high quality and I recommend to anyone that needs supply’s for  there projects .", "pics": null, "resp": {"time": 1603239693340, "text": "Thank you for the positive review"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "114674377527404725857", "name": "Chuck Cabaniss", "time": 1591838809343, "rating": 5.0, "text": "My brother and I have been dealing and buying products from Shoals Products for a while now. John, Joanna, Scott, Joe, and Jerica have always taken good care of us with whatever we needed. We have dealt with a lot of different siding wholesalers through out the years, and you will not find anyone else out there in the business that will treat you as well as Shoals Products does.", "pics": null, "resp": {"time": 1591843936502, "text": "Thank you so much Chuck and Tony! We appreciate y'all!"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "103172276836626563083", "name": "Amy Aldridge", "time": 1595780521371, "rating": 5.0, "text": "Wonderful experience buying windows from Shoals Products.  Highly recommend anyone to use them.  You will not be disappointed.", "pics": null, "resp": {"time": 1595785840917, "text": "Thank you so much for 5 star review"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "109170174665012928386", "name": "Randall Aycock", "time": 1602808797467, "rating": 5.0, "text": "Great products and great people. Give them a call.", "pics": null, "resp": null, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "108913091645352938828", "name": "Elizabeth B", "time": 1595800396046, "rating": 5.0, "text": "This is a awesome place to do business for all your remodeling needs on your home or for a new house being built the people running shoals products are very knowledgeable and experienced at being professional in a very honest and timely manner would recommend them over and over", "pics": null, "resp": {"time": 1595859176827, "text": "Thank you so much for the kind review."}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "115368318386379244797", "name": "Amanda B.", "time": 1595787808520, "rating": 5.0, "text": "Great family company! Jon, Joanna, and all the staff are top notch...great people, professional, helpful and very nice to work with each and every time!", "pics": null, "resp": {"time": 1595859198652, "text": "Thank you for your review Amanda"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "107012859147802113294", "name": "Bradley Oswalt", "time": 1595640331624, "rating": 5.0, "text": "Great people and very knowledgeable within the building industry. Would highly recommend.", "pics": null, "resp": {"time": 1595644082403, "text": "Thank you Bradley.  We appreciate you too buddy"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "110942177031983373470", "name": "Charles Milligan", "time": 1586183909270, "rating": 5.0, "text": "I've been doing business with Shoals Products for several years now. It's great to work with a family owned business that cares so much about what they do and their customers. Every experience/interaction has been great!", "pics": null, "resp": {"time": 1588812133128, "text": "Thank you Charles.  We appreciate you as well!"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "108722331692963799767", "name": "Russell Allen", "time": 1595781759334, "rating": 5.0, "text": "Jon and Joanna are a pleasure to work with.  They are very helpful and sell excellent products at great prices.   Thank you both for all you do!!", "pics": null, "resp": {"time": 1595785815484, "text": "Thank you Russell.  We appreciate all you do as well!"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "112088738116024289739", "name": "Scott Goodwin", "time": 1595780278696, "rating": 5.0, "text": "Great people to do business with , deliveries on time when I need them and always ready and willing to help you find and get the materials you need for any job.", "pics": null, "resp": {"time": 1595785886512, "text": "You are a good customer and we really appreciate you too Scott"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "110216897868561250299", "name": "Tami Bragwell", "time": 1595709921655, "rating": 5.0, "text": "Friendly,clean,very helpful with any questions I might have about their products or any of my future projects 🙂", "pics": null, "resp": {"time": 1596043182974, "text": "Thank you for your kind review! We appreciate you!"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "112705685720548128028", "name": "Bryan Russell", "time": 1595640861203, "rating": 5.0, "text": "This is the best place to buy all you vinyl siding and accessories\nThe have windows that I use I have had I like alot very good product\nJohn Johanna Scott Jerica and Joe are the best\nI have been doing business with them for years\nThey take care of you give them a call and see for yourself  you won't be disappointed", "pics": null, "resp": {"time": 1595644285728, "text": "Thank you very much for the 5 star review.  We really appreciate you as well."}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "117091958435064004960", "name": "Dirtman82", "time": 1597332824782, "rating": 5.0, "text": "Jon and Joanna are great to deal with and even better that they are locally owned and operated.", "pics": null, "resp": {"time": 1597338236228, "text": "Thank you very much for the review.  We really appreciate your business"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "110657507806673821786", "name": "Chris Springer", "time": 1595786176104, "rating": 5.0, "text": "Very friendly group, always have what I need at fair price, looking forward to going  back", "pics": null, "resp": {"time": 1595786281470, "text": "Thank you Chris.  You are a great customer and I greatly appreciate it."}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "100119898063872587397", "name": "Billy Griggs", "time": 1595719008892, "rating": 5.0, "text": "Shoals products is a great place to deal with John and all the guys there and ladies are very good at what they do they will give you gray service with a great product thank you John", "pics": null, "resp": {"time": 1595785904948, "text": "Thank you Billy"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "112534039291618503490", "name": "William King", "time": 1595640151786, "rating": 5.0, "text": "The owners and staff are always so helpful and easy to work with. This is our go to place for all of our projects!", "pics": null, "resp": {"time": 1595644151113, "text": "Thank you very much.  We certainly appreciate your business!"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "114172610536193585881", "name": "Keith Brooks", "time": 1518113363452, "rating": 5.0, "text": "Jon and the staff always comes through. We appreciate their selection, pricing and being willing to go the extra mile. Always a pleasure to deal with them.", "pics": null, "resp": {"time": 1518114339470, "text": "Thank you Keith!"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "106778461991727651058", "name": "Bernice Whitehead", "time": 1581859985788, "rating": 5.0, "text": "Great prices and everyone is very helpful.", "pics": null, "resp": {"time": 1581866420414, "text": "Thank you very much for the 5 star review!"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "116530958100534215908", "name": "Patrick M", "time": 1525997361867, "rating": 5.0, "text": "Jon is great to do business with and is very helpful. I truly appreciate the knowledge and help offered.", "pics": null, "resp": {"time": 1526049779074, "text": "Thanks Patrick!"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "110675609817496062460", "name": "Lisa Rice", "time": 1583204532847, "rating": 5.0, "text": "Very nice staff.", "pics": null, "resp": {"time": 1583252768136, "text": "Thank you so much for the nice review.  If we can be any help in the future please dont hesitate to contact us!"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "104122993802698590004", "name": "Scott Cain", "time": 1595639698103, "rating": 5.0, "text": "Great customer service, great prices and variety.", "pics": null, "resp": null, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "104963809872982897877", "name": "Lynn Grissom", "time": 1502189514303, "rating": 5.0, "text": "Very helpful. Great prices, quality products.", "pics": null, "resp": {"time": 1502202549147, "text": "Thank you for your kind words!"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "114337764267774807305", "name": "Joshua McIlroy", "time": 1500249978688, "rating": 5.0, "text": "Great customer service and great siding!", "pics": null, "resp": null, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "110078893604048578924", "name": "jianzhi cai", "time": 1500386546814, "rating": 5.0, "text": "Great customer service. Owner Very friendly", "pics": null, "resp": {"time": 1500387157503, "text": "Thank you for your business Jackie! We enjoyed working with you!"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "115574327072192181431", "name": "Randal Fuller", "time": 1499780959973, "rating": 5.0, "text": "Great people to do business with.", "pics": null, "resp": null, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "101337563195374108953", "name": "Susan Jones", "time": 1540914013772, "rating": 5.0, "text": "Great folks to work with!", "pics": null, "resp": {"time": 1540914839389, "text": "Thank you so much for the review!"}, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "108787853030308762602", "name": "Linda Norton", "time": 1498572421912, "rating": 5.0, "text": "Excellent Service!", "pics": null, "resp": null, "gmap_id": "0x887d49293d510b1f:0x458e905727e76516"}
{"user_id": "115934760171166026130", "name": "Amanda Ackman", "time": 1617170026427, "rating": 2.0, "text": "They were not very helpful or knowledgeable about their products. I have a custom job and budget is unlimited and they still tried to get me to just purchase generic floor models. I was given a phone number and told to leave and call that number to discuss further. However, the number I was given was to a person who was sitting in the office while I was there. I didn't understand why I couldn't speak to him when I could see him just sitting there. We are remodeling 1800 square feet and adding on an additional 2-3000 square feet. They lost a huge sale and future business.\n\nIn response to their comment:\nYes, this is the correct business. My information was not written down. I was given a base quote and told that it did not reflect actual prices. I took my business to Townsend and they sat down with me immediately and were able to give us exactly what we wanted.", "pics": null, "resp": {"time": 1617138123733, "text": "Amanda, we apologize for your experience. It seems you may have posted this review for the incorrect company. We have also been unable to locate you in our system. If we are mistaken, please reach out to us at (334) 794-6369 so we may provide further assistance."}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "101203960845586789190", "name": "Terri Hutto", "time": 1622559200298, "rating": 5.0, "text": "Great service and excellent installation.  Very professional installers and all old windows were removed. Would definitely recommend Window World for purchase and installation.", "pics": null, "resp": {"time": 1622585978280, "text": "Hi Terri! Thank you for sharing your feedback with us! We're happy you had a great experience with Window World. Please let us know if you need anything in the future. Have a great day!"}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "101151522345172608809", "name": "John Robinson", "time": 1620077050515, "rating": 4.0, "text": "No complaints about this business. Easy to work with and knowledgeable about their products.", "pics": null, "resp": {"time": 1620165179489, "text": "Thanks for the great review, John! So glad you had a great experience with us."}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "117011317652411621803", "name": "Genevieve Lanham", "time": 1605821485958, "rating": 5.0, "text": "I dealt with Mike & Mikey - they were both very courteous and professional. I have nothing but good things to say about my experience with this company. They were clean, punctual, and very polite - and my new windows look fantastic! I would recommend these guys to anyone in the market for new windows! My neighbor was even impressed enough that he came over and asked about a future project! =) Thanks, Window World. Thanks, Mike and Mikey!\n\n- Genevieve Lanham", "pics": null, "resp": {"time": 1605824767171, "text": "Hi, Genevieve! We appreciate your taking the time to do this review. We will always work hard to meet your expectations, and glad we did. Our team will always be here if you ever need anything in the future. Thank you for the recommendation, and trust in our company. Hope you have a great day!"}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "107232028450468495542", "name": "Gary MARDEN", "time": 1614361106282, "rating": 5.0, "text": "Once they items were produced, quick and seemless installation. Great windows for our lake front home. I would recommend them for any home.", "pics": null, "resp": {"time": 1614461014333, "text": "Thanks for the great review, Gary! We're glad you are satisfied with your windows and installation. If there is anything we can assist with in the future, don't hesitate to reach out!"}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "107432549504248274707", "name": "Jamal Thomas", "time": 1621529418924, "rating": 5.0, "text": "Quick and easy unload. Less than 10minutes", "pics": null, "resp": {"time": 1621556841592, "text": "Thank you for the kind words, Jamal! We appreciate you! Have a wonderful day."}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "106253501606834697595", "name": "Lisa Proctor", "time": 1615828929493, "rating": 5.0, "text": "My installer was very  affiliated and respectful the windows  saved me money on the  electric bill", "pics": null, "resp": {"time": 1615845049196, "text": "Lisa, we're so glad you had a great experience with installation. Happy to hear you are enjoying your new windows! Please let us know if there is anything we can help with in the future."}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "102821976466060401735", "name": "clarissa brown", "time": 1605113344877, "rating": 5.0, "text": "Even though it took months to receive my window. I was extremely happy to get my window install. My installer was very professional and courtesy.  He cleaned up his materials and made sure the window was wiped down. Great Guy.", "pics": null, "resp": {"time": 1605811091301, "text": "We appreciate your patience during these unprecedented times. We apologize for the delay but are pleased to know that you are satisfied with the final product, Clarissa. Thank you for entrusting our company with your home improvement needs! Enjoy your day."}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "110597215778972765149", "name": "Sally Thompson", "time": 1616872308193, "rating": 5.0, "text": "They were great & did a very good job!!", "pics": null, "resp": {"time": 1616893599109, "text": "Sally, we are so glad you are happy with the job. Please let us know if we can assist in any way!"}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "106528430400765384126", "name": "Linda Jones", "time": 1592155111101, "rating": 5.0, "text": "The installers were on time and did an awesome job.  Completely cleaned up everything and were very professional and friendly.  I love these windows and would highly recommend!!!   Great Job by all!!!", "pics": null, "resp": {"time": 1592413030111, "text": "Linda, thank you for taking the time to do this review! We are glad that you are satisfied with our product and service. Our team will be here for you if there is anything you need in the future."}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "116602002248768883103", "name": "Michael Ramsey", "time": 1593006465938, "rating": 5.0, "text": "I was very impressed with the whole process. Professional and competent. Would recommend!", "pics": null, "resp": {"time": 1593014785850, "text": "These are the reviews we love to read, Michael. We are delighted to know that you were left \"impressed\" and are satisfied with your experience.  We appreciate your trust and recommendation. Have a great day!"}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "101498683932278961635", "name": "Chase McClellan", "time": 1591910142073, "rating": 1.0, "text": "I was initially very satisfied with this company. But after we ordered a flange for our windows that needed to be installed due to the remodel of our home, we were questioned as to why we needed it to continue. And we’re also told that because of covid19 it was back ordered for 8 weeks but as soon as they got it in they would be out the next to install. And it’s been at the plant for a week know and nobody has come to install. Very disappointed with the end result. Hopefully nobody else will have the problems my family has had.", "pics": null, "resp": {"time": 1590260500623, "text": "Thanks for the great rating Chase!"}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "113682695189299784246", "name": "Mike Cee", "time": 1568757458296, "rating": 5.0, "text": "Window World of Dothan just finished up doing the rest of our windows.  We had some done earlier this year, and the rest of the windows done today.  Both times I was extremely pleased with the entire process, from sales to installation.  Great professionalism, excellent service, and all around wonderful people to work with.\n\nWe did have one issue with a pane that the seal failed on.  That's a real test of the warranty, and I was very pleased with how easy it was to get it corrected.  Small issues happen, what really counts is how they're handled.  Window World of Dothan made the process of get it replaced so easy-one quick email and it was done.\n\nKudos to the entire team at Window World of Dothan.  You folks are great, and I have no problem recommending you.", "pics": null, "resp": {"time": 1576599600250, "text": "Thanks Mike. Appreciate your business and taking the time to do this review. Apologies for any inconvenience, but happy that you are satisfied with the final product."}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "103807360235985118981", "name": "C. Gatlin", "time": 1578617837641, "rating": 1.0, "text": "If I could give Window World of Dothan, AL a -100, I would.  I would NEVER refer them to anyone nor EVER use them again.  They are the absolute worst in customer service.  The salesperson is the face of the company and that’s about as good as it gets.   It is difficult to contact them by phone and when you do no one is ever around who has any answers.  The receptionist or answering service must always get back to you, and usually never the same day.  I don’t know the criteria for Window World being ranked as the #1 replacement company in America, but it can’t be based on any contributions from Window World of Dothan, AL, at least not for doors and shutters.\n\nWe contracted with Window World of Dothan, AL on 1 Oct 2019 for 10 sets of outdoor shutters and a front door.  The install should have only taken a day. The install began on 16 Nov in the late afternoon and still has not been completed as of today, 9 Jan 2020.  The individual sent to install the shutters and door obviously didn’t care about the job because the quality of the installs were substandard.  We tried to give him space and let him do his job, but that was a mistake because when we looked closer at the tall shutters they were installed with only 4 pegs instead of 6 (industry standard) and did not place the pegs uniformly (symmetrically) into the mortar, some directly into the brick.  When asked if 4 pegs was a Window World standard, he said it didn't matter.  We also asked if he filled the old holes and he stated \"some\",  which we knew meant \"none\". His defense was to say there were lots of holes in our house.\n\nThe installer completed the haphazard shutter install and departed because it started to drizzle and he didn't want the caulking to get wet. He was supposed to return the next day (Friday) to install the door.  He sent a text on Friday to say he was still on a job in GA and wouldn't arrive until the afternoon. We responded that we didn't like afternoon appointments because he would be rushing the door install the same way he rushed the shutter install and make more mistakes.  He agreed to return the following day in the morning.  Meanwhile, my wife attempted to call Window World, Dothan several times to ask about the standards for shutter installation but no one ever called her back.\n\nAs he was installing the door on Saturday, we let him know the door was not square in the frame.  His ongoing response was to tell us that our house was the reason the door wasn't straight. Once the install was complete we continued to let him know we were not satisfied with the way the door looked in the frame.  As he prepared to install the storm door, he realized the frame had to be shimmed and stated he would return on Sunday to finish the job.  When he returned at 9am we told him that the thresh hold needed to be adjusted more because we could see car lights under the door and feel the cold air. He appeared a little agitated. He became more agitated when my wife asked \"hypothetically\" what would happen if we wanted to discuss the possibility of getting another door. He then said he could fix the door.  My wife asked him if that was the case why he hadn't fixed it in the first place.  He proceeded to tell my wife that she complained about the shutters and every little thing about the door. He then stopped what he was doing and left the storm door uninstalled.  He told her that day was his last day at Window World so he didn't care if we complained.\n\nMy wife called Window World the following Monday  and asked to speak to the owner.  Instead of being contacted by the owner, the salesman was sent for damage control.  He stated he would have the shutters reordered and expedited.  Another installer was sent to correct the door install.  He made some additional adjustments that helped but was still not the quality of install we expected.  It is currently 9 Jan 2020 and we have not heard from Window World about the shutters or the fact that we are extremely DISSATISFIED customers.  Their lack of care, concern, and communication speaks volumes about the organization.", "pics": null, "resp": {"time": 1578694241397, "text": "Mr. Gatlin, we appreciate the time spent sharing this information with us. There are several items mentioned in your comments that we are not clear on from our previous communications with you. We would appreciate the opportunity to discuss in more detail, as well as give you an update on the shutters we reordered for you. Management will reach out to you promptly to discuss. Regards."}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "109655233816015216892", "name": "Thelma Devita", "time": 1587755571785, "rating": 5.0, "text": "From the sales people, to the installers, everything exceeded my expectations.    I love the windows!  I have, and will continue to refer  this business to anyone needing new windows.  Extremely pleased.", "pics": null, "resp": {"time": 1590260348112, "text": "We love reading reviews like this, Thelma. We are happy to know that your expectations were exceeded. We take provide in the product and services we provide. Thank you for the recommendation."}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "100362642875045215979", "name": "A. Welsh", "time": 1561131795647, "rating": 5.0, "text": "Really great experience\nCame on time and seemed to be really organized in the way the crew carried out each task.  Each person had a task and did it with minimum supervision.  Cleaned up after themselves as they moved from window to window.  Explained how to operate the different functions of the window features and answered all questions we had.  Really had a good experience.  Good crew!!!", "pics": null, "resp": {"time": 1576599788645, "text": "Thank you for your feedback!"}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "116512779145610368529", "name": "Leila McBrearty", "time": 1599836950703, "rating": 5.0, "text": "Excellent job. Nice installer.", "pics": null, "resp": {"time": 1600012686159, "text": "Thanks for the great review, Leila! We're so happy you had a great experience. Please let us know if we can assist in any other way!"}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "112058861584842139313", "name": "Jon Rogers", "time": 1604338481931, "rating": 5.0, "text": "Friendly people with great service", "pics": null, "resp": {"time": 1604598519281, "text": "Thanks for the great review, Jon! We're so happy you had a great experience."}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "102141919291436094639", "name": "B B", "time": 1565202601518, "rating": 5.0, "text": "Window world did a great job, was done, in spite of having to respond to unexpected difficulty, in 3.5 days.  They put me on the schedule in just 3 weeks, way ahead of the competition, and my home is much prettier and cooler temperature wise than ever before!", "pics": null, "resp": {"time": 1576599863584, "text": "Hi! Appreciate the feedback! Apologies for any inconvenience, but glad we were able to work through the issue. Please let us know if you need anything."}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "105030429211880590746", "name": "Warren Bowron", "time": 1501192235650, "rating": 5.0, "text": "We were very pleased with both product and service from Window World. The windows that were installed were of excellent quality and have vastly improved both beauty and value of our home. The gentlemen who installed the windows were punctual and professional at all times. They were focused during installation, cleaned both inside and outside the work areas, and very thorough in explains how to use and clean our windows. They also made sure we had all warranty papers and understood them all including who and how to contact if there were ever and problems with the windows. The entire experience was a pleasure!", "pics": null, "resp": {"time": 1576672463306, "text": "Thank you, Warren, for taking the time to do this review! We are glad that you are satisfied with our product and service. Our team will be here for you if there is anything you need in the future."}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "105250703784957589685", "name": "Scott Chisling", "time": 1564091892365, "rating": 1.0, "text": "Didn't arrive after waiting for two weeks for an appointment to get a quote for 23 windows. I even confirmed the appointment two days prior. Took time off work to be there at the agreed upon and verified time. Got phone call at the time of the appointment and was told...\"sorry we can't make it today\".  You couldn't call an hour before and let me know so I didn't leave work and waste vacation time? Complete amateur hour stuff right there. I'll take my 23 windows replacement job elsewhere where they understand the use of calendars, watches and value their customer's time.", "pics": null, "resp": {"time": 1564100362364, "text": "Hi Mr. Chisling,\nSorry for the inconvenience we may have caused today. We take a lot of pride in being prompt and professional.  Our salesman had vehicle troubles that caused a delay in arriving on time.  I'm sorry you were not notified sooner than 15 minutes prior to your appointment.  The issue has been addressed and the office will reach out for rescheduling an appointment at your convenience."}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "112914533773306124065", "name": "Chucky Duncan", "time": 1519424420598, "rating": 5.0, "text": "Pleasure to do business with Window World of Dothan. Their crew arrived on time and performed their work professionally. They finished the demolition and installation of our windows in one day. Quality windows with a great warranty! Will do business with them again in the future.", "pics": null, "resp": {"time": 1552518849382, "text": "Hi Chucky. Thank you so much for the review! We take pride in our warranty and as the largest window replacement company in the country, we will be there for you if you need us. We look forward to helping you with any future home improvement needs you may have."}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "109889863661147167121", "name": "Alex Brown", "time": 1569253805808, "rating": 5.0, "text": "Window world did a great job. I would recommend them to anyone", "pics": null, "resp": {"time": 1576599557414, "text": "We appreciate the recommendation. Thanks Alex!"}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "101374285224356531103", "name": "Kristi Irving", "time": 1497657979858, "rating": 4.0, "text": "We've had windows put in twice. They're a little pricey. Overall I am pleased. The two gentlemen were very professional. The only snags were minor. The first set of windows I waited well over the 3 weeks, I finally ended up calling them and they forgot to call me to schedule installation.  The other one is the workers scratched one window ledge and left a mess by the pool. The first time they cleaned up so the second time I didn't check, so it is my fault. Otherwise very pleased. Great product, the installation crew were super nice!", "pics": null, "resp": {"time": 1576672770343, "text": "Thanks, Kristi, for the review and returning to our company for your home improvement needs. We apologize for any inconvenience. We are delighted to know that the installers were were professional and you are happy with our product. We value you as a customer. Thank you."}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "100355332761089276432", "name": "Mike Jaynes", "time": 1542232140337, "rating": 1.0, "text": "They may not have account in my name but I was the one Jimmy came and showed windows too, got estimate on vinyl siding and they don’t even say hi when they pull up, I am the one who got them the job, Don’t Use Window World, make this time they won’t call someone and complain for me to take it down, I won’t refer anyone else to use them. The day that Hurricane Michael hit one of the new windows fell out we called they didn’t come then Jimmy said next day and I text him to make sure he was coming, cause he told us he would be there but was really late and when he arrived first thing he did was cuss me asking (what the hell you mean texting me,) I said you told us you would be here, bottom line is this these folks are so ruid Jimmy, Matt if you got a problem after install no customer service what so ever, there is better out there", "pics": null, "resp": null, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "110037206281837451041", "name": "Nate Trav", "time": 1375717447555, "rating": 5.0, "text": "Excellent service, I can't express that enough. Even when their factory produced a window size 1/4 of an inch off, they stayed on the order until it was corrected.  Timely install and even after 1 year it is still the best investment in my home yet.  I love the way they look and the quaility is great. I wish I could find more contractors for other jobs as good as them.", "pics": null, "resp": {"time": 1576672836625, "text": "Thanks for your feedback. We appreciate it greatly!"}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "115549142995977593367", "name": "Richard McLendon", "time": 1507970780796, "rating": 1.0, "text": "I had them come out 2 weeks ago to take measurements for a sunroom. I was told to expect a call in a couple days. I haven't heard from them since. So much for customer service.", "pics": null, "resp": {"time": 1552519222454, "text": "Richard, we apologize for any inconvenience and appreciate your feedback and have made many changes over the years (including but not limited to staff/management) and hope that you will consider Window World for any future home improvement needs you may have. Thank you."}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "112413937629933553227", "name": "Seth Nicholson", "time": 1572385026216, "rating": 5.0, "text": "Amazing Window, Door, and Siding company.", "pics": null, "resp": {"time": 1576599514581, "text": "Thank you Seth."}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "105733388436860450549", "name": "Linda Wallace", "time": 1506541176287, "rating": 5.0, "text": "On time, very professional and the end result is beautiful\n.", "pics": null, "resp": {"time": 1552519442019, "text": "Thank you Linda for taking the time to do this review! We are glad that you are satisfied with our product and service. Our team will be here for you if there is anything you need in the future."}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "104337895694388003054", "name": "Eric Hepperle", "time": 1506994709724, "rating": 5.0, "text": "Matt and Marcus were great, and the windows look fantastic!", "pics": null, "resp": {"time": 1552519300112, "text": "Hi Eric. We appreciate your kind words. Thank you so much for taking the time to do this review!"}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "102911907788768859763", "name": "Paul Flowers", "time": 1572111549793, "rating": 5.0, "text": "Great job.", "pics": null, "resp": {"time": 1576599535382, "text": "We appreciate it Paul"}, "gmap_id": "0x88928d9e43da28cb:0x6dd7909854de52d5"}
{"user_id": "107586037038275947232", "name": "Timothy Davis", "time": 1623949878530, "rating": 1.0, "text": "TERRIBLE service it took me one month to get my glass installed. I paid up front I had to actually go up there to the building again to get them to get the window in. Not once gave me a phone call while waiting. And the lady at the front desk told me numerous of lies. She told me she called my customer when in fact I tried to call the customer at the same time and their phone was going straight to voicemail because she work at night. I would never use them again", "pics": null, "resp": null, "gmap_id": "0x888e817750483063:0xb9b797b22a11c779"}
{"user_id": "104266976473818613796", "name": "Randy Garmon", "time": 1607715052664, "rating": 5.0, "text": "I have been doing business with Best Glass for years and have never been disappointed. The name says it all. If you need glass work look no further.", "pics": null, "resp": null, "gmap_id": "0x888e817750483063:0xb9b797b22a11c779"}
{"user_id": "105538990660393038971", "name": "Robert McGhee", "time": 1609195584889, "rating": 5.0, "text": "I went there to get a replacement window for my house.  The glass was a pretty good size and reasonably priced.", "pics": null, "resp": null, "gmap_id": "0x888e817750483063:0xb9b797b22a11c779"}
{"user_id": "115928157017755116860", "name": "Sue Boehmler", "time": 1603336760722, "rating": 5.0, "text": "Showed up exactly on time. Professional and knownable. Did a great job. Would use again any time.", "pics": null, "resp": null, "gmap_id": "0x888e817750483063:0xb9b797b22a11c779"}
{"user_id": "110968764955975868983", "name": "DONNA GRAY", "time": 1603600223737, "rating": 5.0, "text": "Everyone very friendly and prices good too! Thank you!", "pics": null, "resp": null, "gmap_id": "0x888e817750483063:0xb9b797b22a11c779"}
{"user_id": "109237759506826784326", "name": "james dixon", "time": 1605889491533, "rating": 5.0, "text": "Great service....i recommend BEST GLASS CO", "pics": null, "resp": null, "gmap_id": "0x888e817750483063:0xb9b797b22a11c779"}
{"user_id": "113284162629942450866", "name": "Tommy8mbnhb Thu Hz Mcgough", "time": 1624673083870, "rating": 5.0, "text": "They the best", "pics": null, "resp": null, "gmap_id": "0x888e817750483063:0xb9b797b22a11c779"}
{"user_id": "113112958524111028929", "name": "Nicole McCants", "time": 1625020146876, "rating": 5.0, "text": "Amazing!! Excellent customer service!!!", "pics": null, "resp": null, "gmap_id": "0x888e817750483063:0xb9b797b22a11c779"}
{"user_id": "116409898539455151915", "name": "chad bennington", "time": 1575761760517, "rating": 5.0, "text": "Called for a price on cutting a big piece of glass it was ready same day . Nice people", "pics": null, "resp": null, "gmap_id": "0x888e817750483063:0xb9b797b22a11c779"}
{"user_id": "106419380877817152846", "name": "Jeffrey Jones", "time": 1577247179895, "rating": 5.0, "text": "Excellent work and reasonable prices. Would recommend them.", "pics": null, "resp": null, "gmap_id": "0x888e817750483063:0xb9b797b22a11c779"}
{"user_id": "118099519590204730539", "name": "jdc", "time": 1534858081489, "rating": 5.0, "text": "Great service, fast, helpful.  I value service, so will definitely use them again for glass needs, big and small.  Price for service was very competitive too!  Very glad I found them.", "pics": null, "resp": null, "gmap_id": "0x888e817750483063:0xb9b797b22a11c779"}
{"user_id": "100806269955765328925", "name": "Autumn Griffith", "time": 1592159072934, "rating": 2.0, "text": "They dont fix aquariums. They mostly just fix windows.", "pics": null, "resp": null, "gmap_id": "0x888e817750483063:0xb9b797b22a11c779"}
{"user_id": "111075934081158151315", "name": "Sumr Carter", "time": 1548684550705, "rating": 5.0, "text": "Professional glass installation,  residential, commercial,  mirrors, showers! It's truly BEST GLASS COMPANY!!", "pics": null, "resp": null, "gmap_id": "0x888e817750483063:0xb9b797b22a11c779"}
{"user_id": "102858254333988564179", "name": "Michael Trimble", "time": 1526670561458, "rating": 5.0, "text": "Replacement pane for an exterior lighting fixture. Quick, friendly, high-quality work. Thanks!", "pics": null, "resp": null, "gmap_id": "0x888e817750483063:0xb9b797b22a11c779"}
{"user_id": "112571818525426033914", "name": "Davnwhit Goodwin", "time": 1480658406948, "rating": 4.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x888e817750483063:0xb9b797b22a11c779"}
{"user_id": "103378604934309790815", "name": "Claire Clune", "time": 1602094444315, "rating": 1.0, "text": "We were given a 5 week timeline for installation. After taking a half down payment ($3100) we haven’t heard back. After 7 weeks, my husband called a few times before they bothered to answer, saying they have no way of knowing when the windows will be done. It’s been 9.5 weeks now and no one will answer my calls or return them. I certainly understand delays are sometimes out of our control, but it is absolutely unacceptable that they are not staying in communication with us. A simple call with ‘so sorry, still in production!’ would go a long way here! I will absolutely not be recommending this company to anyone else. I welcome window depot to try to reply to this post; might be the only way I can get in communication with them. I will update if we ever hear back or get our windows installed.\n\nUPDATE: Finally did receive a call back (After leaving messages last Wednesday and then again today) and they seemed more than a little peeved I expressed that I was unhappy with their lack of communication. Regardless of COVID as an excuse for slow production, communication of the delay should have been a given.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
{"user_id": "103281940355097742566", "name": "Joseph Carton", "time": 1484258483861, "rating": 1.0, "text": "Ordered windows on 7/30/16, install date was 10/11/16. Windows came in with internal grids that were not even, screens missing or damaged, one window measured wrong, installers damaged tube in master bath, windows in living room came with no grid. As of 1/12/17, still waiting them to finished installation. Very hard to give a good rating based on this service they provided.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNqnzqmJVYxbbIPuseWcb3fMkzzpHQlb4e1S9Qx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOHsY2K1L33y4K3bMHdb6iJtj4V46ZAe3PreR4P=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPGGgL8zEoMbjeZLuU2_Y6iOL1GeFM4mQ5F9Ej4=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
{"user_id": "117807943614443149322", "name": "Dominique Ponder", "time": 1603296674000, "rating": 1.0, "text": "Wouldn't recommend anyone to use this company. We paid a deposit on our windows on June 1st, we were told it would be 8 to 10 weeks before they were installed. Called after 10 weeks  told the production company had delays. I had to call multiple times to find out this information. Never once did they call to inform me about any delay. So I waited another 4 weeks and called back. Got the same run around. Called back 2 to 3 weeks later and told them that they had a couple of days to figure something out or we would seek legal action. Miraculously a few days later they called with a confirmed ship date. The windows finally shipped and we had an appointment for install the next week. So TOTAL time from paying deposit to install was 19 weeks and 5 days.\n\nAfter they installed the windows and my wife paid them, I get home from work to see trash in the driveway and the yard. I call Zach the owner and told him about the issue. Luckily they hadn't left town yet and were able to come back and clean up their mess.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
{"user_id": "108549765126962472556", "name": "Jason Hunter", "time": 1535347860580, "rating": 5.0, "text": "I'm extremely glad that I chose Window Depot to replace my windows. The customer service from Bill  the salesman a retiree was an honest straight shooter. He did not try to sale you anything that you did not need. Zach the installer took really good measurements. He also explained in details how the windows would be installed and he answered all questions. Saving the best for last is Josh and Mike. The are the actually installers. Words cannot express about there workmanship. This is the best two man crew I have seen. They showed up on time ready to work. They did not take any lunch breaks except water breaks. They also explained the how's and why's of how they had to install the windows. On top of that Josh also fix my Doors from some previous installers. They are extremely detailed and the work can speak for itself. On a scale of 0-10 I would give them a 10 and recommend them. I will be calling them for future work if they can do it.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
{"user_id": "100919254530584997605", "name": "Kelly", "time": 1540384129917, "rating": 5.0, "text": "We are very pleased with the windows we had installed by Window Depot. We were given lots of information and helpful advice on finding the perfect windows for our project. The installation crew was incredibly courteous and went above and beyond with getting a date set for our windows to go up .If you're rearching companies in the area for your next home project, no need to look further. Go with this company.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
{"user_id": "102242320992876172972", "name": "Pavlos Honderich", "time": 1513643169337, "rating": 5.0, "text": "I had 4 bids to install 16 total existing windows original to a 3 year old house.\n\nWe wanted to install 3 slider windows where we currently had a total of 4 single hung and 3 picture frames (2 sets of 2 and a set of 3 respectively).  The remainder of the single hungs would be replaced by double hungs and the 3 remaining picture frames would be replaced with picture frame windows.\n\nOnly Bill from Window Depot would listen to us and provided honest feedback some of which may have actually resulted them taking a few hundred dollars the less from us.  They also gave us an honest price since we went with our own financing.\n\nIt was the complete opposite than what we experienced with Champion who insisted on bells and whistles we didn't need or want and cost $2000 more for the same style and quality windows.  Champions sales pitch was also high stress (must sign today shtick to get special demo offer).\n\nWindow World had come recommended from a few friends but they insisted we go with double hung in all but the one picture frame over our bay window.  They insisted it would cost too much and wasn't worth it vs their recommendation for 15 double hung and 1 bay window.  Customer always knows best and Window World lost the job from the get go for that mistake.\n\nThe quality of the Window Depot installation job is also visibly much better compared to friends who have had Window World windows installed.\n\nBill in sales and Zach were great to work with.  Josh and his crew did an amazing job installing the windows.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
{"user_id": "110730501645668626104", "name": "Jo Dumas", "time": 1524002057503, "rating": 5.0, "text": "Thank you Josh and Mike for installing our new windows! Really good job!! Love them! Thanks for clearing up everything and helping me take down the blind brackets!", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
{"user_id": "102171617803775214912", "name": "Donna Smith", "time": 1487465432840, "rating": 3.0, "text": "Had one window installed, the person who installed very nice, although he installed a damaged screen which I saw and he had to replace it. The inside of the window looks nice but outside appearance did not meet my standards. Contacted owner regarding the issues but  not all were resolved. I have contracted with another window company to finish the project and install the remaining 7 windows.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
{"user_id": "113731716665582127811", "name": "Billy White", "time": 1509769284864, "rating": 5.0, "text": "I dealt with Bill, Zack, and Josh and one other I think his name was Matt.  They were all very polite and helpful.  They did the job on time and as promised.  11/1/2017.  I had 4 windows replaced and plan to have more replaced in the future.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
{"user_id": "113054961893537445624", "name": "Sam Woodson", "time": 1532557293621, "rating": 4.0, "text": "New Vinyl Replacement Windows installed May 2013, it's over 5 years now and they are holding up well.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0x1d2354ad7eeb8af0"}
{"user_id": "101135209554618744620", "name": "Kenneth Thompson", "time": 1619023939391, "rating": 5.0, "text": "Haven't received service from them yet I am waiting on my order to come but I can say they are nice people", "pics": null, "resp": null, "gmap_id": "0x888e80c86bacbd23:0x16cc264e6782ede1"}
{"user_id": "110791558222859983398", "name": "Kim Hyde", "time": 1415760057667, "rating": 5.0, "text": "I needed some hardware for a door.  They were very helpful and had the product that I needed on hand.  Their business was easy to find and their service was phenomenal.  I will use them again!!", "pics": null, "resp": null, "gmap_id": "0x888e80c86bacbd23:0x16cc264e6782ede1"}
{"user_id": "105351505182726690601", "name": "cherlyn burney", "time": 1461025362378, "rating": 5.0, "text": "Awesome customer service. Very satisfied with Windows.  Thanks Ladies.", "pics": null, "resp": null, "gmap_id": "0x888e80c86bacbd23:0x16cc264e6782ede1"}
{"user_id": "101215247249615343710", "name": "Jason McDuffie", "time": 1605811136100, "rating": 5.0, "text": "Everyone there was Amazing! Great service, Great Prices!", "pics": null, "resp": null, "gmap_id": "0x8886030b549b11f1:0xad3ed144c5600d9e"}
{"user_id": "117654766782531718314", "name": "Ben Carithers", "time": 1511494746365, "rating": 5.0, "text": "I need one piece of wood for a shelf & they went above & beyond to pick through all the wood to find me a perfect board. Exceptional people & unbelievably friendly. Go there for your lumber needs...you won't regret it! 👍", "pics": null, "resp": null, "gmap_id": "0x8886030b549b11f1:0xad3ed144c5600d9e"}
{"user_id": "103710907784512209776", "name": "Wiley Mallett", "time": 1608347894444, "rating": 4.0, "text": "Professional fast", "pics": null, "resp": null, "gmap_id": "0x8886030b549b11f1:0xad3ed144c5600d9e"}
{"user_id": "105960177676128801349", "name": "Trenton Smith", "time": 1490798900829, "rating": 5.0, "text": "Great service! Customer service was better than anyone in town!", "pics": null, "resp": null, "gmap_id": "0x8886030b549b11f1:0xad3ed144c5600d9e"}
{"user_id": "106161860194550644685", "name": "LeRoy Perkins", "time": 1554851101728, "rating": 4.0, "text": "Kind of tight turning into the yard with a tractor and trailer, but lots of turning room once inside!", "pics": null, "resp": null, "gmap_id": "0x8886030b549b11f1:0xad3ed144c5600d9e"}
{"user_id": "116385531531207291766", "name": "Michael Clark", "time": 1495641649728, "rating": 5.0, "text": "Lumber place", "pics": null, "resp": null, "gmap_id": "0x8886030b549b11f1:0xad3ed144c5600d9e"}
{"user_id": "113731338336410509361", "name": "Jason Odom", "time": 1603119876837, "rating": 5.0, "text": "If your looking for glass replacement or just a really nice company to work with, Mobile Glass in Mobile, Al. is your place. I had a window that needed repair for a while and I started calling around. The only people that didn’t try to sale me on a complete window replacement was Mobile Glass. They asked the right questions and within a few days I had a quote and they ordered just the replacement glass for my window. They saved me a lot of money and the service guy, DeAngelo was super nice, on time and very professional. Make sure to put these guys on your short list. Job well done.", "pics": null, "resp": null, "gmap_id": "0x889a4d84cf328fc9:0x8af6989db9a99655"}
{"user_id": "108642134360776862145", "name": "Tim Caldwell", "time": 1614518234321, "rating": 5.0, "text": "Great customer service.  Excellent to work with.", "pics": null, "resp": null, "gmap_id": "0x889a4d84cf328fc9:0x8af6989db9a99655"}
{"user_id": "105898448160325739884", "name": "Ronnie Tolle", "time": 1596893886817, "rating": 5.0, "text": "I had a total of 26 window panes replaced by Mobile Glass. Pepper, and other office staff was easy to work with, returned calls or emails in a timely manner. The installers (Marvin and Ty) were on time, professional and knowledgeable. I highly recommend Mobile Glass, I would use them again. Plus they were the lowest estimate.", "pics": null, "resp": null, "gmap_id": "0x889a4d84cf328fc9:0x8af6989db9a99655"}
{"user_id": "109608649472186928322", "name": "annette wigley", "time": 1606318651103, "rating": 1.0, "text": "I called to have a window replaced & they replaced it didn’t come back & clean up the awful job they did on caulking it. So made another appointment for they to come out & clean it up for Tuesday Nov 24, 2020 never heard from them. They took the plexiglass that was in the window that cost us $175.00 that wasn’t broken without asking. So when I called & complained to the manager over the residential department he acted like it was my fault for not requesting for them not to take it (why not ask before taking something that wasn’t broken). Very unprofessional. I paid in full in advance before they ever came out. I guess because they have their money they don’t care anymore. A VERY UNHAPPY CUSTOMER. I’ll never use them again.", "pics": null, "resp": null, "gmap_id": "0x889a4d84cf328fc9:0x8af6989db9a99655"}
{"user_id": "103699326359330609546", "name": "John Waldron", "time": 1568320179597, "rating": 5.0, "text": "The seals on most of my homes windows was broken and condensation was between the glass. I called 3-local companies and looked at new replacement windows and replacement glass. I received multiple quotes and selected Mobile Glass for replacement glass. Marvin came out measured and we ordered 40 windows. Kaitlin arranged installation following 3-weeks lead time to have the glass made. Marvin and Trey came for the installation, but due to a manufacturing snafu, 7-peices of glass were not on the truck, and they had to come back several days later to finish the job. Pepper, an owner, told me he would get the remaining glass installed promptly and he did. The job was completed to my satisfaction at the original price (which was already a great price). Kudos to Mobile Glass (specifically Pepper, Kaitlin, Marvin, and Trey) for a job well done at the contracted price. I highly recommend Mobile Glass for quality, price, and customer service. Their staff was very professional and pleasant from start to finish.", "pics": null, "resp": null, "gmap_id": "0x889a4d84cf328fc9:0x8af6989db9a99655"}
{"user_id": "107266812729688089896", "name": "Betty Harris", "time": 1546529446547, "rating": 5.0, "text": "Needed a mirror repaired.  My experience with them was wonderful.  To my surprise there was even a date on the back of the mirror which dated 10-29-89.  The technician pointed this out and said that this was when the mirror was made.  Interesting information.  We didn’t notice that it was a date.", "pics": null, "resp": null, "gmap_id": "0x889a4d84cf328fc9:0x8af6989db9a99655"}
{"user_id": "104344282291357155962", "name": "Daniel Nunyabidness", "time": 1614052198693, "rating": 4.0, "text": "Pretty helpful", "pics": null, "resp": null, "gmap_id": "0x889a4d84cf328fc9:0x8af6989db9a99655"}
{"user_id": "101428996052235132775", "name": "Guy Etherton", "time": 1583434598912, "rating": 5.0, "text": "Great service and quality work! Will use them again if needed and definitely recommend them!", "pics": null, "resp": null, "gmap_id": "0x889a4d84cf328fc9:0x8af6989db9a99655"}
{"user_id": "106664130349559312876", "name": "Stuart Luckie", "time": 1553956214615, "rating": 5.0, "text": "Best glass company in Mobile. Knowledgeable, professional staff that gets the job right the first time  I highly recommend them", "pics": null, "resp": null, "gmap_id": "0x889a4d84cf328fc9:0x8af6989db9a99655"}
{"user_id": "101539777611793326877", "name": "OBrien Holcombe", "time": 1501351979779, "rating": 5.0, "text": "Nice people, quality glass work...see what they can do for your project, you will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x889a4d84cf328fc9:0x8af6989db9a99655"}
{"user_id": "111533291840126646543", "name": "Bubba", "time": 1589423928987, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x889a4d84cf328fc9:0x8af6989db9a99655"}
{"user_id": "111790379873424495818", "name": "Maria Rodriguez", "time": 1565274398141, "rating": 1.0, "text": "Ray the owner was the worst ever very rude and unprofessional", "pics": null, "resp": null, "gmap_id": "0x889a4d84cf328fc9:0x8af6989db9a99655"}
{"user_id": "115653135515121508936", "name": "Tiffany Bailey", "time": 1530025919627, "rating": 5.0, "text": "Good quality work gunranteed", "pics": null, "resp": null, "gmap_id": "0x889a4d84cf328fc9:0x8af6989db9a99655"}
{"user_id": "101388163860192522148", "name": "One_day_ At_a_Time", "time": 1593380097725, "rating": 5.0, "text": "Precise", "pics": null, "resp": null, "gmap_id": "0x889a4d84cf328fc9:0x8af6989db9a99655"}
{"user_id": "104592313304392161206", "name": "Tonae Garth", "time": 1607124673023, "rating": 5.0, "text": "I was extremely impressed with the service. Cory got the order right the first time. He also remember my first and last name on the account from 3 weeks ago. You just can't  find this type of service alot these day. Everything from the materials being delivered on time to the material I over ordered and returned, the ladies in the accounting department were super nice and they double checked everything on the credit back. I just can't say enough about the service and that's why City Lumber Home Center and Lumberyard # 2 get 5 stars. Will be doing business with you again. Thank you and GOD BLESS.", "pics": null, "resp": {"time": 1610484453719, "text": "Thanks!  Corey does a great job for us and we appreciate you."}, "gmap_id": "0x88626c8e3e5b4385:0x354aa426c390b9ca"}
{"user_id": "109693932334411395117", "name": "Gene Roop", "time": 1595196660048, "rating": 5.0, "text": "Great people. Sent an email on a Sunday afternoon, not during business hours, expecting a response possibly Monday or Tuesday to get an answer on availability for a particular type of siding and where I might could find it. I received an email back not only on a Sunday, but within two hours of sending this email I received a email back with detailed information. Not only did I learn that that particular siding was no longer produced by the manufacturer, I was offered advise and the name of a salesman to call Monday morning to see if they couldn't find something that would work for me. Excellent customer service!!", "pics": null, "resp": {"time": 1595211514166, "text": "Gene, we are delighted to help anytime we can and are thankful for your kind words.  People like you, suporting local small businesses, is what keeps us going!"}, "gmap_id": "0x88626c8e3e5b4385:0x354aa426c390b9ca"}
{"user_id": "104269271619220366733", "name": "C. Anne", "time": 1566581070185, "rating": 5.0, "text": "Amazing customer service.   Jason and Dylan went out of their way to help me out.  Even better every time I’ve been at the shop EVERYONE was so nice and never made me feel uncomfortable because I don’t know a lot about lumber.  I love supporting a local business, makes it even easier when they have superior products and service.", "pics": null, "resp": {"time": 1566584548999, "text": "Thank you so much!  I wish more people realized we help more than just contractors and builders.  Thank you for entrusting us to help and I'm proud of my team for making your experience one worth bragging about.  Thanks again :)"}, "gmap_id": "0x88626c8e3e5b4385:0x354aa426c390b9ca"}
{"user_id": "100844168270025705898", "name": "Allen catdaddy V", "time": 1574864511534, "rating": 1.0, "text": "Absolutely terrible customer service. I called 11/20/19 to get a lumber package delivered to save some time. I knew it would be a bit more expensive but more convenient. Delivery was quick and early 11/21/19 unfortunately delivery is at wrong address 100 yards from where it should be and about 15 boards were incorrect. Still no biggie just let them know and I would think it would be taken care of. First call was 8:40 am. Left a message for Dino with another salesman and on his cell phone. Second call was about 12:30 pm, third call was at 3:00 I was told he was still with a customer. I asked the person on the phone to please tell him so that I could hear him answer I needed a call back today, and he did. 3:30 pm Dino calls I explain 15 boards were to be pressure treated and the delivery was in the wrong spot (address) I was then argued with that I didn’t order pressure treated I wrote down the prices quoted and if it wasn’t p.t it was expensive white wood. He put me on hold when he came back to the phone he said the contractor that came in and paid told him the location. I explained it was all done over the phone and there was only me. Where he described is exactly where I told him to put it. Unfortunately that’s not where it was put. He said he would call me back and get it straightened out. No call back, so 11/22/19 I called and left a message with a nice young lady for the sales manager.(I was told his name is Jason).No call back!! I go to see if the package has been moved that afternoon. I have pressure treated wood but package not moved. So much for convenience. Now I will have to pay someone to move the wood. Oh yeah still no call back or invoice. Never again!!\n\nUpdate, still no call. 11/27/19", "pics": null, "resp": {"time": 1574543628708, "text": "The pictures of the delivery show the load to be at the end of the gravel driveway by the barn and the exact material delivered that was paid for on the ticket.  I'll find out more info on Monday and be in touch."}, "gmap_id": "0x88626c8e3e5b4385:0x354aa426c390b9ca"}
{"user_id": "101154750842049384014", "name": "Shane Parsons", "time": 1593194249214, "rating": 5.0, "text": "Great place to get what you need to build your dream home.", "pics": null, "resp": {"time": 1593199786906, "text": "Thanks for the kind words Shane.  We do our best to be helpful and appreciate your business!"}, "gmap_id": "0x88626c8e3e5b4385:0x354aa426c390b9ca"}
{"user_id": "101017338598883415376", "name": "Gina Terry", "time": 1590692025583, "rating": 5.0, "text": "AMAZING place with an Incredible staff!!! The only place in town for all building materials, doors, windows and MORE!", "pics": null, "resp": {"time": 1590695705054, "text": "Thank you for the review!"}, "gmap_id": "0x88626c8e3e5b4385:0x354aa426c390b9ca"}
{"user_id": "117487413427209073113", "name": "Alarm Sounding", "time": 1575476950463, "rating": 1.0, "text": "These people are not responsible or reliable. I got the run around each time I contacted them.", "pics": null, "resp": {"time": 1575485758597, "text": "This is truely out of the ordinary and I'm sorry to hear this but would love to know more so we can address the issue.  The post is very generic so I don't know how to help.  Please contact me @ info@citylumberco.com"}, "gmap_id": "0x88626c8e3e5b4385:0x354aa426c390b9ca"}
{"user_id": "100695184457814741935", "name": "Melissa Robinson", "time": 1539975448016, "rating": 5.0, "text": "Very helpful sales associate, Terry. He was very informative. He was also very patient with my three children who I had to bring in with me. Looking forward to working with this local business.", "pics": null, "resp": {"time": 1539976718597, "text": "Thanks so much for coming in Melissa.  We are a family business so we love to have kids around!"}, "gmap_id": "0x88626c8e3e5b4385:0x354aa426c390b9ca"}
{"user_id": "103133007757067972151", "name": "Aaron Hearne", "time": 1466722594296, "rating": 4.0, "text": "The guys working in the shop and doing deliveries are courteous and helpful. The truck accidentally busted my water main and these guys covered the cost without argument. I would go back and give them my business again.", "pics": null, "resp": null, "gmap_id": "0x88626c8e3e5b4385:0x354aa426c390b9ca"}
{"user_id": "105521086384120684332", "name": "Ro ro", "time": 1539374626128, "rating": 5.0, "text": "Great I'm employed there we're a family not like one and you shop with us you will be family to 💯👌", "pics": null, "resp": {"time": 1539375412777, "text": "😎"}, "gmap_id": "0x88626c8e3e5b4385:0x354aa426c390b9ca"}
{"user_id": "116948115157594420554", "name": "Bryan Thornton", "time": 1504812266559, "rating": 5.0, "text": "Super helpful guys! Courteous and professional, they carry what Lowe's and Home Depot don't so if you need it they've got it!", "pics": null, "resp": {"time": 1504814468394, "text": "Thanks so much Bryan - we're thankful to be able to help!"}, "gmap_id": "0x88626c8e3e5b4385:0x354aa426c390b9ca"}
{"user_id": "106238862246323638706", "name": "Bree k", "time": 1549656949975, "rating": 5.0, "text": "Well done indeed. They took my list of needed wood and the prices I had from elsewhere and did me right👍🏻", "pics": null, "resp": {"time": 1549666615151, "text": "Thank you Bree, glad we were able to help!"}, "gmap_id": "0x88626c8e3e5b4385:0x354aa426c390b9ca"}
{"user_id": "109379172191080127472", "name": "Donald Jackson", "time": 1527779832049, "rating": 5.0, "text": "People here will do every thing possible to help you with your needs. Bigger companies could take lessons from these people.", "pics": null, "resp": {"time": 1527786065244, "text": "Donald, so proud to see this!  Thanks for your business and props to our employees."}, "gmap_id": "0x88626c8e3e5b4385:0x354aa426c390b9ca"}
{"user_id": "110670155677830347631", "name": "JT Thornton", "time": 1509969489925, "rating": 5.0, "text": "Very professional. This rating is based on 5 different times I have went and purchased materials.", "pics": null, "resp": null, "gmap_id": "0x88626c8e3e5b4385:0x354aa426c390b9ca"}
{"user_id": "101815730120320252772", "name": "Bill Fowler", "time": 1420692266830, "rating": 5.0, "text": "I can't say enough good things about City Lumber. Great people to deal with.", "pics": null, "resp": null, "gmap_id": "0x88626c8e3e5b4385:0x354aa426c390b9ca"}
{"user_id": "117380726713300987636", "name": "Shane Warfel", "time": 1539124820211, "rating": 5.0, "text": "This is where the real pros go to. Everything to build a house.", "pics": null, "resp": {"time": 1539134554136, "text": "Thanks Shane!  We strive to do our best."}, "gmap_id": "0x88626c8e3e5b4385:0x354aa426c390b9ca"}
{"user_id": "116795604468471759158", "name": "STEVE LESTER", "time": 1513114234090, "rating": 5.0, "text": "They have a wide selection of specialty building materials for almost any project", "pics": null, "resp": {"time": 1513126071478, "text": "I'm glad we can help Steve!  Thanks for the review!"}, "gmap_id": "0x88626c8e3e5b4385:0x354aa426c390b9ca"}
{"user_id": "116936110542190053177", "name": "Gary Bahm", "time": 1515688962895, "rating": 5.0, "text": "Great service business", "pics": null, "resp": {"time": 1515690528191, "text": "Thanks Gary, we always appreciate your business and the opportunity to help!"}, "gmap_id": "0x88626c8e3e5b4385:0x354aa426c390b9ca"}
{"user_id": "116936110542190053177", "name": "Gary Bahm", "time": 1515688962895, "rating": 5.0, "text": "Great service business", "pics": null, "resp": {"time": 1515690528191, "text": "Thanks Gary, we always appreciate your business and the opportunity to help!"}, "gmap_id": "0x88626c8e3e5b4385:0x354aa426c390b9ca"}
{"user_id": "116083688803434577913", "name": "Todd Hammonds", "time": 1614266139180, "rating": 5.0, "text": "Outstanding sales team. I talked to Shawn Vern mason  from the centre location looking to buy a propane heater. The one I was looking for was sold out at every retail store in Alabama that I called. He searched around and found the one I was looking for and one of the salesman drove to the Heflin location that day to pick it up. These days it's hard to find someone willing to help. I would highly recommend this place. 5 star service.", "pics": null, "resp": null, "gmap_id": "0x888a610dd648086b:0xb77d43e4128232dc"}
{"user_id": "108617854448333400966", "name": "Craig Newbold", "time": 1587574285236, "rating": 5.0, "text": "Great staff, very friendly and knowledgable.   Much better than going to the big box stores and they have a good selection.  As other state, their prices are as good or better than the big box as well.", "pics": null, "resp": null, "gmap_id": "0x888a610dd648086b:0xb77d43e4128232dc"}
{"user_id": "111048226477897532195", "name": "stanton perry", "time": 1609192957911, "rating": 5.0, "text": "Friendly service and had what I needed.", "pics": null, "resp": null, "gmap_id": "0x888a610dd648086b:0xb77d43e4128232dc"}
{"user_id": "107053069608728742171", "name": "Tom Mclemore", "time": 1593200213105, "rating": 5.0, "text": "Very friendly and helpful. Knowledgeable staff and good prices.", "pics": null, "resp": null, "gmap_id": "0x888a610dd648086b:0xb77d43e4128232dc"}
{"user_id": "117066802065240984388", "name": "Tony Jacobs", "time": 1593126812971, "rating": 4.0, "text": "Great place to deliver too, friendly, helpful, and quick", "pics": null, "resp": null, "gmap_id": "0x888a610dd648086b:0xb77d43e4128232dc"}
{"user_id": "103034432063081631766", "name": "Tom Brown", "time": 1550665009989, "rating": 5.0, "text": "Staff are great. Has everything I need. Readonable pricing. Forget the big box stores ... come here", "pics": null, "resp": null, "gmap_id": "0x888a610dd648086b:0xb77d43e4128232dc"}
{"user_id": "101102098179901056701", "name": "Abby Young", "time": 1532170382297, "rating": 5.0, "text": "Very friendly always willing to help. Love the small town atmosphere but a large selection of merchandise", "pics": null, "resp": {"time": 1532549643130, "text": "Thank you for the great review! We look forward to helping you in the future!"}, "gmap_id": "0x888a610dd648086b:0xb77d43e4128232dc"}
{"user_id": "102161606001438006957", "name": "michael mason", "time": 1548246396722, "rating": 4.0, "text": "Friendly staff and prices competitive", "pics": null, "resp": null, "gmap_id": "0x888a610dd648086b:0xb77d43e4128232dc"}
{"user_id": "102937291044867729328", "name": "B.A David", "time": 1514388528650, "rating": 5.0, "text": "All.good", "pics": null, "resp": null, "gmap_id": "0x888a610dd648086b:0xb77d43e4128232dc"}
{"user_id": "111944578718572722356", "name": "Johnathan Moore", "time": 1622777712427, "rating": 5.0, "text": "Prices are fair and great staff very knowledgeable", "pics": null, "resp": null, "gmap_id": "0x888602452322fb51:0x93b739b58e83caef"}
{"user_id": "112363550661938352786", "name": "Brian Piccolo", "time": 1582672218590, "rating": 3.0, "text": "Think these guys picked to be in a man's profession for the wrong reasons, Kind of like the village people. Everytime I go in and Ms. Terry is off, their listening to a boy George soundtrack talking about having a sleepover for everyone to watch the notebook. They do have spot on material delivery though.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN3ux-uAHwEeqHtxRd9RoToRTsKbG-tt_6xBqV0=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888602452322fb51:0x93b739b58e83caef"}
{"user_id": "116925036452703907305", "name": "Chad Stevens", "time": 1600875721309, "rating": 5.0, "text": "The best people in town to deal with for my roofing needs.  Extremely friendly and the service is the best in Tuscaloosa.  Would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x888602452322fb51:0x93b739b58e83caef"}
{"user_id": "110988803352668210134", "name": "Michael Stewart", "time": 1588615974900, "rating": 1.0, "text": "During this time when things are rough, this place refused business. Others such as Beacon and Wall Zone were more than happy to work with people.", "pics": null, "resp": null, "gmap_id": "0x888602452322fb51:0x93b739b58e83caef"}
{"user_id": "110031760815510224050", "name": "Zach Sarr", "time": 1623192141248, "rating": 5.0, "text": "Work", "pics": null, "resp": null, "gmap_id": "0x888602452322fb51:0x93b739b58e83caef"}
{"user_id": "100454804270955943258", "name": "Byron Deese", "time": 1578331540459, "rating": 5.0, "text": "Great/friendly service", "pics": null, "resp": null, "gmap_id": "0x888602452322fb51:0x93b739b58e83caef"}
{"user_id": "108821364824256278515", "name": "Cynthia Latner", "time": 1551980943845, "rating": 5.0, "text": "Alcohol... need I say more", "pics": null, "resp": null, "gmap_id": "0x888602452322fb51:0x93b739b58e83caef"}
