{"user_id": "104679082656021647590", "name": "Tina Parker", "time": 1309989620961, "rating": 5.0, "text": "Glenn installed window coverings at my office and blinds for two of my son's when they purchased their homes.  He was helpful and his price was better than going to the big box store and doing all the measuring, ordering and installing yourself.  One of the best bargains for new home owners.  He changed the look and feel of my office with updated window coverings as well.  I recommend him all the time.", "pics": null, "resp": null, "gmap_id": "0x88620e11ec21f735:0x33d818b203c803ff"}
{"user_id": "108859647785200805632", "name": "thomas dunnavant", "time": 1309987849906, "rating": 5.0, "text": "I started out wanting to install blinds on the western windows of my home to stop the sun, thought that was all i could afford...Glenn showed me the light...i was able to get beautiful blinds for my entire house and at just a little over what i expected to pay for the western windows along.   Thanks Glenn", "pics": null, "resp": null, "gmap_id": "0x88620e11ec21f735:0x33d818b203c803ff"}
{"user_id": "100806810487255197312", "name": "Robin Otte", "time": 1630417727612, "rating": 5.0, "text": "We had a great experience with Budget Blinds! We had a skylight in our bonus room that left the room WAY too bright and hot.  They went above and beyond to ensure our satisfaction. The customer service is second to none!", "pics": null, "resp": {"time": 1630430014581, "text": "Thank you for allowing us to provide your cellular shade solution. Hope you and your guests enjoy the room darkening effect. We are so grateful for your business!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "110447959062849173610", "name": "Jawan Olive Smith, Attorney", "time": 1624361284647, "rating": 5.0, "text": "Scott and his staff go above and beyond!  They sell quality products that are custom fit for the windows and have a huge selection!  Their service is impeccable. A year later after mine were installed, one of them fell.  I called Scott to look at it.  It was a problem in the construction of my property and has nothing to do with the blind installation. Scott, at no charge to me, fixed the construction defect, reinstalled the blind, and charged me nothing!   He is such a standout guy running a standout business!  Thanks Scott!  I will always use you for my window treatments!", "pics": null, "resp": {"time": 1542669363096, "text": "Thank you for the 5 star rating. You are a five star customer! Thank you!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "104232060758051464056", "name": "John Waggoner", "time": 1624212965654, "rating": 5.0, "text": "Scott is kind, thoughtful and has integrity with his work. He also does high quality work with his products and installation. The blinds we installed continue to work great. Thanks Scott!", "pics": null, "resp": {"time": 1624238277611, "text": "Thank you! It was a joy working with you. So glad you like your cellular shade -- great for energy efficiency."}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "110528638695384328760", "name": "Glenda Hodges", "time": 1616278653907, "rating": 5.0, "text": "Scott was always on time for appointments. I was shown several different products to choose from and there was no pressure from him as I made my choice. I ultimately chose shades and I am so pleased with the quality of the product.  The installer was great, what I expected to take up most of my day was completed in a short time.  I would definitely recommend this company.", "pics": null, "resp": {"time": 1616369986846, "text": "Thank you! We thoroughly enjoyed working with you and hope you enjoy the shades that complement your beautiful home."}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "110729596662943453530", "name": "Becky Robertson", "time": 1617130689310, "rating": 5.0, "text": "I am so pleased with my shutter blinds and shades. They are just beautiful!  Scott and Jonathan were very professional and helpful to me.  I highly recommend using Budget Blinds!", "pics": null, "resp": {"time": 1617133314469, "text": "Thank you so much! It was a pleasure working with you and I hope you enjoy them for a long time! Great choice on the shutters and the color of the roller shades!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "118201662897147051026", "name": "Karen M", "time": 1611026109614, "rating": 5.0, "text": "We just had blind installed, and could not be happier with end result!  Scott was the best!.....from measuring windows all the way through installation.\nHe worked with us, helping to decide which blind would be best for us, will absolutely no sales pitches or pressure!  I recommend Budget Blinds 100%!", "pics": null, "resp": {"time": 1611108214065, "text": "It was a joy working with you! Your cellular shades provide the insulation you need, then open to enhance your amazing views. We are truly grateful for the opportunity to work with you in your beautiful new home."}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "100588353604719356821", "name": "Kelley Notestone", "time": 1619656819282, "rating": 5.0, "text": "Scott was wonderful!  He made the process easy and stress free.  He was always available to answer questions and very patient.  I highly recommend Budget Blinds and Scott!!!", "pics": null, "resp": {"time": 1619718780527, "text": "Thank you so much! We loved your selections of faux woods, roller shades and woven woods in your lovely home. It was a pleasure working with you!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "116223984879432251832", "name": "Alice Murphy", "time": 1604366905423, "rating": 5.0, "text": "We needed to replace window shades in our LR/DR.  We checked several places and Scott at Budget Blinds was clearly the way to go.  They came to our house and helped us select just what we needed.  They came in quicker than expected and were installed within a few days. Everything was very professional and we highly recommend Scott at Budget Blinds. We are so pleased we are updating the kitchen next, and Scott is helping us.  Thank you for such a good experience.", "pics": null, "resp": {"time": 1604593960076, "text": "Thank you! It has been a pleasure working with you and Mr. Murphy! I hope you enjoy your shades and I look forward to working with you more!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "114148403031895722316", "name": "Pamela", "time": 1600814769605, "rating": 5.0, "text": "I recently had new window shades installed by Budget Blinds.  Scott was wonderful to work with and spent much time with me as he showed me samples and explained my options.  When the shades came in, he quickly scheduled a time to install.  I am beyond pleased with the new blinds.  They far exceed my expectations (and that’s saying a lot) and are perfect for the room.  I cannot say enough about the great customer service and quality of the product.  I highly recommend Scott at Budget Blinds to anyone looking into window treatments!\nPam Burkett\nFlorence", "pics": null, "resp": {"time": 1600878053056, "text": "Thank you for your great review! It was our pleasure to work with you! You have a beautiful home with views that are amazing! I'm glad we were able to provide what you were looking for, the privacy but opportunity to enjoy the views! Thank you again for the opportunity and it was a blessing to work with you!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "108951067336753598962", "name": "Carol Streater", "time": 1598533899508, "rating": 5.0, "text": "A few weeks who Budget Blinds of the Shoals installed plantation blinds and solar shades on 27 windows in an old family home we have renovated. I would like to commend them for their great service. They came prepared and installed them in 4 hours. Disposed of all of their trash and cleaned up after themselves. I would not hesitate to recommend them to anyone. Very pleased!!", "pics": null, "resp": {"time": 1598579533289, "text": "Thank you! It has been a pleasure to work with you and an honor to help enhance your historic family home. You have done a beautiful job on the renovation. May you enjoy the blessing of family for many years to come!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "108451332383691539291", "name": "Jordan Morgan", "time": 1598561548101, "rating": 5.0, "text": "Scott and Budget Blinds of the Shoals knocked it out of the park. Our shades are exactly what we wanted for our newly constructed home. We greatly appreciate his professionalism and prompt responses. Scott did a fantastic job helping us pick out the perfect shades. I would highly recommend them to anyone that is in the market for shades/blinds.", "pics": null, "resp": {"time": 1598580017020, "text": "Thank you, Mr. Morgan! It was a pleasure working with your family in your beautiful new home."}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "112283843090457831150", "name": "Keith Collier", "time": 1612322948540, "rating": 5.0, "text": "A great job by some great people! Professional, on time, within budget and even cleaned up ! Will be doing more business in the future!", "pics": null, "resp": {"time": 1612358114752, "text": "Thank you! I'm glad the shades took care of the sun issues for you! You have a great store and look forward to visiting more!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "108966324509390002491", "name": "Glen Doane", "time": 1610150102580, "rating": 5.0, "text": "Excellent customer service!  Ordering and installation professional!  Highly recommend!", "pics": null, "resp": {"time": 1610202603557, "text": "Thank you! It was a pleasure working with you! You have a beautiful home with beautiful views! I think the shutters add beauty to your already beautiful remodel! I hope you enjoy them a long time!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "118317294281475178752", "name": "Kristy Gist", "time": 1609786173865, "rating": 5.0, "text": "Budget Blinds of the Shoals is great to work with. Very friendly and knowledgeable of their products!", "pics": null, "resp": {"time": 1609791003260, "text": "Thank you Mrs. Gist! You have a beautiful home and it was a pleasure working with you!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "108582657745930615705", "name": "Thomas McGill", "time": 1600813203220, "rating": 5.0, "text": "Budget Blinds got the blinds for our house in a timely manner even during the Covid pandemic. They installed the blinds in a couple of hours, cleaned up before they left, and were very professional. Our house has 21 doors and windows that have blinds or shades so it was not a small job. We highly recommend this company.", "pics": null, "resp": {"time": 1600877895615, "text": "Thank you Mr. and Mrs. McGill. It was a joy to work with you both! You have a beautiful new home and we are thankful you allowed us this opportunity to be a part of your new home!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "112038141375276108263", "name": "Sierra Ginevan", "time": 1600129269114, "rating": 5.0, "text": "Excellent customer service and fantastic products.\nScott went above and beyond. I highly recommend budget blinds of the shoals!", "pics": null, "resp": {"time": 1600133428008, "text": "Thank you! We are grateful for the opportunity to work with you. Enjoy your shutters and your beautiful views."}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "112514088290715400485", "name": "Glenda Williams", "time": 1594776618479, "rating": 5.0, "text": "I am very pleased with the service that was offered. I love my blinds and I am happy I chose Budget Blinds.", "pics": null, "resp": {"time": 1594821980182, "text": "We're so happy you love your dual shade!! Thank you for the opportunity and it was a joy to work with you!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "106326631130228304613", "name": "JONATHAN PARKER", "time": 1593045600710, "rating": 5.0, "text": "Thank you for a professional job well done. We strongly recommend!", "pics": null, "resp": {"time": 1593108376139, "text": "Thank you sir. It was a privilege to work with you and Mrs. Parker! I hope you enjoy your interior shutters and you amazing new home!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "108150382972821792614", "name": "Darti Eason", "time": 1578410540167, "rating": 5.0, "text": "I was so impressed with Scott.  He was knowledgable and  seemed very experienced.  It made the selection process painless.  The installation was just as easy.  Scott and Aaron were quiet and efficient...and left no trace.  The plantation shudders are stunning!", "pics": null, "resp": {"time": 1578415242849, "text": "Thank you so much! It was our pleasure to help enhance your beautiful home with new window coverings. It was a joy to work with you and look forward to serving you again!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "115167653085298250602", "name": "Roger Mardis", "time": 1590544357127, "rating": 5.0, "text": "Scott does great work with a great product...check with him for your next job.", "pics": null, "resp": {"time": 1590584582325, "text": "Thank you Mr. Mardis! It was a pleasure to work with you. Thank you for your patience during this COVID pandemic! You have a beautiful new home, welcome back to the Shoals!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "103479278903817114537", "name": "Susan Pass", "time": 1574026055693, "rating": 5.0, "text": "I highly recommend Budget Blinds of the Shoals! Scott and Donna came to my house to help me find a thermal covering for a huge west-facing plate glass window in my 2 story foyer. Scott showed me his solar shade and how it could greatly reduce the amount of heat the window produces in the summer. He was very professional and knowledgeable, but no pressure. And it was reasonably priced. I am thrilled with the solar shade!!! He did a fantastic job of installing it...and the color matches my trim beautifully!  I also asked him about new blinds for our LR/DR...and they fit perfectly as well...they were installed in a jiffy. Very pleased and would definitely use Scott’s services again.", "pics": null, "resp": {"time": 1574038100550, "text": "It was a joy working with you and Doug on this project! Thank you for trusting Budget Blinds of the Shoals with window coverings for your beautiful home."}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "107246742670896907520", "name": "Micheal Rea", "time": 1570730480180, "rating": 5.0, "text": "Budget Blinds has excellent customer service and goes above and beyond to make sure the customer is 100 percent satisfied with their products.  Very friendly and easy to work with.  I would 100 percent recommend them to anyone.", "pics": null, "resp": {"time": 1570744624170, "text": "Thank you Mr. Rea. It has been my pleasure working with you on the Plantation Shutters, Roman Shades and future Woven Woods! Thank you again and I look forward to working with you more!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "104029690515507052446", "name": "Jo Robinson", "time": 1544545911753, "rating": 5.0, "text": "Scott with Budget Blinds of the Shoals is a true pleasure to work with.  He is honest, friendly, cooperative, and goes over and beyond his duty to make your budget work for window treatments you want.  His products are quality and guaranteed.  He will work until you are completely satisfied and will provide you with the best pricing.   I highly recommend him for any window treatments you need.", "pics": null, "resp": {"time": 1544580992675, "text": "Thank you so much Mrs. Robinson. It was great to work with you and Mr. Robinson! I'm so happy that you love your shutters and the shutters for the arches!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "115708644977551185642", "name": "Denise Retherford", "time": 1582078910428, "rating": 5.0, "text": "I am so pleased with my blinds. Scott was most professional and kept to his timeline. I would highly recommend his company!!", "pics": null, "resp": {"time": 1582161832121, "text": "You are so very kind! It was an honor to work with you! You were a blessing! It was great to be able to sit down and talk about life!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "102032903741287095190", "name": "Elizabeth Shelton", "time": 1593707921065, "rating": 5.0, "text": "I can not say enough about how scott an his staff.They were on time,professional, cleaned after they were done,but most importantly, scott made sure they were perfect. If they weren't, he took them down an started again. I am more than pleased an so so happy with my shutters.Thank you Budget Blinds!!!", "pics": null, "resp": {"time": 1594040407467, "text": "Thank you!! It was our pleasure to work with you and meet your family! I hope you enjoy your shutters and you can finish your remodel soon! THANK YOU for the Grapico!!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "106843234061663669677", "name": "Tigger R", "time": 1569799618560, "rating": 5.0, "text": "Scott was great! We love our plantation shutters. Great quality and quick installation process.", "pics": null, "resp": {"time": 1569846575614, "text": "Thank you for allowing Budget Blinds to be a part of your new home! Welcome to the area. It was our pleasure to work with you!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "110695379660150753065", "name": "Tammy Fisher", "time": 1569440299509, "rating": 5.0, "text": "Great experience from start to finish! Scott was absolutely awesome. Thank you for listening to what I  wanted.", "pics": null, "resp": {"time": 1569427263806, "text": "Thank you so much!! It was our privilege to work with you! You did an amazing job picking the color and I thought the draperies looked awesome! Thank you again, you have a beautiful home!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "115274663400397727919", "name": "dixie griffin", "time": 1594333429481, "rating": 5.0, "text": "We recently remodeled the den and kitchen area of our home. I knew I wanted shutters and blinds for the window treatments so I researched the internet.  I found Budget Blinds of the Shoals’ website so I gave Scott a call. We couldn’t be be more pleased with the end results! Our shutters and blinds gave us exactly what I wanted. I highly recommend Budget Blinds if the Shoals.", "pics": null, "resp": {"time": 1594404252296, "text": "Thank you so much, Mrs. Griffin. It was a pleasure working with you on window coverings to enhance your beautiful remodel!  Let us know when we can serve you again. Blessings to you and your family."}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "100153198076260721379", "name": "Debbie Clark", "time": 1554556481371, "rating": 5.0, "text": "Wonderful service.  Scott was so professional. So knowledge of his product. Very helpful with selection.  The shutters look great and add so much to my bedroom", "pics": null, "resp": {"time": 1554596884106, "text": "Thank you so much! You were a joy to work with and appreciate your patience. You have a BEAUTIFUL lake home!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "101752865936099779587", "name": "Richard Ingram", "time": 1568977763408, "rating": 5.0, "text": "Scott was efficient and competitive.  The installer did a neat and clean job.  We would definitively do business with them again.", "pics": null, "resp": {"time": 1568980223261, "text": "Thank you Mr. Ingram! It was our pleasure to work with you and Mrs. Ingram! You have a beautiful new home! Welcome to the Shoals!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "100990331814188210808", "name": "Kenny Gammill", "time": 1585702867937, "rating": 5.0, "text": "Scott and his team are amazing! From start to finish I was extremely pleased. The product and installation exceeded my expectations. I highly recommend Scott and Budget Blinds!", "pics": null, "resp": {"time": 1590796008876, "text": "Thank you so much, Mr. Gammill, for trusting us to provide the window coverings for your beautiful home. We truly appreciate you and your family!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "107036237154961916638", "name": "Seth Stanfield", "time": 1575670273670, "rating": 5.0, "text": "Very knowledgeable and will work closely with customer to ensure the best possible plan for installing blinds and shades. Highly recommend.", "pics": null, "resp": {"time": 1575727090018, "text": "Thank you Seth!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "104869818250775136590", "name": "Gloria Richardson", "time": 1570803411716, "rating": 5.0, "text": "Scott and Aaron were awesome. We moved from Texas and had only been in our new home once. I called Scott and he went to the house and ordered the blinds. I could not have done it better myself. I totally trusted him and he delivered. Would use them again.", "pics": null, "resp": {"time": 1570805181570, "text": "Thank you! It was my pleasure to work with you! Welcome to the Shoals and hope you love it here!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "117149808394786969202", "name": "Cam Price", "time": 1560887651557, "rating": 5.0, "text": "What was promised was done. The product is great but the service was even better. Will definitely use Scott and Budget Blinds of The Shoals for next project.", "pics": null, "resp": {"time": 1560890998202, "text": "Thank you Cam. It was great to work with you and your beautiful renovated church! I'm happy that we were able to solve the heat issue problem but not hide those beautiful stain glass windows!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "112693659010726080148", "name": "Kelly Graham", "time": 1570637919831, "rating": 5.0, "text": "Scott did a great job on our Plantation Shutters.  I highly recommend Budget Blinds of the Shoals!", "pics": null, "resp": {"time": 1570644123406, "text": "Thank you so much! It was our pleasure to work with you! Hope you enjoy the Plantation Shutters!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "108635712013319093199", "name": "Danny OToole", "time": 1560863483750, "rating": 5.0, "text": "Great service with great knowledge of all product lines and options   Really helped us decide which blind we needed in each window   Nice to deal with a company that communicates and follows up.  Highly recommend!", "pics": null, "resp": {"time": 1560864589815, "text": "Thank you Danny! It was a privilege to work with you and Becky! You have a BEAUTIFUL home and I think the shutters were a great choice!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "108689622310885570921", "name": "Alaina Anderson", "time": 1576555625899, "rating": 5.0, "text": "Great experience, very professional and I’m very happy with my bamboo shades!", "pics": null, "resp": {"time": 1576584017551, "text": "Thank you Mrs. Anderson. It was our pleasure working with you and look forward to working with you again! We're so happy you love your woven wood shades!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "114521551518191102670", "name": "Lee Lambert", "time": 1566658121933, "rating": 5.0, "text": "Scott's team really did a great job installing my blinds!  I would reccomencd them to anyone. Real professional.", "pics": null, "resp": {"time": 1566746891152, "text": "Thank you Lee! It was our pleasure!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "112077648261857904353", "name": "Carol Jones", "time": 1582139979974, "rating": 5.0, "text": "Love our new blinds at river. I would recommend Scott at budget blinds of the Shoals for all your window coverings. He was fast and very easy to work with. Can't wait till spring to start staying there. Thanks again Scott.", "pics": null, "resp": {"time": 1582220229167, "text": "You are very kind! Love you Lake Home!! The Solar shades was a great choice for you and your family. To be able to still see the beautiful views but keep the sun out! I hope you enjoy them and thank you for the opportunity to work with you!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "113412619936022911580", "name": "Allison Click", "time": 1546837625712, "rating": 5.0, "text": "Scott does a terrific job & is great to do business with. He knows his stuff! I highly recommend Scott & Budget Blinds.", "pics": null, "resp": null, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "115469340608566029954", "name": "Brooke King", "time": 1557195515965, "rating": 5.0, "text": "Scott is very professional and quick to respond. He does quality work, and I would certainly recommend calling Budget Blinds for any window treatments!", "pics": null, "resp": {"time": 1557231801371, "text": "Thank you so much! It is an honor and a pleasure to work with you, Will, Melanie and Sam!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "115728510914811849585", "name": "Steve Merry", "time": 1552934543237, "rating": 5.0, "text": "Great service.  Very personable.  Enjoyed working with them.  Very good selection of blinds to choose from.", "pics": null, "resp": {"time": 1543190804319, "text": "Thank you Mr. Merry. It was my pleasure! Thank you for choosing Budget Blinds!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "116351463595486411655", "name": "Mickey McClure", "time": 1569427061894, "rating": 5.0, "text": "Great experience, very prompt and installed on time as agreed.", "pics": null, "resp": {"time": 1569447391029, "text": "Thank you Mr. McClure! I appreciate you helping me getting started in the business and glad I was able to work with you and your mom! She is a sweetheart!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "100207699221190636064", "name": "signman Bob", "time": 1561485626383, "rating": 5.0, "text": "Outstanding service and very knowledgeable professionals.  They were very careful to cover their feet when coming into my house and did a beautiful job with the installation all around.", "pics": null, "resp": {"time": 1561487352296, "text": "Thank you so much for your review! It was our privilege to serve you!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "104824978378226527741", "name": "Shelly Stepp", "time": 1570660336267, "rating": 5.0, "text": "Scott and crew were very professional andeasy to do business with. Our school's upgrade looks amazing!", "pics": null, "resp": {"time": 1570661794264, "text": "Thank you! You, your staff and kids were so sweet and great to work with! Thank you for this opportunity and hope you enjoy the shades!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "109441850038843912764", "name": "Vanesha Mason", "time": 1569155884102, "rating": 5.0, "text": "Budget Blinds has great service and knows how to please their customers!!!", "pics": null, "resp": {"time": 1569161923027, "text": "Thank you, it was our pleasure! Enjoy your new home!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "106718705749550003098", "name": "Jennifer Berry", "time": 1554433908622, "rating": 5.0, "text": "Great customer service and products!  Would definitely use them again!", "pics": null, "resp": {"time": 1554499620440, "text": "Thank you so much! It was a pleasure working with you! Hope you enjoy them!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "112440617228680610449", "name": "Jeannie Epperson", "time": 1571759596208, "rating": 5.0, "text": "Great, friendly, professional service.", "pics": null, "resp": {"time": 1571765335509, "text": "Thank you so much! It was our pleasure and I look forward to working with you again! I hope your son enjoys his new home!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "113328786324309345035", "name": "Peggy Castenholz", "time": 1602540442140, "rating": 5.0, "text": "Highly recommend John Paul and the whole team at Island Enclosures. They were professional, timely, communicative and use high-quality materials. Always available every step of the process in creating our beautiful, outdoor screen enclosure,  built-in barbecue kitchen and installing the indoor blinds.   Enclosure withstood Sally with no damage. Definitely will use again on our next project!", "pics": null, "resp": {"time": 1602541997288, "text": "Thanks Peggy.\nYou guys are very gracious.  Thank you for being outstanding customers to work with."}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "117683184607508508493", "name": "Chase Beason", "time": 1588345900731, "rating": 5.0, "text": "Great company! I have had several projects completed by them, and I have been 100% satisfied every time. There were a couple of minor adjustments that needed to be made after the initial installation, and on both occasions, the owner, John Jones, had them corrected the very next day with absolutely no hassle. Their work is beautiful, and they will also work you in their schedule as quickly as possible if needed. The installer, Greg, is also great. I highly recommend this company for any outdoor projects you have!", "pics": null, "resp": {"time": 1588602141647, "text": "Thank you for your kind review!  We appreciate it."}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "104413765980263553441", "name": "Michael Templer", "time": 1609890663978, "rating": 5.0, "text": "Very happy with the new windows they installed. Excellent follow-up support.", "pics": null, "resp": {"time": 1609892717067, "text": "Thank you Mike.  Pleasure doing business with you!"}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "110696385860215309524", "name": "John Kendall", "time": 1599930370225, "rating": 5.0, "text": "Anything you need done these are the people to use.  Great local business that does things the right way.", "pics": null, "resp": {"time": 1599936233348, "text": "Thanks John!  You be safe out there."}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "105172896549507867595", "name": "Melody Winborne", "time": 1607526453625, "rating": 5.0, "text": "Great work", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPsQdO6VB8LwL_h7rBj64wkLZEKkLwFLtC974BG=w150-h150-k-no-p"]}], "resp": {"time": 1608655822233, "text": "Thank you!"}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "103044573418217358876", "name": "Brandi W", "time": 1553972877009, "rating": 5.0, "text": "They constructed a very nice patio, firepit, and outdoor kitchen area for us with a screen enclosure close to a year ago.  OUTSTANDING customer service.  John Paul was always available to answer any questions or concerns and the construction quality is fantastic.  Would highly recommend!", "pics": null, "resp": {"time": 1553976011769, "text": "Hi Brandi,\nThank you for your review.  It was a great pleasure to work with you.  All of at Island Enclosures, wish you and your family all the best."}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "107994520461299534215", "name": "Jackie Clark", "time": 1548534729376, "rating": 5.0, "text": "Staff was very friendly and knowledgeable. Products are top notch!", "pics": null, "resp": {"time": 1548870150070, "text": "Thank you for the review, and your repeat business!"}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "109805676566394538299", "name": "Robert Reynolds", "time": 1531922591449, "rating": 5.0, "text": "Very professional and I highly recommend. All projects started and completed on time.", "pics": null, "resp": {"time": 1531942138852, "text": "Thank you for the nice review! We look forward to working with you on future projects."}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "107843451592497126275", "name": "Ken Lyons", "time": 1628032434422, "rating": 5.0, "text": "They have a huge showroom with hundreds of flooring styles and samples.  The customer service from selecting your flooring through installation process is top notch.  I enjoyed my experience with Town & County Flooring in Troy, Al", "pics": null, "resp": null, "gmap_id": "0x888dec5f700f19fd:0x7ad9ea9f35c8c922"}
{"user_id": "107466970645316110275", "name": "Latoya Smith", "time": 1619798556188, "rating": 5.0, "text": "I highly recommend Town and Country Flooring in Troy, AL. They were very friendly and prompt. It's very rare these days that you get great customer service and awesome service! The contractors Mike and Sharon, along with their crew did a fantastic job! I love my flooring!!", "pics": null, "resp": null, "gmap_id": "0x888dec5f700f19fd:0x7ad9ea9f35c8c922"}
{"user_id": "111821342660620744638", "name": "Robert Smith", "time": 1610292091232, "rating": 5.0, "text": "You couldn't find a more pleasant and knowledgable company to deal with; don't be fooled by the size of the store.", "pics": null, "resp": null, "gmap_id": "0x888dec5f700f19fd:0x7ad9ea9f35c8c922"}
{"user_id": "113744980404744881490", "name": "Brenda Colvin-Cheathem", "time": 1570593439440, "rating": 4.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x888dec5f700f19fd:0x7ad9ea9f35c8c922"}
{"user_id": "107798750642482903192", "name": "Matt Richardson", "time": 1510084853915, "rating": 3.0, "text": "Its okay", "pics": null, "resp": null, "gmap_id": "0x889a57b6e032fb5d:0xe868435e29d9e71"}
{"user_id": "110063225943498164957", "name": "Jennifer Pearce", "time": 1623111501405, "rating": 5.0, "text": "I'm so pleased with my shutters and blinds. They are beautiful and were perfectly installed. My home feels cozy and more like home now. Thank you, Budget Blinds!😊", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "105242807437046218713", "name": "Brian Johnson", "time": 1622225095163, "rating": 5.0, "text": "Great experience once again.  Designer helped me pick out the cellulose blinds I needed to blackout my room.  The installers were on time and installed quickly and professionally.  Will use again.", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "106993416586624190429", "name": "Nancy Edwards", "time": 1623592058595, "rating": 4.0, "text": "Good service overall. Some inconsistency with ability to \"set\" desired height of shades when operating. Installation issues: One set of shades were hung unevenly & techs did not fix the problem.  Most hardware from old shades were left on th floor. Did not install hardware to retain cords.", "pics": null, "resp": {"time": 1623693193285, "text": "Hi Nancy, thank you for the generous review, given the issues you describe above. We are about to call you to get these taken care of."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "109235499176316209452", "name": "Marty Russo", "time": 1620066323314, "rating": 4.0, "text": "Some great people working there..one of a kind products. Very professional!!", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "118197390954157557612", "name": "Laurel Thomas", "time": 1599837881629, "rating": 5.0, "text": "Budget Blinds did a great job caring for my historic home!   They put up beautiful indoor shutters that go beautifully with a house built in 1908.  Upon installation they were careful with the woodwork and even though the windows are odd sizes they fit perfectly.  I need two other bedrooms done so I will definitely be calling them back when we finish painting those rooms.", "pics": null, "resp": {"time": 1600361927088, "text": "Thank you. The plantation shutters are classic. We are glad to hear they work well for you."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "104169811529090968217", "name": "Kathy Royals", "time": 1601652039636, "rating": 5.0, "text": "Dealing with Budget Blinds here in Mobile, AL was an excellent choice.  Very professional, knowledgeable about their products and friendly as well. From the beginning consulting with Donna coming to my home to the installers I give them all an A+.\nYou won't go wrong with choosing Budget Blinds.", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "105697215266454755311", "name": "Laura Perez", "time": 1593792224527, "rating": 5.0, "text": "I love my shutters from Budget Blinds! I purchased a house with a set already here and hunted down who had put them in because I loved how they looked in the bedroom already. I then wanted the same in other rooms of the house!  Glen came to house and matched the style and color so that they matched and fit perfectly. When shutters came in they sent a friendly guy out to install quickly. He worked hard and cleaned up nicely afterwards. I highly recommend!", "pics": null, "resp": {"time": 1594062819001, "text": "Thank you for the kind words. We are so happy you love the plantation shutters."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "117432455342111124105", "name": "Jim Jacobs", "time": 1599838387872, "rating": 5.0, "text": "Budget Blinds did an excellent job from start to finish. Donna helped throughout the process from measuring, ordering, and putting  up temporary shades when we needed them. The installation crew did a fantastic job installing the blinds. If you need blinds highly recommend giving Budget Blinds a call. They will take care of you.", "pics": null, "resp": {"time": 1600361714092, "text": "Thank you, Jim. It was a pleasure."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "101807759364284643517", "name": "Richard Crump", "time": 1583169739274, "rating": 5.0, "text": "It was great working with the Budget Blind team. From the initial appointment to discuss shutter options all the way through installation they were always on time and helpful. You can’t beat the quality, service, and professionalism that Glen and his team bring to the table!", "pics": null, "resp": {"time": 1584110051809, "text": "Thank you Richard. It was a pleasure working with you."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "105506481432503955386", "name": "Scout’s Awesome Channel", "time": 1583174978658, "rating": 5.0, "text": "We worked with Donna on our blinds and she was great. Super knowledgeable and professional. She gave us great advice and had samples of everything. The installation was quick and everything came in within the stated timeframes. I would highly recommend this company!", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "115067938088084911827", "name": "Sarah Stanton", "time": 1595868131375, "rating": 5.0, "text": "They are very friendly and quick. From the consultation to the installation took about two weeks to complete the project. This is the second time I’ve used budget blinds and highly recommend them!!!", "pics": null, "resp": {"time": 1600362099698, "text": "Thank you. It was a pleasure."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "103096849534184173618", "name": "Helen Inge", "time": 1601653294816, "rating": 5.0, "text": "Our recent project with Budget Blinds could not have been easier. We've used them over the years and continue to experience the same excellent professional service.", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "114616569362032656018", "name": "Iris Jackson", "time": 1593635507488, "rating": 5.0, "text": "Glenn was my sale consultant, he was very thorough in his work, he talked thru all the details of my blinds that I ordered, helped me choose the correct style of blinds for my home and made the process easy, the young man that installed my blinds was very professional and courteous, and when I had a question after ordering, someone always picked up the phone with a pleasant voice. I highly recommend this company for all your window needs.", "pics": null, "resp": {"time": 1594063605991, "text": "Thank you so Much Mrs. Jackson. We are glad you are pleased with the interior shutters. They handle arches like yours particularly well."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "117669765747809049382", "name": "Brandon Jackson", "time": 1594656472617, "rating": 5.0, "text": "Great blinds at a great price! Installer was courteous and professional, the sales consultant was helpful and easy to reach throughout the whole process.", "pics": null, "resp": {"time": 1600362213892, "text": "Thank you. It was a pleasure working with you."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "118247287391936143894", "name": "Jessica Sweeney", "time": 1595876302190, "rating": 5.0, "text": "Great customer service. Beautiful blinds. Excellent experience.", "pics": null, "resp": {"time": 1600362034534, "text": "Thank you for the kind words. We hope you are enjoying the cellular shades."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "105471312955487649028", "name": "AJ Muller", "time": 1592840777669, "rating": 5.0, "text": "Excellent product and professional installation.  We’re very happy with the blinds and shutters.", "pics": null, "resp": {"time": 1593187995723, "text": "Thank you for the review. I enjoyed working with you."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "112059471671980016966", "name": "Leslie Nelson", "time": 1591217010440, "rating": 5.0, "text": "Quality product, great team!    Thank you to Donna and the installer,  very happy with my purchase!", "pics": null, "resp": {"time": 1591371806540, "text": "Thank you for the review Leslie. We are glad to hear you are enjoying the new cordless roller shades."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "102750089811379891085", "name": "Harper Groom", "time": 1593197977443, "rating": 5.0, "text": "Great process start to finish. Would highly recommend Budget Blinds.", "pics": null, "resp": {"time": 1593613475610, "text": "Thank you so much. I hope you enjoy the shades and blinds."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "112303192095071819119", "name": "Clay Doyle", "time": 1583173681198, "rating": 5.0, "text": "Glenn and the rest of the Budget Blinds team are extremely professional. The entire process was easy and the blinds look great!", "pics": null, "resp": {"time": 1584108012141, "text": "Thank you for the kind words. I hope you enjoy the shutters."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "107068136901083212921", "name": "Paula Helmly-Parker", "time": 1592955475739, "rating": 5.0, "text": "Very helpful staff. Have not ordered blinds yet but plan to use them when ready.", "pics": null, "resp": {"time": 1593188021907, "text": "Thank you Paula. We are looking forward to working with you."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "100135601899193879757", "name": "David B", "time": 1583171563987, "rating": 5.0, "text": "Wonderful team of people. Very helpful staff and excellent work!", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "110783828943478665577", "name": "Bill Duke", "time": 1601058474694, "rating": 1.0, "text": "Made time for appointment.\nMessaged me on the day of the appointment at 6:54 in the morning and canceled. I don’t understand this kind of treatment from merchant who is trying to make money. I will not bother to use them again.", "pics": null, "resp": {"time": 1601302615689, "text": "Hi Mr. Duke I am so sorry that we found it necessary to cancel the appointment. We do not cancel appointments lightly. The appointment was scheduled by mistake as we do not offer the product you are looking for. The designer caught the error when she was reviewing her appointments for the day. As she said in her text to you, we do not offer screens. She felt it was best to let you know as soon as she had discovered the error. She used text instead of a call due to the early hour. Also, we have found text is the best way to communicate with the majority of our customers. Again, I am sorry that did not work for you. I hope you find the screens you need. If I can be of any assistance, please call the office and ask for Glen."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "107451092853362278859", "name": "Brenda Barnes", "time": 1571402513983, "rating": 5.0, "text": "Good place to shop. Excellent service.", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "104279699730317476463", "name": "Eric Droblyen", "time": 1528988914680, "rating": 5.0, "text": "Friendly and timely service.  Had a problem with a motorized blind.  Company got me a replacement ASAP!", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "100675848324794942851", "name": "JOE VERNEUILLE", "time": 1582855958049, "rating": 5.0, "text": "Very professional and efficient", "pics": null, "resp": {"time": 1582926681467, "text": "Thanks, Joe. I hope you love the new shutters."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "106292150084210782495", "name": "Leo Reed", "time": 1549051807549, "rating": 5.0, "text": "So far so good!", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "106574148164203850254", "name": "Paul Roberts", "time": 1546699896108, "rating": 5.0, "text": "Really professional staff", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "109525881319931606934", "name": "Phil Martinez", "time": 1549994845403, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "106574148164203850254", "name": "Paul Roberts", "time": 1540480312172, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x889bac15b99e25ab:0xf381eb376a90872"}
{"user_id": "103184124113136324885", "name": "Joseph Fallon", "time": 1465595259828, "rating": 5.0, "text": "(Translated by Google) Jj\n\n(Original)\nJj", "pics": null, "resp": null, "gmap_id": "0x889bac15b99e25ab:0xf381eb376a90872"}
{"user_id": "108978323745938422463", "name": "Dorothy Jensen", "time": 1616003749280, "rating": 5.0, "text": "Ray and Abe did a wonderful job installing drapery panels and plantation shutters.  This is our third purchase from Budget Blinds, and every time we have appreciated the professional and friendly service.", "pics": null, "resp": {"time": 1616007701093, "text": "Thank you so much for your kind words and continued business. We really appreciate it!"}, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "112879763318610356570", "name": "Mike Lovell", "time": 1604090077219, "rating": 5.0, "text": "We are new to the area and updating our home here in Gulf Shores. We had 4 sets of French doors that had older drapes that were past their prime. We called this company and Alex came to our home. His professionalism and knowledge of the products was very impressive. We came to an agreement on product and price which was more than fair in my opinion. Alex ordered our new shades which were all odd sizes and had to be custom cut. Our installer, Abe came out as soon as they came in and did a great job taking the old drapes down and installing our shades. This is a first class company, and I highly recommend them.", "pics": null, "resp": {"time": 1604096852664, "text": "Thank you so much for the review and choosing us for your window treatments in your home!"}, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "113476470829819000247", "name": "Robert Bois", "time": 1591969644634, "rating": 5.0, "text": "We decided on Plantation Shutters for our new construction home in Foley. We went with Budget Blinds primarily because of their very good reputation and the fact that their salesman, Alex, was so knowledgeable and he was able to guide us through many decisions we needed to make to get the end product we thought we were looking for. Naturally we had to wait a few weeks as each of our blinds needed to be custom made. However, in the mean time, Alex installed temporary blinds in our home that worked wonderfully and held us over till the day of install. The install was done by Abe and Cameron and simply put, I don't think we could have asked for anyone better in terms of skill, professionalism, and personality.  BOTTOM LINE: We simply could not be happier with the quality of the product, the install, and the LOOKS! Thank you ever most kindly Budget Blinds!", "pics": null, "resp": {"time": 1591980633718, "text": "Thank you so much for the review! We love the great team that we have and appreciate hearing your kind words. It was a pleasure installing your window treatments."}, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "111971183022862613960", "name": "Dottie Lee", "time": 1602196255418, "rating": 5.0, "text": "We love our new plantation shutters from Budget Blinds.The customer service from them is awesome.From our great salesman Alex to our great installers Abe and Dennis. They treat you like family and are so attentive to detail. Five stars!", "pics": null, "resp": {"time": 1602197627984, "text": "We are so happy you love your new shutters! Thank you for choosing us for your window treatments."}, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "115859510479911204956", "name": "Peggy Barton", "time": 1599237938766, "rating": 5.0, "text": "We had living room blinds installed by Phil and Cam.  They were awesome.  They worked hard, were very polite, punctual, and very efficient.  They both wore masks, took their shoes off on the carpet, and cleaned up afterwards.  They did an amazing job!!!!", "pics": null, "resp": {"time": 1610491795721, "text": "Thank you so much!"}, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "103852104817905771568", "name": "Mary Bynum", "time": 1596128129313, "rating": 5.0, "text": "Thanks to Budget Blinds of Baldwin County for installing all of our home window treatments! Absolutely first class service from ALL team members!\nDennis, Ray, Austin, Phil, truly represent th a \" A\" team !!! We highly recommend them, Harry & Frances B.", "pics": null, "resp": {"time": 1596217935183, "text": "Thank you so much for your review! We hope you have a great weekend."}, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "114351652274791896749", "name": "Paula Rigsby", "time": 1579877325788, "rating": 5.0, "text": "This is the second time we have used Budget Blinds.  Phil was great to work with and gave me great ideas.  The installers were here yesterday and installed shutters and shades.  They were very professional, efficient and respectful.  I highly recommend Phil and Budget Blinds!", "pics": null, "resp": {"time": 1579887589487, "text": "Thank you so much, Mrs. Rigsby!"}, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "115716086612215770047", "name": "Sheri Hines", "time": 1591640581356, "rating": 5.0, "text": "Phil was amazing! Helped us select the perfect blinds for our master bedroom with four giant windows and french doors. The finished look is beautiful and just what we wanted. The process was easy from requesting an inital visit through to installaion. Phil is friendly, courteous, communicative, timely, and most of all a joy to work with. I fully receommend Budget Blinds of Baldwin County.", "pics": null, "resp": {"time": 1591654901383, "text": "Thank you for your review! It was a pleasure working with you."}, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "113427799897744993378", "name": "Lundy Wilder", "time": 1528306168480, "rating": 5.0, "text": "Ask for Alex ! The others at Budget Blinds may be great also but I KNOW that Alex is !  I finally had my home-made goofy shades in my bedroom replaced with beautiful sleek roller shades. Alex was great at helping me find some that blocked most of the hot summer sun but allowed me to see the trees and what was going on outside. The color is a perfect match for my walls and it turned out to be the less costly line they carry, which was a bonus.\nAlex is punctual and returns calls and took my old plastic straw shades off to put in their recycle bin and he removed all packaging when he left.\nHe has a great attitude and is a pleasure to be around. Great experience all around.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "108916480485685364055", "name": "Lindsay Pileggi", "time": 1459462053500, "rating": 5.0, "text": "Budget Blinds is the best!  I was contacted within a day of submitting a Request Online through their website.  They set up an appointment with a Consultant to meet at my house.  The Consultant Phillip was on time, friendly, professional, and very knowledgeable.  He was able to go through the various options of Blinds available for purchase, and gave me comparisons on pricing and quality of each selection.  Working with Budget Blinds was the best experience.  And the best part, Pricing was not outrageous!  Why try to hunt someone down at your local hardware store?  Call Budget Blinds and let them come to you.  It's so easy!  I will be contacting them again when I'm ready to get blinds for my sun room.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "115969559339054919550", "name": "Sandy Bookout", "time": 1471005353483, "rating": 5.0, "text": "We have used Budget Blinds in Birmingham several times. So, when we moved to Gulf Shores I went in search of a Budget Blinds close by. And there they were! We have used them twice here and both times have had a wonderful experience. They are easy to schedule an appointment with and they always show up on time. The sales reps are knowledgeable  and very easy to work with. On the day of the install it was pouring down rain. They came to my door, took off their shoes, and got right to work. Wonderful team! Wonderful product. Thanks!\nSandy B.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "106204751617740061875", "name": "Sean Ferrell", "time": 1430243718909, "rating": 5.0, "text": "We have used Budget Blinds multiple times. We love the woven shades in our home so much, we decided to use their products again in our office! Val has awesome knowledge of their products, and recommended a perfect treatment for our windows in our budget! Their customer service and installation team go above and beyond with their kindness and professionalism. We will definitely use them again!", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "105164136374732045318", "name": "Jane Breaux", "time": 1492190696789, "rating": 5.0, "text": "Highly recommend BB for all your window covering needs! I really enjoyed working with highly competent design specialist Phil Duke who was able to help me select the PERFECT style of drapes and blinds without breaking my budget, and perfect installation of them too! They took plenty of time with me, no high pressure sales, and let me decide what was best for the space! I look forward to working with Phil and BB again in the future for more great blinds!", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "108713351276123815517", "name": "Chi EK", "time": 1432438845102, "rating": 5.0, "text": "Very professional and competent at their job. Our blinds were hung with the utmost care and concern. We even received hands on review on how to take care of them, removal and putting back if and when necessary. Thank you for a job well done. We would use them again.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "106395936260783352377", "name": "Rick Johnson", "time": 1507745192915, "rating": 5.0, "text": "Shopped quite a bit looking for professionalism, price, and quality.  Look no further.  Budget Blinds has a superior product and team.  Alex consulted us on the right blinds and shutters, and personally installed them.  They not only look great, they really set the look of the house off.  Hats off to Alex and the whole Budget Blind Staff!", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "108080950047668461498", "name": "Anya Babb", "time": 1551647907074, "rating": 1.0, "text": "We used them twice. The first time everything was perfect. On our second home the shutters were horrible they used a bunch of caulking that cracked and let a lot of light through. Paid nearly 6 grand and regret it.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "105609024235913540067", "name": "Darleen Hatt", "time": 1492181868874, "rating": 5.0, "text": "The solar shades are perfect and Phil Duke is a Master installer and artist if you can consider installing blinds an art as well as a science and I do.  I could not ask for a better job, nicer sun shades, or better services.  Thank you, Darleen Hatt", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "101413749227133665832", "name": "Angie Monteleone", "time": 1499368028359, "rating": 5.0, "text": "Love my new cellular shades.  This company is great, from the office, to the salesman and finally the installer.  Very friendly and professional.  I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "115983538834734122566", "name": "Patricia Cooper", "time": 1462800523847, "rating": 5.0, "text": "Excellent product and excellent service.  Installers arrived right on time and were neat and courteous.  I would definitely recommend Budget Blinds of Baldwin County.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "101527976014087757105", "name": "Ann Rasmussen", "time": 1448593852540, "rating": 5.0, "text": "The people we dealt with were very professional, knowledgable and courteous. The products we purchased- sun shades and shutters, are of a great quality. I would definitely recommend them, and Budget Blinds of Baldwin County, to anyone interested in window treatments.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "104995725109817627712", "name": "susan Storey", "time": 1484337007263, "rating": 5.0, "text": "Phil did a great job with the design, fabric choice and a professional job with the installation.  MUCH appreciated, and highly recommend Phil and Budget Blinds to anyone with window treatment needs.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "111987343138570712556", "name": "Linda “Linds” Johnson", "time": 1457121193507, "rating": 5.0, "text": "We have been very pleased with both professionalism and quality of their product.  A good value that offers a wide variety of options.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "100234288086796462534", "name": "Jeff Hosterman", "time": 1499460628449, "rating": 5.0, "text": "Solid attentiveness, advice and pricing from beginning thru install.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "108012343499434313511", "name": "lynn bobik", "time": 1527801257263, "rating": 5.0, "text": "Knowledgeable,  helpful staff.  Fair prices.", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "115925213177071478585", "name": "Christian Urbach", "time": 1428691605905, "rating": 5.0, "text": "I recently worked with Dan and Val and I couldn't have had a more pleasant experience. They were very helpful and professional throughout the whole process!", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "107127495536824660234", "name": "Annette Sebastian", "time": 1433354736483, "rating": 4.0, "text": "Installers were very professional and polite!  Thank you!", "pics": null, "resp": null, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "115761310714323636849", "name": "Linda Ericson", "time": 1628783292110, "rating": 5.0, "text": "Alex and his team are the BEST!  They have replaced all the window coverings in our home and every installation is PERFECT!  The prices are the most competitive we have found in Baldwin County.  You cannot make a mistake calling Alex for your window projects!", "pics": null, "resp": {"time": 1628785544331, "text": "Thank you so much for your kind words! It was a pleasure meeting you yesterday :) - Phil"}, "gmap_id": "0x889a053827325375:0x90689b1aa8df22b3"}
{"user_id": "106116799092457584323", "name": "Al W.", "time": 1581000747942, "rating": 5.0, "text": "i could not find any treasures in the window dug under windows no treasure big disappoint", "pics": null, "resp": null, "gmap_id": "0x888cedec59f40c45:0x184ad23349b4fc4a"}
{"user_id": "113395448725191976267", "name": "Colin Tomblin", "time": 1627145910401, "rating": 4.0, "text": "Awesome furniture and lighting. It’s a little pricey but great quality. The only downside to this location is that it is quite small with not much to see on display. There weren’t many employees available to offer assistance or answer questions. I highly recommend visiting the multi level Nashville location if you want a better experience.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO98NR2vD0Vd8308p7UDtBN_5y9nFHLylNJeHXN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOh_B7gs7SzrFjJb55MttNW3-2TxUkZ1mYL5lne=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPCl9yWzKLk0U-RQkuMvoLP3F5KBJc1q0CJ8WQJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN3AyvrAAFMjBHu4rMFza0if70L3T7jPILNAYAQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNxQK159SRAu-rUIYX-rIT_QxMm0d5BNescSmMp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNPOhJrCibtn9PmlWEl3gAyHS2TVv4dgC2vhE5i=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPHqbLTa8-4oTHYD9sdlIgTZY9HLvDtGst_6I_d=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOLoethET3gl3NoV9SUJ6U5IP0pxKEVNNvHiWdI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPFLDq2R8Rmz-6VReFkISLCiiO57pXx0L0lhSkC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO6IQh25lCNVXYssDd1EPXBXreaA8_KQLFwnNEj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMsgTNUK6lxXWAmBnnoC9s6YWirvz_ejUeGWoPG=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM2r1rS6EUnw4Ikoo_dTZ14znRZv8L2jzYl-UAP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMqOeEYWkXfy0kOPHe0TaPgtNWRaj2S7me5UyWx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNbjFuhGIqTEiEpENdsrC4-J98I9r4QN63z967r=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOsDqaXMzxUYiTfj6VtQrswSI3K-oEE-YTl6XIa=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "107224526507693509263", "name": "SantanaTyree", "time": 1601951897863, "rating": 1.0, "text": "SAVE YOURSELF THE TIME AND DO NOT GO HERE. See below:\n\nThe customer service was absolutely awful. If you are looking for a warm, inviting environment, RH at the Summit isn’t the place whatsoever. You will be completely disappointed if you receive the treatment we did. You will especially be disappointed and appalled if you had just left Bassett Furniture in Hoover where they took the time to do the following: cultivate a relationship, show you around their showroom, listen to what your needs are, and sit down to customize furniture based on your specifications. For lack of words, the feeling that my husband and I received at RH: “We are RH, our products speak for themselves, so we are not going to do our job at all. We are not going to try to educate them on our selections/options. I am not leaving my computer to assess their needs. If they want something, they’ll ask me then buy it.” The ONLY information we were given was about looking online and a RH book when we got ready to leave because I couldn’t take it any longer. Not once did the lady offer to look at fabrics with us, to go over color selections, discuss what their process was, etc. (We were wanting custom furniture for a spec home and this was stated.) When I asked a question, the response was very much short and NON-informative, I was told to look online which defeats the entire purpose of going in store. The lack of willingness to assist us has left a LASTING impression. Because of that, we are HAPPY to spend MORE elsewhere because of superb customer service. There are numerous competitors; a product can easily be mimicked, customer service can’t.", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "112757506915179676220", "name": "Vicki Dukes", "time": 1604806968634, "rating": 5.0, "text": "I had been looking for a table and chairs for my kitchen. Found what I wanted online. I wasn’t ready to order, though, without seeing it. My husband and I made the 1.5 hour trip to Bham. I had talked to Loren on the phone before I came. When we got there, Loren helped us. She was very professional and knew what she was talking about. It was a very good experience.", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "110620217594569393760", "name": "Brian Panos", "time": 1616100515985, "rating": 5.0, "text": "Nice stuff but pricey!", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "110141350351656074558", "name": "Jennifer Jones", "time": 1604379428320, "rating": 5.0, "text": "Thank God for Rebekah!! I visited RH for the first time on 10/26 during my quick little birthday getaway. This was actually my first time EVER visiting an RH store. Rebekah greeted me enthusiastically. She was so nice and personable as she engaged with me and answered any and all questions that I had. I really enjoyed chatting with her. She was very cheerful, bubbly, and helpful. I really didn't sense the same vibe from the other few associates I saw standing around in the store. The guy who greeted me at the door was also warm ams and inviting. Thank you soooo much Rebekah for being so friendly and kind!!! Little did she know, I had just lost one of my closest friends to Covid-19 who was buried just that Saturday before. So, I was out and about trying to enjoy my birthday in spite of. This was my first visit to the Summit, and Rebekah was one the best experiences I had that day. She really need to spend time over at Saks and Seasons 52 training some of the sales associates and waiters on good customer service and how to demonstrate it. God bless you Rebekah!!", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "100267936957911690744", "name": "ivo horak", "time": 1595633621321, "rating": 1.0, "text": "Bought a cloud with terrible cushions that don’t hold their fill just after a single use.   There is no way a cushion should have to be disconnected and fluffed every single time.    Now they told me that it would cost $1400 to replace them to cushions  that will hold their shape.   Extremely disappointed with a multi million dollar company that can’t remedy a simple problem.", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "116063269017392885493", "name": "Wallace Brown", "time": 1601246195756, "rating": 5.0, "text": "Excellent service and great quality.", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "110192657877984228995", "name": "Quitta Williams", "time": 1583608359545, "rating": 5.0, "text": "Really big zoo. Beautiful animals. We enjoyed it.", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "114699804228184711522", "name": "Sam Wilson", "time": 1564789947313, "rating": 5.0, "text": "Our experience at this store has been maybe the best experience we have ever had. Rebecca Howsam is incredible. She is not only a pleasure to work with, she is friendly and helpful and always puts customer first.  She has went out of her way to make sure we are happy and love our furniture - both inside furniture and outside.  Thank you Rebecca.", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "102456939053545396644", "name": "Susan Hanley", "time": 1523730312942, "rating": 1.0, "text": "If you could assign less than one star I certainly would. I just spent over 20 minutes in Restoration Hardware at the Summit waiting for someone to wait on me (or even speak to me) and obviously they do not need my business because they did not even acknowledge me although they looked over at me several times. There were three sales associates and at the very beginning they were each with someone but then one became available when her customer left and she immediately disappeared to the back of the store. Again keep in mind they all saw me and said nothing and when the sales rep  finally came back out from wherever she went, another person  walked into the store and she asked if she could help them. Wow! I wanted to purchase a king bedroom suite I saw in their catalog which would have been well over a $10k purchase but I guess they do not need my business. I’m taking it somewhere that someone will actually acknowledge you  walked into their store.", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "107596952620806414896", "name": "Peyton Preece", "time": 1510094173373, "rating": 1.0, "text": "We have spent over $15,000 in furniture from RH, live 2.5 hours away and pay over $350 for shipping each time we order or buy something. They were unwilling to replace a defective rug (they deemed it defective) and discount another rug we were willing to buy. Do yourself a favor and go elsewhere.", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "105442850663540391426", "name": "Juanita Motley", "time": 1597887031355, "rating": 5.0, "text": "Love the decor", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "118405631177379047664", "name": "Brian Robertson", "time": 1574510598611, "rating": 4.0, "text": "Very good", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "105988375084610272911", "name": "Eric Wilson", "time": 1570589851853, "rating": 5.0, "text": "Cloud couch", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "117198605546347316733", "name": "g hegenbarth", "time": 1541275838346, "rating": 4.0, "text": "Must haves and stuff", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "113629235163347046570", "name": "FAZLUR REHMAN", "time": 1570084013877, "rating": 2.0, "text": "so so", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "113886944677534831427", "name": "Karyn Bowen", "time": 1620769687735, "rating": 5.0, "text": "I am so pleased with my new shades. Donna was easy to work with and very helpful. Installation guys were pleasant and had them installed quickly. I’ve worked with them before and will definitely work with them again when the need for something else.", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "111823150342230088946", "name": "Azziza S", "time": 1620704306892, "rating": 5.0, "text": "The salesman was wonderful and so helpful.  We weren't sure exactly what we wanted and he steered us to the right choice. He could've steered us another way and made more money but the look wouldn't have been as good.\n\nThe installers were fantastic and professional.  Our new blinds look so good in our home and really set off the windows.  I'm so glad we came to this business instead of going to Lowes or Home Depot!", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "100018288749737523602", "name": "Google User", "time": 1402422213789, "rating": 5.0, "text": "My blinds and shutters were delivered and installed this week. I just wanted you to know how very pleased I am with them. They fit perfectly and the quality is outstanding. However, more than this I waned you to know how impressed I was with your installer and his assistant. He was very courteous and professional. He went out of his way to make sure I was pleased with every window. His assistant was very nice and took great care to make sure that each area they were working in was cleared of all packing material. They worked very well together as a team.\n\nBeing in the business world as long as I have makes me very appreciates of good employees and customer service. You have both.\n\nThank you again for a pleasant buying experience with your company.", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "105942597259848109953", "name": "A Google User", "time": 1398363237862, "rating": 5.0, "text": "Just a quick note to say thanks so much for the new blinds! From start to finish I had a great experience. The sales person, David, was prompt and made me feel at ease about choosing the right blinds for me. And he wasn't pushy, which I really appreciate! The blinds came in earlier than expected and the installation was less than 20 minutes. The blinds look great, thanks again!", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "115736575255568178253", "name": "Stephani Shields", "time": 1506545608646, "rating": 5.0, "text": "I can’t say enough good things about this company. Donna came out and handled everything and even recommended a plantation over 3 shades in our master bathroom and I can’t thank her enough she was soooo right! My house looks amazing and the installers were quick and precise and friendly. I will gladly recommend them anytime anyone asks. 10 stars!", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "113077487335293447631", "name": "A Google User", "time": 1395332574482, "rating": 5.0, "text": "Donna Tanory recently assisted me in choosing drapes for a guest bedroom in my home.  She was a tremendous help to me in selecting fabric and lining material and also a drapery rod.  Not only is she very knowledgeable about different fabrics, she is an absolute pleasure to work with.  I highly recommend her for all your window treatments.", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "116850906182035812098", "name": "A Google User", "time": 1403801830165, "rating": 5.0, "text": "Love Budget Blinds! Did downstairs in 2006. Called them back to finish second floor in 2014. Good Product, Good service", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "114407873212961749674", "name": "Jan Parks", "time": 1474548068228, "rating": 5.0, "text": "This was just what I wanted.  Donna came to my home,  gave me advice about my windows,  and answered all my questions. After they were ordered,  the blinds came on time and fit the space beautifully. The price was almost the same as the big box stores and maybe a little less. But it was much less hassle!", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "100726789451162744369", "name": "Google User", "time": 1410900954640, "rating": 4.0, "text": "Budget blinds is kinda like my family. I have used their services for 12 years. They are so friendly & helpful every time I call! Wonderful Service!", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "109508905244994846900", "name": "Raquel", "time": 1551902081617, "rating": 1.0, "text": "We have blinds that the builder installed when we purchased our home in 2015. One of the blinds doesn’t close all the way, so I assumed it needed to be replaced. Called this company because it was the first one to come up in google. The representative who answered the phone asked if they installed the blinds, I explained that we purchased the home with the blinds and didn’t have any information on who installed and catching up with DR Horton is like chasing a rabbit. She wanted to look up my address so I gave it to her, she says nothing came up and then she repeats again that they do not repair any one else’s blinds. Ok, so since I don’t know who, what’s wrong with charging a service charge to come repair or get a sale on new blinds. Very poor customer service and what business turns away a new paying customer.", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "115902772669523997026", "name": "A Google User", "time": 1400278122743, "rating": 5.0, "text": "I am very satisfied with the installation and the Design Consultant. They were professional and friendly. I highly recommend them-the installers and the Design Consultant", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "101951677865085550085", "name": "Alona Homann", "time": 1394225600117, "rating": 5.0, "text": "Very nice Staff!  Excellent Product!\n\nThank you David for coming to my office to match colors.", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "104925417680619572083", "name": "luke hall", "time": 1494532871955, "rating": 5.0, "text": "Donna was fantastic to work with making it easy for us to choose the right shades for our home. Highly recommend Budget Blinds.", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "107515224493543147231", "name": "Sri Sade", "time": 1393371585812, "rating": 5.0, "text": "We appreciate the prompt service and professional installation. Will definitely contact for future blinds needs", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "104439817188239777571", "name": "Stahl Carreras", "time": 1397236842436, "rating": 4.0, "text": "Excellent experience-friendly & courteous. Easy to work with.", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "104474460738333955404", "name": "J. Casper", "time": 1411584110648, "rating": 5.0, "text": "We really like our cellular shades & vertical blinds that were installed in 2012. We have noticed a significant decrease in our power bill since they were installed.", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "102663306755810225207", "name": "A Google User", "time": 1408985676306, "rating": 5.0, "text": "I could not be more pleased with my shutters. The store was recommend by a friend and from the first phone call to the day they were installed everything was very professional", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "101581036909569694638", "name": "Tracy Duncan", "time": 1549735947415, "rating": 1.0, "text": "Horrible customer relations.", "pics": null, "resp": null, "gmap_id": "0x888918d07e71600f:0x4a7363435dcaaaef"}
{"user_id": "112104576998750243011", "name": "Terry Sandlin", "time": 1497100176631, "rating": 5.0, "text": "Maria is Very creative- she creates with beautiful fabrics- easy to work with!", "pics": null, "resp": null, "gmap_id": "0x8889179d0b7867db:0xcaacadf5a2dac3d0"}
{"user_id": "112762546504838274184", "name": "David King", "time": 1549738874839, "rating": 4.0, "text": "Great shop n convenient", "pics": null, "resp": null, "gmap_id": "0x8889179d0b7867db:0xcaacadf5a2dac3d0"}
{"user_id": "114961971587198774924", "name": "Hailey Daigle", "time": 1591720997308, "rating": 5.0, "text": "This company has been around for 20+ years for a reason!\nI'd be lying if I said I didn't know the owner but guess what, when a job is done right a job is done right! Experienced crews, top-of-the-line salesmen, and amazing customer service is always their priority. Well done, Willy!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMbg1fK05-AHIyqDaw74259-JPxffvW0Ch0znCt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNjGMlFTCmKcnQMLqM_69hclNGVN1STLhseWLPu=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a0e9b0ce52ab7:0x46aca997c81351d"}
{"user_id": "115287780429283146502", "name": "kathleen LoVerde", "time": 1619716250638, "rating": 4.0, "text": "Owner very nice explained everything for us!😊", "pics": null, "resp": {"time": 1619720636792, "text": "Was great to meet you, we look forward to working together."}, "gmap_id": "0x889a0e9b0ce52ab7:0x46aca997c81351d"}
{"user_id": "106864858483819636172", "name": "Chuck Davis", "time": 1594938205842, "rating": 5.0, "text": "We had a 24’ hurricane fabric installed on our back porch this morning. The two young men (Kevin and Dillon) that installed it done a great job. The were very  professional, polite, courteous, and even vacuumed the concrete when they finished. I would definitely recommend them to anyone needing hurricane protection for their home. Great job guys👍 Thank you.", "pics": null, "resp": null, "gmap_id": "0x889a0e9b0ce52ab7:0x46aca997c81351d"}
{"user_id": "108785795092742808234", "name": "Clifford Yates", "time": 1623859868037, "rating": 5.0, "text": "Good people lot o knowledge", "pics": null, "resp": null, "gmap_id": "0x889a0e9b0ce52ab7:0x46aca997c81351d"}
{"user_id": "105504776050931202300", "name": "Matt Lovell", "time": 1562895713385, "rating": 5.0, "text": "Gulf Coast Roll-a-Way is very professional.  Willie and his team are excellent to work with and great communication.  We had an issue with one of our shutters at our condo not going back up.  They came out immediately and did a temporary fix then after the parts came in came and fixed it permanently.  These guys know their stuff!  I’d gladly recommend them to anyone.  Thanks Gulf Coast Roll-a-Way!", "pics": null, "resp": null, "gmap_id": "0x889a0e9b0ce52ab7:0x46aca997c81351d"}
{"user_id": "102339930673321943019", "name": "Erich Hebner", "time": 1561994748412, "rating": 5.0, "text": "Literally the best group of people on the Gulf coast to do business with. Would recommend to all my family and friends knowing that they will get the quality of service and the professionalism they deserve without a doubt in my mind. 10/10!!!", "pics": null, "resp": null, "gmap_id": "0x889a0e9b0ce52ab7:0x46aca997c81351d"}
{"user_id": "110181638312946656595", "name": "Tim Whitfield", "time": 1569936230556, "rating": 1.0, "text": "Called and talked with Willie the owner. Promised a service call but it never happened. This outfit is a waste of your time. The will delay your problem weeks.... ultimately putting you back to square one. Do yourself a favor and avoid!", "pics": null, "resp": null, "gmap_id": "0x889a0e9b0ce52ab7:0x46aca997c81351d"}
{"user_id": "117422247382821157714", "name": "ID360 Media", "time": 1525610303716, "rating": 5.0, "text": "These guys are the authentic Roll-a-way dealers in the area.  Top-notch service and attention to detail. They give excellent sales advice, great installation service and follow up after the sale.  Best shutter company around!", "pics": null, "resp": null, "gmap_id": "0x889a0e9b0ce52ab7:0x46aca997c81351d"}
{"user_id": "117560578500078862094", "name": "Christopher Dickhute", "time": 1618588802213, "rating": 5.0, "text": "Jonathan did a fantastic job! He is very knowledgeable about window tinting and helped me select the right film for my condo. I had the Cool Touch IR installed and I can already tell a reduction in radiant heat, which will be helpful in the summer months ahead. Would do again in a heartbeat!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN16ddyE9k67flbWzpiIVHBYg3j1PPHfqsC-JBr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMSUBR5jn14OfdX3BM72ntn_-HV2-YzcPHjz7d2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP7NFtJhzarmWaCguhDMKBc37XfwiHY50DopNWn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMdVIB0--FReHD-KiqllyY0KNCUsc9-GEVCGdeD=w150-h150-k-no-p"]}], "resp": {"time": 1619473528791, "text": "It was a pleasure working for you.  Thank you so much for the 5 star review and the positive feedback!"}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "109463666926105323019", "name": "Nicole Thomas", "time": 1627339765529, "rating": 5.0, "text": "Johnathan was very professional. The turn around and install time was very quick. The films have been working great, our house stays much cooler. Would recommend to anyone.", "pics": null, "resp": {"time": 1627576582205, "text": "Thank you.  It was a pleasure working with you guys. I appreciate you taking the time to leave this 5 star review."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "102052772769119208117", "name": "wrew were", "time": 1619468136079, "rating": 5.0, "text": "He did a wonderful job on our Turquoise Place end unit. My wife has light sensitivity and we decided to tint the windows to help with that. Johnathan was professional and polite and worked around us as we were all home. He is also a minister at a local church and just a really nice person. Our condo is now much cooler and my wife can walk around the condo without sunglasses. We will use them again for all of our tinting needs and recommend them to everyone!", "pics": null, "resp": {"time": 1619473458526, "text": "Thank you so much for your positive feedback and for taking the time to post this 5 star review. It truly was a pleasure working for you!"}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "107684513837022982864", "name": "Ken Baird", "time": 1626252079063, "rating": 5.0, "text": "I am extremely pleased with the entire process and results. We have an east end unit at Tidewater Condo that experienced radiant heat issues. There is a noticeable reduction in heat permeation through the windows and I look forward to recouping the cost of the project in reduced energy bills!", "pics": null, "resp": {"time": 1626305749451, "text": "Thank you for the 5* review. You guys were a blessing to work with."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "117087422397601147070", "name": "Alan Petitfils", "time": 1625577156844, "rating": 5.0, "text": "My Wife and I are absolutely thrilled with the work Johnathan did for us. His response time was quick and he provided quality work. He was very friendly and accommodating. I will most certainly recommend his services.", "pics": null, "resp": {"time": 1625606905561, "text": "Thank you for the 5* review.  You guys were a blessing to work with.  👍🏻"}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "103652467784328251028", "name": "Cliff Davis", "time": 1623423952761, "rating": 5.0, "text": "Awesome! Legacy came out and installed a privacy frost on an office door. Quick, professional, and all around great transaction. Highly recommend Legacy and will use them again in the future!", "pics": null, "resp": {"time": 1623429558958, "text": "It was a pleasure working with you.  Thank you for the awesome review!"}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "115113384247717285140", "name": "Gina Sutton", "time": 1616794877474, "rating": 5.0, "text": "Jonathon was very easy to work with and professional in my dealings with him.  He removed and installed solar film within a few days of my contacting him. He performed excellent work. I would definitely recommend him to others.", "pics": null, "resp": {"time": 1619473562704, "text": "Thank you for taking the time to post this awesome review. It was a pleasure working with you."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "105300794406364266093", "name": "Brian Ennis", "time": 1622041119993, "rating": 5.0, "text": "Great service on time and did exactly what we discussed at a very reasonable price. Joy to work with", "pics": null, "resp": {"time": 1622054870707, "text": "Thank you.  It was a pleasure working with you guys.  I appreciate you taking the time to leave this 5 star review."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "113155529474799325908", "name": "Shannon Waters", "time": 1611159843060, "rating": 5.0, "text": "Extra nice and professional. Work quality is definitely a 5 star! Will be referring Jonathan to others.", "pics": null, "resp": {"time": 1619473599295, "text": "Thank you Shannon. It was a pleasure to meet and work for you!"}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "103859744832356757162", "name": "Christina Kountz", "time": 1584453327890, "rating": 5.0, "text": "Jonathan is extremely professional and gets the job done very efficiently! He tinted the windows of our Chiropractic Office. We had questions about which level of tint to use and he was amazing about bringing us samples (TWICE) all in the same day. I requested samples on a Wednesday- he was in here installing on a Monday. He is incredible and we love how everything turned out! Thank you!", "pics": null, "resp": {"time": 1584463982135, "text": "Thank you so much for your positive feedback and for taking the time to post this awesome review.\nIt's our customers that allow us to constantly improve the way we do business, one of which we're really proud of, the quick response time you've been experiencing. I'm so glad you're happy with the end result.  Thank you for your business."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "109827465845246726880", "name": "Ashley Caudle", "time": 1599675464203, "rating": 5.0, "text": "Window films look great and provide so much protection from the heat/sun. You still have the great view we were looking for and a mirror kind of tint on the outside. Very quick installation and professional.", "pics": null, "resp": {"time": 1599776494924, "text": "It was a pleasure working for you both,  Thank you so much for the 5* review and earring your trust."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "106110079338582529064", "name": "Debra Webb", "time": 1593731434074, "rating": 5.0, "text": "We had Jonathon to do all our windows and front door in our home. He provided prompt service and reasonably priced. Thank you Jonathon for a job well done!!\nWe highly recommend Legacy!!", "pics": null, "resp": {"time": 1593746056713, "text": "Thank you so very much for leaving this review.  Glad we could help you guys out.  You’ve both been a pleasure to work for."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "111700087650495347010", "name": "Rian Pedalino", "time": 1594340880614, "rating": 5.0, "text": "Very easy to work with. Very efficient and high quality work. Would recommend Jonathan to anyone!", "pics": null, "resp": {"time": 1595294802256, "text": "Thank you for leaving us this review.  We really appreciate your business.  So glad we could help you out by keeping you cooler  while saving you money."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "111536084014506659681", "name": "brandy jane fox", "time": 1591977017817, "rating": 5.0, "text": "had our windows tinted in our home, great customer service! would highly recommend legacy window film! thanks again!", "pics": null, "resp": {"time": 1592249029284, "text": "Thank you so much for your positive feedback and for taking the time to post this awesome review.  It was a pleasure working with you both."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "116381078269250146855", "name": "S Belanger", "time": 1570238449115, "rating": 5.0, "text": "Very pleased and happy with my window and glass door tint. Johnathon was very professional and prompt. Thank you. I highly recommend him.", "pics": null, "resp": {"time": 1570239828866, "text": "It was a pleasure working for you both.  Thanks again for your business.  Appreciate the review!"}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "100698769870426334269", "name": "Stefano Feo", "time": 1502670975542, "rating": 5.0, "text": "Legacy Window Films did me right.  Excellent workmanship on my Lexus.  Jonathan really knows the greatest new high tech products in window tinting.  His craftsmanship is Suoerb.  Super kind and courteous too.  Will do more of my vehicles!!", "pics": null, "resp": null, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "100337463158889624349", "name": "Stacie Reynolds", "time": 1579383041774, "rating": 5.0, "text": "The response time was quick, the work was done efficiently, and the price was very reasonable.", "pics": null, "resp": {"time": 1579388748524, "text": "Thank you so much for taking the time to leave us this amazing review.  We appreciate your business."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "111370049562308023149", "name": "Dick Kaufman", "time": 1561655263063, "rating": 5.0, "text": "Jonathan did all the Windows in our home\nThe effect is wonderful.  I would recommend him to anyone.", "pics": null, "resp": {"time": 1599776521547, "text": "Thank you so much for your positive feedback and for taking the time to post this awesome review. It was a pleasure working with you."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "111877763545774062844", "name": "Stephen Pridgen", "time": 1530982637006, "rating": 5.0, "text": "Great service, great price & a job professionally done. Pleasant service to boot. Would use again if ever the need.", "pics": null, "resp": {"time": 1531004638233, "text": "Thank you for your using Legacy.  It was a pleasure to work for you."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "115405801130506911106", "name": "chuck chavis", "time": 1553027913191, "rating": 5.0, "text": "Johnathan is very professional and knows his stuff. I would recommend him to everyone . If you are looking for honesty and quality with a fair price than this is the company for you!", "pics": null, "resp": {"time": 1553211652464, "text": "Thank you for leaving a review on Google."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "114486821311018627011", "name": "Alicia Barton", "time": 1510020286639, "rating": 5.0, "text": "Jonathan did an incredible job applying tinted window film on all the windows at our Full Armor center. Fantastic work!!! Highly recommend.", "pics": null, "resp": {"time": 1553211732245, "text": "Thank you for your business!  It’s very much appreciated!"}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "114607230010163160101", "name": "Esther Milne", "time": 1414369378816, "rating": 5.0, "text": "We had Window Film Solutions, LLC come out and put film on all our east facing windows.  The offices are so much cooler now.  Would recommend to all who need their windows tinted.  Thanks guys.", "pics": null, "resp": null, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "110046955877749939347", "name": "Asael Rodriguez", "time": 1520741062366, "rating": 5.0, "text": "Did a great job tinting my 18 wheeler  even though they don’t work with semis\nGreat price and professional job!\nI’m happy with the results,\nWill recommend with all my 18 wheeler driver partners and friends!", "pics": null, "resp": {"time": 1599778564259, "text": "Thank you for the 5* review."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "109648611556657697494", "name": "Stephanie Rhodes", "time": 1506982384886, "rating": 5.0, "text": "We had Jonathon put some film on our windows at our office and it has made an amazing difference in the temperature!  Great job!  I’m actually having come to my home to install the film on a skylight that heats my living room up terribly.", "pics": null, "resp": {"time": 1599778685805, "text": "So pleased to hear you are so much cooler now.  Thank you for your business."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "114176451437147691543", "name": "Sheryl Mitchell", "time": 1506379315411, "rating": 5.0, "text": "I love my tinted windows!  Thanks for the great service.  I would highly recommend Legacy.", "pics": null, "resp": {"time": 1599778729473, "text": "Thank you!  I appreciate the 5* review and your business."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "110934690720377403336", "name": "kal patel", "time": 1453495289094, "rating": 5.0, "text": "We had Johnathan come out and put a white frosting on some of my windows in my store.  Great service and a very reseasobable price.  I would highly recommend them.", "pics": null, "resp": {"time": 1599778806943, "text": "Thank you so much for giving us the opportunity to serve you.  We really appreciate the trust and 5* review."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "101974818445365072161", "name": "Kasey Watkins", "time": 1513431464364, "rating": 5.0, "text": "We have used Jonathan’s services for tinting office windows and car windows and will not use any one else! He’s very professional, thorough and reasonably priced!", "pics": null, "resp": {"time": 1599778642940, "text": "Really enjoyed working with you guys.  Let me know if I can help you out with your home or business tinting needs."}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "106300614610396153124", "name": "Jena Watson", "time": 1553204858202, "rating": 5.0, "text": "Excellent job!!!  High recommend them.", "pics": null, "resp": {"time": 1553211692566, "text": "It was a pleasure working for you.  Thank you for leaving a review on Google!"}, "gmap_id": "0x87b688ea005076d5:0xd72ebf4cacf2f482"}
{"user_id": "104625960457922970656", "name": "Amanda Woodard", "time": 1616795478022, "rating": 1.0, "text": "Would not recommend for interior decorating services.  I hired the owner to do a total home renovation,  worst decision ever so be warned if you seek her services in that area.  The store is nice.  ****As far as the below response from the owner, my review is an honest review of how I felt services were rendered, which is what google reviews are meant to be.  My review on your Facebook page was removed as well as blocking me from your business page, that's some great customer satisfaction.  That is the way dissatisfied customers are handled by Vintage West Interiors.", "pics": null, "resp": {"time": 1616789509119, "text": "Hey Amanda, we have tried to address your issues several times through phone and text. After our last conversation, you made it seem like everything had been resolved, so we are a little confused by your review. If you have any other issues, we will be happy to take care of you, but we cannot do so without any communication to let us know how! Please feel free to call or text me if there is something you are still unhappy with."}, "gmap_id": "0x8889cbbfeaa3fce3:0xc1cb77b7e5c6bb25"}
{"user_id": "105059147495774962681", "name": "Scott Champion", "time": 1616220850171, "rating": 5.0, "text": "A design store for anyone redecorating dream, great pricing and great taste in available product.", "pics": null, "resp": null, "gmap_id": "0x8889cbbfeaa3fce3:0xc1cb77b7e5c6bb25"}
{"user_id": "105287292938466275483", "name": "Merri Bass", "time": 1607727375799, "rating": 2.0, "text": "Beautiful things but not one of the people working here was wearing a mask! I would have looked longer and possible purchased had I felt comfortable.", "pics": null, "resp": {"time": 1608668764175, "text": "Hey Merri we are constantly cleaning behind customers and  try our best to keep our distance. So sorry you felt uncomfortable"}, "gmap_id": "0x8889cbbfeaa3fce3:0xc1cb77b7e5c6bb25"}
{"user_id": "116397399589990935946", "name": "TERESA DANIEL", "time": 1611698846465, "rating": 5.0, "text": "THIS IS A GREAT WONDERFULL PLACE!  IF YOU NEED FURNITURE COME HERE", "pics": null, "resp": null, "gmap_id": "0x8889cbbfeaa3fce3:0xc1cb77b7e5c6bb25"}
{"user_id": "106550454417192729621", "name": "James Fairchild", "time": 1603202641401, "rating": 2.0, "text": "We are very disappointed as we ask for the furniture to be made in the US, she said yes it was. Well a stamp on bottom said made in China. It was delivered a week late as she forgot to put on delivery schedule. I tried calling, no answer and no response on my email. This was in Cullman.", "pics": null, "resp": {"time": 1608668610204, "text": "So sorry for you bad experience... Not sure about the made in the USA comment. Most of our upholstery is made in the USA and a majority of our case goods are made overseas as in the case of most furniture stores.  If You were told otherwise I apologize for the misunderstanding.  Sometimes emails get overlooked and I apologize for that as well. Please come back in to see us and we will make sure your taken care of!"}, "gmap_id": "0x8889cbbfeaa3fce3:0xc1cb77b7e5c6bb25"}
{"user_id": "110679681946722723452", "name": "Sheri Spuhl", "time": 1570763279651, "rating": 5.0, "text": "Absolutely love this place, in Madison and Cullman. The owners are wonderful people and everyone K have met in Madison is sweet and helpful.  It's a place to browse and it \"feels good\" to be there. I have a beautiful chandelier,  lovely antique doors and a few other things. We will go back.", "pics": null, "resp": {"time": 1570795364904, "text": "Thank you Sheri for the kind words! Come to see us anytime 😊"}, "gmap_id": "0x8889cbbfeaa3fce3:0xc1cb77b7e5c6bb25"}
{"user_id": "117451078973913937621", "name": "dedie miller", "time": 1456064042918, "rating": 4.0, "text": "Haven't been yet. But love what they are offering. Plan to visit the first of the month. Can't wait to try Annie Sloan paints. Been watching her videos for the past couple weeks and just love it. Have several pieces I want to paint. So be watching my fb page for the painting I'm going to be doing. See y'all soon!,....", "pics": null, "resp": null, "gmap_id": "0x8889cbbfeaa3fce3:0xc1cb77b7e5c6bb25"}
{"user_id": "110198092625682244978", "name": "Vestavia Johnston", "time": 1473337125428, "rating": 5.0, "text": "They're wonderful!! Teresa redid my living room/diningroom. It is so beautiful!! They will be installing plantation shutters in a couple of weeks!! Needless to say I'm very excited! I highly recommend Vintage West for anything you want in your home!❤️❤️❤️", "pics": null, "resp": null, "gmap_id": "0x8889cbbfeaa3fce3:0xc1cb77b7e5c6bb25"}
{"user_id": "114501079949406333138", "name": "Cindy Taylor", "time": 1553762111740, "rating": 5.0, "text": "Great place to find anything you need for your home!", "pics": null, "resp": null, "gmap_id": "0x8889cbbfeaa3fce3:0xc1cb77b7e5c6bb25"}
{"user_id": "108499705861889847201", "name": "Nat Kidder", "time": 1505163110910, "rating": 5.0, "text": "The epitome of Southern hospitality. The world needs more places like this.", "pics": null, "resp": null, "gmap_id": "0x8889cbbfeaa3fce3:0xc1cb77b7e5c6bb25"}
{"user_id": "108100778542682893272", "name": "Brandy Chambers", "time": 1537747956137, "rating": 5.0, "text": "This place is gorgeous!", "pics": null, "resp": null, "gmap_id": "0x8889cbbfeaa3fce3:0xc1cb77b7e5c6bb25"}
{"user_id": "116828252936938123417", "name": "Terri Charney", "time": 1536186493326, "rating": 5.0, "text": "Chrstie is wonderful!", "pics": null, "resp": null, "gmap_id": "0x8889cbbfeaa3fce3:0xc1cb77b7e5c6bb25"}
{"user_id": "112185040957474554143", "name": "Alicia Conchin", "time": 1559661155860, "rating": 1.0, "text": "Extremely overpriced.", "pics": null, "resp": null, "gmap_id": "0x8889cbbfeaa3fce3:0xc1cb77b7e5c6bb25"}
{"user_id": "109518442203917196574", "name": "Beverly Crowder", "time": 1602189642711, "rating": 5.0, "text": "Awesome, ♥️♥️♥️♥️♥️", "pics": null, "resp": null, "gmap_id": "0x8889cbbfeaa3fce3:0xc1cb77b7e5c6bb25"}
{"user_id": "109282141586843528259", "name": "Jessica Gilmore", "time": 1610662378731, "rating": 5.0, "text": "Our experience with Custom Blinds was perfect start to finish!! Craig showed up on time to measure our windows, was quick and accurate, and very kind. Our blinds showed up just 3 weeks later and I'm pretty sure the guys had them installed in under 10 minutes! Great prices, great quality, and great customer service. I'll never use anyone else!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNvN8u-AwckE2WcY7zCv1Q4Qf-h6WCQYiaqbl51=w150-h150-k-no-p"]}], "resp": {"time": 1610977126609, "text": "Thank you Jessica. We appreciate you trusting us to do work in your home."}, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "103733883674800490557", "name": "Sue Sweatt", "time": 1620238965226, "rating": 5.0, "text": "OMG!!!  is all I can say today after my new shutters arrived and were installed!  Great quality workmanship, and the communication processes, as well as the installation team...everything was just PERFECT!!!  I could not be any more pleased with Custom Blinds & Shutters! Totally recommend them!", "pics": null, "resp": {"time": 1620305937487, "text": "Thank you! You are very kind."}, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "107871621649555539834", "name": "chris eddins", "time": 1621261097255, "rating": 5.0, "text": "I cannot say enough good things about the quality and service I received from Custom Blinds.  The plantation blinds are beautiful, the installation was perfect, and everyone I dealt with was awesome!", "pics": null, "resp": {"time": 1621262853832, "text": "Thank you! We appreciate you."}, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "103166990261519277905", "name": "Randy M", "time": 1604463360922, "rating": 5.0, "text": "Mr Byram’s company is truly a first class operation and top-tiered. His products are well built, clean, modern, and a pleasant design. His & his team’s customer service are the best I have encountered in quite some time. His measurements are engineering level accurate. His install team is professional, personable, & trustworthy. The products are very affordable despite the high-end quality. One could spend more on blinds...but why???", "pics": null, "resp": {"time": 1604510201055, "text": "Thank you Randy. We appreciate the trust you put in us to make and install the shutters in your home. You and Angie were a joy to work with."}, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "109662064166108880980", "name": "angelisa Baker", "time": 1610569005984, "rating": 5.0, "text": "Custom Blinds build me some amazing Plantation Shutters! They are something that improves the quality of my home. The guys that came to do the work were courteous and fast to boot! Everyone should use Custom Blinds!", "pics": null, "resp": {"time": 1610637903229, "text": "You are very kind. Thank you for allowing us to do shutters in your home."}, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "111771180728851765555", "name": "Nicole Milam", "time": 1608254243093, "rating": 5.0, "text": "Wonderful quality, great prices, great customer service. I love my shutters!", "pics": null, "resp": {"time": 1608299164288, "text": "Thank you Nicole. You have been a pleasure to work with."}, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "103889249661787430336", "name": "Chris Taylor", "time": 1572972772469, "rating": 5.0, "text": "Craig and his team do an excellent job. From picking out the treatments to install, the service is top notch. The beautiful plantation shutters transformed the look of our new home. Highly recommend you call them before making a decision.", "pics": null, "resp": {"time": 1573221546090, "text": "Thank you Chris. I appreciate you and Marci trusting us to provide your shutters in your new home."}, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "114208311578882592096", "name": "Carey Tuck", "time": 1545102643141, "rating": 5.0, "text": "We love the new shade in our office and our shutters in our home.  I have recommended Custom Blinds & Shutters to several friends and family members. Their installation is super fast and clean. The installers are very timely and professional.  Owner, Craig Byram, is the BEST!!!  No need to look any further for your shutter, blinds or shade needs..... choose Custom Blinds and Shutters today!!!", "pics": null, "resp": {"time": 1545224981626, "text": "Thank you for sharing your positive experience. We value the people who trust us to do things in there homes and businesses. Thank you for the confidence you put in us by referring us to your family and friends."}, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "115136173523905870589", "name": "Stephanie Ayers", "time": 1559960981958, "rating": 5.0, "text": "Absolutely love our new shutters! They really complete our new room and look wonderful! Thank you so much!", "pics": null, "resp": {"time": 1560171781568, "text": "I appreciate you and Lane trusting us to complete the new addition to your home."}, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "106041086999745634472", "name": "Allison Strickland", "time": 1563304373182, "rating": 5.0, "text": "Professional, friendly, fair and honest. We had a fantastic experience! Thanks for such great work!", "pics": null, "resp": {"time": 1563539438425, "text": "Thank you for the compliment. It was a pleasure working with you."}, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "112591106060582361427", "name": "Laura Averette", "time": 1529597599174, "rating": 5.0, "text": "I love my shutters! I have recommended Custom Blinds & Shutters to several friends and family members. Their installation is super fast and clean. The installers are very timely and incredibly respectful. Their prices are great!", "pics": null, "resp": null, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "113667444880132900157", "name": "al yother", "time": 1505699241429, "rating": 5.0, "text": "We have used Custom Blinds & Shutters on several occasions for shades (both indoor and outdoor) and for window tinting and have always been pleased.  Our last purchase of outdoor shades required a creative installation solution to prevent the shades from blowing wildly in a strong wind and it really works.  Having these shades has really extended the time we can be outside on our porch whereas in the past the angle of the afternoon sun made it so bright and hot that it was unbearable to be outside. Good products, good price, and good people.", "pics": null, "resp": {"time": 1507043296701, "text": "We are so happy with the result as well! Thank you for your business; we look forward to working with you again soon!"}, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "106744029970160201445", "name": "judith summerford", "time": 1506201415532, "rating": 5.0, "text": "Craig has just installed new shutters for me.  They look great and the workmanship is perfect.  Nice to work with someone who delivers on time and does a great job of installing and cleaning up behind themselves.", "pics": null, "resp": {"time": 1507043362806, "text": "We are so glad you love them! We were thrilled with how the painted shutters turned out!"}, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "112558096340916946992", "name": "Kathy Grate", "time": 1515719572203, "rating": 5.0, "text": "Great experience. Professional and efficient. So happy with the results. Entire house of new blinds installed in less than one hour. I definitely recommend.", "pics": null, "resp": {"time": 1515786768818, "text": "Hi Kathy, We are SO happy that you love your new blinds! Thank you for the opportunity to work with you! We are here when you need us. Thanks, Craig"}, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "107502001922100785290", "name": "J. Jackson", "time": 1500496209224, "rating": 5.0, "text": "Craig and his team have put blinds and shutters in our last 2 houses.  Their products and service are second to none.  We have also been able to refer him multiple times and each time has been a success.  Would not hesitate to use him again.", "pics": null, "resp": {"time": 1500500342391, "text": "Thank you for your kind words. We value your confidence in us."}, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "114616091681474441493", "name": "Jimmy Stewart", "time": 1515161207790, "rating": 5.0, "text": "Craig with Custom Blinds did an awesome job with our shutters. The off white color he chose matched our trim perfectly. The measurements were spot on too. You will not be disappointed doing business with this company.", "pics": null, "resp": {"time": 1515787022207, "text": "We are thrilled that you love your shutters! Thank you for your business; we look forward to working with you again."}, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "101207652225528140311", "name": "Brannon Dawkins", "time": 1517607736399, "rating": 5.0, "text": "I have used Custom Blinds & Shutters many times and I am always 100 percent happy. Owner Craig Byram is professional, knowledgeable and reliable and so are his employees. I would never use anyone else for blinds and shutters in my home!", "pics": null, "resp": {"time": 1517518623825, "text": "Brannon, thanks so much for your kind words!  We appreciate your business! - Craig"}, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "104634133947710642497", "name": "Tera Helton", "time": 1524173172205, "rating": 5.0, "text": "Best place to get window treatments. The men who work here are very helpful and professional.", "pics": null, "resp": {"time": 1524224935343, "text": "Thank you Tera for the compliment. I will let the other guys know of your kind words."}, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "106081680243201812414", "name": "Kenley Nelms", "time": 1510024401185, "rating": 5.0, "text": "We have always used Custom Blinds and Shutters in our home.  The quality of products are amazing and we are forever customers!", "pics": null, "resp": {"time": 1510079115764, "text": "Thank you for your kind words and your business."}, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "110230205672879832745", "name": "Lilly South", "time": 1534786784529, "rating": 5.0, "text": "Great product, and wonderful customer service!", "pics": null, "resp": {"time": 1535048051367, "text": "We appreciate and thank you for your kind words."}, "gmap_id": "0x88890ceb1f67519d:0x3d081ccec3cecaa4"}
{"user_id": "110202101532434070099", "name": "Clarence Mason", "time": 1596215061397, "rating": 5.0, "text": "This place is very beautiful. It's well lit. Like.. Very well lit. I love the candles, lights and fixtures. I had some fun rearranging the mugs 😂 😂 this place is a great inspiration for things I will build and design myself.\nI was with someone who had to return a defective item (ordered online) and it was handled very well. I definitely recommend shopping here :)", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMRAFBXtVgnUm1i3nkm0oF7hgtHXVl2eL75czuS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM1oZTNLuxws381h-H6Wq26FYWWwOKnNIyw7Ajg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO4CDDe7hcGbEwtnEStDxBvcIHeOgLvvl4CkBCQ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4d784fb22b6b:0xe069e0907313f3bc"}
{"user_id": "114394701603246949095", "name": "chaymae touizi", "time": 1616448513040, "rating": 1.0, "text": "Do not buy their beds, we bought a set from these guys and after it came we noticed wholes and came to find out it was some type of termite, they replaced the first time and same problem occurred the with that same bed ( we have bought 3 from them) and when I reach out they tell me it’s out of warranty, not our problem, you should dispose of it.\nYes, spent 1600$ for a bed that lasted exactly 1year 6 months !", "pics": null, "resp": null, "gmap_id": "0x889a4d784fb22b6b:0xe069e0907313f3bc"}
{"user_id": "100910670503222318111", "name": "Pat Richard", "time": 1615075234514, "rating": 4.0, "text": "Very clean with beautiful stuff.  Wish I could buy.  Love the place.", "pics": null, "resp": null, "gmap_id": "0x889a4d784fb22b6b:0xe069e0907313f3bc"}
{"user_id": "118259554191380327805", "name": "Black Lotus Boutique", "time": 1604170516611, "rating": 1.0, "text": "Nice store but the workers are very nasty. Several times I have been in this store only to walk in and be ignoted not even a hello may i help you. I am so sorry I am not dressed up in heelsholding a Gucci or Coach bag! Very disappointing that you treat potential customers who may have come in to make a purchase. I have walked out all these times because of this one thing calles \"ACKNOWLEDGEMENT\". Iknow these workers do not live in a multi million dollar home but what gives them the right to act all high and mighty. Each time i have gone thinking maybe this time someone will at least say \"Hello, welcome. Is thier anything I can help you with?\" Nothing! You have no idea whether people have money to spend there or not and refardless you should treat people with cimmon courtesy. It is not alot to ask. Meanwhile about 4 stores down at Williams and Sinoma they are extremely friendly. Shame on you for your snotty attitudes.", "pics": null, "resp": null, "gmap_id": "0x889a4d784fb22b6b:0xe069e0907313f3bc"}
{"user_id": "112140456775733860960", "name": "Avalisha Fisher", "time": 1622815213957, "rating": 1.0, "text": "Still requiring masks months after the mandate was lifted", "pics": null, "resp": null, "gmap_id": "0x889a4d784fb22b6b:0xe069e0907313f3bc"}
{"user_id": "110460883227920609136", "name": "Helen H. Gonzalez", "time": 1570043950677, "rating": 5.0, "text": "The day of, the associate called and confirmed and asked if I could have the space cleared for a more efficient delivery. I did just that! But after I had donated my old room furniture, I received a call stating I would not get my new furniture due to the delivery truck breaking down. I was livid because I have a fully breastfed 8 month old and we now have to sleep on the floor. Surely I couldn't feed her in the middle of the night on a sofa. After explaining that to the manager he simply said \"well, things happen\". He did not offer any extra assistance. I offered to pick up the furniture myself and have 2 gentlemen ride with me to put it together because I was the last delivery for the day. I brainstormed solutions and he simply said no. He did not offer compensation for my inconvenience, NOTHING. The day of the delivery, the young man delivering my furniture was very sweet, professional and because I could not be there to observe their proficiency and accuracy,", "pics": null, "resp": null, "gmap_id": "0x889a4d784fb22b6b:0xe069e0907313f3bc"}
{"user_id": "107336762199070953700", "name": "Mike Robertson", "time": 1595777758103, "rating": 5.0, "text": "Really nice things for your home", "pics": null, "resp": null, "gmap_id": "0x889a4d784fb22b6b:0xe069e0907313f3bc"}
{"user_id": "117160172495887364705", "name": "Alexis Yount", "time": 1568293081938, "rating": 4.0, "text": "Nice style and store.   In some ways the store acts as a method of meeting its internet/catalog items in person so that you can order them.", "pics": null, "resp": null, "gmap_id": "0x889a4d784fb22b6b:0xe069e0907313f3bc"}
{"user_id": "115260004251416110175", "name": "Sharon Naman", "time": 1539973909718, "rating": 1.0, "text": "I walked in with cash money to spend the gentle man at the counter Never said a word to me. Very rude on the phone. I WILL NEVER GO IN YOUR STORE AGAIN. READY to spend money. But not now.", "pics": null, "resp": null, "gmap_id": "0x889a4d784fb22b6b:0xe069e0907313f3bc"}
{"user_id": "110133205262129926638", "name": "Laura Weaver", "time": 1498683574796, "rating": 5.0, "text": "Not sure who I spoke with over the phone today.  She had a thick accent.  I asked several questions about couches and sales.  She was very patient, courteous, and helpful!!  This is something rare these days.", "pics": null, "resp": null, "gmap_id": "0x889a4d784fb22b6b:0xe069e0907313f3bc"}
{"user_id": "104937206293796425931", "name": "Laurie Watson McKay", "time": 1488908220409, "rating": 5.0, "text": "Beautiful new store! Love the skylight in the middle. I love your style.", "pics": null, "resp": null, "gmap_id": "0x889a4d784fb22b6b:0xe069e0907313f3bc"}
{"user_id": "101306029661092493890", "name": "andrew crutchfield", "time": 1538837477176, "rating": 5.0, "text": "Nice place to go when your looking for something specific.", "pics": null, "resp": null, "gmap_id": "0x889a4d784fb22b6b:0xe069e0907313f3bc"}
{"user_id": "117037172062304775892", "name": "spencer tuell", "time": 1494676317982, "rating": 1.0, "text": "Extremely poor service. Spent 15 minutes in the store being ignored by every associate, then when I said I would simply like to buy a gift card I was told to hang on one minute. After 10 minutes I left.  Don't waste your time.", "pics": null, "resp": null, "gmap_id": "0x889a4d784fb22b6b:0xe069e0907313f3bc"}
{"user_id": "103202691401652297028", "name": "Michele Thrash", "time": 1490531740995, "rating": 5.0, "text": "Friendly, helpful, neighbors not just another store. Great new location and beautiful set up.", "pics": null, "resp": null, "gmap_id": "0x889a4d784fb22b6b:0xe069e0907313f3bc"}
{"user_id": "116596029889606957871", "name": "Katherine Ward", "time": 1529945915168, "rating": 5.0, "text": "Love love love. Great picture frames, candles, bedding.", "pics": null, "resp": null, "gmap_id": "0x889a4d784fb22b6b:0xe069e0907313f3bc"}
{"user_id": "113699469425066465803", "name": "BrotherTy Page", "time": 1544104267029, "rating": 1.0, "text": "The staff is very unfriendly...I spoke with Jason the manger and he wasn't  any better.  It's regrettable, I refuse  to go back to the mobile store.", "pics": null, "resp": null, "gmap_id": "0x889a4d784fb22b6b:0xe069e0907313f3bc"}
{"user_id": "107842963499576681450", "name": "C.J. Harris", "time": 1569017270151, "rating": 5.0, "text": "Always a great experience.", "pics": null, "resp": null, "gmap_id": "0x889a4d784fb22b6b:0xe069e0907313f3bc"}
{"user_id": "108473848340450121173", "name": "Tr Clevenger", "time": 1518387065805, "rating": 5.0, "text": "Great place to walk around and get ideas", "pics": null, "resp": null, "gmap_id": "0x889a4d784fb22b6b:0xe069e0907313f3bc"}
{"user_id": "102114133478726031636", "name": "Kevlar Richardson", "time": 1501958242473, "rating": 3.0, "text": "I feel very pretty when I shop here.", "pics": null, "resp": null, "gmap_id": "0x889a4d784fb22b6b:0xe069e0907313f3bc"}
{"user_id": "108461345992821767233", "name": "Karen Landrum", "time": 1523567259727, "rating": 5.0, "text": "I’ve never needed to order draperies before & I was looking in the Yellow Pages & found Western Draperies.  I asked the gentleman who answered the phone if they made block out draperies & he said yes.  The rest was history as Mary came out & made some measurements in my “hot box” bedroom.  I’ve been on my own since I was 21 & moved out of this house ever since.  Mama passed away & she loved lacy valances & mini blinds but it was too hot in this front bedroom.  I moved back in as I knew it would benefit both daddy & I.  But the sun came in fast & furious & I sleep better when it’s dark.  Mary was very personable & definitely knew what she was doing.  My draperies are beautiful!!  And they work so very well w/blocking out that sun that baked me in the early morning.  Her husband was such a nice man & did a wonderful job installing my drapes.  I was like a kid in a candy store!! 👍🏼 💯% satisfied customer!!", "pics": null, "resp": {"time": 1554999857341, "text": "Thank you so much, Karen! We really appreciate the review!"}, "gmap_id": "0x88891964ee99dcb9:0x5c9cab50316f9b9d"}
{"user_id": "109332975547593912319", "name": "cash wilkerson", "time": 1476814263290, "rating": 5.0, "text": "Great... both Mary and Phil are true professionals ... magicians with the fabric.\n\nTwo big thumbs up.", "pics": null, "resp": {"time": 1477684242947, "text": "Cash, thanks for the nice review and for your business!"}, "gmap_id": "0x88891964ee99dcb9:0x5c9cab50316f9b9d"}
{"user_id": "115502573476427931475", "name": "Mike Denton", "time": 1448313185336, "rating": 5.0, "text": "We were looking for someone to make a half circle window treatment (fanlight approx 3' x 6') for us, but found that no one did that kind of work anymore. It was the look we wanted. We were finally referred to Western Drapery in Homewood. They have a new vender who will make any shape frame you want from a template. After discussing the way fabric would go on the frame with the kind people at Western Drapery, we decided that we could do it ourselves as long as we had the frame. So after carefully measuring and creating the template, it was ordered, made, and shipped. We attached sheer fabric to get the star burst look we wanted to achieve and the end result was perfect. We couldn't have done it without Mary and her brother at Western Drapery and the company that made the form. They were both great to work with.\n\nMike and Randy Denton", "pics": null, "resp": {"time": 1449507015705, "text": "Thank you Mike for leaving the great review.  We appreciate your business and hope your window treatment is perfect for you."}, "gmap_id": "0x88891964ee99dcb9:0x5c9cab50316f9b9d"}
{"user_id": "103574179415098269771", "name": "Valerie Chavez", "time": 1504276276388, "rating": 5.0, "text": "They do amazing work!!", "pics": null, "resp": null, "gmap_id": "0x88891964ee99dcb9:0x5c9cab50316f9b9d"}
{"user_id": "117097590346646117872", "name": "Cameron al Shaqar", "time": 1592312514772, "rating": 5.0, "text": "Tatiana at Calico Corners in Hoover is lovely! She is so knowledgeable and has helped me make my house just the way I wanted it. She is clear, concise, works within my budget, and an all-around fantastic decorator and person!", "pics": null, "resp": {"time": 1596552875630, "text": "Hello Cameron,\n\nThank you for taking the time to complete our survey and for the 5 star rating! We are happy to hear that you had a great experience at our store with Tatiana, we will definitely let her know.. We look forward to working with you again very soon. Thank you - Vik"}, "gmap_id": "0x8889226b77fa5111:0x5ed1145ff87b0598"}
{"user_id": "117737124671984138232", "name": "Julie King", "time": 1498072205869, "rating": 5.0, "text": "Excellent service! Tatyana is like having your own designer- so talented and willing to help. The store is clean and organized, and again the customer service is fantastic. I won't be going to any other fabric stores- they have it all!", "pics": null, "resp": null, "gmap_id": "0x8889226b77fa5111:0x5ed1145ff87b0598"}
{"user_id": "115907037500852997677", "name": "Merrilyn Cook", "time": 1532090806408, "rating": 5.0, "text": "Great selection of fabrics and great service. Be sure to see Jeannie. She is wonderful!", "pics": null, "resp": null, "gmap_id": "0x8889226b77fa5111:0x5ed1145ff87b0598"}
{"user_id": "115141523618536058183", "name": "Mary Jane Karwoski", "time": 1489884428554, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x8889226b77fa5111:0x5ed1145ff87b0598"}
{"user_id": "101513151186798138867", "name": "Deirdre Taylor", "time": 1622688512722, "rating": 3.0, "text": "I only go to home Depot if Lowe's doesn't have what I need, and that's rare. I always have a problem picking up orders. You can't just call in to have it brought to you by curbside because they claim to be too busy to get your information. When you go in, if the order is not in that little closet behind them, they'll just tell you it's not there rather than to go to the back and get it. I order a lot and never have a problem with Lowe's. It took an act of congress to finally get my complete order from Home Depot. One young lady, Kia went out of her way to help me and it wasn't even her department. Thanks to her I have everything. I only shop here when I absolutely have no choice.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104964551689477447064", "name": "Anithea M", "time": 1612635352740, "rating": 5.0, "text": "Got in and got out! Found what I wanted on the app!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPEJJ19L9HY6S3BHuCEDa7leYXYOhx0EhmbABvc=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111996270626342312335", "name": "Liz R", "time": 1622766599420, "rating": 5.0, "text": "Everything seems to be easy to locate. If you are using The Home Depot app most of their inventory counts are accurate or up-to-date for products on shelf", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114499768142150027895", "name": "Silvery Nova", "time": 1615510726435, "rating": 1.0, "text": "The first problem is the delivery service company that Home Depot uses for direct deliveries,Central Transport. My 1st initial delivery date changed three time before it was actually attempted to be delivered on March 3rd. On March 3rd the shipment came on a long bed truck with a pallet dolly. My shipment is a pallet of 33 boxes of porcelain tile., plus 7 additional boxes they put on the same pallet. The right side of the pallet was coming apart due to the immense weight of the tile . The driver could not move the pallet down the truck. He was not going to be able to pull it up the small slope on my driveway. What on earth were they even thinking?They needed a fork lift. I called Home Depot and they got the Transport company on the line while I was on hold. I ended up being told the transport company needed to take care of this and they would contact me in 24 to 48 hours. Which they never did. I had to call them. On 3/5 Friday I called central transport and they told me the shipment would be delivered on Monday between 11 and 12. They never showed. I checked the shipment tracking and found that they changed it to Tuesday 3/9! I got no call, text, or phone call.So Tuesday 3/9 I message them to find out eta. They said the drivers hadn't left yet and to keep checking they will update me. That never happened. So I wait and wait and I get a call from Home Depot letting me know the tile has arrived at THE STORE. I was never told anything about this.They will be delivering the tile on Monday 3/15....", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101221607261505326604", "name": "Benny Woods", "time": 1523533187461, "rating": 5.0, "text": "Really nice store they have just about anything you're looking for tools paint Lumber home appliances shingles sheetrock power tools tool boxes cement ceiling fans lawn mowers", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP9qFYleXfGd8KsqAHKPFKBrpyGVTFE3PKy7jts=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPcIGMGhvMzavg-KCdLgIa_5JylqQpyzmiuugjw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPOFgEh8h0T-OdPoH9Dlk1k4dEAGlgWxHqtAtQI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNMRjZ7grMLRGCv0Is4S8Rii6CmSagRRvz5m7Cy=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110877374690689930464", "name": "Carolyn Ann Pitts", "time": 1618192368761, "rating": 5.0, "text": "GREAT SALE PRICE ON OUR DISHWASHER WE GOT WELL THEY ORDERED IT AND WE WILL GET IT ON APRIL 23. SALES ASSOCIATE WAS VERY SWEET AND VERY HELPFUL. THANKS FOR SUCH A GREAT SALE", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113417706957439140552", "name": "Cynthia James", "time": 1617413205829, "rating": 5.0, "text": "Online order pickup inside store was super easy. Total transaction was about 3 min. I even had someone ask me if I needed something. Unfortunately that night I was only browsing  but Thanks to the lady working in the appliances department for actually engaging.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111659223413567054206", "name": "Tiffany Reed", "time": 1620603244557, "rating": 4.0, "text": "Love home depot.. They had alot of stuff at decent prices and the employees were really friendly and helpful. They now have self checkout so checkout was a breeze too. It wasnt crowded and displays made things very easy to find on my own.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113432997716455065250", "name": "Sandra Cauley", "time": 1621983538747, "rating": 1.0, "text": "I went in the garden center and told girl at registry, that  I wanted 2 medium bags of Miracle-Gro potting soil, and help getting it n putting it in car.  No help came, then she told me go in back pick it up.  Finally realized she charged me for garden soil, I ask her to give me potting soil and charge me for the difference.  She said she couldn't, I had go customer service.  I told her I wasn't able, that why I parked out in front garden center and ask for help.  I told her I would eat the loss and never come there again.\n\nI don't like be hard get long with, but it was her mistake, why should I have go customer service, when I have trouble walking that distance.  I will use Lowes from now on.\n\nI'm a 100% Service Connected Disable Veteran.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113865377088864607035", "name": "K'Cee Ortiz", "time": 1616266636351, "rating": 4.0, "text": "Came just to check out the garden center/plants selection. Very minimal, but prices are decent. If looking for a larger selection of flowering, herbs, or trees go to Lowe's. Home Depot's tropical plant section is good however.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116088088101848650793", "name": "Kathryn Brakefield", "time": 1623539227378, "rating": 5.0, "text": "Clean ..well stocked..great customer service. Prefer Home Depot Mobile AL.  worth the drive from MS.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111949167487821334289", "name": "Michelle Williamson", "time": 1618344948983, "rating": 5.0, "text": "Great service as always! Purchased a small metal gate for my flower bed to keep the dog out but didn't realize the poles that stake into the ground were missing. They found them straight away when I went back and made it stree free", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100307314560605388116", "name": "Zash", "time": 1622489800680, "rating": 2.0, "text": "Needed some rope but it was locked up behind glass. Could not find an employee to help. Asked the Paint Dept person to call us some assistance. Waited 10 more minutes but no one came. Hunted down someone again but they didnt know the combination to the lock that was gaurding the rope. Was in the store 30mins just for 10ft of rope!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116484690062615838964", "name": "melissa renee", "time": 1619300009804, "rating": 3.0, "text": "The lady who sold us a washer and dryer was very nice no problems at all. I have a problem with the fact that they were supposed to be delivered at my house on April 21st. It got delayed so they moved the delivery date to Today ( April 24th ) but I never got any notification so I called and they told me that they don’t deliver to my area on saturdays, only Wednesdays and they don’t deliver when the weather is rainy. It’s been SUNNY all day. No bad weather AT ALL. Now the delivery date has been moved to May 12th. I will be giving birth in May so that’s really annoying 🙄 I ordered my washer and dryer on MARCH 3RD!!!  I hope the warehouse manager makes this right.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104240201754965289589", "name": "Jessie", "time": 1608187758221, "rating": 3.0, "text": "Went to buy an appliance that I saw online. Called the this particular store literally on my way over there. Young lady told me that indeed they had the sale item which I was inquiring about. I get to the store and spoke with someone worker in appliances I ask him again to verify of what I wanted. He walks back and confirms my injury. Rung me up just to realize he mentioned through conversation of the appliance he thought I was asking of. Which I corrected him and pointed out and literally touched again the same appliances that I wanted. Apparently some way some how after all this confusion. They magically had sold out. So my thinking leads me to believe the person I spoke to on the phone didn't bother to check or maybe something with system either way wasted my time and here's the kicker the way the guy tried to put it was like I could go to another home depot after I already paid. Luckily my bank released this debit transaction. Poor poor salesmanship and somewhere along the line communication is lacking. I hope I can revisit this location in the future without this issue.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117727525725400636738", "name": "Brent Jennings", "time": 1614037891713, "rating": 5.0, "text": "Great place to get your gardening supplies early picked up some tomato plants today I was surprised they already had them available", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115961453894344222231", "name": "Stanley Pettway", "time": 1611766885361, "rating": 5.0, "text": "“There’s something bout this Home Depot that keeps me coming back for more... it’s just NEAT for a home supply store. Peace.”", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110345849221491784161", "name": "byron wilmoth", "time": 1598928417542, "rating": 5.0, "text": "Used the online order and drive up to pick up option.  Ordering was very easy and so was payment.  Pick up was very clear and easy.  The whole process was clear and easy.  The young lady who brought out the order was superb!  So friendly and a breath of fresh air!  I actually feel bad because I lost the receipt and cannot remember her name so I could go back and submit a survey to help her employer see her worth.  If I get back there and she is there, I will make it a point to find out her name and then submit a survey for her.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109676816278255837627", "name": "Andrew Clark", "time": 1615316713646, "rating": 5.0, "text": "Nice customer service support. I love the garden center this time of year.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111994225692975806241", "name": "Mollie Newsome", "time": 1614431962599, "rating": 2.0, "text": "Aside from the staff of the paint store Home Depot could be better. The price is could be better and products should be easier to find.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112557907033870184990", "name": "Shianne Mitchem", "time": 1616525098218, "rating": 5.0, "text": "Love the garden center. If I could I would buy it all and bring it home.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102186728581377564199", "name": "William Mincey", "time": 1614990819561, "rating": 4.0, "text": "I'm a Lowes shopper myself but they had what I needed w knowledgeable staff that where eager to help.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105227513662855236040", "name": "Lisa Watkins", "time": 1606356715106, "rating": 5.0, "text": "We went at a perfect time when the store wasn't crowded. The team members were very pleasant and helped us select and load 2\"x6\"x8' deck boards. We shop at this store frequently.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110924236981351568400", "name": "Robert Jackson", "time": 1614645278739, "rating": 4.0, "text": "Always decently helpful staff and prices aren't to high unless your looking at lumber but that's not really their fault at the moment.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112076761294574915517", "name": "Titus Young", "time": 1622421005992, "rating": 1.0, "text": "Costumer service was horrible. I waited 30 minutes literally just to get a screw", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110612619121097252708", "name": "Katherine Riley", "time": 1612560858290, "rating": 1.0, "text": "The woman working in the kitchen dept. at the store on Schillinger Rd. was no help. I called to ask about my cabinet order, and she couldn't find it, couldn't find me in the system, and insisted I must be wrong. Later I found out my order had been there. She sounded very stressed out and somewhat rude. Oh well, it's Christmas time, and maybe she has a psycho family like I do, who have ruined another Christmas. It's ok honey, breathe, and hope they get what they deserve next year.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111509877702176760147", "name": "Joseph Fletcher", "time": 1597471794369, "rating": 5.0, "text": "HD is awesome. I bought a lawnmower with the app after shopping the store a prior visit. Curbside pick up was so easy. Their app is so much better than Lowe's. So many up to date items to make your house better vs Lowe's. Even the in store checkouts are very digital and up to date. Was a die hard Lowe's guy but visit here, it'll make you switch.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109401105095606555056", "name": "Kaitlin Hairston", "time": 1614361697517, "rating": 5.0, "text": "Always a good experience there. Good customer servicealready has items looking for", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102644633938724459704", "name": "Thomas Long", "time": 1607914071145, "rating": 5.0, "text": "I shop this store often mainly because of a very helpful Associate Layden. He is very accommodating, friendly and helpful. This store should model every Associate after him! Thanks for your help!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106463529330046753090", "name": "Felix Gonzales", "time": 1623544075566, "rating": 3.0, "text": "Clean and nice ppl", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117618862829477315462", "name": "The Hulkster", "time": 1605802729623, "rating": 2.0, "text": "For the most part they have what you need just keep in mind do not rely on finding help ..to find what you need you literally have to look through several aisles to find anyone that works there. I also had to deal with one employee who had a very smart aleck attitude I almost told her just walk away it was that bad. Sometimes the clearance item priced stuff is phenomenal sometimes it's not a deal at all. The return warranty is a huge problem they want to make you pay a checkout fee for a broken item even if it comes back as broken and needs to be replaced they still want you to pay $35 diagnostics fee this is totally wrong on every level. I actually purchased a pressure washer could not get it to work they sent it off come back and said there was nothing wrong with it I said let's go to the garden center let's hook it up to hose and let's find out ..so finally they agreed after I insisted guess what it didn't work they still wanted $35. The extended warranty is 100% a joke it's just a way to steal money.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112594286035553588652", "name": "Cassandra Moultrie", "time": 1611326190945, "rating": 4.0, "text": "I went in to pay a bill. I was in and out. Cashier friendly and professional great attitude for dealing with the public.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104371656142578105016", "name": "John Curry", "time": 1617280599374, "rating": 5.0, "text": "So much better than lowe's for me", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103953237477058203326", "name": "SShaw6174", "time": 1615834206842, "rating": 2.0, "text": "People here want to draw a check not work. I much prefer Lowes in tilmans corner than this home Depot.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107926670848471184896", "name": "Lel Dale", "time": 1596330984107, "rating": 5.0, "text": "I returned to this store hoping to find a freezer, & I did! Just the one I was shopping for. Ms Kendra went above & beyond to make sure it was delivered @ pickup. Thank U Ms Kendra & the other young lady who assisted U. U both r Store Gems! I hope The Home Depot thinks so to..stay safe while U serve. U r appreciated!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117281273727611378939", "name": "STEPHEN DAVIS", "time": 1618047057577, "rating": 4.0, "text": "Received very friendly  service in appliances from zjulie", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110827696071847299630", "name": "Chris Lang", "time": 1611255969820, "rating": 5.0, "text": "Store is clean and well stocked.  The staff is friendly and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118139140107495633477", "name": "Doctor Plagus", "time": 1596914302458, "rating": 4.0, "text": "I use this store a lot for my home improvement.  I love the garden section.  I bought beautiful Hibiscus plants for $6 and they bloom so beautiful they are the envy of the neighborhood.  The paint department staff is so friendly, knowledgeable, and helpful, I try to get all my paint there.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118139140107495633477", "name": "Doctor Plagus", "time": 1596914302458, "rating": 4.0, "text": "I use this store a lot for my home improvement.  I love the garden section.  I bought beautiful Hibiscus plants for $6 and they bloom so beautiful they are the envy of the neighborhood.  The paint department staff is so friendly, knowledgeable, and helpful, I try to get all my paint there.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111795258364355802064", "name": "Retros 4Life 79Boxing", "time": 1616490208934, "rating": 2.0, "text": "I had the worst Home Depot experience I've ever had in  30yrs of shopping at home depot. I came into the establishment and requested an automatic wheel chair due to injuries and the employee took forever to get the chair to me just to stop talk on his phone and seen me standing in pain but chose to help other customers instead of getting the chair to me 1st.  I changed my mind and ordered the products online to get delivered to my residence but Home Depot decided to ship my items to a store over 10 miles away from my home causing a real inconvenience.  I see why i started  shopping at their competitor majority of the time.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110827696071847299630", "name": "Chris Lang", "time": 1611255969820, "rating": 5.0, "text": "Store is clean and well stocked.  The staff is friendly and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107351363159104575026", "name": "JOKER Morris", "time": 1619239217138, "rating": 4.0, "text": "Had to buy a new stove. Wife blew up the old one.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102924211152045663679", "name": "Rimmy Bullock", "time": 1600702763210, "rating": 4.0, "text": "The staff is helpful, the selection is normal great, my only problem is all of the broken pots that you have to go though to find a good one. If something is broken, it should be removed form the shelves. I visited 2 days in a row to check to see if they put out new stock for something I wanted, but both times it was the same broken planters and pots.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116611600076308804343", "name": "Greta Hamilton", "time": 1587822445334, "rating": 5.0, "text": "Home Depot you Rock!!!  Excellent customer service, efficient, friendly and helpful employees. I had a bad encounter last night at Lowe's. I wanted a simple Storm door and could not find anyone in the store to assist me with the purchase. Could not even get the manager to the department to assist.  So I came to Home Depot this morning, was treated professionally and efficiently.  The employee came to me and asked if I needed help, I didn't have to go looking for him.  Thank you so much.  I will certainly be back.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114860446333793707617", "name": "Diane Tipton", "time": 1618168804546, "rating": 5.0, "text": "Bought a washer and dryer . Very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113064211600259048958", "name": "Antoinette Harmon", "time": 1614111055363, "rating": 5.0, "text": "Got some plants they had some Awesome choices..", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105884525324402918161", "name": "Randy Blocker", "time": 1612841948397, "rating": 5.0, "text": "Very well laid out with good stock on hand!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108898997234304606957", "name": "april ehlers", "time": 1609591883159, "rating": 2.0, "text": "The service was Horrible at this location.  I have always loved shopping Home Depot and I understand being short staffed but the employees here were just awful!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102579838281592558281", "name": "Lee Nichols", "time": 1618940324248, "rating": 5.0, "text": "Always good service and products.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110194388613042963994", "name": "B Tech Builds", "time": 1600552392531, "rating": 5.0, "text": "Great customer service looking to buy a shed. Staff was prompt knowledgeable and very helpful during the process highly recommend", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117189553308850442003", "name": "SABINA SABINA", "time": 1616835432183, "rating": 5.0, "text": "I love their curbside pickup", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115456278350109820792", "name": "Rodney Moody", "time": 1609293739310, "rating": 4.0, "text": "Clean and made great efforts to be Covid safe.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115386481373515200688", "name": "Lauren Young", "time": 1596064139441, "rating": 5.0, "text": "I ordered some washing machine hoses online, got a text they were ready for curbside pickup In about 30 min, texted that I was there & the sweetest, friendliest young lady named Christy brought it out to me in about 5 min!  Great, efficient service which is extremely rare in these trying times. Very refreshing, highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114157172180809207070", "name": "Sam Kennedy", "time": 1606330707137, "rating": 5.0, "text": "The store pickup women was very nice to me and complemented me on my hair.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106621008810962547918", "name": "Chip Perry", "time": 1617832857072, "rating": 4.0, "text": "I was disappointed @ Montlimar location, but the Schillinger Home Depot had the stuff", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106617504231334806529", "name": "Jessy Monic", "time": 1609452418595, "rating": 1.0, "text": "This place sucks. Verry bad service and no help at all. Got hung up on when I TRYED to call and when I went there they were very rude.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100065732828233375248", "name": "Radar Rider", "time": 1592956483096, "rating": 4.0, "text": "This Home Depot has gotten much better-ish ever since they got rid of the last manager they had!  This location had gone to the dogs for the longest time but here in recent years it has improved a whole lot.  It still has a ways to go.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116134951286012151131", "name": "Steve Coyle", "time": 1598482683737, "rating": 5.0, "text": "Enjoyable if possible, just wish they actually had the things I have looked for. Example the not common rough in toilets.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100546824989251464246", "name": "Shelley Griffin", "time": 1621111893478, "rating": 4.0, "text": "Clean store but they have a lack of help", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111265612337732970314", "name": "Keith Doucet", "time": 1599165875530, "rating": 4.0, "text": "Everything was good with the store, however the department CSR's were useless.  I had to wait 20 minutes to get a board cut.  Everyone of the CSR's told me that they would be right back and never returned.\nIf the use of cellular devices were stopped maybe Services would be better", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117860242357012411926", "name": "jjnjayo pineapple", "time": 1590523923399, "rating": 5.0, "text": "Store nice and clean. Needed to buy lawn mower. Found a employee so very nice he went got us a cart loaded the mower took us up to register came outside and loaded the mower into our car.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103595037780557042809", "name": "SimbaJKU", "time": 1617384449641, "rating": 5.0, "text": "Home Depot's staff was very helpful", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNfi7gxbsAitYBeCSdYjtMjNcG2Qd__OgAMKBX3=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113013160645688772622", "name": "Jerry Persons", "time": 1613440508915, "rating": 5.0, "text": "Awesome Carhartt clothing and Milwaukee  clothing .....", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108701034558117160854", "name": "James Stafford", "time": 1622409281284, "rating": 5.0, "text": "Always helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114327080915237958501", "name": "NotAFish", "time": 1614968704552, "rating": 5.0, "text": "They got tools! Did you know?", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102168329092414812708", "name": "louis jackson", "time": 1595021033784, "rating": 5.0, "text": "MS. Kristy and MS. Tee Tee is awesome the best customer service I ever seen in a hardware store if the don't know what your talking about they will find the right people to help you I'm a contractor and when I walk into this home depot and I see them I fill at home awesome just awesome", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115354375494675470886", "name": "Joel Minto", "time": 1614210348281, "rating": 5.0, "text": "Best in store and curbside pickup.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105490118152553275568", "name": "Joe Behr", "time": 1597422030124, "rating": 5.0, "text": "Needed help and the associate I first encountered quickly had specialist provide the information I needed. He even got the items!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111643441117496498538", "name": "Cindy Gardner", "time": 1597528885984, "rating": 5.0, "text": "Akways clean and neat when I go. Friendly and courteous staff. They always go put of their way to answer any of your questions. Competive pricing. 👍❤👍❤👍❤", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107071635484914978441", "name": "Ken Welch", "time": 1613527669748, "rating": 3.0, "text": "Did not find the light bulbs I needed, no associate around so I gave up.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103918012464024930224", "name": "Larry Foots", "time": 1608227208130, "rating": 5.0, "text": "Associates in Hardware were very helpful and also at the register", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106112085429468681128", "name": "Rosemarie. Frei Parker", "time": 1594921244569, "rating": 5.0, "text": "Excellent service found what I wanted ask for advice. I am thankful for the good advice everybody wore masks sanitize stations were available by the entrance Thank You Home Depot", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104431425225249246689", "name": "JC Gottlieb", "time": 1587582892793, "rating": 5.0, "text": "A tall slender young man that works for maybe ,Home Depot inventory distribution (he did not wear HD uniform) but he helped my husband load 18 bags (60lbs each) without hesitation or question. I wish I would have caught his name. Thank you so much for your time.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111864449617436778643", "name": "Tony Seybert", "time": 1593725326402, "rating": 2.0, "text": "Don't order anything on line , waited over 2 months for appliance to be delivered. I was put off twice on delivery. Then was told 11:30 to 3:30 ,  received at 6:00. I called sorry airfreight when 1st delivery was canceled, they said I can cancel my order. I told them not after waiting so long .home Depot won't get my business after all that. THEY took my money soon as I ordered , not prior to delivery. Same with carpet , made two payments prior to having it installed .", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113908218853598947922", "name": "Donnie Moody", "time": 1603481261358, "rating": 1.0, "text": "I shop this store at least 3times a day today I go in there and see a faucet for 14.88 and bring it to the counter and they say it is 31.00 still I go back there take a picture and show them it says 14.88 and they tell me it’s not on sale yet so my thing is change it in the computer before it is set out this is false advertisement so basically I didn’t get the faucet cause they wouldn’t sell it to me for what is advertising on the sign", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113335470443819553870", "name": "Dywane Butler", "time": 1616904343320, "rating": 5.0, "text": "Has a lot of electrical supplies to keep my business going", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109106462902134413040", "name": "Terry Finney", "time": 1619555156180, "rating": 5.0, "text": "Great costumer service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110479653611652853125", "name": "John Diaz", "time": 1621912384722, "rating": 5.0, "text": "Grabbed some gloves and a light.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102737879936977616150", "name": "Terry Rhea", "time": 1600631312069, "rating": 1.0, "text": "Nobody  around to help three or four was huddle up talking then if you walk over there they walk off. I like the one over here on\nOff cottage hill", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113423784249485348146", "name": "David Rodgers", "time": 1593179941271, "rating": 2.0, "text": "Went to three different stores. They were out of stock at all three. Ended up at Lowe's...", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103477708376233613854", "name": "C Sells", "time": 1582217374838, "rating": 5.0, "text": "Too good...great selection and value backed by a great return policy.\nSometimes items look different when they're home, but, easy returns makes a house a home!\nIf only we could leave with what's on the list!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102374112252966416030", "name": "PamelaAnn Taylor", "time": 1606451775035, "rating": 4.0, "text": "Always as usual helpful when you need them", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105826764256867057801", "name": "Kinsley Welch", "time": 1590088050189, "rating": 4.0, "text": "Always super clean and good products. Thankfully, I am someone who knows what they need, because they really don't have enough people to help customers who really need it. But, overall, I like it.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117176364859831372836", "name": "Dr.David Callaway", "time": 1550941408521, "rating": 1.0, "text": "Very friendly employees. I don't like having to show my ID. EVERYTIME when I pay using a gift card. Just remember before  buying a gift card  for  love  ones.To much a hassle We will not be given our time  or money to them any more. Lowe's here we come,", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOn_MjhMYOXT0ZjVptNIO3XWwqrn7B-EFhp5KpJ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102747989441964599317", "name": "Theresa G", "time": 1617718392556, "rating": 4.0, "text": "Excellent customer service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111402836039010547905", "name": "Linda Y", "time": 1616843471248, "rating": 4.0, "text": "Mmmmm", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109780329442563034978", "name": "Barbara Tilley", "time": 1591734593962, "rating": 5.0, "text": "Great store for almost all home needs.  Very helpful sales people also.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102992686994987587204", "name": "Virgil Ladner", "time": 1592605006973, "rating": 1.0, "text": "I ask three people were a item was in the garden center an they looked at me an said I don't know. They worked in the garden section. I will not go back nor would I recommend people go there!!!! Lowe's is the place to go!!!!! Just my opinion..", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103245741622740626221", "name": "Janna Brown", "time": 1574202027588, "rating": 5.0, "text": "Went in the Schillinger store lost as all get out,  and this precious gentleman that already had his vest off fixing to go home stopped me to offer his help. Mike manager of Millworks and Lumber you were so sweet and so kind to stay and make sure I got what I needed, even if it wasn't your dept. Thank you so kindly for making a difference!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104124984774329340690", "name": "Amin Shabanpour", "time": 1612242868287, "rating": 5.0, "text": "Best place for home shopping", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116354866446786710157", "name": "susan vinson", "time": 1590953797519, "rating": 4.0, "text": "Like everyone else the stock is down, but all the employees were wearing masks and were courteous.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109270296971069209461", "name": "Christopher Burnette", "time": 1616986451550, "rating": 5.0, "text": "Great place to go", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109771806148985985893", "name": "Stephen Richardson", "time": 1620295398283, "rating": 2.0, "text": "Have to look for help when you need it", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107565643189478262943", "name": "Asad Khan", "time": 1593655530732, "rating": 5.0, "text": "Everything I was looking for, they had in stock... Sales Associate was very helpful...", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103196309004711384357", "name": "leah turner", "time": 1583897490207, "rating": 5.0, "text": "Darla in kitchen designs is the best kitchen and cabinet specialist that my company has ever dealt with. I hope they appreciate her.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116040791578042911230", "name": "Doressa Cobb", "time": 1575554418286, "rating": 5.0, "text": "The lady in the kitchen area was the most helpful I've ever seen in any store! Every store needs employees like her!!!! We were looking for knobs for cabinets and she was enthusiastic to help and have great info!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109372626033386545378", "name": "Teresa Morris", "time": 1598916732429, "rating": 5.0, "text": "My new shopping hardware store!!! No more shopping at Lowes for me.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108993363167133101343", "name": "Guy Miller", "time": 1610504183961, "rating": 5.0, "text": "Caught 300 count  Christmas lights on sale for $1.99. What a bargain", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112793287501862981803", "name": "Rita Richardson", "time": 1621396220756, "rating": 5.0, "text": "Good service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107472912101270201813", "name": "Agnes Jones", "time": 1578493524252, "rating": 5.0, "text": "Had the best check out cashier in the garden section. She made the trip a pleasure. Knowledgeable,  pleasant and efficient.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108455570912774566110", "name": "Alfred Murphy", "time": 1600023084851, "rating": 5.0, "text": "Gentleman in flooring was great in explaining options for my broken ceramic tile.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117801262450584330062", "name": "James Duke", "time": 1575734554019, "rating": 5.0, "text": "I took my daughter to do one of the free kids' Saturday projects. The space was well organized, and the associates very friendly. We will definitely try another.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113262204891381948054", "name": "Tom Blythe", "time": 1602118843569, "rating": 5.0, "text": "Excellent 2 ladies at customer service!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116246583955022535300", "name": "Mary Cherry", "time": 1599069197372, "rating": 5.0, "text": "Good place. Friendly people", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107160046004323485651", "name": "zach “ZacTurf-n-Sports” coffman", "time": 1619360462138, "rating": 5.0, "text": "Good leadership", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100482056128454942502", "name": "wes Coy", "time": 1617490979405, "rating": 5.0, "text": "Somebody said DeWalt", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110887497829573828168", "name": "pops296", "time": 1591042216478, "rating": 5.0, "text": "Great assistance and products. Very helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100947592268508277791", "name": "Hussain Alyousif", "time": 1590778047960, "rating": 1.0, "text": "Waited more than 15 min for help, and no one showed up. I asked 2 employees and they redirected me somewhere else. I ended up going to Walmart.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110680805187940007538", "name": "Mark Fikes", "time": 1620084636657, "rating": 5.0, "text": "Had everything wife needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100335350050962386824", "name": "Evon Parker", "time": 1616353655600, "rating": 5.0, "text": "Always got what you went to get", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113235848553027168355", "name": "Magdalena Peter", "time": 1615738165392, "rating": 3.0, "text": "They need a bigger variety on flowers", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105313906455636915776", "name": "Jasmine", "time": 1600401823862, "rating": 1.0, "text": "They are very neglectful with their in-home setups. You have to wait weeks before they can make the actual appointment then they do not work with you when they themselves have to reschedule due to the technician having to cancel. Mind you that this technician lives nearly 3 hrs away.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107296948444531258748", "name": "Don the time Lord", "time": 1596740397553, "rating": 4.0, "text": "It's good but they need to water the plants more because some of them look like they're wilting", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103654833316857499698", "name": "Mary Lou Sims", "time": 1583796302211, "rating": 5.0, "text": "I LOVE  HOME DEPOT ..BOUGHT HANGING BASKET  THERE SO PRETTY.GREAT VARIETY...", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103681730939090798553", "name": "Ronald “BIGDADDY” Scott", "time": 1580097658196, "rating": 1.0, "text": "Home depot is a place nearly impossible to get help. Do your research on your own for any projects. If you depend on the staff, you will most likely be misled. That's after you stand around waiting for help to come that never does. You have to hunt them down. Short of help almost 100% of the times I have shopped there. When I go there it's because they have what I need when nobody else nearby does. But I dont ask for information because they just dont know. Instead I carry my phone and Google in store.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101670471549315133738", "name": "commonsense forreal", "time": 1604764492840, "rating": 1.0, "text": "Do not buy anything from this home depot, their customer service,  is horrible,  they lie, when assuring they will return your call. If you pay for a job to be done there is no follow up to see if their horrible subcontractors have completed the job, and no one at the home depot is reasonable when its not completed. They get your money up front and you get the run around, October 15th I ordered doors and paid to have them installed, not only was the installation price more than advertised, its Nov 7th and I have the doors sitting in my living room floor, not installed,  but they took my money, so I warn you dont do business with home depot, I wont again.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116496315807220319912", "name": "Justin Kline", "time": 1583613019901, "rating": 5.0, "text": "Walked in, asked someone a question, they told be the exact aisle, hit self checkout and was out in about 5 mins.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105333932048428469220", "name": "Christie Hamilton", "time": 1593872459273, "rating": 2.0, "text": "I went in for 2things a blind and a cordless drill. I waited in the blind department for 45 minutes, they called 6 times for an associate, but no one ever came to help me or another couple. Then I went over to the drills, the man started to help me, another couple walked up claimed they were first, so he turned around said just look over there and walked off. I left in frustration.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111879236121876895579", "name": "Terri Langan", "time": 1599004867439, "rating": 5.0, "text": "Couldn’t live without HOME DEPOT! One of us is there every other day of the week!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102202494217631608643", "name": "Marcia Bean", "time": 1598899617694, "rating": 5.0, "text": "Picked up cinder blocks Just what I needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110535086056325761505", "name": "BeachNutty Brad", "time": 1584211150997, "rating": 3.0, "text": "I have always came to Home Depot for the service they provide.  I will be driving past Home Depot to drive to Lowe's from now on.  Home Depot has got rid of the registers and I had to scan all of my cart while the young lady stood over me to make sure I wasn't stealing anything.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105256378627230408426", "name": "Benny Manzanilla", "time": 1606268601365, "rating": 3.0, "text": "Not enough help the one that do have a very inexperienced", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110905842917720201327", "name": "Timothy Roy Whitley", "time": 1617737214073, "rating": 5.0, "text": "Got some spring plants", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116802486122278737370", "name": "Glenn Jones", "time": 1572128026868, "rating": 5.0, "text": "It helps if you find whatever you're looking for on their website first. The website will list where the items are in the store. Then it's easy to get in and get out.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106350035214090702422", "name": "Juanita Wallace", "time": 1592679998305, "rating": 5.0, "text": "I had excellent service enjoy shopping there", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104439982470146582938", "name": "Randall Cowart", "time": 1597549490421, "rating": 5.0, "text": "Home Drpot is great and the people work their are great.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112868761892738040259", "name": "kaoskat13", "time": 1581277558776, "rating": 1.0, "text": "Went into the store to purchase plexiglass. They did not have the size we needed. We found a girl and asked if it could be cut there. She said no. Which was fine. We asked if there was anywhere she was aware of that we could take it to be cut. She then informs us that oh no! There is nowhere that is allowed to cut them it is much too dangerous and risky. We went down the street to Lowe's. There we found this amazing hero who was willing to risk the impossible and cut our precious plexiglass while looking completely bored and half alseep.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117669765747809049382", "name": "Brandon Jackson", "time": 1583105029950, "rating": 5.0, "text": "I prefer this location to the one across from the festival center, but both are great.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100903083161674057350", "name": "Roberto Gonzalez", "time": 1604021222169, "rating": 2.0, "text": "There is not anyone to assist you.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115153288896045035979", "name": "Danny's Place", "time": 1577958443186, "rating": 5.0, "text": "Love Home Depot, just going in there makes me want to build something, and the staff is very friendly and helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114412420420786425296", "name": "Meloney Ashworth", "time": 1578532150739, "rating": 5.0, "text": "This is also a very clean, well kept store and the employees are friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101825549814721229373", "name": "Antonio Miller", "time": 1605370698648, "rating": 3.0, "text": "Ok if I can find help", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110472418809137016247", "name": "Margo Bickham", "time": 1579734951963, "rating": 5.0, "text": "Rxcellent home decor place! Prices were great too", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112944501230177249342", "name": "Alex Brotze", "time": 1609242028512, "rating": 5.0, "text": "Friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118170524364501248435", "name": "Dawg 69 (Dawg)", "time": 1599561965299, "rating": 4.0, "text": "Just like every other store right now with the pandemic low on inventory", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113109074032161929495", "name": "Duane Clark", "time": 1592069601470, "rating": 3.0, "text": "I like home depot but this location does not have a very good garden center.  Very poor selection of flowers.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105971734849142686941", "name": "RMK III", "time": 1579617359427, "rating": 1.0, "text": "went for a specific item. spoke to an employee there who said they'd get someone from that department.\nthey went down one aisle and stopped to talk to another employee for about eight minutes or so before I asked her if she had gotten someone to help me.\nshe said she was going to do that now and left.\ntwenty minutes later I left because I got tired of waiting.\non the way out I saw her again at the customer service desk just jabber-jawing with one of the managers.\nas I passed by them I said, \"I'm going to Lowe's. maybe I can get some help there.\" at which point the woman who said she'd get help tried apologizing and said she'd forgotten.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115547925685606397372", "name": "Chuck Cross", "time": 1578689762951, "rating": 5.0, "text": "Super nice clerks..\nGood selection of goods", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108835989467940756066", "name": "Robyn Curry", "time": 1577994952755, "rating": 5.0, "text": "**EDIT**\nSince the freezer mishap below the management staff (namely Dave) has gone above and beyond to make things right by me. I feel like The Home Depot has redeemed themselves and they have earned my business once again.\n\nI ordered an upright freezer to be delivered to my home. I missed three days of work for no-show deliveries and countless hours on the phone trying to get a freezer delivered and all I got in return was excuses and finger pointing. I had three managers from the West Mobile location involved in this situation (Dave, Cameron, and Jonathan) as well as the customer service help line. They were all aware of the fiasco that had occurred with this delivery yet when I asked what could be done no solution was offered. After a month of no freezer from the Home Depot I cancelled the order and bought one from Lowe’s. I had it the very next day. The Home Depot was always my go-to home improvement store but in light of the lack of customer service in this particular situation I think I’ll reconsider that.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110902223554959623010", "name": "Osborne Roberts", "time": 1608733297909, "rating": 4.0, "text": "Not as good as Lowes", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105252361242923707111", "name": "Matthew Hayes", "time": 1597324233539, "rating": 2.0, "text": "Seen several employees standing around chatting until I needed help finding something then there was nobody to be found", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113956031498285402458", "name": "Eric “A” Pettway", "time": 1594693828877, "rating": 1.0, "text": "Not enforcing social distancing and not enforcing the mandatory mask wearing!!!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106302319587767151087", "name": "Rebecca Gainer", "time": 1576246392411, "rating": 1.0, "text": "DO NOT PURCHASE FROM THESE PEOPLE!!! THRY DO NOT DELIVER THE APPLIANCE YOU BOUGHT FROM THEM, NOT ONLY DO THEY not come on delivery date scheduled, they dont even let u no they aren't coming, THEY DO NOT RESCHEDULE ANOTHER LATER DELIVERY DATE..HAVE BEEN O  HOLD 1 HOUR WAITING ON SOMEONE TO ANSWER MY CALL..*** AM GOING TO THE HOME DEPOT FOR MY MONEY I PAID THEM FOR WASHING MACHINE I PURCHASED, THEN I'LL GO LOWES, WHERE I SHOULD HAVE GONE IN 1ST PLACE...", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108034574595445164107", "name": "William Tackett", "time": 1604890613800, "rating": 5.0, "text": "I took that photo!!! Want to buy that refrigerator.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113035088980259270503", "name": "Peggy A", "time": 1602016473983, "rating": 4.0, "text": "They were busy closing off many aisles to stock and start putting up their holiday decorations 🤦‍♀️ However there were lots of staff to assist and I got what what I needed and was on my way out the door", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100293719502051322470", "name": "Myra Pierotich", "time": 1595365023909, "rating": 3.0, "text": "People never want to wait they don't want to help you lousy I don't like their plumber", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106819463579724545994", "name": "Kenny Tran", "time": 1581567787168, "rating": 5.0, "text": "Customer Service is always the best! Check their sales", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113549760866928539881", "name": "Dylan Daughety", "time": 1542318253937, "rating": 3.0, "text": "Home Depot has everything you could want from pipe tape to air conditioning filters. Generally convenient for any projects you may be working on because of the helpful staff willing to teach anyone a few things on how these projects work. You can also buy gardening supplies, laundry machines, and much more in this one store. Truly the star of capitalism.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106302319587767151087", "name": "Rebecca Gainer", "time": 1576246392411, "rating": 1.0, "text": "DO NOT PURCHASE FROM THESE PEOPLE!!! THRY DO NOT DELIVER THE APPLIANCE YOU BOUGHT FROM THEM, NOT ONLY DO THEY not come on delivery date scheduled, they dont even let u no they aren't coming, THEY DO NOT RESCHEDULE ANOTHER LATER DELIVERY DATE..HAVE BEEN O  HOLD 1 HOUR WAITING ON SOMEONE TO ANSWER MY CALL..*** AM GOING TO THE HOME DEPOT FOR MY MONEY I PAID THEM FOR WASHING MACHINE I PURCHASED, THEN I'LL GO LOWES, WHERE I SHOULD HAVE GONE IN 1ST PLACE...", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113956031498285402458", "name": "Eric “A” Pettway", "time": 1594693828877, "rating": 1.0, "text": "Not enforcing social distancing and not enforcing the mandatory mask wearing!!!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101654060967829356649", "name": "Bearofkratos", "time": 1579045590504, "rating": 4.0, "text": "Better then it use to be ,they seem to have nee knowledgable staff in the departments I have needed things in. As far as asking someone about things they dont know...they do still act like it is or isnt something they have without finding out. Hope this is fixed soon", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106819100192874622856", "name": "Ultreya Park", "time": 1550715134969, "rating": 4.0, "text": "Love to drive by the garden center just to see the flowers and plants and brighten my day. Nice that it is so accessible and laid out well. Helpful people. Convenient to group with other errands or on an outing to eat out. Located between Kohl's/Cracker Barrell/movie theater, and Wal-Mart/Burke's Outlet/Rue21. NEED to clean more! Hire people who like to clean.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100293719502051322470", "name": "Myra Pierotich", "time": 1595365023909, "rating": 3.0, "text": "People never want to wait they don't want to help you lousy I don't like their plumber", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106865234073238981165", "name": "Isabelle Delannoy", "time": 1590271832798, "rating": 5.0, "text": "Good prices and people", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110902223554959623010", "name": "Osborne Roberts", "time": 1608733297909, "rating": 4.0, "text": "Not as good as Lowes", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108827484100317662019", "name": "Bo Betzler", "time": 1606596174047, "rating": 2.0, "text": "Not much interaction or help from the employees.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111435636794123727691", "name": "JEFFRY Howard", "time": 1594399261406, "rating": 5.0, "text": "Always a great experience for contractors.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118407322366229731303", "name": "K Bradley", "time": 1604912127029, "rating": 4.0, "text": "Gr8 shopping experience  !!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112055864570295101136", "name": "Veronica Saucier", "time": 1581540199725, "rating": 4.0, "text": "Good just had to exchange some items", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108827484100317662019", "name": "Bo Betzler", "time": 1606596174047, "rating": 2.0, "text": "Not much interaction or help from the employees.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103699326359330609546", "name": "John Waldron", "time": 1578508321960, "rating": 5.0, "text": "Always a great visit when you need something.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107608434828489518959", "name": "Jennifer Emley", "time": 1594860733296, "rating": 1.0, "text": "Horrible! We went in to get filters for the refrigerator and we had to get someone to page for help and still no one came.  There was someone else waiting before we got back there and no one had come to help him either.  We left and went to Lowe's, so did the other guy that was wanting to purchase a refrigerator, freezer  and a washer and dryer.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113640002932594804979", "name": "Kenneth Woodward", "time": 1574014255325, "rating": 1.0, "text": "No one in the store can help you find anything even when you know what you need. Went to customer service and they pages someone 3 times and couldn’t get a return call. Finally called another employee which did not want to come and asked the other employee to call the first person they paged. I hate when I’m a bother to a company. Left and went to Lowe’s.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100259382616853418311", "name": "Reginaldo Garcia", "time": 1553002359581, "rating": 5.0, "text": "Frequent shoppers at Home Depot.  Gale is my \"Go To\" staff person for assistance. He is  characteristically welcoming, friendly, knowledgeable, efficient, and helpful. Thank you!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104942844188293985048", "name": "J Johnson Law", "time": 1604817671196, "rating": 4.0, "text": "Good shopping experience", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100840300821011101286", "name": "Mama Hall's Kitchen", "time": 1596392633178, "rating": 4.0, "text": "Very helpful employees.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102140288297413302535", "name": "Mz Monique", "time": 1563324163205, "rating": 1.0, "text": "What I don't  appreciate is when a customer ask for assistance after waiting 20 to 25 minutes later and still no one comes.I think that's unacceptable they will not have to worry about me spending my money there ever!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110093615715967242121", "name": "bridget", "time": 1611450648100, "rating": 4.0, "text": "Lots of home improvement items", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108249047282101500379", "name": "Shaun Steffensen", "time": 1519340673124, "rating": 1.0, "text": "If you order appliances from somewhere, do yourself a favor and not order from Home Depot. First, the people who are selling the appliances do not know much about them. I was told that for installation of my microwave, I needed an outlet in the wall that it was being installed on. Great. I'm good. WRONG!!! The outlet had to be above the microwave.... Something that would have been nice to know, but they could not communicate that properly.\nThen, the delivery/installation people had no idea what they were doing. They were more of a delivery company, not an installation professional. They could not install my gas range. They damaged my microwave. So, really, they weren't even a good delivery company. Home Depot just subs out delivery to the cheapest company....and you can see the quality when your damaged items arrive!\nAnd I pray for you if you have ANY problems with your delivery or installation!!!\nCount on a couple of things: 1) You will spend hours on the phone getting to talk to the right person. Once you think that you have the right person, they will tell you they have to check on something and they will have to call you back. OR, the right person is \"on lunch\" and they will call you back. After giving them ample time for \"lunch\" (3 hours) when you call them back, you will be told that they were \"off today\" but they will return your call in the morning.\nBasically, it's a game of ping-pong and it takes days to get simple questions answered because, obviously, no one who works there wants to actually do anything.\nI can't believe I dropped over $7K in there and they can't even answer a simple question!!!!\nBuyer beware!!! Shop at Lowe's!!!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116306875088218071030", "name": "jesse wilkins", "time": 1600145764861, "rating": 2.0, "text": "Terrible layout and not a very good selection", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105950966549735259266", "name": "Annett Bosarge", "time": 1560905879732, "rating": 2.0, "text": "Need more help on the floor...if you need something get ready to fine it your self..", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111620370464856936162", "name": "Tommy Gardner", "time": 1590449263610, "rating": 2.0, "text": "Don't carry the vent hood parts in store and the ones you do are on the opposite sides of the store.all the employees could tell you was they probably online 😂", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103157777360308114523", "name": "John Ghegan", "time": 1500265857945, "rating": 3.0, "text": "The employees are always friendly and  knowledgeable. I have a credit card with them and today might be my last visit . I went to buy some 2x4x16s and some 4a4s.  The prices on those items were 4 dollars above average. I went to Lowe's and saved 78 dollars on the same exact same lumber.\nThere should not be such a price gap...", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117487217502503390968", "name": "Paul Bacon (Bacon's Pub)", "time": 1578519794250, "rating": 4.0, "text": "Store is clean, friendly employees, coffee is always fresh.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114172462849939682010", "name": "Dan Depuy", "time": 1504293389774, "rating": 3.0, "text": "Bought 8 bags of river rock. I loaded it on the cart and loaded it in my truck. Was disappointed that no one helped. Yet I saw people standing. This is not my normal experience with Home Depot. Usually everyone is eager to help. Hopefully this is a one time event.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101060113010857986385", "name": "Melissa F Gibson", "time": 1555613232244, "rating": 5.0, "text": "MOST excellent customer service on contractors side the 2 morning ladies make me smile even when I don't have anything to smile about", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116969073931554268197", "name": "Michael McCarthy", "time": 1600031820300, "rating": 5.0, "text": "Remodeling project, needed several items found everything.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104809727798572497929", "name": "daniel Burdette", "time": 1608316310664, "rating": 5.0, "text": "Friendly and helping", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100485981822101815118", "name": "Ken Todd", "time": 1594109355356, "rating": 4.0, "text": "No delays at checkout.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112468064019371032056", "name": "Matthew Sando", "time": 1595356410479, "rating": 4.0, "text": "Great customer service..", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109064380289511496126", "name": "David savoy", "time": 1553107670362, "rating": 5.0, "text": "I'd rather go to Home Depot over \"big blue\" because customer service is better and the store layout makes it easy to find what I need.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109649978467882785856", "name": "Sam Tate", "time": 1553020791367, "rating": 5.0, "text": "This is one of my favorite places to shop fast friendly service and they don't have a problem with helping you.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107091869637018185297", "name": "Rickie Peters", "time": 1600714734063, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105519853751389110616", "name": "Walter Stearman", "time": 1546099688890, "rating": 4.0, "text": "I would much rather use the Home Depot than Lowe's any day the people that work at Lowe's are rude the people that work at Home Depot or Awesome every one of them that I've ever talked to has been very courteous and very friendly and like always you get better deals at Home Depot then you would at Lowe's I called in to get a quote on some roofing material it took me 3 hours to get a quote that I did not even get don't go to Lowe's", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113690954212440982225", "name": "Debbie Fikes", "time": 1609790396569, "rating": 5.0, "text": "Had everything I needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104503932638541959944", "name": "Matt DeBlaey", "time": 1533205235889, "rating": 4.0, "text": "I needed some assistance finding something. I've had to search for help before but today it seemed like they were everywhere. Great customer service. Home Depot Alston seems to have what I need over the other stores lately. Even though I am closer to another, I just drive here because they have what I need.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101315351200690673747", "name": "Tom Thornton", "time": 1528228298030, "rating": 5.0, "text": "Nicest Home Depot I have been too. Mike the store manager was great and very helpful. Didn’t push me off to someone else and helped me load my new grill as well! Thank you!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103676840226204440483", "name": "Jane Roberts", "time": 1603124347014, "rating": 5.0, "text": "Fast, efficient service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101662871063598781943", "name": "Angel Kerney", "time": 1553480248319, "rating": 5.0, "text": "Great service....lady in the paint dept. was patient with us & also learned a little while we waited just before closing😜", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108111676498132264084", "name": "susie pierce", "time": 1544927163076, "rating": 5.0, "text": "Had a very pleasant experience. They were  prompt with my order.\nI will continue to shop at Home Depot.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115863217564989131875", "name": "J Jackson", "time": 1529781137064, "rating": 3.0, "text": "Went looking for a trimmer. Surprised to find refurbished trimmers at a fraction of the cost of a new one! And I could purchase a replacement warranty from the store also.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106815759251078947569", "name": "Michael Peaden", "time": 1534287905011, "rating": 5.0, "text": "I'm here everyday , sometimes twice. Just wish they would hire some knowledgeable ppl. It's definitely a do it yourself place .", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108346923478261534226", "name": "David Pham", "time": 1615587774812, "rating": 4.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103666264481733099065", "name": "Laura Kinsey", "time": 1513367264069, "rating": 5.0, "text": "I have been so amazed at the quality of service at this Home Depot store. There are plenty of helpful and knowledgeable staff ready to help you. I drive out of my way to shop at this store.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116249679342655818500", "name": "Robert Harrison", "time": 1590507985761, "rating": 5.0, "text": "Great place to shop.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107552663340007368137", "name": "Debbie Phil", "time": 1583426262878, "rating": 4.0, "text": "Good selection of tools and home items", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101539777611793326877", "name": "OBrien Holcombe", "time": 1520525312049, "rating": 5.0, "text": "I prefer this big box store. I work in multiple states in different counties and cities and h.d. is where ever I go. So I stay consistent with quality.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111192683215328183471", "name": "Jon Mullen", "time": 1513539794028, "rating": 4.0, "text": "Lovey was VERY helpful and a pleasure to deal with. The only reason it wasn't 5 stars was the unavailability of the appliance we wanted when we wanted it. Overall it was a very enjoyable experience.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111355980571480367779", "name": "Adam Robinson", "time": 1580338537540, "rating": 5.0, "text": "Very helpful staff and good selection", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102203631523731829562", "name": "Kimberly Bates", "time": 1535897686923, "rating": 5.0, "text": "I appreciate that home depot has Saturday morning kids workshops.  My little guy loved it.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN0gU05yWc39rqXOBrVmAgaWkXOtaW-zta1Rolk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102120332704426358467", "name": "Tracy Kelton", "time": 1555975223167, "rating": 4.0, "text": "A little difficult to locate help in the store,  but overall very clean with helpful staff", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107207837763775911766", "name": "rebecca strickland", "time": 1584259708985, "rating": 3.0, "text": "If you ask where something is they literally have to look on the app to see.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100196848760287918014", "name": "Frank Karwoski", "time": 1595791973099, "rating": 4.0, "text": "Same consistent service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101871889054132280278", "name": "Rick Taylor", "time": 1617146238426, "rating": 4.0, "text": "No service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101079947091563059672", "name": "Timothy Cherry", "time": 1617491247130, "rating": 5.0, "text": "A+", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115260004251416110175", "name": "Sharon Naman", "time": 1520214432454, "rating": 5.0, "text": "Always enjoy going to Home Depot. Everyone was kind and very helpful. Thanks for all of your help.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116809699803642081953", "name": "Melissa Nicely", "time": 1617568292353, "rating": 5.0, "text": "Needed a ladder", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113455325428195403159", "name": "James J", "time": 1547353784149, "rating": 3.0, "text": "Good luck finding someone to answer a question. Better prices though.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107207837763775911766", "name": "rebecca strickland", "time": 1584259708985, "rating": 3.0, "text": "If you ask where something is they literally have to look on the app to see.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101079947091563059672", "name": "Timothy Cherry", "time": 1617491247130, "rating": 5.0, "text": "A+", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108132685035891926959", "name": "Lee Will", "time": 1600172715672, "rating": 5.0, "text": "👍", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110216665266841559589", "name": "Ms Q", "time": 1557258866065, "rating": 1.0, "text": "I've tried to order ceiling tiles from this location since April 5th. It is now May 7th and they are still not in. First batch was broken. That's ok but 3 weeks later still nothing.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116809699803642081953", "name": "Melissa Nicely", "time": 1617568292353, "rating": 5.0, "text": "Needed a ladder", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111355980571480367779", "name": "Adam Robinson", "time": 1580338537540, "rating": 5.0, "text": "Very helpful staff and good selection", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102873848574055058950", "name": "BRIAN JOHNSON", "time": 1533935555673, "rating": 1.0, "text": "The black girl in the garden department has this “I hate my job... I hate my life.... and I hate you...” look on her face. In her voice and in her posture. I felt bad about asking her how much the pine straw was...... as if I was not allowed to speak in her presence or as if I bothered her while she was out in space because it was slow. I just wanted to get my pine straw and leave before she started open fire on me for asking her to do something so bizarre as giving me a quote.\nIt’s people like her that worry me....", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100698451629668427992", "name": "Kitty Cat", "time": 1537376429001, "rating": 5.0, "text": "The employee's are helpful!👍\nThey have a lot of awesome halloween decorations!!! They have really anything you need for remodeling, air conditioners, decorations and ect.\n😸😸", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102675416392399376892", "name": "Nelson Dorgan", "time": 1546205721193, "rating": 5.0, "text": "Pleasant. At least 10 people ask if i needed help.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111064563693576657675", "name": "Cary Campbell", "time": 1593448495731, "rating": 5.0, "text": "Always a good experience", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116251679599506463513", "name": "Robbin Hilbert", "time": 1551640546895, "rating": 4.0, "text": "Nice and helpful employees, have a lot of veggie, flowers, and herb  plants. A lot of home improvement supply's.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118046956968089073055", "name": "Roger Clark", "time": 1579209266002, "rating": 1.0, "text": "You need to fire everyone in your Appliance Department, nobody knows what they're doing", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114972890779130776757", "name": "Tony Harrison", "time": 1488085209212, "rating": 4.0, "text": "I love shopping at The Home Depot. I find that it's much cheaper than Lowe's. Very friendly employees but they are in need of hiring more employees bad.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117252104033640038881", "name": "Tolley Smith", "time": 1570660136997, "rating": 5.0, "text": "Always perfect go in get what I need and leave", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103836949348301591948", "name": "Almightycorn", "time": 1582941881293, "rating": 4.0, "text": "Always my top choice", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114712778326107866835", "name": "Doris Martin", "time": 1549552943298, "rating": 4.0, "text": "Friendly staff, items easy to find, good prices", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111064563693576657675", "name": "Cary Campbell", "time": 1593448495731, "rating": 5.0, "text": "Always a good experience", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103151469593971789226", "name": "Paul Manning", "time": 1577740628869, "rating": 5.0, "text": "Came home with everything , i went after kayla in flooring, helped me  ,very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100779295001455203355", "name": "deanna lanier", "time": 1582504822927, "rating": 1.0, "text": "The people that work here just walk around,  aimlessly!!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114786495704776052318", "name": "Courtney Wolfe", "time": 1523188586168, "rating": 5.0, "text": "Came here on Thursday evening to purchase a dryer. Bien help us & if I could give that man 5 stars of his own I would. He was nice, helpful & knowledgeable (I ask questions) We also found a disherwasher in the mark down area after he had rung up the dyer but Bien didn't mind he got us hooked up with that as well. Every time  I've been there Home Depot employees are friendly & patient. Please keep it up guy!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100698451629668427992", "name": "Kitty Cat", "time": 1537376429001, "rating": 5.0, "text": "The employee's are helpful!👍\nThey have a lot of awesome halloween decorations!!! They have really anything you need for remodeling, air conditioners, decorations and ect.\n😸😸", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100882311540374764492", "name": "Prince G.", "time": 1555533773327, "rating": 1.0, "text": "Sucked no one knows nothing from nothing dont you work there for a reason or just for a paycheck", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100399574085670850453", "name": "Mark L Tate", "time": 1553370758535, "rating": 5.0, "text": "Always find what I need and then some.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105820758827869839747", "name": "Rich", "time": 1530563568949, "rating": 4.0, "text": "People were helpful in finding light fixture, receptacle and wall hangers.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112860769336469642587", "name": "Roy Davis", "time": 1530668711903, "rating": 5.0, "text": "Customer service was excellent.  That helped me find things I had no idea of their location.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105478552768494572814", "name": "Dennestons world", "time": 1549062010110, "rating": 5.0, "text": "Great store for the DIY projects and how to manuals as well.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114308510732916219398", "name": "georgia hacker", "time": 1518642099569, "rating": 2.0, "text": "I am handicapped.  Bought 5 bags of mulch . cashier called someone to load it for me. Finally after I realized no one was coming had to struggle & load it by myself.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109028418160116453852", "name": "Julius Dixon", "time": 1513454008429, "rating": 5.0, "text": "Wonderful experience people friendly helpful all your work is a really good people love to smile and greet you keep up the good work", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101987044554609727582", "name": "Dr L", "time": 1532743095070, "rating": 5.0, "text": "Great helpful service tell them what you want to do and the give you ways to do it good prices and selections", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105368106133542353135", "name": "Howard Strum", "time": 1594216220578, "rating": 1.0, "text": "Never has what I need.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111141955990335730291", "name": "Tommie Williams", "time": 1597981026588, "rating": 4.0, "text": "Good location", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115111173974195082665", "name": "Robbie May", "time": 1526675683654, "rating": 5.0, "text": "Shopping for a large window AC. Service  Desk personnel were extremely helpful in helping us get the correct unit and loaded it Into our Truck. 22000 but LG for $619.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118428536883982090004", "name": "Victory Reliable Services, LLC", "time": 1523038269144, "rating": 4.0, "text": "Excellent Pro Desk service, the best in the region in a good 60 + mls radius beat any other HD in this department, the dynamic duo Marcia and Elizabeth will go the extra mile to find materials for any project, for hurricane preparedness questions and needs ask for Melinda. The store is well organized and seems like they don't move stuff around a whole lot like at any other HD. The rest of the staff in the other departments (plumbing, electrical, etc.) are outstanding too, they're very helpful, with good knowledge, courteous and eager to help.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102808662761612941757", "name": "Steven", "time": 1535315470552, "rating": 4.0, "text": "Can always find stuff to buy. Just not always what I'm going for.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111986029497490221900", "name": "Eguene Walker", "time": 1583123775136, "rating": 2.0, "text": "There's never anyone there to answer your questions", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107678998529995131834", "name": "Rebecca Jett", "time": 1553812209551, "rating": 4.0, "text": "Helpful staff and well stocked with what you need, when you need it!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106961822857426341956", "name": "William Sutherland", "time": 1593810290585, "rating": 5.0, "text": "They have everything I need", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102875121437485715461", "name": "Trish Morley", "time": 1543793360299, "rating": 5.0, "text": "Great place for our home. Always in there.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107351436513139773109", "name": "DARK 2.0", "time": 1528948172825, "rating": 5.0, "text": "Bought my stove from there lovely experience good customer service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100543828475427551472", "name": "Joe T", "time": 1552009877849, "rating": 5.0, "text": "Found just what I needed.  Good price.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106581561356093837246", "name": "Holli Basch", "time": 1608589016098, "rating": 4.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116096364600953090374", "name": "Len Wells", "time": 1495726577652, "rating": 1.0, "text": "No one answers the phone.\nMost employees know very little about what is in the store where it is at or if there is any in stock.\nThe internet tells you they have a product but it is not there when you go to get it and no one will answer the phone so you can find out if others before you drive up there.\nNo real sales or discounts in the store.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106802828426796673277", "name": "Megan Crane", "time": 1426167213242, "rating": 5.0, "text": "Bridget the Customer Service supervisor is amazing. She spent over an hour trying to get a online order sorted out for me. She never acted annoyed or upset. Always a smile on her face. She is wonderful!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110271316640344862500", "name": "Jessie Sanders", "time": 1512410686379, "rating": 5.0, "text": "L wonderful experience went back to the paint department they tell me where everything I needed to go get what I'll it was on help me find the paint I needed and it was the right kind", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100550476030937518508", "name": "Lacey Paquin", "time": 1514066099176, "rating": 1.0, "text": "I ordered $1,600 worth of appliances on black Friday to furnish my investment property. I scheduled them to be delivered on Friday, 12/22, and I was told the delivery time frame would be from 2pm-6pm. I planned accordingly and the my appliances were never delivered! No CALL or anything. It took me 4 different phone calls to reach an actual person. The delivery people could not be reached. I waited at the property until 10pm. I went to the store the next day and spoke with the manager, and apparently I was the 3rd customer complaining of no delivery and no notification. The store could not reach the delivery service because they were closed, and would not re-open again until that Tuesday after Christmas. I was told they \"might\" start calling customers then to attempt to re-schedule deliveries. I found this to be completely unprofessional and unacceptable. I cancelled my order and was refunded my money. I am showing my rental Wednesday and it will be empty. Home Depot has hurt my business.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114623470391982426972", "name": "Jamie Pierkowski Ishmael", "time": 1551351614910, "rating": 5.0, "text": "Everyone is so nice and helpful there.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109348560891921236241", "name": "Manda McGuff", "time": 1482338530957, "rating": 5.0, "text": "Unfortunately I had been shopping with lowes. It had been on more than occasions than not a terrible experience. I decided to try Home Depot in my recent purchase of a bathtub. Within the first 5 minutes of being inside the store I was greeted by 4 associates. All of which were very welcoming and friendly none of which I have ever experienced at lowes. They pointed me in the direction I needed to go. Upon my arrival of the bath tub isles another associate was there eager and ready to assist me. He opened the merchandise and checked for defects and everything to my satisfaction. None of which I have ever experienced at lowes. Even on the way to check out associates asked if there was anything more they could do to help. Overall my experience at Home Depot was outstanding. I work in customer service and a lot of places lack in that department. Job well done!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102411274432499355628", "name": "P Thomas (PCFROG)", "time": 1584147284227, "rating": 4.0, "text": "Paint department has Friday nights off.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117866553938772280874", "name": "Hummingbird Verses", "time": 1593812204951, "rating": 1.0, "text": "Was never there.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114159913113927283524", "name": "Aaron Cowden", "time": 1511023353751, "rating": 1.0, "text": "The ladies at the registers are great but there is no stadf for assistance, and theyre not too knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101621782740978021423", "name": "Al Sauls", "time": 1503526818910, "rating": 5.0, "text": "While at Home Depot a male associate named Leyland and a female associate named Tonja were very helpful to me and my wife in selecting a dish washer and ceiling fan for our home and rental house. They made sure that we got the best price and the discounts that were available to us.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108463844422818951198", "name": "Emilio Valdez", "time": 1503169869533, "rating": 5.0, "text": "Great help. Lowe's lost over $600 on flooring because the manager didn't have time to come help my wife so she came to home depot were we got a better selection and cheaper.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104163262876088875250", "name": "Carolina Alday", "time": 1519947847514, "rating": 5.0, "text": "The employees were very knowledgeable and helped me with everything I needed to get.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111201889428627324697", "name": "Erika", "time": 1503277339795, "rating": 5.0, "text": "Store manager Michael was incredibly helpful in finding exactly what I needed for my vent cover project!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109921743136263194457", "name": "MH M", "time": 1482099982071, "rating": 5.0, "text": "Landon did a great job of helping me find what I needed to finish my project.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105401966393512449430", "name": "joseph morris", "time": 1533039140418, "rating": 4.0, "text": "Better than the one on Montlemar Dr. Better stocked.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101009946016441361608", "name": "Terry And pipe pipe.", "time": 1605624497017, "rating": 2.0, "text": "Not happy", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104343322407975601358", "name": "Sean Steelreath", "time": 1522457503216, "rating": 5.0, "text": "Professional staff, Extremely clean shitters what more can u ask for", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107080001725918330267", "name": "Samantha Barton", "time": 1561739546064, "rating": 4.0, "text": "Stopped shopping there when they discontinued the military discount. Cancelled my credit card too", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106132977503775641982", "name": "Frank Davis", "time": 1546614097007, "rating": 5.0, "text": "Home debot, like Lowes, gives military discounts up to $50.00 towards their more pricey items which is a help.  10% across the board but its a start.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111141955990335730291", "name": "Tommie Williams", "time": 1597981026588, "rating": 4.0, "text": "Good location", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106132977503775641982", "name": "Frank Davis", "time": 1546614097007, "rating": 5.0, "text": "Home debot, like Lowes, gives military discounts up to $50.00 towards their more pricey items which is a help.  10% across the board but its a start.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110128508212684208422", "name": "Mike Anderson", "time": 1535539930383, "rating": 5.0, "text": "They have everything you need,for any Project you you have to tackle. Tools and more, Great Prices Too.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118428096489468065193", "name": "Clausell Huff", "time": 1593794561331, "rating": 5.0, "text": "Excellent service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108721048350671908512", "name": "Richard Long", "time": 1596139727767, "rating": 4.0, "text": "Bought what I needed.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102734014262906328928", "name": "Wesley Packer", "time": 1595389227430, "rating": 3.0, "text": "They a little pricey", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117866553938772280874", "name": "Hummingbird Verses", "time": 1593812204951, "rating": 1.0, "text": "Was never there.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101009946016441361608", "name": "Terry And pipe pipe.", "time": 1605624497017, "rating": 2.0, "text": "Not happy", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104712438291178280495", "name": "Luke Hildreth", "time": 1546892330264, "rating": 4.0, "text": "Great but need more register open", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101582180480024203533", "name": "Shawn Hinderman", "time": 1592523214489, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104639630769269065496", "name": "Herminio Flecha", "time": 1546227014771, "rating": 3.0, "text": "Unless you know what you are looking for, dont ask the store clerks. You can rarely find any store associate to help. Associates are not familiar with the store's products.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108721048350671908512", "name": "Richard Long", "time": 1596139727767, "rating": 4.0, "text": "Bought what I needed.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105323128250421231146", "name": "James Prowell", "time": 1606960761032, "rating": 1.0, "text": "No help!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101541602566671242619", "name": "Justin Hobbs", "time": 1427279967050, "rating": 4.0, "text": "Friendly staff. I visit this location daily, they are always helpful. They usually have what I need also.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107298757813376665622", "name": "Knowledge Gulley", "time": 1583278024519, "rating": 5.0, "text": "Friendly and Very Helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102734014262906328928", "name": "Wesley Packer", "time": 1595389227430, "rating": 3.0, "text": "They a little pricey", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111653794026138916581", "name": "jan kennedy", "time": 1392747126223, "rating": 1.0, "text": "Don't go for special order blinds. The associate  could't even tell me the name of the display model so I could order it. She said it might be outdated.. She also said she would research and get back to me but I got the impression she never would.. what a waste of time.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102068549540202716710", "name": "Chris Adams", "time": 1582330743229, "rating": 4.0, "text": "David help was awesome", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106574148164203850254", "name": "Paul Roberts", "time": 1518384873646, "rating": 5.0, "text": "Employees were helpful. Had several walk up and ask if we needed assistance", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103039852126736852093", "name": "T Denton", "time": 1532176110924, "rating": 4.0, "text": "Good appliances. Slow service.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102700113626857969621", "name": "Rick Robinson", "time": 1550615632442, "rating": 4.0, "text": "Good selection of home improvement items", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112672335846397238901", "name": "Jay Becks", "time": 1533845781965, "rating": 5.0, "text": "Great lumber amd huge selection of products", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100307342772303780445", "name": "MILO BROWN", "time": 1365712029861, "rating": 2.0, "text": "I spent 35 minutes in the power tool department. I went to customer service to ask for assistance and the lady said she would help. I asked her a question and she simply turned to  another employee  and asked him. He responded that the item i was looking for was\"by the ladder\" and just walked away. The item was not by the ladder. This is the worse customer assistance I have ever seen. Twice in two weeks. I will never spend another penny at this crap hole. Lowes will continue to get my currency. HD SUX!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105210760005763006698", "name": "Mike Jones", "time": 1581647471216, "rating": 5.0, "text": "Great for home improvement", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101582180480024203533", "name": "Shawn Hinderman", "time": 1592523214489, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116190989415552930293", "name": "Mathew Kasper", "time": 1556637176548, "rating": 3.0, "text": "Very clean store. My cart was taken by someone while shopping. Not a great tool selection. Lots of items were out of stock. Customer service needs improvement.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108698198049461626156", "name": "Bruce Jones", "time": 1533337067315, "rating": 1.0, "text": "Awful place to shop. I went in there today to buy anchor bolts. Everything was in disarray. Very unorganized. I had to go fight airport blvd traffic and go to Lowe's", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116303520436914352827", "name": "James Stallworth", "time": 1548865184040, "rating": 5.0, "text": "Great store and helpful employees.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111593104390973544180", "name": "Ana Thema", "time": 1543282063682, "rating": 3.0, "text": "I found what I needed with the help of 4 different enployees", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111218838315913634196", "name": "Brian Cobb", "time": 1549582592134, "rating": 5.0, "text": "I got lost and couldn't find something immediately and had to ask a store clerk for help. So all in all nothing was missing from this visit compared to every other Home Depot visit I've had throughout my life.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100047080999638277350", "name": "Robert Thomas", "time": 1590321425089, "rating": 5.0, "text": "Good selections", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113222393143509711869", "name": "Faye Sheffield", "time": 1578090941722, "rating": 3.0, "text": "Customer service not great!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109887666982652873039", "name": "LC, CE, & DG Mitchell", "time": 1526951552920, "rating": 5.0, "text": "Was looking for an item that looked like it was sold out and one of the associate saw that it has just came in on a big shipment. He found the item and brought it to me.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117182453788562777316", "name": "Amy Toler", "time": 1553799058631, "rating": 1.0, "text": "Associates were rude and had no knowledge of the products they are supposed to be selling. I will not shop at Home Depot again.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116947039998168789506", "name": "Matthew Rhodes", "time": 1464883431720, "rating": 3.0, "text": "They always seem to have less than Lowe's. Their tools seem to be a better value though.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112574890016378356322", "name": "Samaria Moore", "time": 1537118883404, "rating": 4.0, "text": "Friendly people who were available to help", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104941670521887577832", "name": "ashley howell", "time": 1543788734360, "rating": 1.0, "text": "Salesperson in tools was very rude to my husband. Will not be returning to this store.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109466651452253254805", "name": "Charles Holland", "time": 1524264361756, "rating": 5.0, "text": "I've always liked Home Depot. Can't complain about this location so far!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105265525173498214949", "name": "Philip English", "time": 1545803350838, "rating": 2.0, "text": "Who can help me find what I'm looking for and know about the product?????", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110443859125230193711", "name": "Mark Moose", "time": 1553091456594, "rating": 5.0, "text": "People were nice and helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113641364958886547898", "name": "Louie Guertin", "time": 1530528229735, "rating": 5.0, "text": "Friendly curious staff. Helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104190293445325183239", "name": "GHOST AMERICAN BEDOO", "time": 1583776282154, "rating": 5.0, "text": "Zero N95 masks available.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110850431431222582388", "name": "Marie Lange", "time": 1548541339429, "rating": 5.0, "text": "But I bought a pitchfork and some lime time to turn my mulch pile", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109255002131882591689", "name": "JoAnn Rolin", "time": 1595443739502, "rating": 5.0, "text": "Found what I was looking for", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105857503108963277455", "name": "Mildred Braun", "time": 1578546555404, "rating": 5.0, "text": "Has everything ineed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116903518238209213835", "name": "Robert Howell", "time": 1544579283345, "rating": 5.0, "text": "Great customer service.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116873093007762223478", "name": "Arild Warholm", "time": 1549498672714, "rating": 4.0, "text": "Found what I was looking for.👍", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112206044726385431454", "name": "Jeffery", "time": 1607224111355, "rating": 4.0, "text": "Same", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108848425929892270304", "name": "Dena Amison-Middleton", "time": 1573334706701, "rating": 4.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115874532383571328778", "name": "Harold Thomas", "time": 1544061476078, "rating": 4.0, "text": "Love the place.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110890729795807530632", "name": "Anthony Welborn", "time": 1577916556837, "rating": 4.0, "text": "Many things on sale", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115482212534389928686", "name": "william smith", "time": 1539640619833, "rating": 2.0, "text": "I had to ask several people where I could find a PRESSURE WASHER,they all sent me to an aisle that has smokers,grills,and PRESSURE COOKERS!!!!°°°", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115170416762104050335", "name": "Charles Brooks", "time": 1539446425427, "rating": 5.0, "text": "Always a good experience", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117632984121279447948", "name": "Jason Hodges", "time": 1576187092747, "rating": 5.0, "text": "Always awesome!!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108274439345624128512", "name": "Joe Williams", "time": 1549334964923, "rating": 1.0, "text": "Not good try to get some help in the blind department on one came to help", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103597519588746451759", "name": "Kent Busby", "time": 1545737474556, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100242437977343106929", "name": "Bob Phillips", "time": 1555280840082, "rating": 5.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117062338824095554856", "name": "United Public Radio", "time": 1545748041066, "rating": 3.0, "text": "Could have been better", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100930665885371488074", "name": "Tim Brazell", "time": 1533501819943, "rating": 5.0, "text": "Very good service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100547465487374394620", "name": "TJ Averett", "time": 1578868225056, "rating": 3.0, "text": "No vegetable seeds", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112337751910822875937", "name": "Cantare Alabanzas al nombre del Señor", "time": 1529430292980, "rating": 4.0, "text": "Good customer service.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106837932504973756211", "name": "tim shewmake", "time": 1542483289202, "rating": 4.0, "text": "No one to help you", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112581671648541211232", "name": "Take Flight", "time": 1532576552443, "rating": 5.0, "text": "Great experience", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104716775472412256539", "name": "Michael Thomas", "time": 1553023313416, "rating": 5.0, "text": "Great product", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103866852895116876040", "name": "Darlene Wolfe", "time": 1546546649259, "rating": 5.0, "text": "Helpful staff, always.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117321159902698272338", "name": "Osborne Roberts", "time": 1545624385134, "rating": 5.0, "text": "Great tools, compatible prices,", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110268379310929563933", "name": "Amber Hight", "time": 1539475838417, "rating": 5.0, "text": "Nice vist", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109218804703885207004", "name": "lisa schreiner", "time": 1545576579366, "rating": 4.0, "text": "Found everything I needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113390643922318265845", "name": "Gary Walker", "time": 1532348350154, "rating": 3.0, "text": "Good layout", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110053686816649363124", "name": "Liz Ming", "time": 1549227649207, "rating": 1.0, "text": "Can't find help", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104782360706800629617", "name": "Lula Porter", "time": 1524518489431, "rating": 3.0, "text": "Seemed s little shorthanded today. It took the man with the forklift a half hour to get my fridge to the door.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108060180123467399396", "name": "deep south Diesel cowboy", "time": 1535264948837, "rating": 4.0, "text": "I go here for most of my construction needs", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114228943109386201276", "name": "Kevin May", "time": 1556334861974, "rating": 4.0, "text": "Like it cool stuff", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105594355121661133492", "name": "Grand Bay City Girl", "time": 1546222679287, "rating": 5.0, "text": "Nice people", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106100745204828030801", "name": "Terry Manzy", "time": 1547472030369, "rating": 5.0, "text": "Have everything that you need from garden to home projects", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106087890297713426628", "name": "Nathan Hunt", "time": 1549731639961, "rating": 4.0, "text": "Need more plumbing parts", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117397604931476613301", "name": "joshua Atkins", "time": 1537667395087, "rating": 4.0, "text": "People were nice, and helpful....", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107362106692827508163", "name": "CHARLES MILLER", "time": 1528506774718, "rating": 5.0, "text": "Refigerator install went great", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112899706162875837839", "name": "Tony Lamm", "time": 1531145168331, "rating": 5.0, "text": "Lots of helpful people.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109807495399620929802", "name": "Mark Byrd", "time": 1578672405889, "rating": 5.0, "text": "Its Home Depot", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113269812323775880863", "name": "emily william", "time": 1556590852620, "rating": 5.0, "text": "Very helpful and friendly", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106853288376372087970", "name": "Lisa Normand Davis", "time": 1507572069597, "rating": 5.0, "text": "great service in the paint department", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104269007091832175479", "name": "angela galey", "time": 1550333638649, "rating": 5.0, "text": "Great service and pricing", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113106490236201095403", "name": "William Howard", "time": 1540684734640, "rating": 5.0, "text": "Top notch staff.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103079965585645537801", "name": "sam weaver", "time": 1545945402665, "rating": 4.0, "text": "Great company except lumber is way to expensive.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102797642289151965412", "name": "Brian Nichols", "time": 1561073879360, "rating": 1.0, "text": "The last couple of times I have been in the store only the self checkout was opened. I walk down to the lumber to checkout. Home Depot doesn’t give me a pay check to check myself out. You need to open a line by the self checkout so people have the option instead of walking to the far end of the store.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106217902403167589198", "name": "Thomas Beck", "time": 1532399086164, "rating": 4.0, "text": "It's a Home Depot what else is there to say.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111787553837186657344", "name": "Teresa Drinkard Fountain", "time": 1546309758056, "rating": 5.0, "text": "Great Store", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100453880335418413398", "name": "Marcus Richburg", "time": 1579461754003, "rating": 4.0, "text": "Yep", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109748683603278994757", "name": "Dallas Hill", "time": 1536836658283, "rating": 5.0, "text": "Very kind and friendly employees.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115502613150956707891", "name": "Alan Scull", "time": 1532191978409, "rating": 5.0, "text": "What ever you need for lawn care", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110049684847264274895", "name": "Debra Colbert", "time": 1523295295403, "rating": 5.0, "text": "Helpful customer service lady", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109016241603667420070", "name": "Brian Meehan", "time": 1548421914496, "rating": 5.0, "text": "Knowledgeable staff", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107650588747151602258", "name": "JJ fnaf fan", "time": 1541534088351, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117542981899968452725", "name": "Joyce Cody", "time": 1540585751655, "rating": 5.0, "text": "We t right to the items I needed.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118210152394321726686", "name": "Wendy Tulo", "time": 1549950490869, "rating": 5.0, "text": "Nice store", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101318036086236581776", "name": "E. Sully", "time": 1535825274178, "rating": 4.0, "text": "Just your generic retail home goods store.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103335531352260760995", "name": "Ricky Carroll", "time": 1546930284191, "rating": 3.0, "text": "Get what you need", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114477386696750613101", "name": "Brandi Tanner", "time": 1549918356327, "rating": 5.0, "text": "Love this store", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105294570695074613785", "name": "Chris White", "time": 1533910525773, "rating": 5.0, "text": "Great experience", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106217902403167589198", "name": "Thomas Beck", "time": 1532399086164, "rating": 4.0, "text": "It's a Home Depot what else is there to say.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104716775472412256539", "name": "Michael Thomas", "time": 1553023313416, "rating": 5.0, "text": "Great product", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116873093007762223478", "name": "Arild Warholm", "time": 1549498672714, "rating": 4.0, "text": "Found what I was looking for.👍", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109748683603278994757", "name": "Dallas Hill", "time": 1536836658283, "rating": 5.0, "text": "Very kind and friendly employees.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112933951290228808603", "name": "Danny West", "time": 1514352386758, "rating": 5.0, "text": "They have any and everything you need", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113427939733542005542", "name": "Daniel Fisher", "time": 1499533853348, "rating": 4.0, "text": "Very helpful staff", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118382350873268670028", "name": "Ringo Yokley Herron", "time": 1498518425460, "rating": 5.0, "text": "Very helpful and nice", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103598246280809129346", "name": "Vanessa Duncan", "time": 1523823144676, "rating": 5.0, "text": "Great  services!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111787553837186657344", "name": "Teresa Drinkard Fountain", "time": 1546309758056, "rating": 5.0, "text": "Great Store", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112160926469257350294", "name": "Warren Horton", "time": 1546099894719, "rating": 5.0, "text": "Love the place", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117445325195087096515", "name": "David Carmichael", "time": 1550955400946, "rating": 5.0, "text": "Had what I needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111636796631495585000", "name": "Christopher Dyess", "time": 1534298428218, "rating": 3.0, "text": "People seemed racist", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100141225573243559931", "name": "L Ray Lindsey", "time": 1532439633048, "rating": 3.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111619120493344955303", "name": "Vic Shaw", "time": 1532400332952, "rating": 1.0, "text": "Not well stocked", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112160926469257350294", "name": "Warren Horton", "time": 1546099894719, "rating": 5.0, "text": "Love the place", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101564131232142485875", "name": "Mary Richards", "time": 1535228240191, "rating": 5.0, "text": "Just like shopping there!!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109643419634187383259", "name": "My Life As Chloe", "time": 1546577342991, "rating": 5.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116748242871006362723", "name": "Robert Midkiff", "time": 1529796251278, "rating": 1.0, "text": "Rude", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106513086567276043097", "name": "Penny Stanley", "time": 1544492855316, "rating": 4.0, "text": "Found everything I needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111219870614421211194", "name": "James Jernigan", "time": 1525224892714, "rating": 5.0, "text": "Good job", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107821293953100160371", "name": "Sarah Byrd", "time": 1521798082034, "rating": 5.0, "text": "Works are helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113411391146293806536", "name": "Joshua Jones", "time": 1552806791715, "rating": 5.0, "text": "Excellent people", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112953364779408892927", "name": "Jonathan New", "time": 1533402122757, "rating": 2.0, "text": "Understaffed long waits", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112179491491546437655", "name": "Ronnie Weitzel", "time": 1532838523411, "rating": 5.0, "text": "My favorite place", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109388152793463937790", "name": "Property Care & Maintenance", "time": 1533008299049, "rating": 4.0, "text": "They need more people on the sales floor. People that know where stuff is located.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104945454251529264389", "name": "faze tfue", "time": 1535472642975, "rating": 4.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105994050331829418711", "name": "Sam Walters", "time": 1523561219072, "rating": 5.0, "text": "Great place to shop.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115255871671499388824", "name": "Jesse Brown", "time": 1552224288344, "rating": 4.0, "text": "Love this store!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110044359295103851372", "name": "kurt jahnke", "time": 1548359261010, "rating": 5.0, "text": "Has stuff that Lowe's does not, expanded selection", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108661298482255468236", "name": "Jadera Dees", "time": 1524002799533, "rating": 5.0, "text": "Great expression", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111636796631495585000", "name": "Christopher Dyess", "time": 1534298428218, "rating": 3.0, "text": "People seemed racist", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112953364779408892927", "name": "Jonathan New", "time": 1533402122757, "rating": 2.0, "text": "Understaffed long waits", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106407380444858417754", "name": "mike piliponis", "time": 1468368059281, "rating": 5.0, "text": "Good deals on appliances", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118384910440020869366", "name": "Christopher Poppe", "time": 1462933063408, "rating": 5.0, "text": "I always shop there first.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109218804703885207004", "name": "lisa schreiner", "time": 1545576579366, "rating": 4.0, "text": "Found everything I needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109807495399620929802", "name": "Mark Byrd", "time": 1578672405889, "rating": 5.0, "text": "Its Home Depot", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103335531352260760995", "name": "Ricky Carroll", "time": 1546930284191, "rating": 3.0, "text": "Get what you need", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111619120493344955303", "name": "Vic Shaw", "time": 1532400332952, "rating": 1.0, "text": "Not well stocked", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115745958481609162017", "name": "Metrulla Barnes", "time": 1504209905384, "rating": 5.0, "text": "the help was great", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112816232795255375614", "name": "gary sullins", "time": 1500237706255, "rating": 5.0, "text": "Outstanding store", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102440875410451859175", "name": "Payton Kynaston", "time": 1507503354656, "rating": 5.0, "text": "Supercalafragliskexpaldse", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108945194261768282669", "name": "Matt Lake", "time": 1500750576372, "rating": 5.0, "text": "The service was excellent. In and out.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109381823413606686871", "name": "rajesh kumar", "time": 1508887825416, "rating": 4.0, "text": "Staff is ready to help.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116234031405072124643", "name": "Billie DeView", "time": 1498273229770, "rating": 1.0, "text": "Horrible", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108927482445964255884", "name": "Allen Oshea", "time": 1476315659677, "rating": 1.0, "text": "Employees no help.  They could care less if the store sells anything.  I know why it's empty when I go there.    How does it stay in business?", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100255249060710133965", "name": "Richard Hedd", "time": 1499020597671, "rating": 5.0, "text": "Friendly staff.clean.well stocked", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106954212289885996471", "name": "Glenda Baker", "time": 1497115826354, "rating": 4.0, "text": "The sales associates were very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107964153372610662737", "name": "Mark J.", "time": 1464872941664, "rating": 4.0, "text": "Not as large as the one off Airport but still nice.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118384910440020869366", "name": "Christopher Poppe", "time": 1462933063408, "rating": 5.0, "text": "I always shop there first.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113884600727340099984", "name": "Jackie MacFarland", "time": 1460168934867, "rating": 5.0, "text": "Plants, tools, hardware and wood.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104533618842092768416", "name": "Jody Poirier", "time": 1459822003251, "rating": 5.0, "text": "Awesome!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104745061944419122913", "name": "Rafael M", "time": 1463043054287, "rating": 1.0, "text": "Is so hot inside,  the weather is cooler outside than inside", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106407380444858417754", "name": "mike piliponis", "time": 1468368059281, "rating": 5.0, "text": "Good deals on appliances", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111381875140223825276", "name": "Nathaniel “Ryan” Bowman", "time": 1456681512008, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110901525459269813605", "name": "[Oofer Inks Studios]", "time": 1428498328613, "rating": 5.0, "text": "they have cub cadet lawnmowers", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109769136615044453869", "name": "Mey Wallace", "time": 1428253432777, "rating": 5.0, "text": "Customer service here is awesome!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108266776301678367967", "name": "Stephen Jones", "time": 1623983724847, "rating": 5.0, "text": "Pickup from service desk was quick and convenient. Kim was very helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116669912350548994227", "name": "Juan Guzman", "time": 1576283274788, "rating": 1.0, "text": "(Translated by Google) There was no paint gun worth 59.00 dollars, there was only the excibition\n\n(Original)\nNo había una pistola de pintar que vale 59.00 dollar,solo estaba el de excibicion", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117056651426739289546", "name": "Armando Martinez", "time": 1579194549074, "rating": 5.0, "text": "(Translated by Google) Very good\n\n(Original)\nMuy bueno", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109450057972225739486", "name": "Ricardo Peralta", "time": 1535122057594, "rating": 4.0, "text": "(Translated by Google) It has everything\n\n(Original)\nTiene de todo", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110908456014146666611", "name": "Gilda Fernández", "time": 1553912972469, "rating": 5.0, "text": "(Translated by Google) Excellent, I like it very much.\n\n(Original)\nExcelente, me gusta mucho.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111070221025675338365", "name": "Yahaira Michel Jimenez Piña", "time": 1519426681648, "rating": 5.0, "text": "(Translated by Google) Under construction 😉😉😉\n\n(Original)\nEn construcción  😉😉😉", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
