{"user_id": "108496818278999082603", "name": "Mac Mac", "time": 1543588163366, "rating": 5.0, "text": "😎😎😎😎😎", "pics": null, "resp": null, "gmap_id": "0x8889187a69fd0f99:0x4eef298fb49783ad"}
{"user_id": "117066802065240984388", "name": "Tony Jacobs", "time": 1598403076678, "rating": 4.0, "text": "I deliver there I. Gadsden, AL AND Mayfield, KY. TIGHTEST DOCKS I HAVE EVER BACKED INTO. Great friendly people", "pics": null, "resp": null, "gmap_id": "0x888a38a275c0da2f:0x18347fb3ce6525a5"}
{"user_id": "108214926333348656135", "name": "David Lewis", "time": 1534512656753, "rating": 3.0, "text": "Ok place to deliver. The receiving dock is INSANE! WAAAAY TOO SMALL! It'll be a tough back, but it's doable. Ask for spotters if you're not sure. It's a super tight, 90° back. Once you're in, unload is pretty quick. People were nice.", "pics": null, "resp": null, "gmap_id": "0x888a38a275c0da2f:0x18347fb3ce6525a5"}
{"user_id": "109809622115332198992", "name": "thomas mitchell", "time": 1581370694168, "rating": 5.0, "text": "Never have been there I live across the street from the place", "pics": null, "resp": null, "gmap_id": "0x888a38a275c0da2f:0x18347fb3ce6525a5"}
{"user_id": "114675869409810961677", "name": "James Mackinlay", "time": 1590711304822, "rating": 2.0, "text": "Idiots!", "pics": null, "resp": null, "gmap_id": "0x888a38a275c0da2f:0x18347fb3ce6525a5"}
{"user_id": "107058035576311790976", "name": "Jamie Turner", "time": 1611704658203, "rating": 5.0, "text": "Very nice customer service and reasonable prices ,very good inventory", "pics": null, "resp": {"time": 1619529242197, "text": "Thank you Jamie :) We have the BEST customers!"}, "gmap_id": "0x888a76c69bfa8a31:0x64f6d1025009e3b5"}
{"user_id": "103653163436359400028", "name": "lexi hardin", "time": 1525292834123, "rating": 5.0, "text": "James and Company has a fantastic selection of reclaimed woods. I was very impressed with both the staff and the inventory. All my questions were answered politely and with great detail. Their prices are more than reasonable. If you are looking for reclaimed wood for any project this is the place to go.", "pics": null, "resp": null, "gmap_id": "0x888a76c69bfa8a31:0x64f6d1025009e3b5"}
{"user_id": "117310210672621735095", "name": "Amy Snider", "time": 1525289926570, "rating": 5.0, "text": "This place is amazing. No trees were cut down and the antique wood is beautiful. The staff are extremely helpful through the whole process. If you you're looking for quality, customer serious and true its word wood then this is the place to go! I highly recommend this to my friends and spread the word. These guys know what they're doing and it shows!! Thanks James and Co.", "pics": null, "resp": null, "gmap_id": "0x888a76c69bfa8a31:0x64f6d1025009e3b5"}
{"user_id": "114158137607138628189", "name": "Mountain Valley Kennels", "time": 1525288669465, "rating": 5.0, "text": "I have done business with the company for years. They have a wonderful selection of lumber. Unlike anything you'll find in the southeast. Wonderful staff, they always treat you like family and answer any questions you have. If you want something beautiful and unique, this is the company for you!", "pics": null, "resp": null, "gmap_id": "0x888a76c69bfa8a31:0x64f6d1025009e3b5"}
{"user_id": "101607209594493242449", "name": "Tracy Petrie", "time": 1525288159358, "rating": 5.0, "text": "Great company.  Excellent selection of product,  and wonderful customer service.  I got everything I needed,  and couldn't have asked for a better experience!", "pics": null, "resp": null, "gmap_id": "0x888a76c69bfa8a31:0x64f6d1025009e3b5"}
{"user_id": "100462612047901117231", "name": "Brea' Cozart", "time": 1525288542159, "rating": 5.0, "text": "Love this place, everyone is super friendly and helps me out in every way they can. The prices are amazing and quality is great. I don’t go anywhere else but to James and company. I recommend to everyone", "pics": null, "resp": null, "gmap_id": "0x888a76c69bfa8a31:0x64f6d1025009e3b5"}
{"user_id": "106794970444997525588", "name": "Ronnie Osborn", "time": 1525306127229, "rating": 5.0, "text": "Great place. Great Family!!!!!  Very easy to locate. Wonderful products. If you are trying to find hard to find lumber.  Give them a call.", "pics": null, "resp": null, "gmap_id": "0x888a76c69bfa8a31:0x64f6d1025009e3b5"}
{"user_id": "112063844721572692683", "name": "James Miller", "time": 1525292992497, "rating": 5.0, "text": "I have known these people for several years and the wood products they sell are well worth the price.  They have been very helpful and in no way rude to anyone. I will continue to do business with them. Shannin has always been helpful and cheerful.", "pics": null, "resp": null, "gmap_id": "0x888a76c69bfa8a31:0x64f6d1025009e3b5"}
{"user_id": "106830914257558619914", "name": "Roy C Wells", "time": 1525289894925, "rating": 5.0, "text": "I have been using James and Company for approximately 10 years, they have always been very professional, carry a large line of products and they have one of the best  and very accommodating  staffs.  That I have ever worked with !", "pics": null, "resp": null, "gmap_id": "0x888a76c69bfa8a31:0x64f6d1025009e3b5"}
{"user_id": "110023907416761337127", "name": "Melanie Miller", "time": 1525357722273, "rating": 5.0, "text": "I've known the owners of James & Company for years ! I luv that they reuse wood from all over the country ! Unique woods from all over . If your looking for different look no farther !", "pics": null, "resp": null, "gmap_id": "0x888a76c69bfa8a31:0x64f6d1025009e3b5"}
{"user_id": "114096041060578655741", "name": "Daniel ciotta", "time": 1525288018710, "rating": 5.0, "text": "This is a great company with awesome customer service.   They are wonderful people and offer a great product at very competitive prices!", "pics": null, "resp": null, "gmap_id": "0x888a76c69bfa8a31:0x64f6d1025009e3b5"}
{"user_id": "110127241670561304070", "name": "Nicole Betz", "time": 1525289061388, "rating": 4.0, "text": "This is a great company with great customer service. I have been there many times and have never been disappointed!", "pics": null, "resp": null, "gmap_id": "0x888a76c69bfa8a31:0x64f6d1025009e3b5"}
{"user_id": "100561650481306096471", "name": "Deanna Ciotta", "time": 1525315762380, "rating": 5.0, "text": "Very Helpful!!! Great prices!!!! Great quality stuff love this company", "pics": null, "resp": null, "gmap_id": "0x888a76c69bfa8a31:0x64f6d1025009e3b5"}
{"user_id": "103383872035927152558", "name": "Jeanie Shea", "time": 1610854312615, "rating": 5.0, "text": "I ordered two custom floating shelves for my newly updated kitchen and was very pleased with how they turned out. I was able to select the type of wood, the stain color and a grey wash along with a texture that finished off my shelves. The owner and his side-kick were knowledgeable, helpful and had my shelves ready on time. Be sure to check this place out if looking for a fireplace mantel, beans for your ceiling and lots of other types of wood uses.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNK-Btff9n0mlQpKZDh-ESfVCg2ZVDQiki9WBKf=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipODQkPYREq0lPb9DwijKvBDFHRiJ4M2KRhGaJLb=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891b6f22dd7e97:0xe360e2a6f9c59956"}
{"user_id": "106807104015991348181", "name": "Tray Wilson", "time": 1554913571621, "rating": 5.0, "text": "Very professional and very nice wood", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPAbsFWG_j2QFB4O9nTSeOV5FoyNtxFqBoSiaZn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPjT5XjsdmF0AIiradtzA1EfGnKqYkEkRir2Bsz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNiNP29ekhi7jHSRy1vysBIg8bB82wDIhPnM33H=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891b6f22dd7e97:0xe360e2a6f9c59956"}
{"user_id": "109375640038011194551", "name": "Jessica Wilson", "time": 1599773548611, "rating": 5.0, "text": "I am an employee at River Bottom Pine and take it from me, there is no better place to the best quality hard wood floors and meet the best people. Everyone there not only cares about your business but they care about you as well.", "pics": null, "resp": null, "gmap_id": "0x88891b6f22dd7e97:0xe360e2a6f9c59956"}
{"user_id": "103499781752203757822", "name": "Philip Flores", "time": 1550079684033, "rating": 5.0, "text": "The best wood flooring and custom beam mill in the south east! Very friendly beautiful craftsman’s live edge tables. Very nice selection of custom barn doors. Highly recommend! Philip Flores", "pics": null, "resp": null, "gmap_id": "0x88891b6f22dd7e97:0xe360e2a6f9c59956"}
{"user_id": "112091812725462710155", "name": "Wesley Meier", "time": 1493394116717, "rating": 5.0, "text": "Amazing company! Great products!", "pics": null, "resp": null, "gmap_id": "0x88891b6f22dd7e97:0xe360e2a6f9c59956"}
{"user_id": "105984107954854688035", "name": "Scott Mains", "time": 1620079956632, "rating": 5.0, "text": "Wonderful selection of rough cut and live edge wood. Definitely worth your time to wander through. Super friendly staff!", "pics": null, "resp": null, "gmap_id": "0x88891a510d5afed5:0xb77ff9874b705f13"}
{"user_id": "105523044524638294643", "name": "Pinson Patriot", "time": 1600112513798, "rating": 5.0, "text": "Supper nice and very unique furniture.", "pics": null, "resp": null, "gmap_id": "0x88891a510d5afed5:0xb77ff9874b705f13"}
{"user_id": "114442061198995321253", "name": "David McMahon", "time": 1532965158385, "rating": 5.0, "text": "I purchased a beautiful desk from Alabama Sawyer and I love it. It's extraordinarily well-designed and constructed, and I will have it for years. Excellent communication with the company as well. Thanks!", "pics": null, "resp": null, "gmap_id": "0x88891a510d5afed5:0xb77ff9874b705f13"}
{"user_id": "102363230634334681981", "name": "Stephen Hicks", "time": 1549829220953, "rating": 5.0, "text": "Innovative design sold me on the Sputnik side table.", "pics": null, "resp": null, "gmap_id": "0x88891a510d5afed5:0xb77ff9874b705f13"}
{"user_id": "107760424119855428619", "name": "Arthur Zevack", "time": 1513717479108, "rating": 5.0, "text": "Awesome place!", "pics": null, "resp": {"time": 1567857912882, "text": "Thanks for the support!"}, "gmap_id": "0x88928d3a5c72cdaf:0xc34547198c215598"}
{"user_id": "103215960657837672788", "name": "Alexandria Jones", "time": 1519181562406, "rating": 3.0, "text": "Great service", "pics": null, "resp": {"time": 1567857889811, "text": "Thanks for the support!"}, "gmap_id": "0x88928d3a5c72cdaf:0xc34547198c215598"}
{"user_id": "105413703929949679003", "name": "Robert Rock", "time": 1598752879196, "rating": 5.0, "text": "We like the people that work there, have used the services about 14 years ago and prefer to go back.", "pics": null, "resp": null, "gmap_id": "0x888f9ddec4da1f29:0xc39d7866bb063625"}
{"user_id": "114005880095022070353", "name": "Andy Dailey", "time": 1603334046475, "rating": 5.0, "text": "It's my place of employment so of course it was great", "pics": null, "resp": null, "gmap_id": "0x888f9ddec4da1f29:0xc39d7866bb063625"}
{"user_id": "105134416370651692283", "name": "Tammy Deram", "time": 1550517195166, "rating": 5.0, "text": "This is an artisan woodworking shop. They make their own cabinets and other items. If you want precision this is the place to go!", "pics": null, "resp": null, "gmap_id": "0x889a095e231778a3:0x738aa99327d15a4e"}
{"user_id": "107973066021504228821", "name": "Joanna Jones", "time": 1505936146200, "rating": 3.0, "text": "I would give it 5 stars but it was still closed from the fire they had in March so I couldn't shop. There was lots of stuff I would like to purchase if they reopen. It would be nice if owner would post that they were closed from fire as we came from Florida.", "pics": null, "resp": null, "gmap_id": "0x8888de28403f2045:0xada7b71477cb7e8c"}
{"user_id": "109191003379761859793", "name": "Justin Rodgers", "time": 1470876129167, "rating": 1.0, "text": "Despite having good stuff; my mother, brother and I were chased out by one of the managers with a really foul attitude.  (full story and quotes on facebook)\n\nMy mother got us excited to drive TWO HOURS to see this place but when we got there, one of the managers singled me and my brother out separately asking \"Are you going to buy anything?\" as well as some other angry, uncalled for aggression.  When we said \"No sir\" he told us \"you need to leave, right now!\"  We were escorting our mother because it's in a bad part of town!  When my mother came to inquire about something she wanted to purchase this man told her he was with someone (another employee) and couldn't \"deal with her\" and she would just have to wait.  He was very rude and angry with her too.\n\nWe drove two hours so my mother could spend a LOT OF MONEY on things there but we were chased out within 5 minutes!!   We were treated like bums begging for money!  We would not have driven halfway across the state to kick your tires!  The things you said to my family will NOT FLY with me!  Uncalled for and unprofessional!\n\nThere are lots of antique stores closer to our small town, all which treat us like customers not garbage.  We try to buy at least 2 or 3 things whenever we visit.  We will not be coming back here though.", "pics": null, "resp": null, "gmap_id": "0x8888de28403f2045:0xada7b71477cb7e8c"}
{"user_id": "105066214342607505842", "name": "Christine Cole", "time": 1453135179046, "rating": 5.0, "text": "Vintage Station is my new favorite place to find unique, salvaged, re-purposed home decor. It's also overflowing with unique, one-of-a-kind antiques & beautiful custom order furniture. If you can dream it, they can build it! And if you want to build it yourself they have barnwood, salvaged windows & doors, & plenty of odds & ends to help you create your own masterpiece!", "pics": null, "resp": null, "gmap_id": "0x8888de28403f2045:0xada7b71477cb7e8c"}
{"user_id": "117310882189058696825", "name": "Brian Svencer", "time": 1481306690017, "rating": 1.0, "text": "We were very excited about visiting after seeing all the advertising and neat pictures posted. When arriving the owner approached us and apologized for it being disorderly. Another nice gentleman approached us and informed us of all the areas available to be seen. While speaking to both men we informed him of the interest we had in the reclaimed lumber and that we custom make them ourselves back home. He gave us pricing on what he had and told us to check out the shop area and to let him know if we needed help with any lumber. We also refinish furniture for a living and are on the look out for good fixer uppers to refinish and resell. So we walked around the top and bottom floor. They had nothing of good quality to choose from. We then made our way out to the \"OPEN TO THE PUBLIC COME ON IN\" shop area. The craftsmanship done by his employees was great and we were simply admiring the work done. NO PHONE, NO CAMERA simply looking and out of no where the owner comes up to my husband and tells him \"IF YOU ARENT HERE TO BUY YOU NEED TO LEAVE\" \"WE BUILD CUSTOM TABLES FOR CLIENTS\" \"WE ARE A CHRISTIAN BASED COMPANY AND WE DONT NEED ANYONE STEALING OUR DESIGNS\" Now if I was taking pictures of this mans work I could understand his hostility but we weren't we were simply browsing his shop, custom tables, painted furniture and doors as we were told to do. Then he approaches me and tells me if I'm not here to buy anything from him to leave right now and never come back. He turns back around to my husband who was holding our 1 year old in his arms and leans in like he is about to grab him and yells to my husband to walk faster and to get out. While this place looks great in pictures it is not what they display online. How this man stays in business talking to customers the way he does is unreal to me. Christian business?!? You are a hotheaded joke. I have browsed the other reviews and this is not the first time or the last that this man has ran out good paying customers.", "pics": null, "resp": null, "gmap_id": "0x8888de28403f2045:0xada7b71477cb7e8c"}
{"user_id": "104440869189676926780", "name": "Campbell Dunbar", "time": 1469918016889, "rating": 1.0, "text": "Their work is beautiful, but when we have spent hours going through hundreds of doors during an Alabama summer heat wave to find a few matching pairs and the owner couldn't even spend 3 minutes with us discussing what might be a fair price for all of it I knew we wouldn't be back. We were told to let them know when we were ready and the owner would come out and talk to us about prices. When he did he was very rude, inconsiderate, and his pricing system made no sense. He wanted $75 per door on every door we had, even though some were in much worse shape than others. We came prepared to spend a pretty penny and ended up spending a fraction of that because of his attitude. We won't be back. The drive out there is not worth the hassle and we do not recommend that anyone else waste their time either.", "pics": null, "resp": null, "gmap_id": "0x8888de28403f2045:0xada7b71477cb7e8c"}
{"user_id": "115042198788597891512", "name": "Diane Cann Pigott", "time": 1502347443780, "rating": 5.0, "text": "I was out there on Sunday and they were closed, but from what I could see it was amazing", "pics": null, "resp": null, "gmap_id": "0x8888de28403f2045:0xada7b71477cb7e8c"}
{"user_id": "106383260270345132395", "name": "Billy", "time": 1461626409712, "rating": 5.0, "text": "Great place to fine old stuff.", "pics": null, "resp": null, "gmap_id": "0x8888de28403f2045:0xada7b71477cb7e8c"}
{"user_id": "104279497235161106431", "name": "Chris Andrews", "time": 1564433107456, "rating": 4.0, "text": "Good place to shop convenient easy to get out of friendly people good place to shop easy In-N-Out", "pics": null, "resp": null, "gmap_id": "0x888d46ff83ac721d:0x11ac7d3f181fbb53"}
{"user_id": "113236634424785109120", "name": "Thomas A Wingate", "time": 1493692394766, "rating": 5.0, "text": "Really cool.. Helped me find my tarps. Thanks.", "pics": null, "resp": null, "gmap_id": "0x888d46ff83ac721d:0x11ac7d3f181fbb53"}
{"user_id": "104805103755544439823", "name": "Keith Sasser", "time": 1537189201532, "rating": 5.0, "text": "I deliver particle board to this place. I think they laminate it for cabinets/sinks etc.....", "pics": null, "resp": null, "gmap_id": "0x888d46ff83ac721d:0x11ac7d3f181fbb53"}
{"user_id": "111977377720279409859", "name": "Gabbi Calderone", "time": 1622752158908, "rating": 5.0, "text": "Tim was prompt, efficient, responsive, and professional.  Highly recommend! Knocked out what would have taken my husband and I probably half a day or maybe a whole day in three hours! I submitted my request and received a response instantly.  Tim was out to our house the next day and completed all tasks exactly how I wanted.", "pics": null, "resp": {"time": 1622761795354, "text": "Thank you so much for the kind words and for taking the time to do this review for us! Tim is definitely an asset to our team!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "108978733634757155129", "name": "Maria Holmes", "time": 1597687539950, "rating": 5.0, "text": "I'm a little late but a huge THANK YOU to Tim Childers with Birmingham Fast Repair for putting together our patio furniture and replacing our window blinds last month. He was very professional and a great sport dealing with the complicated patio piece we asked him to put together. We look forward to using Tim again for our future projects!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOAZbeB-d86c8yt5hoRb7veaAgH-MkOUAFScsGw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMZzjOsE78SlZBmRVOzpLWuP-eQyHtSxyhxrh8R=w150-h150-k-no-p"]}], "resp": {"time": 1597692036499, "text": "Thank you so much for taking the time to do a review Maria! We are so pleased that you had such a great experience with Tim. Please let us know if we can ever help out again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "106395817116326249386", "name": "Tiara Young Hudson", "time": 1622385928176, "rating": 5.0, "text": "The entire business model is awesome. It is hard to find a knowledgeable and trustworthy handy man when you’re new to home repairs. Our assigned handyman was everything I hoped for and he didn’t loaf on the job just because he was charging me hourly.", "pics": null, "resp": {"time": 1622824959334, "text": "Very kind words. We love it when someone notices and appreciates our unique approach! Thank you!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "111071221813907073063", "name": "Mk Rashid", "time": 1563338469012, "rating": 5.0, "text": "We have to give shout outs and thumbs up to Kyle Butler! His work has been some of the best that we've seen as far as rehabs are concerned. Kyle has Rehabbed 4 of our apartment units for us and he's about to start on the 5th unit soon. We are very excited to see his Great Work and Detail during this upcoming rehab!! We have been completely satisfied with the work that he has completed for us and we intend to use him over and over when available!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN5znmV1XUxFIFJdYTBXwQpflrSmwVhwP61IzF8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOQ1QDBaszVlsN6R23dwnfS1sD7YyidIVaXFM6x=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPKRnQdiABj9mkFZ73U_F8EYU8IergV1PGYUhy6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPFiLr0ghbyfDDtH7hZ6azGl59d0CO2bY5Y7ARL=w150-h150-k-no-p"]}], "resp": {"time": 1563378330229, "text": "We will pass along the kind words. Thank you for being such a great client. If google allowed, we’d give you 5 stars right back!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "106322434717160412099", "name": "RC and MoonPie", "time": 1621360905626, "rating": 5.0, "text": "On time, worked fast. Looks fantastic, caulked, sealed, painted, cleaned up.Totally pleased. I have found my Go To home repair company!", "pics": null, "resp": {"time": 1621435286810, "text": "Thank you! Who was the handyman assigned to your project? We want to be sure to pass on the kind words!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "117617474278687131201", "name": "Steve Casey", "time": 1621710832385, "rating": 5.0, "text": "I have used Bham Fast Repair on several occasions now. They always respond quickly, show up on time, and do good work for a fair price. I’ll continue to use them and highly recommend them.", "pics": null, "resp": {"time": 1622129538557, "text": "Thank you so much for taking the time to do this review and we appreciate your business!  We look forward to working with you again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "101778923479355537513", "name": "Beverly McCutcheon", "time": 1606377530577, "rating": 5.0, "text": "TRAVIS, I got the best finally. Gave up, looked for Gutter Repair. 8 years of misery with Gutter Company that installed never could fix. Same areas. Travis has been here several times repairs and so much more. More then I can say this man has done.Truly needed him years ago. Stopped all the problems I have had for 8 years with leaking gutters, A nightmare for me. I feel rescued. Has been so great I could never say enough about him. A really nice man too I got know well as I was out there with him showing me what was wrong and needed. So where would I be now without Travis. Another person or new gutters? First day he came I was horrified what he found. Asked him do I just need new gutters again, was worried then about the whole house. He said no, he was repairing them, I needed to see what was wrong, those areas. Travis saved me a lot money and stress I have been through with the thought of new gutters and couldn’t be repaired. I will always use him.\nI see now here too maybe he can clean them. Had no\nIdea all the other things this company can do. Will be helpful for me too. All the great reviews and I have just gotten one of them, Travis. Must be just like him.", "pics": null, "resp": {"time": 1607229157855, "text": "Thank you so much for your review! We are very pleased that you were happy with Travis and will pass that along to him!!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "110925814739244530364", "name": "Devon Rankin", "time": 1622128050091, "rating": 5.0, "text": "Hired BFP to install screens for my existing back porch. Blake contacted me the day after I submitted my request to talk through it. We communicated via text and phone after as questions came up and then Blake put together a detailed scope for the work and made great suggestions for materials to use for the job. We ran into problems sourcing the materials (very high demand!), but he kept me informed of the delay along the way and was able to begin work as soon as we had what we needed. Work was performed over a 3 day period, and Blake showed up on time and worked diligently each day. He kept me updated on his progress during the day and the end product turned out great. We can't wait to start using our newly screened porch.", "pics": null, "resp": {"time": 1622129452224, "text": "Thank you so much Devon!  We are so pleased that everything went well and will happily share your kind works with Blake!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "106605411646573617746", "name": "Lawrence Sheffield", "time": 1617126064013, "rating": 5.0, "text": "BFR is the best in the business! I wish I called them sooner. Thanks Seth and Gibbs.", "pics": null, "resp": {"time": 1617806426386, "text": "Thanks so much for the review!! We are so glad you were pleased!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "105843001202051508598", "name": "Charles Simpson", "time": 1617217545692, "rating": 5.0, "text": "Can't say enough good things about this service! They showed up, on time, the day after initial call. Tim assembled our patio furniture in just over two hours. We are so pleased. We'll never use anyone else. Thanks, guys!", "pics": null, "resp": {"time": 1617806550013, "text": "We are so glad you were pleased!! Thank you so much for taking time to do the review !"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "109464509412322114225", "name": "Bryan Ramsey", "time": 1594351495597, "rating": 5.0, "text": "About a month ago I had posted a negative review about Birmingham Fast Repair, and I'm here to say that I was WRONG!!! They were quick to respond in the most professional manner to my complaint. Seth made this matter his top concern, which every customer would want. This just goes to show the quality of customer service this group has. Seth was very apologetic (which he did not need to be) and did a fantastic job on installing my french patio doors. Seth was such a pleasure to be around. Not only was he professional, but he took time to get to know me and my family, which went beyond my expectations. His work and craftsmanship were very impressive. He definitely knows his work and set the bar very high. I could write this review all day on how pleased we were to have him in our home and his work product. I feel like I have finally found a company that I can trust to do an Honest, and PROFESSIONAL job at an unbeatable price. Seth's work has transformed our home beyond what we thought it could look like. I would highly recommend SETH and Birmingham Fast Repair for all of your projects. They will definitely be my \"go-to\" company for future projects.", "pics": null, "resp": {"time": 1594404103981, "text": "Thank you so much Bryan!  We really value our customers and appreciate that you took time to write this review for us.  We are so pleased that you were happy with the work Seth did for you and very grateful that you gave us a second chance! Please call us again any time!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "112493158752831101881", "name": "Madison Williamson", "time": 1618858000085, "rating": 5.0, "text": "We have used this company twice now- for building our deck, building our fence, and staining our deck! Great value, great quality, and very friendly staff!", "pics": null, "resp": {"time": 1619037034237, "text": "Thank you so much Madison! We appreciate that you took the time to leave us this nice review. We look forward to working with you again :)"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "111089989782510075270", "name": "Michael Forester", "time": 1605211560212, "rating": 5.0, "text": "Gibbs, from bham fast repair, repaired a fence that was damaged from Zeta. I couldn’t get any companies to call back because everyone was busy because of the storm. I ended up getting in contact with bham fast repair. They put me in touch with their employee Gibbs and I dealt with him for the rest of the project. Very efficient way to handle work especially since I couldn’t even get a return call from others. We worked out the details and it was repaired within a  week or so. He saved us money on supplies and followed through on everything he said he would do. He was even early to my house to start the repairs. No surprise charges either. Very impressive individual and company. If I ever need any other odd jobs done, I’ll definitely reach out to Gibbs and Birmingham Fast Repair", "pics": null, "resp": {"time": 1605221566485, "text": "Thank you so much for your review Michael!  We are so glad that you were pleased with the way your job was handled and with Gibbs!  Please call us again for any future needs!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "103139702407368752525", "name": "Hadden Smith IV", "time": 1604520085274, "rating": 5.0, "text": "Great company. Quality of work was exceptional and the worker we had was very professional. I'd recommend them to anyone.", "pics": null, "resp": {"time": 1604521468033, "text": "Thank you so much for your review and for taking the time to post this! Please call us again for any future needs!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "109511280557242024076", "name": "Sheena W", "time": 1589994737408, "rating": 5.0, "text": "It was a pleasure working with Chris. I live out of state and own a 4 plex. One of the units were vacant and needed some paint/drywall work before being put back on the market. Chris was quick in contacting me, quick to start and complete the job and great at maintaining constant communication throughout the project. He was very willing to go above and beyond in assisting me. He provided before and after pictures and a walk through video explaining everything so I could be comfortable with his work. I can't physically be there, so he was my eyes and brought unknown issues to my attention, which he verified with pictures. I have a property management company, but their bids were high to do some of this work, which is why I shopped around and found Birmingham Fast Repair.  They also didn't catch some of the issues Chris did. My experience leads me to believe that Chris is nothing short of honest, knowledgeable, trustworthy, and hardworking. Highly recommended.", "pics": null, "resp": {"time": 1590003136760, "text": "We appreciate your business. Thank you for the generous review!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "109053634298216774423", "name": "Karen Register", "time": 1605755212719, "rating": 5.0, "text": "Mailbox uprighted & concreted into position. Gibbs did a great job! On time, professional, skilled for job, communicated well, detailed. Thank you!", "pics": null, "resp": {"time": 1605755874249, "text": "Thank you so much for that review Karen!!! We are so glad you were pleased and will pass that on to Gibbs!!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "116495181525722011731", "name": "Joe Walker", "time": 1586277680688, "rating": 5.0, "text": "I can't say enough good things about this experience. From my initial phone call with Shannon to the finish of the job, it has been such a pleasant experience. Travis is the best! He was in constant contact with me. He was able to come do my job a week earlier than scheduled, and was able to come earlier than the appointment time. Imagine that!!! And to boot, he charged $100.00 less than the quote. He was that fast! The work looks great. I told him that I will definitely use them again in the future.", "pics": null, "resp": {"time": 1590371777298, "text": "Very kind. Thank you!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "110977379092926487321", "name": "Bradford Acton", "time": 1603311164951, "rating": 5.0, "text": "Everyone should be using this business. It's not just about the cost, or the quality, or the professionalism. More than anything else, when you use BFR you know you are going to get a quality worker, an honest person, and a company that cares about those things as it grows.", "pics": null, "resp": {"time": 1603378655852, "text": "Thank you so much Bradford!! We really try to uphold those standards and care greatly about being honest with our customers and building lasting relationships! We appreciate your kind words!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "115529207962960644094", "name": "Jeri Tanner", "time": 1592600115222, "rating": 5.0, "text": "Stephen has been to our house on a couple of projects and I can’t brag enough on him. He’s got great ideas and does fast, neat work. He has a great decorator’s eye as well as the ability to do anything with tools, seemingly. So glad we found this company and that Stephen is our Fast Repair guy.", "pics": null, "resp": {"time": 1592616623750, "text": "Love that you call him “your guy”. We hope that all our customers develop a relationship such as this. Thank you for being a wonderful customer!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104157861279324833069", "name": "Bart Slawson", "time": 1588692137334, "rating": 5.0, "text": "I had a gutter that drained poorly on top of our exit stairs. Travis came on time, very polite, did a fast accurate professional job and charged half the quote. WOW that was great. This was 2nd time I used Fast Repair. 1st time a man came out and assembled my deck furniture. He did in 30 minutes for half price! Excellent", "pics": null, "resp": {"time": 1590371800192, "text": "Thank you Bart!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "107992190039947739005", "name": "Greg Eiselin", "time": 1594519602399, "rating": 5.0, "text": "Thank you Tim Childers! He worked diligently to piece together a large children’s play-set, and our children couldn’t be happier. This would have taken me entirely too long by myself. We are grateful. We are going to utilize Tim’s abilities on another project in the near future.", "pics": null, "resp": {"time": 1594738673757, "text": "That is awesome!  Thank you so much for sharing that Greg.   We are so glad that you were happy with Tim's work and will look forward to working with you again on future projects!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104207456679163686682", "name": "jeremiah alcorn", "time": 1589392049625, "rating": 5.0, "text": "SO EASY!  Emailed pics, got a quote.  When it took less time than the estimate, he charged me appropriately!  So glad to have competent, respectable workers available for any project.", "pics": null, "resp": {"time": 1589409792819, "text": "Thank you! I will be sure to pass this on to Travis!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "116331117173878022438", "name": "Debbie Medenica", "time": 1579816928660, "rating": 5.0, "text": "The repair person contacted me quickly, and was professional, yet cordial.  I had emailed photos of the damaged item, and he was able to give me an estimate of the time/cost required.  He was even early to our appointment, but he called before he came.  He was knowledgeable, meticulous, and thorough in his work, and left the work area completely clean.  He was a really nice guy, friendly and conversant, and answered any questions I had with expertise.  I will definitely use this company again, as well as recommend them to my friends!", "pics": null, "resp": {"time": 1579821838092, "text": "Thank you Debbie. What encouraging words!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "102579978873489332139", "name": "Kim Bryant", "time": 1588970662355, "rating": 5.0, "text": "Both my daughter and I have hired Birmingham Fast Repair 3 times now. Caleb Bergmann was our technician the first time. He did such a great job we requested him the next two times. I couldn’t believe how much he got  done in just an hour. Best money I’ve spent!!!", "pics": null, "resp": {"time": 1590371860194, "text": "Thank you! We love our repeat customers!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "109943955610700496942", "name": "Jenna Zoghby", "time": 1597429879219, "rating": 5.0, "text": "Tim is great! He hung 12 pictures for me in a grid format. Made my life so much easier", "pics": null, "resp": {"time": 1597433562643, "text": "Thank you for taking time to post your review Jenna! We are so glad you were pleased with Tim’s work!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "106904868610599648993", "name": "Jhavalen Brown", "time": 1590834711997, "rating": 5.0, "text": "Tim was excellent. We could not have asked for a better handyman for our job. Everything was completed to our liking and looks great.", "pics": null, "resp": {"time": 1591898287885, "text": "I'll pass the kind words on to Tim. Thank you!!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "109083394355706721538", "name": "Jillian Thomas - HHS", "time": 1585333735663, "rating": 5.0, "text": "Great experience! Easy to communicate with, quick to respond, and even quicker to complete the work. Highly recommend! Grateful to the friends who did recommend this team.", "pics": null, "resp": {"time": 1589409828363, "text": "Thank you for the kind words!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104676247163784261207", "name": "Josh Crago", "time": 1571766197351, "rating": 5.0, "text": "Birmingham Fast Repair did a fantastic job with the long list of repairs that we had.  Luis did a great job, and works very efficiently.  I am glad that I have found my go to home improvement company for any need that arises.", "pics": null, "resp": {"time": 1571771452629, "text": "Thanks Josh! We appreciate the kind words!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104953353912519219413", "name": "Yuhua Zhang", "time": 1547524593790, "rating": 5.0, "text": "We had our porch stairs down and I submitted a request online. Blake quickly responded and scheduled time. he came exactly on the time he promised and estimated the work. He made very clear estimate and explained in detail of the job. The price is fair. Blake did an excellent job replacing the stairs, much beyond what we have expected. He handled the job very professionally and efficiently. After the job was done, he cleaned the work place and hauled away the old stairs. We are very happy to the job he accomplished. We highly recommend Blake to who needs home repairs. He is great! We thank him again for making our home much better.", "pics": null, "resp": {"time": 1547554686485, "text": "Thank you! I’ll be sure to pass along the kind words to Blake."}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "110718465641180812208", "name": "Joy Phillips", "time": 1570187948283, "rating": 5.0, "text": "We had a list of mostly small repairs to get done before listing our townhouse for sale.  Birmingham Fast Repair and Kyle Butler are such a blessing!  BFR website made it easy to get started.  Kyle made it easy to get the work finished.  We had a kitchen drawer that wouldn't close properly.  Small problem but essential to get it fixed.  Contractors weren't interested in such a small project, several \"handy\" guys looked at it and couldn't fix it.  Kyle fixed it within the first 20 minutes of walking through the front door!  From there he went to the squeak in the kitchen floor.  Fixed!  We needed new lattice panels on an outside storage closet.  Done!  Life is so much easier because of  Kyle and Birmingham Fast Repair.", "pics": null, "resp": {"time": 1570193470348, "text": "Thank you for kind words! We truly appreciate the feedback!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "118279556739034945919", "name": "David Dolinger", "time": 1555417132322, "rating": 5.0, "text": "Chris Evans was my repairman and did an excellent job.  The work was paint and repair on our chimney cap so involved climbing up on the roof, screening, caulking, and rust-proof painting.  Chris arrived on time, was very nice, and worked safely and efficiently to get the job done in a timely manner.\nWe are very happy with his work and will call again when needed.", "pics": null, "resp": {"time": 1555546428523, "text": "Thank you David. We truly appreciate the business. And the feedback!!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "108622944494082475826", "name": "Jeff Iftekaruddin", "time": 1553199350440, "rating": 5.0, "text": "The Absolute BEST!  What a pleasure to find this terrific company in Birmingham.  Each step of my customer journey was EFFORTLESS.  Seth, Shannon and Chris made my life so much easier.  Chris is an expert handyman and is as professional as they come.  If you are looking for a company that is courteous, responsive and provides stellar work, call Birmingham Fast Repair.  I will be definitely be using them in the future! Thank you Seth, Shannon and Chris!", "pics": null, "resp": {"time": 1553204951503, "text": "Thank you Jeff for the kind words! A pleasure working with you as well!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "114164332930397554177", "name": "Kaitlin Brown", "time": 1573658620995, "rating": 5.0, "text": "This is a hidden gem of a home repair service. The variety of work they're able to do is so wonderful! I really appreciate their timeliness and professionalism with each repair.", "pics": null, "resp": {"time": 1573663511354, "text": "Thank you, thank you!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "115429433027910261121", "name": "Aaron Gray", "time": 1542818900236, "rating": 5.0, "text": "Luis did a great job on the handyman tasks we've given him. He started on a fence repair and has done a number of other things around the house from painting to plumbing. Seth Corbin is also a good guy. Highly recommended.", "pics": null, "resp": {"time": 1542819868502, "text": "Thank you Aaron!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "113578171023346209645", "name": "R Thompson", "time": 1593459887465, "rating": 5.0, "text": "Tim did great work cleaning and repairing our gutters, and came out within an hour of our initial phone call. Great communication and will be happy to hire again.", "pics": null, "resp": {"time": 1593466335191, "text": "Thank you! Will pass on to Tim!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104235789980065825969", "name": "John Willard", "time": 1572968619639, "rating": 5.0, "text": "Birmingham fast repair was so great to work with. Seth and his crew efficiently fixed the problems that we faced. Can’t wait to use BHM fast repair again.", "pics": null, "resp": {"time": 1572975962504, "text": "Thanks John! Always a pleasure to work with you."}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "108783105927708742265", "name": "Bryan Ramsey", "time": 1589504623053, "rating": 1.0, "text": "It took about a month for someone to come out to do measurements (started the 2nd week of March). I was told I would be contacted 2 weeks later for an install. I understand this happened at the beginning of the COVID-19 situation and is a hard time for all of us, but I had not received any other communication or follow up from anyone. I had sent text messages on 2 occassions (a month after measurments) and no response. I'm not sure what its like in this line of work, but I was willing to spend close to $3K on the project and not a peep from anyone. This may not seem like a lot of money in this line of work, but $3K for a day or two of work I would be running to complete this job. I'm  concerned about the lack of follow-thru in communication. There are plenty of people that need work and it's disappointing to see the lack of interest.", "pics": null, "resp": {"time": 1589587480444, "text": "Bryan, I appreciate the feedback. Obviously we missed the mark on this one and I sincerely apologize. I’ll certainly look into what went wrong and make the necessary adjustments to prevent this from happening again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "117002595676189867619", "name": "Grace Willis", "time": 1535143664898, "rating": 5.0, "text": "Couldn't recommend anyone better! (Ask for Ethan!)\n\nI called Birmingham Fast Repair to book a quote and possible appointment to install a pedicure chair's foot rest at my job. They were very fast and informative to book someone for us. They sent an email with a name/photo/bio/contact of who the handyman would be. He followed up the day before and day of (before the appointment).\n\nUpon arrival he was prepared and friendly. He assessed the parts/chair and confidently installed everything exactly as needed and at a timely manner -- I commend him for agreeing to fix it, especially since he had never worked on a pedi chair (who even has?) and it's fairly complex considering there are water lines and pipes involved. He communicated everything very well.\n\nThank you for everything. We will definitely be recommending you all to everyone we can!", "pics": null, "resp": {"time": 1535152105583, "text": "Thank you for the kind words! It means so much!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "112572611943784547144", "name": "Rebecca Barganier", "time": 1581447082925, "rating": 5.0, "text": "Excellent experience. 10/10, would recommend, will use again!", "pics": null, "resp": {"time": 1581452166993, "text": "You are too kind! Thank you!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "114442721499589525966", "name": "FrostByte", "time": 1580257705020, "rating": 5.0, "text": "Did a great job hanging my tv. Was on time, professionally mannered and dressed.", "pics": null, "resp": {"time": 1580317636488, "text": "Thank you for the feedback!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "107532666962236075516", "name": "Marilyn Ireland", "time": 1547832599797, "rating": 5.0, "text": "Micah did a FANTASTIC job on my 80+ year old antique dining room tabletop.  It had been ruined years ago by a felt backed tablecloth that was ironed on while sewing.  We finally got it refinished and he did a remarkable job.  Thanks so much Birmingham Fast Repair, I will be using you again.  And by the way, the PRICE was awesome!", "pics": null, "resp": {"time": 1547860265586, "text": "Thank you! I’ll make sure to share with Micah"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "105650408963731561504", "name": "Jerry Currin", "time": 1529360739649, "rating": 5.0, "text": "Seth Corbin does excellent work!  Arrives on time, professional, yet personable.  Has the skills, tools, ability to complete the work assignment.  Spent extra time, without charge, to assure the job was completed to my satisfaction.  Seth is in my phone directory as a first call for repair/installation work.", "pics": null, "resp": {"time": 1529366785507, "text": "Always great to hear when one of our guys hits the mark!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "117012867347705376602", "name": "Sharon Wix", "time": 1534945860345, "rating": 5.0, "text": "Everything about my experience with Birmingham Fast Repair was positive. Shannon took my call, determined what kind of help I needed and promptly put me in touch with Kyle Butler. Kyle arrived on time and was pleasant, professional and efficient. I will definitely be using BFR for future projects!", "pics": null, "resp": {"time": 1534953541885, "text": "Thank you Sharon!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "103807248478057509185", "name": "slimerv", "time": 1597021643179, "rating": 5.0, "text": "Doug Sands was very nice and professional.", "pics": null, "resp": {"time": 1597025681225, "text": "Thank you so much for your review! We will make sure Doug sees it and we are very glad you were happy with his service!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "108551001163451535193", "name": "Mary McC.", "time": 1502811220355, "rating": 5.0, "text": "We are thrilled with the work this company did! They gave us an accurate estimate, showed up on time, and completed the work within the estimated time frame. They were always professional and very nice. I highly recommend them!", "pics": null, "resp": {"time": 1502815453603, "text": "Thank you! Our pleasure to work with you!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "113255318136601252183", "name": "DeeDee Barnes Bruns", "time": 1511297941059, "rating": 5.0, "text": "Jim from Birmingham Fast Repair did an excellent job installing my mailbox. He picked up all the necessary supplies, dug up the existing concrete base and installed my mailbox according to postal service standards. He was quick and prompt and professional. I will use Birmingham Fast Repair again!", "pics": null, "resp": {"time": 1512933891349, "text": "Thank you! We look forward to working with you again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "105756473975385612568", "name": "Ellason Holliday", "time": 1594742878135, "rating": 5.0, "text": "Great experience and service, would highly recommend!!", "pics": null, "resp": {"time": 1594820632897, "text": "Thank you so much Ellason!  Please call us again anytime!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "113546052482717433739", "name": "Kelley Largin", "time": 1575481827061, "rating": 5.0, "text": "Quality work. Professional and reliable!!", "pics": null, "resp": {"time": 1575912345227, "text": "Thank you Kelley!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "113447356902872101594", "name": "Clay Hubbard", "time": 1504981247297, "rating": 5.0, "text": "We had our deck replaced from Blake at Birmingham Fast Repair. He did a fantastic job, was super timely with his work, and very friendly! If you are looking for a quality job, look no further! We could not have been happier with their work!", "pics": null, "resp": {"time": 1504982071688, "text": "Thank you! So glad to here it!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "105097042115684152364", "name": "Kyle Murphy", "time": 1506963040210, "rating": 5.0, "text": "I recently had some work done to my house I just bought by Micah and I am more than satisfied! The work ranged from outdoor tree work to electrical to installing shutters and house numbers and everything worked out great. The best part of using Birmingham Fast Repair is the communication and honesty you get about the service and what needs to be done. I plan on using them again for more projects around my house and recommend to anyone in the Birmingham area.", "pics": null, "resp": {"time": 1506984760659, "text": "Thank you for sharing. We look forward to the next project!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "116487728854517195490", "name": "Lisa Muncher", "time": 1556742338290, "rating": 5.0, "text": "This company did a great job for us on the deck steps we requested. The price was very reasonable, the steps look fantastic and Brent was a great person to work with. He was quick and efficient at his work and cleaned up afterwards. Will definitely use BFR again in the future. Just a note, the fact that you can pay your invoices on line, with half up front, and use any form of payment, is a huge plus!", "pics": null, "resp": {"time": 1556760193530, "text": "Thank you Lisa. We really appreciate the feedback. I’ll pass on you kind words to Brent!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "115255608470999109324", "name": "Shannon Johnston", "time": 1471548449007, "rating": 5.0, "text": "Seth did an awesome Job fixing my daughters drawer to her dresser! I would highly recommend him for anything you may need fixed in your house!", "pics": null, "resp": {"time": 1471564681183, "text": "Thank you Shannon!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "108608701853877251285", "name": "Trudy Clements", "time": 1551216637641, "rating": 5.0, "text": "Highly recommend this company. From the first minute through completion of the job, everything was first class. Kyle did a wonderful job moving the cabinet over my cooktop, replacing the range hood and SS backsplash.", "pics": null, "resp": {"time": 1551218120636, "text": "We love feedback. Thank you!!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "113558550874110777763", "name": "jacqueline smith", "time": 1473375099385, "rating": 5.0, "text": "Seth repaired and serviced our Dyson vacuum and I could not be more pleased! He picked up and delivered for a fair price and even found a better deal for replacement filters for me!! He was very quick to respond and the repair turnaround time was super fast! Seriously some of the best customer service around - I will definitely be calling him again!!!", "pics": null, "resp": {"time": 1473375874376, "text": "Thank you Jacqueline!!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "107571316991647484041", "name": "Rae", "time": 1564124442068, "rating": 5.0, "text": "Trustworthy, friendly, and knowledgeable. The whole process was stress-free.", "pics": null, "resp": {"time": 1565091906369, "text": "Great to hear! Thanks again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "100204599229098913299", "name": "Amy S", "time": 1479496388354, "rating": 5.0, "text": "Birmingham Fast Repair did a great job in stalling a small fence and gate in my backyard. A pleasure to work with - quick responses and good quality work!", "pics": null, "resp": {"time": 1479669851257, "text": "Thank you Amy!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104937908497463699385", "name": "JJ Thomas", "time": 1488905551510, "rating": 5.0, "text": "Seth and Bham Fast Repair were very responsive. They were able to perform the work timely, at a very reasonable price and, also, at a high quality. Will call on them again.", "pics": null, "resp": {"time": 1488906407534, "text": "Very kind! Our pleasure"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "115819374549422593846", "name": "Elaina Gunter", "time": 1517943254667, "rating": 5.0, "text": "Blake with Birmingham Fast Repair was amazing! He showed up on time, was respectful, and very professional. Communication can sometimes be a hassle with certain companies but not this one. Bham Fast repair always responded to my emails, calls, and even texts in a timely manner making this project a breeze. Blake came prepared and went above and beyond for our yard cleanup. Would recommended them to anyone for ANY job! Will definitely be hiring again!", "pics": null, "resp": {"time": 1517961951075, "text": "Thank you for the kind words! We look forward to working with you again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "117716242555072450979", "name": "Cathy Alexander", "time": 1471532012663, "rating": 5.0, "text": "I was very happy with the service I received from Seth Hamby.  I needed my reclining sofa repaired.  He came to the house and repaired it there so we didn't have all the hassle of having to take it somewhere (If you have ever had a reclining sofa you know how heavy and bulky and awkward it can be to move)! I would definitely recommend calling Birmingham Fast Repair if you have any type of repairs needed around the house.", "pics": null, "resp": {"time": 1471544812251, "text": "Thank you Cathy. It was a pleasure!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "102805233915725257488", "name": "courtney callis", "time": 1617244102290, "rating": 5.0, "text": "David Moss did an amazing job putting together my furniture!", "pics": null, "resp": {"time": 1541815641526, "text": "Thank you Courtney! We really appreciate that you took time to do a review for us. Please call us again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "118369324823855483078", "name": "alan dean", "time": 1550263667162, "rating": 5.0, "text": "gutter work repairing leaks, painting the gutter elbows, replacing the splash guard, and a few incidentals - reasonable pricing, on time, personable service.  Much more for him to do!", "pics": null, "resp": {"time": 1550696944364, "text": "Thanks Alan! We always appreciate the feedback!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "103443732244359694128", "name": "Corey M", "time": 1607228413873, "rating": 5.0, "text": "Treadmill assembly", "pics": null, "resp": {"time": 1607229068956, "text": "Thank you for your review!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104852949043229895286", "name": "Luke Rabun", "time": 1504719503206, "rating": 5.0, "text": "Great work", "pics": null, "resp": {"time": 1504734544772, "text": "Thank you very much!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "117040382034370356448", "name": "Brenda Dillard", "time": 1613181716065, "rating": 5.0, "text": "I love my work  love the people  great experience its taught me I can make furniture", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN3Fd27tfUbRftl7Yv19w1gPLSl_8CRkUqKwIYY=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8887fd27619c2873:0x23af06f4a7125193"}
{"user_id": "117664313456582506166", "name": "Douglas j West Jr.", "time": 1614302696693, "rating": 5.0, "text": "Only been here a few times. Super nice people here .", "pics": null, "resp": null, "gmap_id": "0x8887fd27619c2873:0x23af06f4a7125193"}
{"user_id": "103934359916977951038", "name": "Paul Godsey", "time": 1609101317998, "rating": 5.0, "text": "Making great wood furniture every work day", "pics": null, "resp": null, "gmap_id": "0x8887fd27619c2873:0x23af06f4a7125193"}
{"user_id": "116436040124313732534", "name": "Ronnie Taylor", "time": 1606401242739, "rating": 5.0, "text": "Locally owned great craftsmanship and great to do business with", "pics": null, "resp": null, "gmap_id": "0x8887fd27619c2873:0x23af06f4a7125193"}
{"user_id": "101564870966511799745", "name": "Bill Godwin", "time": 1617176783008, "rating": 5.0, "text": "🇬🇧👍", "pics": null, "resp": null, "gmap_id": "0x8887fd27619c2873:0x23af06f4a7125193"}
{"user_id": "110651631179722317141", "name": "Katelin", "time": 1617814690033, "rating": 1.0, "text": "Agreed with everything my husband said about Custom Interior. They are lousy.\n\nI will say too that this company is so petty about a bad review, versus actually helping their customers and making their business better, that Mike Letson had not only his employees, but his own relative give him 5 star reviews just to boost him on Google right after Blake wrote his review.\n\nSad that they care more about their online persona than the service they provide to customers.", "pics": null, "resp": null, "gmap_id": "0x8862695ead5d35ef:0x1f9811c7fc8a4a2"}
{"user_id": "106105512207248468317", "name": "natalie Snyder", "time": 1602185165064, "rating": 5.0, "text": "This company has top notch customer service, everyone I have come in contact with has been very professional and attentive!!!", "pics": null, "resp": null, "gmap_id": "0x8862695ead5d35ef:0x1f9811c7fc8a4a2"}
{"user_id": "115867717679594272062", "name": "Rusty L", "time": 1602185598516, "rating": 5.0, "text": "Nice quality cabinets plus amazing customer service, will definitely recommend this company to my friends!!!", "pics": null, "resp": null, "gmap_id": "0x8862695ead5d35ef:0x1f9811c7fc8a4a2"}
{"user_id": "100997616840140597450", "name": "Blake", "time": 1600187085659, "rating": 1.0, "text": "We built a new house with a builder who uses Custom Interior as their cabinet supplier. Multiple of the cabinets were incorrectly drilled in our house and had old drill holes in them that were partly patched. No problem though, as I confirmed with the cabinet making rep that he was reordering all of the messed up cabinets and he would have them done in two weeks, prepared for our “30 day appointment,” November 11, 2019.\n\nWe were scheduled for said appointment exactly 30 days from our closing date, with all necessary parties notified and told to be there with the time frame of 8:30-11:30. Custom interior hadn’t shown up about 11:15 so we called our builder and told them. At approximately 1:30, their guys showed up with all of the wrong cabinet doors and parts they needed, telling me they “hoped they could come back that night, but they weren’t sure.” So they didn’t show up for the scheduled appointment, had to be reminded about it and got there with all of the wrong parts for installation.\n\nAt my PSI one week before our closing date, we walked through pointing out all of the broken cabinets that were going to be replaced by Custom Interior, we documented them and I was asked to sign off that other than the documented cabinets, the others were good to go. I even made sure to ask the Custom Interior head who we met with point blank to clarify and make sure all DOCUMENTED cabinets would be replaced, to make sure that wouldn’t come back on us. And it’s lucky that I did.\n\nI followed-up with our builder later that afternoon of our 30 day appointment, NOV 11, 2019, asking what is going on with the cabinet people. They informed me that the cabinet guy, with whom I spoke and made sure with that my broken cabinets would be replaced, had informed our builder that “we signed off on all of the cabinets being good and that he wasn’t supposed to replace them...” So he custom ordered me cabinets, sent his guys out to my house to replace them with the wrong parts, and then had the audacity to try and throw me under the bus and say that “I had signed off on them.” You can imagine I was quite upset at the fact that he was attempting to circumvent his job requirements. I informed the builder of this and was told that I would be kept updated as to what would happen.\n\nSo it’s now been 40+ days since move in, the head at the company has attempted to undermine me and get out of doing this job, I still have messed up cabinets and will again have to take a day off of work to try and meet them, with them hopefully being prepared this time.\n\nI realize I shouldn’t have given our builder the ability to close without everything fixed properly and yes that is my mistake. However, having Custom Interior show a complete lack of professionalism through this process and their non-caring attitude towards their customers, I can and will never recommend this company to you, nor can I advise you to do business with any builder that uses them as a sub-contractor, unless you ensure everything is complete pre-closing.\n\nEDIT to add final info:\n\nThey did show up NOV 26, 2019, but only replaced the pull out drawers that were drilled incorrectly. They, for a second time, brought a wrong sized cabinet door and did not bring a soft-close hinge for the one cabinet that needed it.They showed back up January 27, 2020 and replaced the cabinet door, but still did not bring the soft-close hinge. February 3, 2020, the soft-close hinge was finally brought and installed and we had fully-functioning cabinetry.\n\nTo summarize, 115 days of excruciating service. They have to be constantly monitored and reminded just to do the job they agreed to do. Even with the exact cabinet specs documented for my house, they still managed to build and bring incorrect cabinetry three times before they were all fixed. It's unprofessional and absolutely unacceptable.\n\nThough the cabinets are good quality, I'm sure you can find 5 other cabinet suppliers in the area that will do the job just as well, without all of the emails, heartache, and wasted time.\n\nTrash company with non-existent leadership.", "pics": null, "resp": null, "gmap_id": "0x8862695ead5d35ef:0x1f9811c7fc8a4a2"}
{"user_id": "103507289413527567475", "name": "Bethanie Guzman", "time": 1602171896003, "rating": 5.0, "text": "This company and it’s employees are top notch👌🏼", "pics": null, "resp": null, "gmap_id": "0x8862695ead5d35ef:0x1f9811c7fc8a4a2"}
{"user_id": "101057002844545741485", "name": "dylan smith", "time": 1602170273737, "rating": 5.0, "text": "Would definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x8862695ead5d35ef:0x1f9811c7fc8a4a2"}
{"user_id": "103887855849146659311", "name": "Meagon Underwood", "time": 1588979061672, "rating": 5.0, "text": "Highly recommend this Cabinet Shop!", "pics": null, "resp": null, "gmap_id": "0x8862695ead5d35ef:0x1f9811c7fc8a4a2"}
{"user_id": "104170451922951297197", "name": "Reggie Whiddon", "time": 1527218946693, "rating": 5.0, "text": "You can't go wrong here honest as they come a fine Christian man", "pics": null, "resp": null, "gmap_id": "0x888e708146ede83b:0xb5a182c56c48e475"}
{"user_id": "101473775427329554154", "name": "David Jacques", "time": 1470150835479, "rating": 5.0, "text": "I have seen Lorenzo's work, from the raw wood to the finished product. It is amazing the talent God has blessed this man with !", "pics": null, "resp": null, "gmap_id": "0x888e708146ede83b:0xb5a182c56c48e475"}
{"user_id": "103306678955674420100", "name": "Joe Price", "time": 1610544885643, "rating": 5.0, "text": "Great southern wood.......not \"greater\"", "pics": null, "resp": null, "gmap_id": "0x888d5fc59cf599b7:0x2c06f4c83c453efd"}
{"user_id": "111092263349489494348", "name": "Robert Sloan", "time": 1571415991208, "rating": 4.0, "text": "Pretty organized company that gets stuff sold and moved.    I'll admit though Alabama has texas swooped............Columbus TX location should be looked at and tweaked a little.........boy they ha w come a long ways the last few years though", "pics": null, "resp": null, "gmap_id": "0x888d5fc59cf599b7:0x2c06f4c83c453efd"}
{"user_id": "118065102865155309746", "name": "Cynthia Cunningham", "time": 1557925618954, "rating": 5.0, "text": "Great wood", "pics": null, "resp": null, "gmap_id": "0x888d5fc59cf599b7:0x2c06f4c83c453efd"}
{"user_id": "103186682314376005147", "name": "Cynthia Russell", "time": 1611764193888, "rating": 4.0, "text": "Great job listening to what I want and need,", "pics": null, "resp": null, "gmap_id": "0x88891eddabcc0fa7:0xb948e5b5c66a857c"}
{"user_id": "114856840471454054872", "name": "Caleb Jones", "time": 1622752546025, "rating": 5.0, "text": "Great service and selection for fine woodworking tools.", "pics": null, "resp": null, "gmap_id": "0x888c26b6fee6d7ff:0x6295b82e1a56f7fd"}
{"user_id": "100814533666444321530", "name": "Dorothy Priest", "time": 1611685316446, "rating": 5.0, "text": "Customer oriented. Usually has what you need. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888c26b6fee6d7ff:0x6295b82e1a56f7fd"}
{"user_id": "110365196556536236138", "name": "Ray Albright", "time": 1607989560794, "rating": 5.0, "text": "Great wood store knowledgeable people very helpful and friendly", "pics": null, "resp": null, "gmap_id": "0x888c26b6fee6d7ff:0x6295b82e1a56f7fd"}
{"user_id": "115024471328314947431", "name": "Dave Canham", "time": 1617170478199, "rating": 1.0, "text": "They steal your money ! The owner Ben sold me $7000 in black walnut logs . He then said deal was over as I was picking them up only refunded $2400 of my money and I only got $1500 worth of logs before he ripped me off and said it’s trespassing if I come on property . Update . Bin a few days now . He has not honored our deal given back the money or even responded to my numerous messages . Stay far away from this place !!!", "pics": null, "resp": null, "gmap_id": "0x888c26b6fee6d7ff:0x6295b82e1a56f7fd"}
{"user_id": "104764451462116716194", "name": "Bradley Hall", "time": 1576982248344, "rating": 5.0, "text": "This place is amazing. If you are into woodworking, do yourself a favor and stop by. You will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x888c26b6fee6d7ff:0x6295b82e1a56f7fd"}
{"user_id": "117634033248286318432", "name": "heelysblake", "time": 1599841633482, "rating": 5.0, "text": "Great tools and very knowledgeable", "pics": null, "resp": null, "gmap_id": "0x888c26b6fee6d7ff:0x6295b82e1a56f7fd"}
{"user_id": "106159894942693256908", "name": "Russell Lamkin", "time": 1565874347135, "rating": 5.0, "text": "Great local place to find specialty woodworking tools.  Great service and very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x888c26b6fee6d7ff:0x6295b82e1a56f7fd"}
{"user_id": "111115998015277278489", "name": "Katherine Presley", "time": 1404425363295, "rating": 5.0, "text": "This guys knows his tools and hardware! If you need  a small or large tool, check with this company. Great service and prices!", "pics": null, "resp": null, "gmap_id": "0x888c26b6fee6d7ff:0x6295b82e1a56f7fd"}
