{"user_id": "112220853949849102584", "name": "Melanie Williams", "time": 1609793897328, "rating": 1.0, "text": "I had a positive experience prior so hired Kevin again. I tried to reach him to make things right and could not reach him via phone or text. My flooring was cut incorrectly. I have numerous spots where you can see the slab. Toilets were not correctly re-installed. House was left a total mess. Floors were filthy, grout and sand and debris left in my sinks and tubs. Trim was not replaced where it belonged. Hole was made in my bedroom wall, was repaired, not great. I felt I was taken advantage of regarding charges to remove subfloor. I questioned the high rate and was told it was because it could take days, it took hours yet I wasn’t offered any relief.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN_mA4s5pTMLT3UICh3YohBQjafnPw6rqNEOAfO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMtqFLNpVE1rJzO9n3rClZYZRQrRX5xAxRdzey9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMoUPFvGAz5jo13F9bWdZcsLtR7UTpBinQKO5CN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNOFkVPFXF2iyUjkmPBwLawhvgexqxq4D1BVWr9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN6ROpnE3TTIN7vt9pfaDe4CnQxKEEXy0bdsEF7=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN0erzxaLVnNurrgJ65ksViUkg0axjUz7Pk33JD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNKF8ZhvaWqEWkri2JENMBk3pY2cvtf42AQDv_L=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOFybDR4MqSoJeUO5EAHMMaiPV9HowBpb9bixRU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPlX2229h-Ny72KgQ_IuyX6LpjnSZLWqajzRY2r=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMK4UVezvMdV8LvXREu5MSJjhoBdYlZQxSUh8ei=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN3vl2NC00nUlE099hTVUSOdGphkdSUJHVcsafa=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOHlWky5_w6Y6p3eI1PIIm0r6I-oVpEnp4wI_SB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNgrHrlA8rMZDkKcrhwFvFE1Q7XYCw2dPlsPQYP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMcxiIjDAI9HnrG3UxsV3FFLTTE3U2XbP50M8ws=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "110410250439737212384", "name": "Alex", "time": 1620175013411, "rating": 5.0, "text": "Kevin is prompt and very professional. He arrived on time and notified me in advance when he would be here and what he would be doing. He tore out my old plastic master shower and tiled in a beautiful new one for me. The only negative is my water bill is going to go up because I love my shower now.10/10 highly recommended for tile in shower work.", "pics": null, "resp": null, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "113907057201223468636", "name": "Meredith Zywno", "time": 1579620948292, "rating": 5.0, "text": "Kevin and his team recently replaced some laminate flooring in two rooms of our house with hardwoods. Kevin arrived on time and got the job done well within the expected timeline. He and his team were extremely courteous and professional, and his office manager was very easy to work with. We are very happy with how our floors turned out and will definitely be calling WCR in the future.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNNlBO459dWlDLx8o7ts-VwfDc-jef9cfCBJ1Zc=w150-h150-k-no-p"]}], "resp": {"time": 1604507128890, "text": "Meredith, thank you so much for your positive review!"}, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "115815977662471540601", "name": "Dra Coleman", "time": 1586978175028, "rating": 1.0, "text": "The quality of work is very poor.  The quality of work could have been mitigated if problems  we're shared with the owner when discovered.  You  can not suggest or make comments unless you pay for his and son mistakes.  This guy does not listen and have an answer for everything.  I would not recommend this company to anyone else.  I am having to hire someone else to correct his errors with the wood floors installed.", "pics": null, "resp": null, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "102815027768439436293", "name": "Larry Levitt", "time": 1592924447148, "rating": 5.0, "text": "Kevin and his crew work hard to provide quality service in a polite, professional manner. I highly recommend them.", "pics": null, "resp": {"time": 1604507165588, "text": "Larry, thank you for your kind words! It was a pleasure working with you."}, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "112126647934827977328", "name": "Caryn B", "time": 1561502970253, "rating": 5.0, "text": "Kevin and his crew did an excellent job remodeling our bathtub into a walk in shower. He was kind enough, and patient enough, to work around our crazy hours and scheduling to get the job done. Only one little hiccup with the plumbing but he just called in another plumber and was back on track in no time! Job well done gentlemen!", "pics": null, "resp": {"time": 1568044620435, "text": "Thank you Caryn for your kind words! It makes us happy that you are pleased with our work."}, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "100725632466140286690", "name": "Ivy Heffelfinger", "time": 1573934924609, "rating": 5.0, "text": "Kevin made the entire process of a tile backsplash seamless. The job was on time, didn’t overspend on material and it was done beautifully. Will definitely keep them in mind for our next project", "pics": null, "resp": {"time": 1579706505862, "text": "Thank you!"}, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "108219338770832385708", "name": "Jennifer Greer", "time": 1583337949581, "rating": 5.0, "text": "They redid our master bathroom shower and did such a beautiful job! Kevin was so great to work with and we could not be happier with the outcome!", "pics": null, "resp": {"time": 1604507137515, "text": "Thank you Jennifer!"}, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "117719533005660636430", "name": "Buddy Boggs", "time": 1510184510481, "rating": 5.0, "text": "Kevin came to my home in Meridianville as scheduled. He tore out the old tile and sub floor and then put down backer board and new tile. I found Kevin to be very professional, knowledgeable and friendly. All trash was removed and I am well pleased with the work.\nWilliam Boggs", "pics": null, "resp": {"time": 1554995358846, "text": "Buddy we appreciate the opportunity, glad you were pleased with the services provided."}, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "101481880839484542381", "name": "Melissa Lloyd", "time": 1531252773916, "rating": 5.0, "text": "KEVIN AND HIS CREW DID A FABULOUS JOB REPLACING MY WOOD FLOOR WITH PORCELIN WOOD TILE.", "pics": null, "resp": {"time": 1554995281903, "text": "Melissa it was a pleasure working with you, thank you for entrusting us with your project."}, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "104540841410596870675", "name": "John Whitman", "time": 1508781787716, "rating": 5.0, "text": "Outstanding work by Kevin and his team: prompt, fast but high quality, informative. Would hire them again.", "pics": null, "resp": {"time": 1554995414433, "text": "John, thank you for the opportunity and we look forward to working with you again."}, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "113067643194269425298", "name": "Fred T", "time": 1521218012181, "rating": 5.0, "text": "Beutiful work and on schedule.", "pics": null, "resp": {"time": 1554995317427, "text": "Fredrick thank you."}, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "105628026063125652002", "name": "Bahia Saxon", "time": 1629579098251, "rating": 5.0, "text": "this was a top notch experience. I was so impressed about how easy and seamless this process was. Not only are the professionals at Homewood Carpet & Flooring super helpful and friendly but the final installation was pristine. We couldn't be happier with our result and they were very cost efficient. I will absolutely be using these guys for any flooring project in the future. If I could give more than five stars I would! :-)", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "105452077554670514724", "name": "Susan Upton", "time": 1629403066529, "rating": 5.0, "text": "Had an incredible experience using this company. They got everything in when they said they would and were very easy to communicate with. Finished look was 10x better than I imagined! Highly recommend", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "118186634923858061571", "name": "Sarah Donnell", "time": 1630092365201, "rating": 5.0, "text": "Paul was great to work with! Really knows his stuff. The instal only took a little over an hour and they were super friendly and efficient! We are so happy with our new carpet. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "115241771041549968552", "name": "Mary Dutta", "time": 1629746634664, "rating": 5.0, "text": "Ww had an excellent experience with this company. Paul was very responsive and clear up front about the process. Buck and his crew were prompt, pleasant, and did a beautiful job. The price was reasonable and the results outstanding. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "113011621824311531721", "name": "Lora Gaxiola", "time": 1616420374675, "rating": 5.0, "text": "Paul was responsive and easy to work with. He presented several options to fit our budget. The work was done promptly, neatly, and efficiently and we're so happy with the results!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNPlICy5D3CApDrSyJemEd2v3NPAFwBYcuyi7r2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNNpQNtJbxuoWHHE_OnznFNg7KkGwZYIhpp-epO=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "118162646328130450948", "name": "Sarah LeCroy", "time": 1593821432159, "rating": 5.0, "text": "So happy with my floors. I chose to go with a darker grey flooring that is scratch proof and waterproof. I have a black lab, so these floors will be so much better than the dingy carpet I had. Paul was very prompt and even came to my condo to show me samples. I never even had to go in the store, everyone came to me! I called Homewood carpet and flooring, and the same afternoon I ordered my floors. Buk and his helpers were on time and did a fantastic job. They cleaned up very well after laying the floors and were respectful of my furniture and belongings. I live in a 750~ sq ft. Condo, approximately 3/4 of the condo flooring was being redone, and took 10 hours from start to finish. I would highly recommend Homewood Carpet and Flooring. You can’t beat the quality of floors, the timeliness and the accountability they give you for their price. Thank you!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPBsxypdIcavR9-1JfdMe3KKB1LrIDo6Zi6rkkW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNxL-R-fqpKVFjMJRphbCqv1mAge5ZGHY4LmI6P=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMfuvx1mlkkPMUNlcAmDm0UiMpUe0F5gGWN1ggJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOOYPx9NSY3OWSv0TykkxSAXplbKgU-x6cNRVaP=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "114618076015317725078", "name": "Elizabeth Adams", "time": 1625785222657, "rating": 5.0, "text": "Very responsive and helpful! Helped us out in a pinch when our first carpet installer backed out just a few weeks before the project date. Directed me to a carpet that was in stock (and what I wanted) so that the project could move forward on the timeline our business needed. At the install, they discovered an unexpected floor issue which required us to make a last minute change and he handled that and found an available carpet for us. Went above and beyond to make sure our timeline was met! Super nice guys did the install. Great attitudes and a pleasure to work with.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "102550943489522229247", "name": "Naomi Smitherman", "time": 1622842703498, "rating": 5.0, "text": "I was pleased with the whole process.  I needed carpet stretched.  I got a fair quote for the work and it was completed sooner than expected.\nThe two men who stretched the carpet were prompt, courteous, quick workers and they did a great job.  My floors look so much better.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "118259884880483695119", "name": "Melanie Clark", "time": 1617645545607, "rating": 5.0, "text": "Foo did an amazing job with helping me pick out quality flooring for two basement rooms. He gave a great price and was quick with getting me scheduled. The communication was great through the whole process. He was easy to work with. His team was efficient and very pleasant to deal with. I would definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "113474695457460213822", "name": "Cody Hirsberg", "time": 1621631846764, "rating": 5.0, "text": "We decided to use Homewood Carpet & Flooring based on the referral of a trusted builder. Tyler was excellent to work with regarding sales and selection. He came by the house for measurements and then met us at the showroom to review his recommendations and to make a flooring selection. Foo then organized the install and, because we were in a bind with guests arriving in a few days, was able to install the carpet a day sooner than expected.  Overall, Homewood Carpet and Flooring exceeded expectations which is why they earned this 5-star review.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "103023993376649810129", "name": "Ann Langley", "time": 1617841699433, "rating": 4.0, "text": "Paul was extremely helpful and responsive throughout our decision making and installation process.   The installation crew was courteous and very hardworking.  Everything was cleaned up and put back in place when they finished.  I have already referred this company to several friends!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "116080352438061654217", "name": "Alexandra Baugh", "time": 1617048385814, "rating": 5.0, "text": "Got carpet replaced in 3 rooms. Very fast and good quality work! Would definitely use again and recommend. Fair pricing and kind staff.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "104158047672989891341", "name": "Wendy Morell", "time": 1614952124707, "rating": 5.0, "text": "I’ve had three jobs done in the last month: carpeting stairs, refinishing original hardwood floors, and laying vinyl flooring. All three looked amazing when finished. The people who completed the work were kind and knowledgeable. I would highly HIGHLY recommend to anyone for any job, and if I have any flooring needs in the future, I will definitely be going back to Foo!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "104618926811918696197", "name": "Austin Wilson", "time": 1621624780392, "rating": 5.0, "text": "Amazing customer service! Fair pricing, they did a great job, and in a timely manner. Will use again!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "111495963250111391792", "name": "Shannon George", "time": 1628170628473, "rating": 2.0, "text": "I called on Saturday and was told someone would come out Monday to look at our floors. No one showed up, no one called to cancel, no one called to reschedule.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "101596527165292822274", "name": "Erika Olds", "time": 1613614553654, "rating": 5.0, "text": "Paul was very nice an easy to work with excellent customer service.This company has great pricing and did an excellent job on my mom's floors. They went above and beyond to make sure she was satisfied I would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "107406140331088407281", "name": "Mandy Willig", "time": 1611775396054, "rating": 5.0, "text": "Paul and his team replaced our carpet with beautiful engineered hardwood flooring. They provided amazing service throughout the process, from home consultation through the final walk through. We will not hesitate to recommend them to our friends and family!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "112669690267867551371", "name": "Mark Grissom", "time": 1607013347512, "rating": 5.0, "text": "We had an urgent need entering into a new home. Foo and crew responded same day, made selections easy, had it installed before we could get through the quoting process of big box. The installers were friendly, efficient, and the work was superb with exactly the product we wanted. What else can I say! Oh, above all else wife loves the new carpet and quality work.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "115776682774923613335", "name": "carol harris", "time": 1602631356793, "rating": 5.0, "text": "From the moment I walked in the door I was completely impressed with Homewood Carpet & Flooring. Not only was Paul knowledgeable about the flooring, he was genuinely interested in my specific needs for flooring. He was completely helpful  in the product selection that would best suit my needs. He stayed in communication with me throughout the entire process. His install team was  right on time and did a beautiful job. The guys were extremely thorough. I was really impressed with their attention to detail. They finished my (whole house) flooring job on time and left my home clean and in order. I have no reservations at all in recommending the guys at Homewood Carpet & Flooring to my friends and family.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "117769460189460528973", "name": "9 Bachelors", "time": 1618853711320, "rating": 5.0, "text": "Great job all the way. Excellent service, accurate quotes, very professional, polite and thorough installation team.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "110244103281373819637", "name": "Greg Yemm", "time": 1611325640548, "rating": 5.0, "text": "Quality, prices, and service were all 5 stars. The owner was very responsive any time I had questions too. Definitely would recommend.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "106706201392271033749", "name": "Kelly Arrington", "time": 1614274894918, "rating": 5.0, "text": "Enthusiastic crew who did a fantastic job on matching the rest of my floors and amazing job on my stairwell. The were timely, efficient and did a high quality job!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "107894437989686182279", "name": "Brian Murphy", "time": 1599170488442, "rating": 5.0, "text": "You are in good hands with Paul and his team.  First class service and a job well done.  I would recommend this company to anyone looking for flooring work.  Paul’s team sanded and re-stained my floors.  The work was of the highest quality.  Will definitely work with them again in the future.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "118431358092981908870", "name": "Corie Clark", "time": 1614175577124, "rating": 5.0, "text": "Foo was easy to work with and very responsive. The carpet and vinyl plank in out basement looks great.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "108185767878195700642", "name": "Bryan Stack", "time": 1595571082452, "rating": 5.0, "text": "I highly recommend them. Paul helped me select the flooring to replace my carpet. He was very prompt in providing an estimate and getting the job started.\nThe installers did an excellent job removing the carpeting and installing my vinyl floors. My condo looks 100% better. I will choose them again when I sell my condo and purchase another home.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "109786987685071944786", "name": "Britney Henry", "time": 1607133893779, "rating": 5.0, "text": "Paul and his staff did a wonderful job with our flooring project! We had our red oak floors refinished and also had our stairs repaired. They took our very outdated and yellowed flooring and transformed it into a beautiful brown/gray color that is exactly what we had envisioned. They even mixed two of the stains to get the exact color we described. One room had several areas of stains that was so bad I wasn’t sure they would ever look normal, but they were able to make the stains completely disappear. They also replaced a broken part of one step and repaired the stair treads so that they no longer squeak! We are completely satisfied with the job that Homewood Carpet and Flooring did for us and we appreciate their professionalism and thoroughness.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "117280063315082407405", "name": "felicity79", "time": 1596471524844, "rating": 5.0, "text": "I was unsure of what flooring I wanted, Paul was very helpful on helping me decide to refinish my hardwoods or to choose a new floor. He came to my house to show me color swatches and was willing to come back a second time when I thought I had changed my mind. I ended up going to his store and we picked out a beautiful floor that I am so proud of. Installation only took maybe 4 hours for my 900 ft. square floor. I would choose them again for my flooring needs. Will be redoing my kitchen floor soon, and definitely plan on calling Homewood Carpet and Flooring.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "106375889622757826283", "name": "Susan Copeland", "time": 1601668566170, "rating": 5.0, "text": "I have used Homewood carpet and flooring three separate times now for my home renovations and each time they exceed my expectations. Both Foo and Paul are really lovely to work with and provide clear communication so that I always knew exactly what was going to occur. And with a German Shepard puppy and 3 teenage boys, they have always guided me on the best flooring and carpet that would keep up with our chaotic and busy household :)!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "105121955311567759148", "name": "Tracy Thomas", "time": 1601657899176, "rating": 5.0, "text": "Paul and the guys at Homewood carpet and flooring did a wonderful job removing and installing new carpet in our upstairs! I even had to reschedule them and they fit me in on a Saturday at a moments notice! Everyone I worked with was professional and timely.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "106129743773265585104", "name": "Kristina Martin", "time": 1614178887077, "rating": 5.0, "text": "So compassionate and helpful. We had a time crunch and extenuating circumstances and they worked within those and did the job well.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "107364611999581145920", "name": "Kathryn Dorlon", "time": 1614974470649, "rating": 5.0, "text": "Friendly staff! Always looking to make your experience a good one and find the product you are looking for your home!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "116669237657631918488", "name": "Klaudia Thomas", "time": 1586493100689, "rating": 5.0, "text": "Paul did a great job providing the best customer service, attention to detail, offered his expertise and knowledge in carpet and wood selection process. Price was very competitive with others in the market. The crew was very professional, efficient and accurate. We love our new floors, looks amazing. We highly recommend this company.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "117292198587016720216", "name": "marybeth kaylor", "time": 1598277551269, "rating": 5.0, "text": "They did a great job refinishing our hardwoods and installing sisal carpet. Very fair, honest, and professional.  Highly recommend and will use again!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "117927648101878405915", "name": "Aaron Tallo", "time": 1599232880272, "rating": 5.0, "text": "Excellent and fast service. These guys are top shelf all the way around. If you need flooring you need to call Homewood Flooring!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "109897471029265977962", "name": "Landon Parris", "time": 1580746963373, "rating": 5.0, "text": "My wife and I need carpet installed in 2 bedrooms and we’re going to do it ourself, until we walked in Homewood Carpet and Flooring and met Paul, who was so helpful in the store helping us pick out the right carpet for our home. He came and took measurements same day and we had a great quote within hours. Paul updated us on ever detail until carpet was here and job was done. Installing team was professional and friendly. Paul came after they finished to do a walk through and checked everything. So blown away by the personable staff, quality products, and thorough service they provided!!!!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "115446824885828872031", "name": "Renie Moss", "time": 1597672791787, "rating": 5.0, "text": "Paul and his team went above and beyond, beating all the big box store prices and installation timelines.  We had carpet installed in two bedrooms and needed it done prior to an appraisal for refi.  The team was fast and professional. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "114768715712822487049", "name": "Debra Marciniak-Grimm", "time": 1593804341247, "rating": 5.0, "text": "We are pleased with the carpet installed by Homewood Carpet and Floor. Paul and his team were professional and easy to work with. He knew we were in a time crunch and were able to squeeze us into his schedule when another customer dropped out.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "118348250169309480457", "name": "Roena Randall", "time": 1598114616803, "rating": 5.0, "text": "From picking the carpet to installation, Homewood Flooring did an outstanding job. I am in love with my new carpet and  highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "106960485294534860176", "name": "Mike Simpson", "time": 1585827596541, "rating": 5.0, "text": "Just had our den and home office re-floored, and couldn't be happier with the results. Paul was very responsive to our initial inquiries, and provided good advice in helping us with our decision. Installation was prompt and very well done.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "118184430553207416823", "name": "Gary cutter", "time": 1539620311021, "rating": 5.0, "text": "Foo and his team were spectacular - responded immediately to my request for an inquiry - called on the morning of the measurement to be sure the time was still good for me.  The team did the job professionally and actually ahead of schedule.  Having spent three weeks trying to get the job done with a big box store with all types of exceptions, it was a pleasure to have the entire process done is less time.  Highly recommend this team.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "117506862403762401323", "name": "Mary Rogato", "time": 1556921176842, "rating": 5.0, "text": "My bath had to be rebuilt from subfloor because of water damage. Paul’s expertise management  and planning was excellent in getting job complete in a timely manner.  This bath was a total mess. When the workers came in and I saw their work, I knew my bath would look stunning.  Tile work is perfection.  I have been pleased with every job Homewood carpet and flooring has done for me. I strongly recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "111673837076019905808", "name": "Ryan Hartfield", "time": 1544822479160, "rating": 5.0, "text": "Foo and Paul do amazing work at a reasonable price. Their customer service surpassed my expectations. I wish I could give them more than 5 stars! ***HIGHLY RECOMMENDED!*** A+++", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "107924338687263126982", "name": "Ryan Hartfield", "time": 1581310003256, "rating": 5.0, "text": "Foo and Paul do not only do great work, but really help to guide you through the process and help you find the best options for your budget.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "113495018619618453896", "name": "Liza Roitman", "time": 1604282879129, "rating": 5.0, "text": "Great experience!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "115945416308632197519", "name": "Connie Thompson", "time": 1598578770897, "rating": 5.0, "text": "Stairs look great!!", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "102122478744703865565", "name": "Ken Patel", "time": 1472082259886, "rating": 5.0, "text": "very nice and great staff.\nprofesssional attitude , on time completed the enire work.\n\nvert much on time show up, quiet work oriented employeres.\n\nthe owner/maneger was great\n\nThanks\n\nKen P", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "106188424001067705739", "name": "Alyssa Terry", "time": 1496699419374, "rating": 1.0, "text": "I have tried to visit this store multiple times during the posted store hours, but they have been unexpectedly closed each time.", "pics": null, "resp": null, "gmap_id": "0x8889193428fc7e7b:0x2a244e1fd1eb3606"}
{"user_id": "107373578747965377165", "name": "James McCrary", "time": 1626720129291, "rating": 5.0, "text": "Very professional and detail oriented!", "pics": null, "resp": {"time": 1627425276565, "text": "Thank you for your feedback, James. Best wishes."}, "gmap_id": "0x88892324714bf263:0x39d3fc7f8e29f644"}
{"user_id": "110229001605108355798", "name": "Matt Trombley", "time": 1611841653569, "rating": 5.0, "text": "I've known the owner, Cory, for several years and I can say with complete honesty that he is a man of integrity, hard work, and resolve. What this would mean to any Footprints customer is that they would benefit from an honest estimate, timeframe for work, and commitment to see it through. I can't think of better traits for someone working on my home, and so I would highly recommend Cory to anyone looking to have a flooring project completed.", "pics": null, "resp": {"time": 1612201570763, "text": "Hello Matt, thank you for the five-star review of our flooring installation business and your incredibly kind words!"}, "gmap_id": "0x88892324714bf263:0x39d3fc7f8e29f644"}
{"user_id": "108127912775681228903", "name": "Matt Elsner", "time": 1612209368300, "rating": 5.0, "text": "I have been fortunate to work with Cory on a number of projects, and I will go out of my way to continue to work with him when I can.  Honesty and integrity are two traits that you can expect from him.", "pics": null, "resp": {"time": 1612374374237, "text": "Hello Matt, thank you for the review! We appreciate your kind words."}, "gmap_id": "0x88892324714bf263:0x39d3fc7f8e29f644"}
{"user_id": "116739485628185613042", "name": "Shelley", "time": 1623972877383, "rating": 5.0, "text": "I cannot say enough great things about Cory and his installation crew. The entire process, from start to finish, was amazing. Everything was thoroughly explained, I was kept up to date, and there were no surprise fees. The installation team far exceeded my expectations. They were very friendly, efficient and highly skilled. They cleaned up everything before they left and made sure I was happy with everything. I had put my kitchen floor project off for a long time because I can't stand having strangers working in my home as it is so stressful. This company put me at ease and I am so grateful I gave them a chance. My new floor is beautiful! If you are hesitant about having strangers in your house and need a great job at a very fair price, call Cory!", "pics": null, "resp": {"time": 1624295952281, "text": "Shelley, Thanks for the kind words! We are happy to read that our team has been able to provide exceptional service for you. As always, our team is avaible if you need anyhting else. Best wishes."}, "gmap_id": "0x88892324714bf263:0x39d3fc7f8e29f644"}
{"user_id": "107843451592497126275", "name": "Ken Lyons", "time": 1628032434422, "rating": 5.0, "text": "They have a huge showroom with hundreds of flooring styles and samples.  The customer service from selecting your flooring through installation process is top notch.  I enjoyed my experience with Town & County Flooring in Troy, Al", "pics": null, "resp": null, "gmap_id": "0x888dec5f700f19fd:0x7ad9ea9f35c8c922"}
{"user_id": "107466970645316110275", "name": "Latoya Smith", "time": 1619798556188, "rating": 5.0, "text": "I highly recommend Town and Country Flooring in Troy, AL. They were very friendly and prompt. It's very rare these days that you get great customer service and awesome service! The contractors Mike and Sharon, along with their crew did a fantastic job! I love my flooring!!", "pics": null, "resp": null, "gmap_id": "0x888dec5f700f19fd:0x7ad9ea9f35c8c922"}
{"user_id": "111821342660620744638", "name": "Robert Smith", "time": 1610292091232, "rating": 5.0, "text": "You couldn't find a more pleasant and knowledgable company to deal with; don't be fooled by the size of the store.", "pics": null, "resp": null, "gmap_id": "0x888dec5f700f19fd:0x7ad9ea9f35c8c922"}
{"user_id": "113744980404744881490", "name": "Brenda Colvin-Cheathem", "time": 1570593439440, "rating": 4.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x888dec5f700f19fd:0x7ad9ea9f35c8c922"}
{"user_id": "109035949185807481959", "name": "Leon Vickers", "time": 1622140572523, "rating": 1.0, "text": "Purchased vinyl they didn’t show up until too late to install. Had to call several times to have rescheduled. Finally showed up to install. Installed flooring over AC vent. Still waiting on a call as to when they CAN GET BACK OUT. Weeks now!!!!! Kitchen looks like a huge air pillow!! Terrible customer service. Terrible!!!", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "103697719551870720172", "name": "Victoria Hermann", "time": 1579625830621, "rating": 5.0, "text": "Rock Bottom Carpets was great to work with everyone was friendly. Prices were great and we're happy with how our floors turned out. They were able to install our floors quickly for a fair price. Would recommend.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPrjHKjOtUbxdcILIbGFStGjSj9Aiv4P4otMdno=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "111774413050567282058", "name": "anquiette100", "time": 1625068630739, "rating": 1.0, "text": "Don't use Rock Bottom!!! Never seen such poor quality carpet install.  Carpet wrinkled/buckled in every room they installed it.  looks horrible!", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "110295640646704837025", "name": "Charlotte Ragland", "time": 1618081696863, "rating": 5.0, "text": "THEY'RE THE BEST......I USE THEM ALL THE TIME I LOVE THEM THEY'RE ALWAYS THE ONE FOR ME ALWAYS.......WAY TO GO ROCK BOTTOM KEEP UP THE GOOD WORK 🌝", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "105863898325995251018", "name": "Blake Butler", "time": 1602514669823, "rating": 1.0, "text": "Everything was fine until it was time to do the work.  We wanted vinyl flooring removed and replaced and communicated from the beginning that there were several layers to be removed.  Andy said no problem and we ordered the vinyl and waited a week for the measuring.  After measure they said it would be a little more expensive, which isn't unreasonable.  However, a week later when the crew came to install, they flat out refused to do the work due to possible damage to the sub-floor.  They had a solution to sub-floor damage, but would not do it.  They only offered to put the vinyl down on top of the 4-5 other layers and cut the bottom of the doors.  So now I've wasted 2 weeks when I could've found somebody else to do it.  Extremely frustrated by the lack of communication between sales, measuring crew, and demo/install crews.  Now I own some useless vinyl after they refused to refund me.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "109893755339258672159", "name": "Tyron Newton", "time": 1622899359841, "rating": 5.0, "text": "I love my new luxury vinyl plank flooring.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "108342323075460420581", "name": "Mike Dominick", "time": 1572301318162, "rating": 5.0, "text": "Decent price quick install", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMEW0ckhuVCBj70dRMN_U7fiBdqN7Ak-oNIZg4c=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOj9tGqU3ktt07L-ATkHytvW7wmFjc3MMAoPSgF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOE1RRX-lH5MbfsRkQLBqPTf-giYv0haDhER0-3=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "115932440668585477723", "name": "Angela Schram", "time": 1602765626464, "rating": 1.0, "text": "Not a good place to get carpets. We bought flooring for our house a year ago and I’ve called and left messages several times but the manager will not return my calls to even hear my concerns and get a resolution. Our carpet is pulling everywhere and we’re not happy. Obviously they’re not interested in customer service since they can’t even return a phone call. That’s just bad business. I would not recommend or use them again. There’s plenty of other places around Huntsville that I’m sure would treat their customers better.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "100784408582232941807", "name": "A new life", "time": 1593186600684, "rating": 1.0, "text": "I'm not sure how they stay in business. I'm a small business owner myself. We were to have carpet installed Saturday the 20th when my husband was off work, they did not show up, even after many calls we were told they were still coming. Fast forward to 5:30pm I got home from work and no carpet. I left a message for them to call and let me know what was up. I worked Monday also but have access to my phone, no call. I called on one of my breaks, apparently they don't check their messages because nobody knew anything. I work my small business and a second job, so I work 7 days a week. They told me they could be here Tuesday the 23rd and have the carpet installed by 12 pm so I could be able to keep my appointments in my office in the afternoon as I was off the morning at my second job. That didn't happen. The 2 that came to install didn't have all the materials needed for installation. So they left to get it at 11am and didn't return until 1pm. The job was finished at 2:20pm and I am out $250 for the appointments I had to cancel. And no consideration for my time. I don't recommend using Rock Bottom unless you are at rock bottom.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "107328933852221992075", "name": "Bryan Minchew", "time": 1582036798933, "rating": 1.0, "text": "Do not do business with them. Check the Better Business Bureau first. Look at Face Book. I don't see how their still in business.", "pics": null, "resp": {"time": 1582655597996, "text": "My. Minchew is a disgruntled carpet installer who is no longer working for Rock Bottom Carpets. We wish him well at his next place of employment."}, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "118310378427339966706", "name": "Tyson DeAngelis", "time": 1569755346970, "rating": 5.0, "text": "Good prices. Quick service. Quality install", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "117488409327964166520", "name": "Jody Thomas", "time": 1582035058981, "rating": 3.0, "text": "Edit: they sent a very experienced gentleman out to fix the issues. He removed a\nTool from under the carpet and knocked the tack strips down much better than I could (they first told me to do it) there is something else under the carpet on the steps. But I guess we will have to live with it. Raising my score some after they sent a good person out for fix.\n\nTICKED OFF! THEY WON'T RESPOND OVER AN ISSUE OF SAFETY\n\nSHARP TACKS EVERYWHERE!\nMy 5 year old son can't even play without getting hurt! I'm so mad they don't even want to say anything to me out of the way. It's personal now after my son is bleeding!\n\nSTILL PICKING UP CIGARETTE BUTTS AND WHOLE CIGARETTES DROPPED. I even asked them to picked them up before leaving. We cant even walk through our house barefooted. They left tools and other objects UNDER THE CARPET. Carpet is coming up in areas.", "pics": null, "resp": {"time": 1557923527119, "text": "The issue of tack strip is common. There is tack strip around every wall and at every doorway. This is easily resolved be taking a mallet and knocking the strip down where you step."}, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "111710305579212947773", "name": "Terri French", "time": 1373308231485, "rating": 3.0, "text": "I wouldn't use them again.  They came and installed and left a bit of a mess.  Then when I vacuumed for the first time, my vacuum caught a \"nub\" they had not trimmed and the carpet ran.  They came and put a new piece in which was darker than the original carpeting.  Also, I noticed a dark spot after they left, it felt stiff like glue.  I called and they were supposed to send someone out to look at it but never did.\n\nOk, the mgr called and came out today.  They are going to try to remedy the situation.  So, that does give them major points and if they do a good job, I would certainly reconsider using them again.  Good customer service goes a long way in my book.\n\nThey came out today (a mere week after the mgr called and came out) and relayed the hallway, without piecing it this time. Everything looks good, like it should have the first time.  But, I am pleased and would recommend them.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "109794122877105258083", "name": "A G", "time": 1462465845472, "rating": 5.0, "text": "AWESOME!!! If it isn't right they will make it right! LOVE MY NEW FLOORS!! Thank you Rock Bottom Carpets!! Installers Todd and Clay were the bomb!  Big thank you to the manager Mr. Mark!!!  Thank you thank you thank you!!! Would definitely recommend RBC off Bob Wallace!", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "116758659387049198069", "name": "Marlyse Knezevich", "time": 1556987404922, "rating": 1.0, "text": "Poor customer service.  Was told by sales guy that my husband and I couldn't install the flooring ourselves. Because it was too complicated.  WTH? Shouldn't that be our decision if we pay for the flooring? But he wouldn't give us a price/without installation.", "pics": null, "resp": {"time": 1557922070980, "text": "We also think it would be poor customer service if we did not warn people that the product they were looking at was not a DIY product no matter how good of a handyman her husband thinks he is"}, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "112981894706665285363", "name": "Amelia Hreha", "time": 1434728393217, "rating": 5.0, "text": "I would absolutely use them again. I went in on a Thursday just before closing and our installation was completed the following Tuesday. I had gotten a quote from Lowe's and Home Depot and both were at least 2-4 weeks out and about $400 more expensive for lower quality products. I got a great deal from Rock Bottom Carpets on a quality carpet and with the money I saved was able to afford the best padding offered. Mark and Raj were such a pleasure to work with. They didn't pressure me to purchase anything and answered all my questions about the products. Raj helped me find the best carpet to fit our budget and needs and Mark was quick to respond to any questions or concerns that we had. I'm not sure why anyone would choose to not support their local businesses especially when they provide better products and services.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "101239368762917502384", "name": "Priscilla's African Apparel", "time": 1611366509299, "rating": 5.0, "text": "Great staff", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "109009435443034079445", "name": "Kandy Winsette", "time": 1500323286928, "rating": 1.0, "text": "Installer left a hugh seam visual. Left a mess.\nWhen installer drop carpet on the floor upstairs it caused sheet rock damage to my dining room on first floor under the bedroom. Took pics to RBC they had us email pics so they could turn them in to someone that handles this. He called today and said someone can come back out to fix seam which he agreed was bad. But said his insurance would not cover other damage the installer caused. I wish I could attach my pics so the public could see for yourselves. Would not recommend them to no one.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "107804050498252049842", "name": "Brandie Dorsett", "time": 1531833299683, "rating": 2.0, "text": "The initial customer service was good. But the follow up was not.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "116171310103117214806", "name": "William Gallo", "time": 1449335335618, "rating": 5.0, "text": "I was skeptical at first based on the BBB comments and reviews I saw. We decided to still try it out based on the competitive pricing and the installation timeframe. They did an amazing job. We carpeted two bedrooms and put wood laminate in the office and the guys who installed them were amazingly good. They were clean, well experienced guys. Paul kelley was the installation guy accompanied by klein. I would recommend rock bottom carpets to anyone if they keep using pro guys like the two who did our stuff.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "114443280234166189948", "name": "Sonya Mertz", "time": 1566587534403, "rating": 4.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "109956620326329016220", "name": "Rachel Kepler", "time": 1440102972977, "rating": 1.0, "text": "I will never use them again. Not only did they knowingly send a sick man to my house (he vomited RIGHT IN MY FRONT FLOWER BED!) My husband had to help move the carpet in and out of the house and move the furniture, which I was told moving furniture was only a courtesy and that was after the fact fyi and they left a mess of left over carpet in my bathroom and the tub?!?!. The manager told us, \"well the job he did was good,right?\" BUT YOU SENT A SICK MAN TO MY HOUSE,ALONE. We got nothing,a run around apology was pretty much it and an offer for a discount on future need, UMMMMM,NO. I will never use them again,my husband did half the work and,the installer(sub contractor) was very nice,yet he was sent to do a job even though he was sick and the manager was rude. So,next time,I will go with a company that has empathy for the people they work with and for.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "105723543530831146087", "name": "Mark Bounds", "time": 1510582453283, "rating": 5.0, "text": "Inexpensive flooring store", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "108182416079643742571", "name": "Mark Mcdaniel", "time": 1582065171915, "rating": 4.0, "text": "They were very patient with me in scheduling the work. The prices are reasonable. We are enjoying our new carpet and vinyl.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPj_bQH9toE6n9e7jyPOsE9xN6Ps52x2lXb0sZl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOHJVutH7Elg4HqH-bLAkR5XKYFtA_212Repc7f=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88927c2e3ef6ef9f:0x475f563410758375"}
{"user_id": "109324422851809026462", "name": "Diana Hall Bixby", "time": 1604892464174, "rating": 5.0, "text": "EXTREMELY helpful and great customer service.  The crew was very nice and made sure everything was cleaned up. I highly recommend Ben Baker Flooring. Clark Always takes care of me. Thanks guys!!", "pics": null, "resp": null, "gmap_id": "0x88927c2e3ef6ef9f:0x475f563410758375"}
{"user_id": "102294417311361326732", "name": "Kelli Wallace", "time": 1599054883544, "rating": 1.0, "text": "I had flooring installed from this company in 2015. Upon completion there were gaps in the flooring, my moldings were not put back, I requested they build my floors up to be an even transition between the tiles and wood flooring which they did not, the columns in my house were not accounted for when they did their measurements and the transitions between the floors were not properly laid so they continuously shifted and came loose. After two years of fighting to get these things fixed, it was finally somewhat decent. But the gaps between the flooring became an issue and soon started to separate and pull up. They came out and looked at the flooring in 2018 and agreed to lay new flooring for me, I picked out my new flooring bc the design I had previously ordered was no longer available. Apparently the new floor I picked was back ordered so it took months to come in, and once it did I was not notified, so I had to call and call to get my installation set up. Needless to say, there were more issues and as of right now, I still do not have the transition from my kitchen into my dining room bc the installer said that someone else would be handling that and when I called that person they laughed and said that was incorrect and now noone will answer my calls.", "pics": null, "resp": null, "gmap_id": "0x88927c2e3ef6ef9f:0x475f563410758375"}
{"user_id": "116183650590459390258", "name": "Willie Stanford", "time": 1563078706200, "rating": 4.0, "text": "The staff is very helpful and friendly even they're give you suggestion if it is a do it yourself project", "pics": null, "resp": null, "gmap_id": "0x88927c2e3ef6ef9f:0x475f563410758375"}
{"user_id": "108333275463522469497", "name": "Tommy Davenport", "time": 1625763011973, "rating": 5.0, "text": "Professional flooring", "pics": null, "resp": null, "gmap_id": "0x88927c2e3ef6ef9f:0x475f563410758375"}
{"user_id": "102071106224535363138", "name": "Karen Gardner", "time": 1562968915303, "rating": 5.0, "text": "Professional, informative  and reliable!", "pics": null, "resp": null, "gmap_id": "0x88927c2e3ef6ef9f:0x475f563410758375"}
{"user_id": "117300244181074048318", "name": "Karen Rae Gardner", "time": 1581812428713, "rating": 5.0, "text": "Great installation", "pics": null, "resp": null, "gmap_id": "0x88927c2e3ef6ef9f:0x475f563410758375"}
{"user_id": "107053069608728742171", "name": "Tom Mclemore", "time": 1612997813291, "rating": 5.0, "text": "I have used Ray on three homes and he is absolutely the best. Not sure what a parking lot issue has to do with a business's quality of workmanship.\nThe prices are fair, service is great and their selection is huge.", "pics": null, "resp": null, "gmap_id": "0x8861d7dfa72e4cf3:0x6d523d8da49e91b6"}
{"user_id": "108705735619693243928", "name": "Trisha Smith", "time": 1616805219288, "rating": 5.0, "text": "We renovated our Grandmother’s house last year and used R&D flooring to install our flooring throughout our house. These guys are the best! If you are building or renovating a home, go down and speak with Ray. You will not be disappointed!", "pics": null, "resp": null, "gmap_id": "0x8861d7dfa72e4cf3:0x6d523d8da49e91b6"}
{"user_id": "115323671775564525638", "name": "Amy justice", "time": 1616355069860, "rating": 5.0, "text": "We were so pleased with R&D Flooring for our recent renovation.  Excellent selection,  great customer service,  exceptional installation crew! Thanks,  Ray and Crew!!", "pics": null, "resp": {"time": 1616543483974, "text": "Thanks Amy it was a pleasure help you out!!"}, "gmap_id": "0x8861d7dfa72e4cf3:0x6d523d8da49e91b6"}
{"user_id": "115067893709027093742", "name": "ray langston", "time": 1616764615372, "rating": 5.0, "text": "I am the owner of this place and would like to explain the bad reviews. These were truck drivers that were tresspassing and got their feelings hurt and left bad reviews. Neither of the 3 have ever stepped foot inside my store", "pics": null, "resp": null, "gmap_id": "0x8861d7dfa72e4cf3:0x6d523d8da49e91b6"}
{"user_id": "106276948366641226143", "name": "kyle", "time": 1612030143669, "rating": 1.0, "text": "If you support truckers (the back bone of America, the ones that bring you food and all the essentials you need) do not shop here. They will boot you and say you owe them 500 bucks to remove it. They say they have signs up to warn truckers to not park or turn around in their lot but the sign is 100 feet off the road and against the building, you can't see that till you are already in the lot. The other 4 signs they have are 1\"×2\" signs you can't read till you are right on top of them and from what I could see those only said no parking. If you really wanted to till truckers not to use your lot you should put your sign front and center next to the roadway where people can see it.\n\nThey clearly can't make enough money on flooring so they have to prey on truck driver to make their mortgage. This place is a cash grab, and a place of extortion.", "pics": null, "resp": {"time": 1612131154233, "text": "Again sir I have had nothing but problems from disrespectful truckers since I opened my business. If you can’t read a 4 foot by 8 foot sign asking you to not park or turn around there then maybe you are in the wrong line of work. Maybe an optometrist visit is in your future."}, "gmap_id": "0x8861d7dfa72e4cf3:0x6d523d8da49e91b6"}
{"user_id": "116186986024781628778", "name": "Charles Wright", "time": 1611897563699, "rating": 1.0, "text": "It's a sad company that preys on unsuspecting truck drivers.", "pics": null, "resp": {"time": 1611940623392, "text": "If this truck driver could learn to read and had a little respect for others property then this truck driver would have not had any problems. There are 5 signs telling truck drivers they cant trespass on this property yet some think laws and rules do not apply to them. When a driver knowingly tresspasses is he really unsuspecting?"}, "gmap_id": "0x8861d7dfa72e4cf3:0x6d523d8da49e91b6"}
{"user_id": "101724120657508604841", "name": "Nick Kcin", "time": 1618698486952, "rating": 1.0, "text": "No good, would not recommend. I was sold on the panel flooring we have being pulled up to repair the areas were gaps were located, this wasn't done. All the crew did was squirt glue into the gaps and jam them forward to join them. This resulted in not all the gaps being fixed, and the ones glued a few of them have mounds of dried glue sticking out.  The flooring that was placed was fine, but the 1/4 round wasn't painted/stained on the cut ends, the transitions were nailed in (which is fine) leaving  sharp nail heads sticking up which would easily cut a foot. I guess this job would have been ok if it was cheap but it was not.", "pics": null, "resp": {"time": 1619991132379, "text": "We're sorry to hear this. We know that our team went out and tried to fix your older flooring but put in new flooring that you loved. Please give us a call and we can help you out, thanks!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "115909813805842053388", "name": "Beth Eddings", "time": 1579795795104, "rating": 5.0, "text": "I cannot share enough good things about our experiences with Hill's. The quality of their work is wonderful and they stand behind it. We purchased some beautiful tile from them in 2016 transforming our kitchen and bath, and then in 2018 returned to purchase all new bedroom carpet before our daughter was born. Each time we've been presented with affordable options that are still of high quality and any time someone we know is looking for flooring I recommend Hill's in Hueytown. They offer all the same products as flooring places in Birmingham but at a fraction of the price due to being a small family shop.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP6plsnL2MBk9j1lnayZf3BQyb0JYEe1UzZRjdK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN4pd3cExhhMfIVa8hzL9RxV2Q2LGRG8Ua6Q2Zl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPhEyth0WtMPEpt4vOpZe8KLMXCqgK6RhqCE8dl=w150-h150-k-no-p"]}], "resp": {"time": 1579801051252, "text": "Thank you so much for your lovely review, Beth! Come see us anytime and we're so pleased you're happy!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "103611507111797857431", "name": "Debbie Kleist", "time": 1615165893630, "rating": 5.0, "text": "I highly recommend Hill's Carpet and Floor Coverings. The technicians arrived exactly when they told me they would, were experienced and efficient in their work and finished flooring my entire house in 2 days. They were neat and courteous as they worked. My floor looks beautiful and the price was reasonable. If you need flooring work in Hueytown, Hill's is the company to call.", "pics": null, "resp": {"time": 1615317257450, "text": "Thank you so much, Mrs.Kleist! Come back and see us anytime!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "107612078775520848674", "name": "Greg Marlin", "time": 1620927031680, "rating": 5.0, "text": "I've been using Mr. Hill since the early '90's. Prices are always reasonable, products are great, & installs always go well. I would highly recommend!!", "pics": null, "resp": {"time": 1620928435893, "text": "Thanks so much for your review!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "101765987170228550966", "name": "Diane C", "time": 1620857837829, "rating": 1.0, "text": "I had a terrible experience and would not recommend or use them again. A 1 day installation turned into 5 visits to my home, they have not corrected everything they messed up, and they destroyed all the door frames. They tell you they've have been in business for a long time, but the owners are not the same, and neither is the quality of work.", "pics": null, "resp": {"time": 1621549762181, "text": "We have been patient in our reply and have decided it is time to respond since you will not take our repeated calls. We understand your frustration with the initial installation of your flooring which resulted in our decision to terminate the original contractor. Obviously we were frustrated as well and we spoke with you at length over the phone about this. The errors he made have been corrected.  You called again with concern that the carpet was not fastened correctly in one area and, though after inspecting we determined there wasn't a problem, we still agreed to have a contractor come and re-stretch it in an effort to resolve your concern.  We disagree that \"they destroyed all the door frames\".  Yes, there was some slight damage done to some of the door frames but they were far from being \"destroyed\".  Your salesman offered to repaint those areas himself but you declined.  We have gone as far as discounting your invoice three times in an effort to appease you.  We have a two year labor warranty and we stand behind it.  The quality of work performed by subsequent contractors to correct the errors of the first was excellent.  Hill's Carpet & Floor Coverings has been in business at our main location since 1986.  The original owner sold the business to his nephew some 9 years ago and the original owner remains active in the business.  We are proud of our history of serving the greater Birmingham area by offering quality products, competitive prices, and professional installation.  We're proud of and humbled by so many positive reviews on line.  We recognize that the original installation fell short of the last standard and we have tried diligently to work with you to resolve your remaining issue."}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "104152490812992711519", "name": "Kelly Finnegan", "time": 1583971964168, "rating": 5.0, "text": "We chose to go with Hill’s over a box store like Home Depot or Lowes and we are so glad we did. They were so incredibly helpful throughout the whole process. They let us take home several samples until we found the right one. They explained the different types of carpets and the benefits of each one. Mr Hill personally came out and measured and quoted the room. Installers were right on time and worked quickly and did such a wonderful job. We love our carpet and plan to use Hill’s in the future when we redo our kitchen flooring.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMXlxBjultxUS-3o2DixTf50hi9nC2MXS3VKrKk=w150-h150-k-no-p"]}], "resp": {"time": 1583976092635, "text": "Wow! Thank you so much for your honest review! We really do take pride in doing our best to bring beauty to your home without the hassle. Remember us and come back to see us anytime! Thanks again!!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "108978733634757155129", "name": "Maria Holmes", "time": 1602725658143, "rating": 2.0, "text": "FYI LONG REVIEW: I originally contacted Hill's back in Aug to refinish our hardwood floors. Very pleasant experience with Clark with setting up my consultation. Cullen came out and did the consultation with me and my husband. It went well, and the price was very reasonable. He advised me that he would email me the proposal and to call him when we were ready.\n\nI waited for the email but never received it. However, I still called a week later and let him know we were ready to schedule but that I still haven't received the proposal email. I didn't feel comfortable calling to pay my deposit over the phone without a proposal. He wasn't at the office when I called but was going to call once he got settled. When he finally called, I wasn't available but I still didn't get a proposal email.\n\nSo I waited before calling back. Then Clark called and left a msg asking if my consultation went well and if I was ready to schedule. At that time I was not because I wanted the proposal on paper with the amount I was quoted. Never heard back.\n\nSo I called again Monday, 10/12 and spoke with a gentleman about scheduling (yes I was still willing to use this company because the price I was quoted was the best). He got my name and address and tried to look up an invoice or proposal and guess what, there was none!! He asked who did my consultation and I told him Cullen. He said he would get him to call me. Days later, I'm still waiting on my call.\n\nThe other 2 companies I've contacted this week have been very responsive and gotten me proposals within the same day of the consultation. I'd rather pay the extra $ for great customer service and communication.", "pics": null, "resp": {"time": 1602795297698, "text": "Ms. Holmes, your experience with our company is very regrettable.  We strive to establish a meaningful relationship with all our customers resulting in a satisfying experience throughout the purchasing process.  It is unfortunate that in your case we failed to do that and we apologize.  Having been in business in the greater Birmingham area since 1987 we're very humbled and gratified by the excellent rankings we have on social media on Facebook, Google, and the Better Business Bureau.  We appreciate your candidness and again, apologize for not exceeding your expectations.  Your review is a reminder of the importance of delivering a satisfying experience for each and every potential customer every day."}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "114211389125518569156", "name": "S", "time": 1600716591991, "rating": 5.0, "text": "After years of contemplation I finally decided to get my floors redone. I went with the Mohawk LVP and am thoroughly pleased with the installation and customer service received from Hill's Carpet and Flooring (Helena). I am pretty particular about everything, and Cullen (sales) was very patient with my indecisiveness and worked with me on figuring out what would make me happy. The install crew was prompt, super efficient, and extremely professional.  They exceeded my expectations, especially with cleaning up, and returning things to their original place. If you want good old fashioned customer service then you should definitely check them out!", "pics": null, "resp": {"time": 1600720283702, "text": "Thank you so much for your awesome review and for being such an awesome customer! Come and see us anytime!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "100427760477639652845", "name": "Chris Jennings", "time": 1585614258092, "rating": 5.0, "text": "Excellent customer service from the estimate appointment till the completion of the job. Great prices and excellent workers. Very pleased.", "pics": null, "resp": {"time": 1588438845675, "text": "Thank you so much for your review!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "113690369261329542299", "name": "Lanea Head", "time": 1626654048358, "rating": 5.0, "text": "👍", "pics": null, "resp": {"time": 1626713306661, "text": "Thanks for the review!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "108557876078336111425", "name": "Emmanuel Lewis", "time": 1575593753879, "rating": 5.0, "text": "These guys are fantastic. 👌 Just had my floors put in! Nice easy and to the point. No B.S. and the free estimate and consultation was just what I needed with my busy schedule. A++", "pics": null, "resp": {"time": 1575931658033, "text": "Thanks for the review Mr. Lewis!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "107846925040834145442", "name": "Candie L Walton", "time": 1568074191892, "rating": 5.0, "text": "Great Company! Bill has been good to work with concerning my flooring issues.  Guys came out and did a superb job installing my new carpet.  I will definitely go back to Hill's Carpet and Flooring with all my flooring needs", "pics": null, "resp": {"time": 1568076927338, "text": "Thank you so much for your business and for such a great review! It was a pleasure working with you! 😃"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "118130945719269653841", "name": "Prince Homebuilders inc", "time": 1501378069942, "rating": 5.0, "text": "Great work on all of our homes.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO-20WSgKBtmNajMRqLLUj615aM7kKiTiYUvkg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPQfG8HENIGWCjW1EHmmdnCX5jl7OI4N-OqdVg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPsdpnJPubiQ0_mC1r-M6icQsn532HaV8pp12g=w150-h150-k-no-p"]}], "resp": {"time": 1555352678626, "text": "Thank you for the awesome rating! We've recently expanded our showroom in Hueytown, more than doubling the original size. This gives us the opportunity to display a lot more product lines which greatly expands choices."}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "116404737303652503120", "name": "Kathy Andrews", "time": 1559915480332, "rating": 5.0, "text": "Hill's recently installed Milliken carpet on our stairs and master bedroom closets.  They also installed Harris wood flooring in our upstairs bonus room. Their installation crews are professionals, doing a great job. Thank you so much! I definitely recommend them.", "pics": null, "resp": {"time": 1559921114335, "text": "Thank you so much Mrs. Andrews! We always look forward to doing our best and we truly appreciate your business! Thanks again and come see us anytime!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "101218801385641254555", "name": "Katherine A. Higgins", "time": 1557169316686, "rating": 5.0, "text": "Hill's Carpet & Flooring has a beautiful showroom full of a large variety of tile, luxury vinyl, and carpet.  Their staff is helpful and knowledgeable.  I recommend Hill's Carpet & Flooring.", "pics": null, "resp": {"time": 1557173149514, "text": "Thank you so much, Katherine! We hope to see you back again soon!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "111251483691155354022", "name": "jennifer hill", "time": 1567814861546, "rating": 5.0, "text": "Bill makes sure everything is done exactly like the customers want . Would recommend Hill's carpet to anyone.", "pics": null, "resp": {"time": 1567816184784, "text": "Thank you so much for your review! It's so good to hear! And as always we sure do appreciate your business."}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "114075508103934587162", "name": "Dean Ethridge", "time": 1487981992919, "rating": 5.0, "text": "These guys have great flooring products not found in most area flooring stores.  From lower priced to higher end, you'll find something that looks great in your home. Very happy with our new floor!", "pics": null, "resp": {"time": 1555352695711, "text": "Thank you for the awesome rating! We've recently expanded our showroom in Hueytown, more than doubling the original size. This gives us the opportunity to display a lot more product lines which greatly expands choices."}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "115124280332197152666", "name": "Kyle W.", "time": 1499295597274, "rating": 5.0, "text": "Scott & his crew did a fantastic job pulling old carpet and refinishing old hardwoods. He later replaced my  parquet flooring and seamlessly matched the remainder of the house.  Would highly recommend!", "pics": null, "resp": {"time": 1555352684905, "text": "Thank you for the awesome rating! We've recently expanded our showroom in Hueytown, more than doubling the original size. This gives us the opportunity to display a lot more product lines which greatly expands choices."}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "112766756259032719716", "name": "Christie Armstrong", "time": 1567892738623, "rating": 5.0, "text": "great people, great customer service.  I recommend Hill's for your flooring needs.", "pics": null, "resp": {"time": 1567894020140, "text": "Thank you so much Christie! As always we sure do appreciate your business!! Thank you!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "110945175042342373363", "name": "greg pennington", "time": 1599827085826, "rating": 5.0, "text": "Great local flooring company", "pics": null, "resp": {"time": 1599835811960, "text": "Thanks Greg! Come back and see us anytime!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "112067903751004246254", "name": "Scott Suell", "time": 1464458997850, "rating": 5.0, "text": "Dont know what happened on the last post but I could not be more satisfied!  Very professional and clean cut. Give em a try. You won't be sorry.\nThere's a reason they've been around so long. Thanks", "pics": null, "resp": {"time": 1555362376758, "text": "👍"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "117839155201107161329", "name": "Darrell Garrett", "time": 1559930952655, "rating": 5.0, "text": "Very professional and the guys went out there way to help me on issues that I had overlooked in the bid process. The job was complete in the correct time frame and looks amazing.", "pics": null, "resp": {"time": 1559931784325, "text": "Thank you so much, Darrell! It was an absolute pleasure. Come back and see us anytime!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "110184859492440163283", "name": "choppy praytor", "time": 1550859949299, "rating": 4.0, "text": "If u need flooring. They got a great choices", "pics": null, "resp": {"time": 1550936277654, "text": "Thank you for the nice rating. We've recently expanded our showroom in Hueytown, more than doubling the original size. This gives us the opportunity to display a lot more product lines which greatly expands choices."}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "106914497909440150309", "name": "Bill Green", "time": 1600013977158, "rating": 5.0, "text": "Great place!", "pics": null, "resp": {"time": 1600023641907, "text": "Thanks for the review Mr.Green!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "106446869546044400267", "name": "frank sebert", "time": 1458261043103, "rating": 1.0, "text": "Please do yourself and choose wisely before using Hill's, I used the Helena store and can not and would not use or recommend any Hill's seeing how they all the same owner and installers.\nI will tell you about my experience, The carpet is nice and seems to be installed well, this is not where the problem is and if you enjoy paying someone to rub paint off your walls and base boards then tell you\" well that just happens\" then you have found your place. My wife and I spent over an hour sweeping dusting and vacuuming after the installers left angry and in a hurry, when i told them I expected them to vacuum and clean what mess they made during the install, just got in the van and left?!\nI will tell you the salesman did at least get me a whole pint of paint so I could repaint what HILL'S CARPET should have taken care of, there wasn't even an offer to say \"hey how bout we at least knock of $20.00 or $25.00 for your time and trouble.\" Granted by what it would have taken to make this right it isn't a major deal, but do you really want to spend your hard earned money and have to clean up and paint a house you just cleaned and painted? Then be disrespected and talked down to in your own home? Please make a better choice than I did. There are many carpet stores in the area and I know most will appreciate your business,\nI can tell you for a fact unforunately that HILL'S CARPET will not.", "pics": null, "resp": {"time": 1555352888513, "text": "We're sorry for the bad service at the time but you may call us at our office anytime. Also thank you for rating honestly. We've recently expanded our showroom in Helena to display a lot more product lines which greatly expands choices and our crews are amazing! Come back and give us another chance to wow you! Thanks!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "100829791550852605265", "name": "rlmccullough", "time": 1596745526643, "rating": 5.0, "text": "They have flooring.", "pics": null, "resp": {"time": 1596749364329, "text": "Thanks for the five star review!!!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "104294954143446612344", "name": "Pedr0 Ram0s", "time": 1612884927960, "rating": 4.0, "text": "(Translated by Google) Okay everyone\n\n(Original)\nMuy bien todos", "pics": null, "resp": {"time": 1613407427890, "text": "thank you!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "103383872035927152558", "name": "Jeanie Shea", "time": 1610854312615, "rating": 5.0, "text": "I ordered two custom floating shelves for my newly updated kitchen and was very pleased with how they turned out. I was able to select the type of wood, the stain color and a grey wash along with a texture that finished off my shelves. The owner and his side-kick were knowledgeable, helpful and had my shelves ready on time. Be sure to check this place out if looking for a fireplace mantel, beans for your ceiling and lots of other types of wood uses.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNK-Btff9n0mlQpKZDh-ESfVCg2ZVDQiki9WBKf=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipODQkPYREq0lPb9DwijKvBDFHRiJ4M2KRhGaJLb=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891b6f22dd7e97:0xe360e2a6f9c59956"}
{"user_id": "106807104015991348181", "name": "Tray Wilson", "time": 1554913571621, "rating": 5.0, "text": "Very professional and very nice wood", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPAbsFWG_j2QFB4O9nTSeOV5FoyNtxFqBoSiaZn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPjT5XjsdmF0AIiradtzA1EfGnKqYkEkRir2Bsz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNiNP29ekhi7jHSRy1vysBIg8bB82wDIhPnM33H=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891b6f22dd7e97:0xe360e2a6f9c59956"}
{"user_id": "109375640038011194551", "name": "Jessica Wilson", "time": 1599773548611, "rating": 5.0, "text": "I am an employee at River Bottom Pine and take it from me, there is no better place to the best quality hard wood floors and meet the best people. Everyone there not only cares about your business but they care about you as well.", "pics": null, "resp": null, "gmap_id": "0x88891b6f22dd7e97:0xe360e2a6f9c59956"}
{"user_id": "103499781752203757822", "name": "Philip Flores", "time": 1550079684033, "rating": 5.0, "text": "The best wood flooring and custom beam mill in the south east! Very friendly beautiful craftsman’s live edge tables. Very nice selection of custom barn doors. Highly recommend! Philip Flores", "pics": null, "resp": null, "gmap_id": "0x88891b6f22dd7e97:0xe360e2a6f9c59956"}
{"user_id": "112091812725462710155", "name": "Wesley Meier", "time": 1493394116717, "rating": 5.0, "text": "Amazing company! Great products!", "pics": null, "resp": null, "gmap_id": "0x88891b6f22dd7e97:0xe360e2a6f9c59956"}
{"user_id": "108452318216825960510", "name": "Chris F", "time": 1613760104075, "rating": 5.0, "text": "Friendly people in good service.And they  always have what I need", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "111629201481998458747", "name": "BJ Lawrence", "time": 1598628466675, "rating": 4.0, "text": "Very friendly, helpful, needed a board cut in two to haul and they cut with no charge.  Price was reasonable.", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "110637748586957343285", "name": "Deborah Perry", "time": 1598722770036, "rating": 5.0, "text": "Great service . Prices very reasonable . Courtious staff.", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "104508036459440389575", "name": "Patrick Erb", "time": 1577991419001, "rating": 5.0, "text": "They have really stepped up their game. Increased inventory a new-look on the interior with expanded products", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "111189521876633652396", "name": "Sandi Stephenson", "time": 1552754928754, "rating": 3.0, "text": "The young boy help in us was really clueless about everything we asked and the guy at the register was rude like he didnt want to be there. Other than that it was ok.", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "112552503212451880129", "name": "Danny Roberts", "time": 1540833581289, "rating": 5.0, "text": "If you need building materials and appliances at low prices check here first you will be back if you go anywhere else", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "102199070504581052250", "name": "Rodney Walker", "time": 1543781892163, "rating": 5.0, "text": "They have anything and everything you could want for home repair", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "106311822894182759034", "name": "Rodney Hopkins", "time": 1544925279169, "rating": 4.0, "text": "Good prices.", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "103939690930579465759", "name": "Joy Pintovidal", "time": 1624385651340, "rating": 5.0, "text": "We moved here from Colorado and bought an older house. We needed the floors to be completely redone before our furniture arrived within a week. We worked with David Cox and he got our flooring scheduled and completed within the week. The guys worked long hours and did an excellent job. The flooring looks beautiful and the staff was over the top friendly. I would highly recommend them for any flooring job that you need. You will get a high quality job and excellent customer service.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "104140845922021883219", "name": "Dj Burls", "time": 1620216977938, "rating": 5.0, "text": "I highly recommend Prattville Carpet. They carry quality material which they stand behind and their staff is both friendly and knowledgeable. I purchased their 22mil vinyl flooring which is a commercial grade that you can't view on the floor at the chain stores.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "107904501006619233408", "name": "Janet Kissane", "time": 1626292122729, "rating": 5.0, "text": "A big THANK YOU to David Cox and his crew of Prattville Carpet!  Great service, great work and I love my new carpet!", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "103748348622716496122", "name": "Tami Gorman", "time": 1619440759808, "rating": 5.0, "text": "Very friendly  great customer service, however my floors have not been installed so I will let you know after that.. I heard they do a wonderful job but I also was told  that they broke a friend of mine's lamp and she had to pay a lot of money to replace it , also they knocked stuff off wall let her to wire back up her tv they should have paid for the lamp !!! but that was her experience not mine...", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "117380284859075873616", "name": "Leah Taylor", "time": 1607484667202, "rating": 5.0, "text": "We had a great experience with Prattville Carpet. David was super friendly and not only helped us pick out exactly what we wanted but was able to help us coordinate a time to get our new flooring in. The staff & David communicated with us throughout the whole process. We absolutely love our new flooring. Thanks David & Prattville Carpet!", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "107553029175112296385", "name": "Jan Sticka", "time": 1585528622004, "rating": 5.0, "text": "The beautiful Mohawk laminate flooring installed by Prattville Carpet. Great customer service from start to finish. Highly recommend them for your flooring needs.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNeqxOXatHIDuJOtPLaoi8iymg8LVTIZHCOA43y=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "117120611443798787042", "name": "Victoria Lowman", "time": 1612460895014, "rating": 5.0, "text": "Great price and very happy with completed floor!!", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "110003917008369891311", "name": "Tina Taylor", "time": 1586140259620, "rating": 5.0, "text": "Terry and team went above and beyond to help me. Terry was able to work around my crazy schedule and  get the job completed, quick, and to perfection. I highly recommend Prattville Carpet. We will definitely be using them again on other projects.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "105675921166083124568", "name": "Cathee Gipson", "time": 1495465121889, "rating": 5.0, "text": "A master bathroom renovation seemed more than daunting until we reached out to Ray Boles at Prattville Carpet.  His design expertise proved invaluable.  His installers were prompt, courteous, and professional.  His contacts and recommendations for the entire project were beyond helpful.  The process was stress free and fast thanks to Ray and Prattville Carpet.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "116446196322829226465", "name": "Tracey Cannon", "time": 1558805712910, "rating": 5.0, "text": "Ronnie and David have been fantastic in helping me pick out my floors and shower tile.  I highly recommend Prattville Carpet", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "110172031862463209819", "name": "Chris Jarrett", "time": 1551707636750, "rating": 5.0, "text": "Barry and his team of installers where amazing. From start to finish great job. Barry came to my house after I got off work (well after 6) to show me the samples. Lots of option with zero pressure. They installed quickly and with very little interruption in our lives. On the day of the install I got home from work and thought they hadn't come that's how well they cleaned up. It wasn't even apparent they had been there until I walked in and saw my amazing floors. Zero interest payments for 12 months was a nice bonus.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "100511141865234058846", "name": "J.K. Jones", "time": 1494463223851, "rating": 5.0, "text": "Prattville Carpet put new tile in our house and did a fantastic job!  From helping us select our tile to the installation,  everyone was great.  They even moved all the furniture!", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "113443639146901200226", "name": "Kelli Hill", "time": 1524758555602, "rating": 5.0, "text": "Prattville Carpet went above and beyond to help me after my house flooded.  New flooring in the living room and bedroom areas and it is gorgeous.  I couldn't be more pleased with the flooring and customer service.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "109183369016725841693", "name": "Marty Sutley", "time": 1412274812838, "rating": 5.0, "text": "I have had multiple experiences with Prattville Carpet and the Boles family.  They have always been honest and reasonable to deal with.  In an industry such as Floor Covering, it is refreshing to find a business owned and operated by people you can trust to do what they say they will do.  It makes all the difference.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "114041522895259255541", "name": "Angela Addison", "time": 1554224982456, "rating": 5.0, "text": "Super friendly staff. Prices are reasonable, actually better than competition up the road.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "117579639395437397980", "name": "Robin Kitchens", "time": 1553362904656, "rating": 5.0, "text": "David was very nice about helping me pick out carpet for my house", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "105415956406803641400", "name": "Gaye Pelkey", "time": 1548365562228, "rating": 5.0, "text": "They put in all new carpet and flooring in rental home..great job and great service..", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "110303723420445418753", "name": "adam pike", "time": 1545344913268, "rating": 5.0, "text": "Quality service, friendly sales staff!", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "102624918932850199272", "name": "Eddie Parker", "time": 1595704342404, "rating": 5.0, "text": "We could not be happier with the work we had done by Juan and his crew. They showed up every day right on time and stayed as long as it took to complete the job. They take great pride in their work and will not quit until everything is done just right. We would defiantly use them again.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMKeHcOfQCiLDIWY9V0dbNvEmqVTz-E86G41mTm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNoQecv9mC53cmuGdyPzwdvsHgpBcFH237W_cjL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP5_1pPClfVStgOTwc3LLfq5pVs8jIWZtnxluLw=w150-h150-k-no-p"]}], "resp": {"time": 1595708430939, "text": "Colossians 3:23 And whatsoever ye do, do it heartily, as to the Lord and not unto men.  Blessings my friends."}, "gmap_id": "0x886285dbb3a5be67:0x44e879f67ea7e7a9"}
{"user_id": "102464635448872075621", "name": "Erik Marsh", "time": 1604554495480, "rating": 5.0, "text": "I wanted to let you know how pleased I am with the job well done at home. My bathroom looks astonishing. I really love what you did with the floor. I will certainly call you again to help me with my next project. Keep up the great work! Highly recommended!", "pics": null, "resp": {"time": 1610464018837, "text": "Thank you Erik. God Bless youns."}, "gmap_id": "0x886285dbb3a5be67:0x44e879f67ea7e7a9"}
{"user_id": "113979681974989321008", "name": "Pete Sutton", "time": 1602746989571, "rating": 5.0, "text": "I turned to these people for the installation of the new tiles for my bathroom. They did an amazing job, and I am glad to have hired them. I would also like to recommend them to anyone who needs to turn to capable and reliable professionals. Thank you for everything, and keep it up!", "pics": null, "resp": {"time": 1610464061698, "text": "Thank you Pete. God Bless youns."}, "gmap_id": "0x886285dbb3a5be67:0x44e879f67ea7e7a9"}
{"user_id": "101478029253820751244", "name": "Jason Marshall", "time": 1610457788452, "rating": 5.0, "text": "Juan and his crew installed flooring for us and did a great job!  Communication and services were excellent! I would definitely use them again.", "pics": null, "resp": {"time": 1610462734905, "text": "Thank you for the opportunity to install your flooring, Jason. God Bless you and your family."}, "gmap_id": "0x886285dbb3a5be67:0x44e879f67ea7e7a9"}
{"user_id": "102696058417843002335", "name": "Leo Adams", "time": 1605150770500, "rating": 5.0, "text": "I hired these people for the installation of my new ceramic tiles, and I must say that they did a great job. I would gladly recommend them to anyone who wants to hire capable and experienced professionals. Thank you for everything, and keep it up!", "pics": null, "resp": {"time": 1610463977139, "text": "Thank you for your review. God Bless youns."}, "gmap_id": "0x886285dbb3a5be67:0x44e879f67ea7e7a9"}
{"user_id": "100774211761025752347", "name": "Nicky Heinzen", "time": 1606333725775, "rating": 5.0, "text": "Juan and his folks have done a wonderful job for me and I will continue to use them for my home and office. He saved my garage and even noticed mistakes that another contractor made that would have made the floor fall on my car. I can't thank him and his workers enough for the hard work and professionalism.", "pics": null, "resp": {"time": 1606664739217, "text": "Thank you Nicky. Blessings."}, "gmap_id": "0x886285dbb3a5be67:0x44e879f67ea7e7a9"}
{"user_id": "105079465697002045266", "name": "Howard Miller", "time": 1582791528583, "rating": 5.0, "text": "They are a reliable tile contractor that did good work in our home. We highly recommend them.", "pics": null, "resp": {"time": 1595708547531, "text": "Thank you my friend. God Bless you."}, "gmap_id": "0x886285dbb3a5be67:0x44e879f67ea7e7a9"}
{"user_id": "118060551945759320393", "name": "Jonathan Camino", "time": 1583393365308, "rating": 5.0, "text": "Very professional ceramic tile replacement service. Their work is great. Will call you again soon.", "pics": null, "resp": {"time": 1595708471688, "text": "Thanks and God Bless you my friend."}, "gmap_id": "0x886285dbb3a5be67:0x44e879f67ea7e7a9"}
{"user_id": "105523427918582111108", "name": "Harold Burkett", "time": 1526963638146, "rating": 5.0, "text": "Super nice guys and they do great work. Installed tile in my kitchen and dining room. They were very informative and helpful. Great job guys and thanks.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM6u_YIr335-n9NuyAaERTn-DdgXlgDRWhq6y6R=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMucXAWw9P911l7rl34cQGjYdQwoMdTtwNqrac3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPTRm4Kp3mHugRRTXKZd93skllBurmW2ZJh9ReW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMEbqEU-y2deOERsw8vXz5taYwr-Jmo8cjpUpZQ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886256219fb7526d:0xe42818a18cee2789"}
{"user_id": "106015993468339647334", "name": "Alabama Lucey", "time": 1625605787997, "rating": 4.0, "text": "We have done business here before and once again the employees were OUTSTANDING!  They even took us in the back to show us their kitchen flooring so we could have a better feel for what it would look like   Another place you have got to at least check out if you're in the market for flooring.  But they have other items also like tile for backsplashes.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOa7J9q9oz_cwGElMUoYY5WxI9giAtdNTRxc2Iz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMpSqPk_GjNgJQm85iQTEty-JLP3O0GYNujC6Gt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPCOmTUjh--5JyhRJ_HbT1LB1svllE8vDMBkFmS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPx5M67YE5CKkUOIhgZKtHxJ4tj8ijCsGC4C2nV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMl_Aa1YoxxouFmdH61XXvRfqw_AAx-YUp5TW1x=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNLC59Evt1ECCI1aRnZyBlQ6b6hQmtL7GMGO3zt=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "102365181481903847186", "name": "Jordan Smith", "time": 1624489603446, "rating": 5.0, "text": "Blake was amazing! I wasn’t having much luck getting ANY responses (email, phone, etc) from other local flooring stores but Blake kept in touch and worked with us on getting us the BEST price and made the process SO easy!!!!! Will recommend to everyone I know, & be using them for all future needs!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "108623454228907601944", "name": "Tracy Sedlack", "time": 1596936751352, "rating": 5.0, "text": "Needed a quick install to sell a house. Customer service was outstanding. Jim worked with me and helped find me a great deal on new flooring. Installed two days later and looks great. Can't thank Jim and the installers enough for the great service and help picking a great looking carpet for the whole house.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMpKyVmjjTRGL2BhgHTVdPCxGj_2qApomVQ0grX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNPOgkyelpS4ASD8Cb2SJN0EFShjkMJU9x0sD3k=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN2cfp-PhD6aMVQj5vj6xMjqmXcdElZAi8xv1oU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "109587481776307648339", "name": "Ashley Carson", "time": 1617127251867, "rating": 5.0, "text": "Most definitely a one stop shop!!! I am so very happy we chose American Flooring, Cabinet, and Granite to take care of all our needs in building our new home. My husband an I finally built our dream house this year;  we were treated like family from all the staff and installers from start to finish.  We did LVP flooring throughout it is absolutely gorgeous. They helped us pick out the perfect tile and accent pieces for our walk-in shower. The solid wood cabinets were just fantastic they went perfect with the quartzite we chose for the kitchen an master bath, it makes my heart beat fast, it's so beautiful. They have a large selection from all over he world, slabs I have never seen before anywhere.                                        I want to thank everyone there for making our experience a little less painful, anytime you build a house things come up and we were very pleased how they worked with us on our scheduling.  I highly recommend American Flooring, Cabinet, and Granite to all my family and friends. We are so very happy!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "101412820628372191874", "name": "Melanie Lobel", "time": 1616004968202, "rating": 5.0, "text": "First visit to American Carpet and had the best experience picking out carpet. Johnny Marino was such a professional and assisted me with making great selections at a terrific price. They were able to meet my installation requirements immediately. The quality and service was so remarkable that I went back 2 days later and purchased gorgeous marble for my fireplace surround. What a pleasure doing business with American Carpet and Flooring. Definitely ask for Johnny. Great guy.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "106852215908119072573", "name": "Tazman Reid.", "time": 1625695887269, "rating": 5.0, "text": "The sales lady was fantastic, she pretty much took care of everything over the phone, I went to the store and was out of there in 10 min.\nA 10 for Marisa !", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "114570039299034401076", "name": "Gerald Drakeford", "time": 1614206391101, "rating": 5.0, "text": "Mr. Don Williams always has a warm smile and greeting each time we visit the store. Johnny facilitated our flooring and granite orders and was great to work with as well!\n\nWe had hardwood floors as well as granite countertops installed.  Glynn and his crew did a great job on the flooring. They were on time each day and were very attentive to details during the installation.\n\nLikewise, the guys that installed our granite countertops were top shelf as well, detail oriented, and very professional.\n\nWould definitely recommend American Carpets and Flooring!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "106947545531976446298", "name": "Kishina Brown", "time": 1609199926737, "rating": 1.0, "text": "I was looking for purchasing new flooring for the rest of my house. I walked in with a large piece of carpet in hand to see what would look good with my new carpet. As I entered I was not greeted. I noticed three men in a corner talking and I walked close by and again never greeted. So I will not ever step foot in this store again.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "101554162029775948900", "name": "James Sessions", "time": 1598480748262, "rating": 5.0, "text": "My wife and I decided to totally remodel our master bathroom which was a big deal for us.  After making visits to several stores and getting conflicting advice on what we could and should not do. We were so confused but knew how we wanted the new bathroom to look.   I suggested that we stop by American Flooring which we decided to be the last stop before leaving Mobile and head to Baldwin County or even Pensacola. American Flooring should have been our first stop.  We met Johnny Marino and shared with him what we wanted to see in our new and updated bathroom project.  He took our the contractor's proposal along with many pictures that my wife had gotten off the internet, how we wanted our new bathroom to look.  He provided us with expert advice.  He took the time to tell us what we needed.  He was more than a salesman... I considered him an expert in flooring.  We are so excited, we cannot wait until the job is completed.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "105366377189058722485", "name": "Burchfield lc", "time": 1599342220206, "rating": 5.0, "text": "Great service from picking out flooring to the install! Highly recommend! They are a locally owned company with fantastic prices, I will be back next time!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "111979773792994848010", "name": "Sandra Mikul", "time": 1594921337563, "rating": 5.0, "text": "Beautiful installation! Michael and Cliff were pleasant, efficient and we love the final product.  Glad we decided on new counters! Also, Robert gave us good advice on choosing colors while we were looking at the large inventory.  Thanks", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "103804285607193038083", "name": "Daniel Garrido", "time": 1578984122599, "rating": 5.0, "text": "Amazing store to buy from, great people and service. Definitely recommend!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN7-Ai_AbaCI-9EEmMmP-6-3R9zPf56mPGfyB2a=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "111964048522762970615", "name": "Ashley La Bounty", "time": 1597380561659, "rating": 5.0, "text": "Our experiences has been amazing!!! The quality flooring and staff is amazing. Had the pleasure of working with the owner himself and he make us feel right at home every time.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "107245293847523842491", "name": "Quintin Wilder", "time": 1606336925435, "rating": 5.0, "text": "I only deliver packages to them but every time I go they always helping someone with a great attitude.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "110002926730751455212", "name": "Stanley Self", "time": 1597330236110, "rating": 5.0, "text": "Great. Carpet and pad.  Wonderful flooring.   Installers were very friendly and respectful.  Salesman was very friendly and helpful.  Very satisfied.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117031730763445449523", "name": "Theresa Seibert", "time": 1590596225290, "rating": 5.0, "text": "American Flooring and Granite has impeccable customer service very knowledgeable on all the products.  I love the fact that they use a 15 year sealer on all the natural stones. They have a large selection to choose from. My counter tops are beautiful!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "118277219069483773175", "name": "Richard Moore", "time": 1575942723017, "rating": 1.0, "text": "NEVER AGAIN!\nThis level of incompetence is unfathomable. My installer calls me up to verify directions, ten minutes later one of the employees calls me to tell me \"We can't sell you this flooring\" ( That the salesman practically begged us to pay for weeks earlier) Half my house is on my porch and in my yard at this point. They had their third \"problem\" reported two days earlier but didn't bother to call the people who had bought any of it. The sales man was an absolute joke. I don't know whos brother-in-law he is but that is the ONLY way he could keep his job!\nThe Installers....were AWESOME! (Sub contracted).\nThis is only part of the issues I had....all I can say is,\nAmerican Flooring will NEVER get another dime from me.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "101370247566958826845", "name": "Jesse Brewer", "time": 1502760071136, "rating": 5.0, "text": "We did a major  2 1/2 bathroom remodel at our home and American Flooring Cabinets & Granite did a great job! It was a pleasure working with  Jennifer who helped us pick out our porcelain tile and exotic granite.  It did not stop there she took the time to pick out the paint color that would compliment the exotic granite and porcelain tile.  The  selection of porcelain tile and granite options we viewed that day at American Flooring Cabinets & Granite was  top quality.  The workers did a top notch job.  At the completion of the job, Jennifer came out and looked over everything and made sure we were satisfied with everything.  All of our questions were answered.  Our future flooring projects will definitely be handled through American Flooring.", "pics": null, "resp": {"time": 1502807432418, "text": "Thank you, Jesse! Glad we could serve you!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "115407434266322970944", "name": "Donna Dicken", "time": 1573583095201, "rating": 5.0, "text": "My husband and I are very please with the whole experience from buying our flooring to the two gentleman who put it in. They did a fantastic job. We LOVE our new floor. We recommend American Flooring, Cabinets & Granite and will use again in the future.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "100871770003133492545", "name": "Steven Duquette", "time": 1506094777655, "rating": 5.0, "text": "I had a great experience at AFC&G from the minute I walked through the door until the minute the job was completed.  Don and Jennifer were so helpful throughout the entire process and what a selection of materials they have in the storeroom to choose from.  My granite counter tops and custom designed shower turned out like a showroom display.  Many thanks to Roland who did the design and installation.  Every measurement and cut he made was with laser precision.  I highly recommend you visit the showroom to see what they carry and talk with their very knowledgeable sales reps.", "pics": null, "resp": {"time": 1506095564974, "text": "Thank you Mr. Duquette! We loved the finished product and are glad to have you as a loyal customer! If you need anything at all, you know who to call."}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117510542557733207554", "name": "jay trammell", "time": 1559960940685, "rating": 1.0, "text": "Stay away from this place. Salesman that helped me was great. Owner is crazy to work with I was giving quote and come in to store and he changed it. Very low to do. Obviously does not care about business . This 5k plus Job was going to be a 12k plus job when done so business is not his priority. Other stores did honor their quotes.  Check your options as they lost me and a lot more business because of this guy. Pathetic customer relations .", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "116634315422112267553", "name": "Forest Dixon`", "time": 1519424301693, "rating": 5.0, "text": "American Flooring, Cabinets & Granite is the best place to go if you're interested in perusing some remodeling a home. We just had some new carpet installed in our house and couldn't be more pleased with the outcome! Mr. Don Williams is personable, yet professional. He gave us a fair up-front price as soon as we gave him our measurements. Ms. Jessica also helped us and she was a pleasure to work with as well. Even the installers were professional, quick and did a wonderful job. We are planning on remodeling our bathrooms with new cabinets, granite counter-tops and porcelain tile, so we know exactly where to go for our next project!", "pics": null, "resp": {"time": 1520862170784, "text": "Thank you, Forest! We appreciate your business!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "111231804867099643802", "name": "Maggie Ainsworth", "time": 1562606126956, "rating": 5.0, "text": "American Carpet did an AMAZING job on my new vinyl flooring!!! Workers were professional, punctual, and friendly. I would highly recommend them to anyone interested in new floors. Will definitely use them again!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "106482303702287774593", "name": "Mike Doggett", "time": 1502749320110, "rating": 5.0, "text": "Great Selection!! This store has a TON of products. Jennifer was our salesperson and guided us every step of the way. We looked at engineered wood and solid wood flooring, but ended up getting a beautiful tile that looks exactly like a wood floor. Guests are shocked when they find out it's tile. We also got a backsplash and granite for our bar and it looks amazing. We will be going back when we get ready for cabinets.  I would recommend this company to anyone looking upgrade their home. They had a amazing selection of vinyl plank and vinyl tile that would be perfect for a bigger family on a budget.", "pics": null, "resp": {"time": 1505741762879, "text": "Thank you, Mike! Great doing business with you!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "106054624322724094989", "name": "HM M", "time": 1576021878267, "rating": 1.0, "text": "I walked in and was not greeted. I walked up to two people at desks and they didn't seem interested and couldn't seem to help even though I had a tile in my hand. They called another guy. I asked him about finding a similar size to my vintage tile because Lowe's only had 4x4. He said it would have to be measured and hesitated. He said he would see if he could find a tape measure. He came back and measured and said 4.25x4.25 and that was custom. He said I would have to buy a box but wasn't positive he knew how many tiles that was. He did a bunch of stuff on a calculator until he quoted me 100 tiles for $62. I needed 14 so I told him I would check back after searching. He told me he had the same problem when he did his bathroom. He said okay and maybe I would find an open box somewhere. I walked into Home Depot and 4.25x4.25 is a standard size. I bought 14 tiles for $2.46. I'm not sure what to say about that. I will let you come up with your own conclusions.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "108630299565623962172", "name": "Lynn Sigouin", "time": 1520610762148, "rating": 5.0, "text": "Thank you once again for another beautiful and professional installation. Our stairs look like the center piece of our new home thanks to our wonderful Irene who gave us great customer service and always followed up with calls, Jonathon and Stephen who installed with perfection for detail and so,so polite and so talented.\nAnd for the kind, sweet voice on the other end greeting me this morning,  Jessica who assisted all my needs.\nGreat team you have, Don...Jay, I am sorry to have missed you my friend but we couldn't be more pleased .\nBlessings to all,\nThank you again,\nRay and Lynn Sigouin (Principe)", "pics": null, "resp": {"time": 1520862146281, "text": "Thank you so much, Lynn!! We are so thankful for your business. Please let us know if you need anything else in the future!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "108057886593171219422", "name": "Belinda Hall", "time": 1599083189436, "rating": 1.0, "text": "I came to this store for cabinets.  It is going on 2 months. The are not hung. The parts of the cabinets they just ordered without ever coming to my home for any type of measurements are under my carport blocking so I can't park my car. I have called repeatedly,  people have been rude, hung up on, talked down, and still no progress!!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117787036663477905789", "name": "Nina Propst", "time": 1562852054807, "rating": 5.0, "text": "We are very satisfied with our new carpet and with the service we received.  We recommend checking them out for all of your flooring and countertops first...it will save you lots of time and stress!  Special thanks to Don Williams.  We will be back.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "113328340343186174231", "name": "Mendy Nilsson", "time": 1475770457823, "rating": 5.0, "text": "Shannon Williams is fantastic. He listened to my needs and showed me lots of options giving the pros and cons of each type of floor. That allowed me to choose the best floor for my needs and WOW I'm so thrilled with my luxury vinyl plank flooring. So beautiful and so easy to clean it makes cleaning house fun. Thank you Shannon and American!!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "113970014622307309182", "name": "LeBarbara Stinson", "time": 1506745563941, "rating": 5.0, "text": "I had the opportunity to have my Luxury Vinyl Plank floors installed by Mr. Glenn Smith. He had his team members with him. They were the kindest men. They worked hard and didn't half step on anything! They are funny and welcoming. I would recommend them anytime. I thoroughly enjoyed them. They were professional and operated on total and complete excellence!", "pics": null, "resp": {"time": 1506950838480, "text": "Thank you, LeBarbara!! We will let Glenn know he did a great job. We appreciate your business!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "111416900792223991488", "name": "Susan Allen", "time": 1590878893482, "rating": 5.0, "text": "Very informative, professional, and helpful!\n\nThanks Don Williams.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "101100780463141592614", "name": "Lisa McGhee", "time": 1513869536331, "rating": 5.0, "text": "I want to say that I won a contest with American Carpets. My prize was 250$ off any area rug in the show room. I went in yesterday to pick out my rug, and was greeted by the owner Mr. Don.. I never expected to have the experience I had with the owner and or any of the showroom employee's they were all so nice and helpful. The owner was there to help me the whole time and made it very memorable he is a very great guy.. I would never hesitate about sending someone in to get any flooring these people treated me with the up most respect and dignity as if I was a paying customer and I'll never forget that... Thanks again to all the people at American Carpets.. y'all are the best... Thanks again Mr. Don glad to have met you...", "pics": null, "resp": {"time": 1513948177848, "text": "Thank you, Lisa! It was our pleasure!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "114561379651249873993", "name": "Mr. Curtis", "time": 1506004714295, "rating": 5.0, "text": "In the past I've remodeled homes for a living, but was never in the position to actually come out of pocket and select carpets, etc.\nIt turns out making the right choice is lots harder than you think! With the fierce competition now days, it's easy to be told what you want to hear, given prices that you can't judge properly, and ultimately, run around in circles ending with products that are NOT to your satisfaction.\nThese issues do not arise with American Flooring (the Mobile location is the one I've become acquainted with). The woman who answered my calls, Jessica, was absolutely wonderful to speak with, and the sales person she brought me to the table with, Shane, was both professional, and compassionate.\nSuffice it to say I will be returning very soon!", "pics": null, "resp": {"time": 1506005641756, "text": "Thanks you, Mr. Curtis!! We look forward to hearing from you soon, and in the meantime if you have any questions at all, you know who to call!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "103818978067295149003", "name": "t h", "time": 1505054545999, "rating": 5.0, "text": "I have recently completed a kitchen renovation and love the outcome. Don helped me select the perfect quartzite countertop for the new island, we purchased luxury vinyl plank for the new floors plus found a beautiful new rug too. Thank you so much for all of your assistance! I am pleased and feel I got a great deal and great service at American Flooring. I would highly recommend them to all of my family and friends.", "pics": null, "resp": {"time": 1505741724783, "text": "Thank you!! We loved the way your kitchen turned out. Looking forward to doing business with you again in the future!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "109170999786149336161", "name": "candes ritter", "time": 1528755297028, "rating": 5.0, "text": "I’ve had several rooms carpeted and have always received excellent service, prices and installments.  Absolutely...... this is your first stop if you need flooring!", "pics": null, "resp": {"time": 1529938086003, "text": "Thank you, Candes! We really appreciate your business!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "110647611947034005455", "name": "Gary Stiegler", "time": 1540443305316, "rating": 1.0, "text": "My wife came in with a sample and the info for the flooring which had been purchased at AC.  Johnny,  the salesman immediately let her know without looking around that they didn't carry the item.  She proceeded to look around the store on her own, no one asking if she needed help, but after 20 minutes, found the exact piece of flooring!  Found Johnny, and he gave her a price of almost $200 for a 12 piece box of vinyl flooring.  Thanks, but NO THANKS American Carpets!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "105141951524097154911", "name": "Sally Faucheaux", "time": 1471873045321, "rating": 5.0, "text": "Thank you Jennifer ..... She  was my floor and cabinet specialist..... And thank you for all your expertise,   Also want to thank every one else at  American flooring this is not  the. first time that they have done work for me.  I was very pleased in the past,   It has been some years ago I am changing now because I don't want carpet anymore I want to change to ceramic....great job then, and I am sure they will do a awesome job this time as well, after all   I came back for more ;)", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "113660126408283553855", "name": "Rachel Jenkins", "time": 1509468604976, "rating": 5.0, "text": "Jennifer Vaughan is amazing to work with.   She saw my vision and brought it to life.  She also prepared me for the installation experience by explaining it honestly and in depth.   I will never use anyone else in the future except her.   American Flooring needs to hold on to her.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "106479852329186106783", "name": "Sharon Thompson", "time": 1507040325676, "rating": 5.0, "text": "I am a mortgage lender in the Mobile and Baldwin county areas and have referred more clients than I can count to the Mobile and Gulf Shores locations over the years. Whatever your home needs may be, American Flooring is well rounded with an amazing selection of products, and a wonderful team of sales reps and installers. Be sure you follow them on Facebook, they do lots of giveaways and sales you don't want to miss! If you want to call before you go in and actually schedule ahead, ask for Jessica and she'll make sure someone is there to greet you and meet whatever needs you have!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117040202545697376479", "name": "Jessica Bates", "time": 1513098225059, "rating": 1.0, "text": "I'm only giving one star because the material itself was great. The guy that did our template for our countertops measured wrong and only half of my notch was able to be done. The installers flooded my bathroom because the water wasn't off when they took the pipes apart. They knocked several holes in my walls and left without mentioning any of them. After a SIX HOUR install, I still had no water to my sinks and only half of the kitchen done. My stuff wet and laying everywhere and holes in walls in every room they worked in.", "pics": null, "resp": {"time": 1513099726486, "text": "Thank you for taking the time to let us know about the situation. We are reaching out to the installation crew and will make this right for you, whatever it may take. We apologize for any inconvenience this may have caused.\n\nUpdate: Thank you for allowing us to fix all of the issues. We appreciate your business!!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "116401465991465306335", "name": "Leslile Reddick", "time": 1423752030323, "rating": 1.0, "text": "I used American Carpets to install my granite, carpet and laminate flooring in my kitchen.  This was done in August 2013.  My carpet separated between rooms and along the kitchen and living room and nails are sticking up.  My under counter sink is loose.  I have been trying to have this fixed for months now with no resolution at all.  Chris in installation has been out to my house twice to \"look\" at it with promises of it being fixed.  Nothing has been done.  I feel that the work that was done was unprofessional and cheap.  I spent a lot of money on this and would expect it to last longer than a year and if not, at least for it to be fixed in a timely manner.  I will never refer anybody to American Carpets as my experience has been very dissatisfying.  I have never written a review before, much less a negative one, but I felt I had to because I have been getting the run around for months.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "112051624005515480683", "name": "Steve Baker", "time": 1493588377767, "rating": 5.0, "text": "Very friendly folks. Not only did I get a great job on my ceramic flooring​, I think that this business has a lot of Christian people and that is why it is doing so good. Chris and his son that laid my flooring did a great job. Shane the salesman also knows his job. A plus to this business.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "108856669990873646097", "name": "Lacy Hilliard", "time": 1501614043493, "rating": 5.0, "text": "Craig Crawford and his crew did excellent on the installation of vinyl flooring. They were personable, well mannered and addressed my concerns immediately . This is the crew you need for your installation! Showroom time was quick and precise with my needs.", "pics": null, "resp": {"time": 1502807682245, "text": "Thank you, Lacy! We've let Craig know how great of a job he did. We look forward to doing business with you in the future!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "107646176517346174831", "name": "Kem Hall", "time": 1495299730107, "rating": 5.0, "text": "I googled wood floorings and came up with this store. For years I thought they only sold carpet.  I found a vast amount of everything needed for a home; granite, cabinets, wood flooring, tile, rugs, vinyl plank, you name it and its here.  This is a ONE STOP SHOP. Employees are welcoming, helpful and knowledgeable to help with everything. They have good deals too.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "101853443802132720285", "name": "Kyla Gaston", "time": 1518029527616, "rating": 5.0, "text": "I GOT THE OPPORTUNITY TO WORK WITH JENNIFER V. AND JAN R.  - OH MY GOODNESS THEY ARE A TERRIFIC TEAM. I HAD AN ISSUE WITH MY FLOOR WHEN MY HOME WAS BUILT DUE TO THE WRONG DOOR BEING PLACED IN THE HOME, MY WOOD FLOORING HAD TO COME UP DUE TO WATER DAMAGE AND I HAD TO REPLACE IT WITH ANOTHER PRODUCT. JENNIFER AND JAN SAW HOW UPSET I WAS AND WAS ABLE TO MAKE FEEL BETTER AND REASSURED ME THE SECTION OF MY FLOOR WOULD LOOK FABULOUS. I AM SO HAPPY WITH THE TILE AND MOSIAC ACCENT TILE FOR THE FLOOR AREA, IT LOOKS LIKE THE HOME WAS ORGINALLY BUILT THAT WAY. I CAN NOT SAY ENOUGH FOR JENNIFER AND JAN TWO WONDERFUL LADIES AND THEY ARE GREAT AT THEIR JOBS.", "pics": null, "resp": {"time": 1520862213675, "text": "Thank you for your business, Kyla!!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "107643177770399754051", "name": "Ethel Moore", "time": 1460319740957, "rating": 5.0, "text": "My husband and I received a warm welcome upon entering the storefront and we were treated wonderfully! I explained to Shannon,  our sales rep,  what I wanted and he took us right to it!  It felt as if we were old friends.  I was never pressured to purchase anything which is a PLUS.  I cannot count the many times that I left a place due to the pressure to buy something that I'm really not looking for.  We also met the 'big man in charge' -as I affectionately refer to him.  You know,  the 'open 8 to 8 so don't be late' gentleman.  Lol.  Very warm and professional.  The carpet they installed looks AMAZING!  It's exactly what I wanted at the price I wanted! I will DEFINITELY recommend American Flooring and Cabinets. Ask for Shannon,  HE IS A GEM!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "107707794170294401374", "name": "Lynn Zimmerman", "time": 1497716097916, "rating": 1.0, "text": "We had Johnny also five years ago and are sorry we went there. We asked for the best pad that they had and also wanted quality carpet and were told that we had ordered it. Now we have \"humps\" in our carpet from stretching and we have to replace it soon. They tiled our foyer, hall and kitchen and while we love the tile they are uneven and chipped. Afterwards they fixed some but in order to make it right they would have had to redo most of it.  For $6,000+ we just expected better.  Make sure that you know what you are getting is right and the quality that you expect. We went to the Mobile store to have our work done.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "110867929909355066555", "name": "AllDone3", "time": 1502979966395, "rating": 5.0, "text": "Not only did they sell me on buying material from them instead of the competitors in the are, they educated me on WHY was more durable or waterproof than another and explained the difference in the products that I was interested in.\n\n\"People buy from people, not companies.\"\n\nThese people took fantastic care of me and my home.", "pics": null, "resp": {"time": 1503061999030, "text": "Thank you, Aldon! We look forward to doing more business with you in the future!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "115722297709588678394", "name": "Katie Azevedo", "time": 1549474581896, "rating": 5.0, "text": "We love our new carpet! The prices were reasonable and everything was done quickly and professionally.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "110594986656957890844", "name": "Mallory Howard", "time": 1562361944716, "rating": 1.0, "text": "So, my impression was great when I left the store but quickly changed. Salesmen were very helpful. Acted eager to help us get our remodel done. They showed me a countertop that they had in stock. It was ok, but not exactly when I was looking for but they insisted it looked great. I again, said no, I’ll keep looking. Kept looking and found the one, the countertop that would look the best. Left the store with the salesman’s card to call back with measurements. My husband called them 2 hours later to get a quote. Salesman tried selling him the countertop they had in stock but was not what I looking for. My husband told him no, she wants the other. He quoted him a price. Then called back and DOUBLED the the first quote because they’d have to order it. Seems they were eager to help sell what they had in stock, but be darned to sell what they’d have to order. We won’t be making a purchase from this store. Our business will go else where.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "111823440820378354845", "name": "Scotti Bee", "time": 1544726827548, "rating": 5.0, "text": "Great place. Everyone I worked with was fantastic. Great attitudes, wonderful customer service.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "103199519475517768154", "name": "Apple Henderson", "time": 1504216358877, "rating": 1.0, "text": "Well..well well, what can I say??  I sought help and met a man named Johnny at American.  We were needing granite and flooring.  He showed us a couple of choices and suggested we go to the warehouse in Loxley to pick granite and took our info and said  let him know what we decide on and we'll get a quote.  Needless to say he lost our info and forgot who we were.  We contacted him and reminded him of the quote.  He was to get with us on several occasions and did not!!  The lady who answered my call was aware of my frustration and got a owner/manager to take my call.  Got another we'll get you the answer and call you spill again.  We are not from here and should have believed reviews...SOOOO grateful to have been referred to HARD ROCK GRANITE....they are professional, personable,  thorough, quick and they treat you like family. If quality everything choose HARD ROCK they will be honest and get you a better deal too!!!!!", "pics": null, "resp": {"time": 1504219425037, "text": "April,\n\nI am so sorry to hear about your unfortunate experience. We really appreciate your feedback, and hope that in the future you give us the chance to make it right."}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "100418002630902400509", "name": "Logan Crouch", "time": 1475035900830, "rating": 1.0, "text": "I came in with a friend and Johnny Marino was our salesmen. I have never had a worse experience. He was introduced to us as 'the man who knew it best' and that he had 'been in the business for 43 years'. However, he was not polite, seemed to talk over us as we explained our needs, treated us as if we had no idea what we wanted, and overall was completely unprofessional: not only to us, but for other customers who were in the store. We were shown one product, and after the purchase, were shown a completely different colored product; then were argued to repeatedly that it was the light causing the color difference.\n\nThe business had a wide selection of products, and I'm sure with another salesman we would have had a better experience. But this particular transaction just left a bad taste in my mouth.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "114089316454675169832", "name": "Joshua Carper", "time": 1582784525996, "rating": 1.0, "text": "Dont shop here they are crooks!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117391671372413098311", "name": "Victoria Wilson", "time": 1561134408013, "rating": 1.0, "text": "Advertised \"Open 8 to 8\". Arrived about 5:40 unaware of new store hours. Came to buy flooring for 3 rooms. Salesman took me to the back to look at sheet vinyl rolls and remnants. Told me to browse while he figured out how much I needed from the measurements that I provided. I thought he was taking a little too long. Went to look for him and discovered that everyone had left and locked the doors. That's when I saw a sheet of white paper on the front door with new store hours 8-6. I HAD A PANIC ATTACK! Called my sister. She called Mobile Police Dept. MPD came. A woman in another vehicle then arrived and told him how to get me out. I left a note on the salesman's desk with my name and phone number and what had happened. I picked up my floor plan and measurements and left. NO ONE EVEN CALLED TO APOLOGIZE.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "100870931229571003310", "name": "Michael A", "time": 1457630008683, "rating": 5.0, "text": "Service was excellent. Shane Gros was very helpful. Definitely the place to shop. Can't go wrong. Thank you Shane for all your help!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "115666149050338080865", "name": "Todd Burley", "time": 1429800439217, "rating": 5.0, "text": "Visited this place on April 2nd to shop for new carpeting for our new house in Semmes. After we shopped around at several stores we found this place the most useful because of their helpful staff, affordable prices and financing. We ended up buying 1500 sq ft of carpet and had it installed last week, my wife loves the carpet and I love being able to get out of bed barefoot. We are very happy with American Flooring and would recommend them to anyone who needs a good deal on carpet", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117025975305460744902", "name": "Cyndi Booth", "time": 1460990865568, "rating": 5.0, "text": "I love, love, love my new kitchen granite countertops. They look great with the new cabinets recently installed by American Flooring, Cabinets , and Granite . I had the tile floors installed in a few rooms about 6 months ago. Everything is coming together and looking beautiful! Next is the bathroom shower and countertops and a bedroom needs hardwood flooring and........American Flooring, Cabinets, & Granite \"Your One Stop Shop\" for all of your remodeling needs!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "109266193797410791492", "name": "John rohman", "time": 1521160462034, "rating": 5.0, "text": "They have a beautiful showroom and staff was very helpful it was a great experience no stress,ill be back", "pics": null, "resp": {"time": 1521207459266, "text": "Thanks, John! We are looking forward to it!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117076347066617113149", "name": "Danny Woodard", "time": 1500739486402, "rating": 1.0, "text": "Attended the event they had last week where they said they were giving away prizes. I was told by a young lady there the drawings wouldn't be until late that evening and that I had to buy something to get a ticket. I then decided to buy a bottle of cleaner and was told that wasn't enough value for a ticket into the drawing. Clearly a bait and switch tactic to get people in their expensive store. Buyers Beware!", "pics": null, "resp": {"time": 1501006940255, "text": "No purchase was necessary to enter the contest or win. In fact, 4 out of 5 of our big prize winners didn't shop with us that day. We did not find this customer in our database of transactions that day. We appreciate all of our customers who came in for our 45th anniversary customer appreciation day event and hope to continue being your one stop shop!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "112977216569026173651", "name": "Diane james", "time": 1502988783377, "rating": 5.0, "text": "LOVE my new rugs! Will definitely be doing business with y'all in the future!", "pics": null, "resp": {"time": 1503062016602, "text": "Looking forward to it! Thanks!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "100618850160735047178", "name": "Norma Beachman", "time": 1506864146747, "rating": 5.0, "text": "We got everything we asked for .the company is number 5 you\nAnd their employment Ronald STEGMEIER is So Good At his Job\niWould Give Him A 10\nHe made Sure the Job was done Right And worked untill it was Finished\nOn A Saturday we would Recommend your Company and  Employee\nRonald STEGMEIER to anyone.\nRobert and Norma BEACHMAN", "pics": null, "resp": {"time": 1506950932066, "text": "Thank you, Norma!! We appreciate your business and I believe you meant Roland? We will let Roland know of his stellar job!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "104093080593887491080", "name": "val hansen", "time": 1501517000703, "rating": 1.0, "text": "When you place an order for 14 boxes for laminate flooring and get 3 boxes you think maybe it was just 1 mistake.  When you also place an order for ceramic tile for the facing of your fireplace at the same time you ordered the laminate flooring and you get 3/4 of it you start to wonder about this store that's been in business for so long. When you place an order for 3 boxes of ceramic tile for the inside of your fireplace at that very same time and you get 1 box because they FORGOT to order 3 and  you have PAID for it ALL!!!!  I am wondering WTH is THEIR problem!!!!  I took back the 1 box of ceramic tile since I didn't like it,  it didn't match, got a refund, pkd up the 3 boxes of flooring and tried to give me the other 2 boxes of ceramic tile I had gotten a refund on?????  Yes, I know had for me to believe too!!  Finally got all of my flooring. Had to reorder more fireplace facing tiles, pd for it, was told it was ordered as I was in the store and would be in that Friday, it came in the next Tuesday!!!! Found out it was NOT ordered until the day AFTER I ordered it!!!!  BTW, I finally went to LOWES, and got the rest of the ceramic tile I needed for the inside of my fireplace that they had IN STOCK!!  All this going on as my contractor was doing what he could with what we had!!!  Needless to say HE was not very happy and will be writing a review also on this store.  I live 18 miles 1 way from this Mobile store.  I made a trip 6 days in a row.  My sales person was Shane Williams.  I would NEVER recommend this store to anyone and will tell everyone I know of my experience.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "115158994240707227703", "name": "J H", "time": 1393281602049, "rating": 1.0, "text": "Misleading sales. If they make a mistake you are stuck with it...no returns! I tell everyone not to shop here. Salesman called me \"sweetie\" when he refused to correct his mistake..how demeaning. Similar incident with an acquaintance of mine, so must not be a rare occurrence.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "107762932826141481779", "name": "Leigh Stewart", "time": 1509484574891, "rating": 5.0, "text": "Don has always help us in anyway that he can.  If I ever had a problem,  Don take care of it himself. We have been with him for many, many years.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "118414276853890684407", "name": "Hannah Saenz", "time": 1447170793676, "rating": 5.0, "text": "This is most definitely a one stop shop, bought my counter tops, cabinets and flooring here. The prices were very affordable and I highly recommend this place to everyone!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "101758304990908887038", "name": "Jonathan Cunningham", "time": 1539007918594, "rating": 5.0, "text": "Good place friendly service", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "113681901621026223863", "name": "Jason Pyon", "time": 1517948519847, "rating": 5.0, "text": "Great people, great floors!", "pics": null, "resp": {"time": 1520862227750, "text": "Thank you, Jason!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "105090492168884359582", "name": "jessie james", "time": 1600095598542, "rating": 5.0, "text": "Awesome Customer Service!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "100447168247335546352", "name": "Tiffany Middleton", "time": 1516397427585, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": {"time": 1516407373391, "text": "Thank you, Tiffany. We appreciate your business!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "105897648709098992834", "name": "Kyle Patterson", "time": 1509545845019, "rating": 5.0, "text": "Very good experience", "pics": null, "resp": {"time": 1509547905471, "text": "Thanks, Kyle! Who was your sales rep?"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "108730415867708162165", "name": "Michael Farrier", "time": 1517445406499, "rating": 4.0, "text": "Helpful", "pics": null, "resp": {"time": 1520862242977, "text": "Thank you, Michael!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "109671780258856185954", "name": "Victoria Davis", "time": 1581644139875, "rating": 5.0, "text": "New Life Refinishing renovated two bathroom vanities for me. They arrived when they said they would and kept us informed of when they would be returning. They spent hours sanding the vanities down to the wood, inside and out, then applied the base coat and paint in the color I selected. Even though the refinishing of the bases was done on-site, they did not make a mess or create a lot of dust. Doors and drawers were refinished at their shop. The finished vanities are even nicer than I expected. The pictures below show the cabinets before (white) and after (grey) refinishing. I recommend this company to anyone needing cabinets refinished.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO6vUKshSZ9Xf_5T2SGAvWS3QDe4GB5rOa2oILW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN8PVjBIyMlBgArzCGnKgZtiFgmCTt7j0UP8tZP=w150-h150-k-no-p"]}], "resp": {"time": 1581647854133, "text": "Thanks so much for sharing your experience!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "103775575517672302851", "name": "Amanda Arthur", "time": 1622815682414, "rating": 5.0, "text": "Had our front door refinished and it looks great! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "111930188390055700367", "name": "Sonja Mathis", "time": 1607392507883, "rating": 5.0, "text": "New Life did an excellent job repairing an antique dresser for me. Thankful to Nick for the great work! So glad to have my Grandmother’s dresser back with me in much better condition. I can’t even tell where the repair was! Highly recommend.", "pics": null, "resp": {"time": 1607970528947, "text": "Thanks for the kind words!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "116721569895622904759", "name": "Beth Marshall", "time": 1514069600080, "rating": 5.0, "text": "Rather than purchasing new cabinets for our home, we decided to contact New Life Refinishing to have them painted. They came recommended from a friend. I was worried that the cabinets would look \"painted\" since we were going from a light wood color to grays and blues. I cannot begin to describe how amazing the final product is. Not only is the workmanship exemplary, but the staff is also. They were punctual, easy to work with, an even entertained our high maintenance cat who wanted to be in the center of the work. I would HIGHLY recommend New Life Refinishing!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNCvmg81-YQBg-QB9V2A0YQiux9dG2ZVQ5Bjueu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMy7iAqf3-5k7gHGN5Emxdj68cV4r5KcwMt8ljQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPZlqufm7GrIVlX1hBh7SQ__tkII2QiI6EHFdKL=w150-h150-k-no-p"]}], "resp": {"time": 1514070293863, "text": "Thanks so much for the kind review!! We really enjoyed you guys!!!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "115899078601987623827", "name": "Adam & Avery Tuley", "time": 1595280495521, "rating": 5.0, "text": "We are very impressed with the service provided by New Life Refinishing. They were professional and extremely humble about their expertise. The turn around time was quick and they provide delivery services. Super reasonable price! The quality of the finished table exceeded our expectations. We will forever be grateful to New Life Refinishing for giving our family dining room table a new life!", "pics": null, "resp": {"time": 1595284178857, "text": "Thanks so much for taking the time to share that!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "103541659806857197607", "name": "Jody Charland", "time": 1515341727444, "rating": 5.0, "text": "All I can say is \"WOW\" my wife loves this piece now!  She says it looks exactly like she remembered when she went to her grandmas house when she was a little girl.  I only wish I had some before photos to show you.  Nick took it from a failed restoration(heavy varnish), separated joints, broken drawer floor and so many Knicks , dents and scratches to a beautiful desk again.  My wife thanks you Nick and the rest of your crew.  Not gonna lie, I got some KUDOS for finding a great place to do the work!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO958BoUnw4pbbYZFrWQ5b7BtilzkFBIu7JT85Z=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNRyUpLE_i3G0m_IdGFHyCW4ToHqA_d1F2fQJnq=w150-h150-k-no-p"]}], "resp": {"time": 1515345797621, "text": "Thanks so much for the great feedback!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "114441307446717495370", "name": "Dianne Debter", "time": 1588964679057, "rating": 5.0, "text": "My door is beautiful!!! A contractor, who had previously been to my house came by. He smiled really big and said, “Your door is brand new! Looks great!” He is right my door looks new! What a fantastic job! I am SO pleased! It all went so well!Nick follows through as planned and does quality work!  👏🏻👏🏻👏🏻😄Thank you Nick!😄", "pics": null, "resp": {"time": 1590934432729, "text": "Thanks so much for the kind words!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "112029330417372948398", "name": "Sonya Brasher", "time": 1600886471738, "rating": 5.0, "text": "Our door looks absolutely beautiful!  Nick was very professional and polite. I would highly recommend New Life Refinishing for your next project !!", "pics": null, "resp": {"time": 1600889876885, "text": "Thanks for the kind review!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "102923550155269925354", "name": "Pete Hudson", "time": 1557171128758, "rating": 5.0, "text": "I am thrilled with my \"new\" kitchen table!  I had the table top of my grandmother's dining table refinished, and it is better than I ever remember it being!  I can't remember what type of finish Nick said he used, but he said it is very durable.  And it is SO SMOOTH!  I just want to pet it every time I walk by.  It is beautiful!  I'm looking forward to making new memories with it now!  Also, I had previously re-caned a few of the chairs and needed them to be stained to match the others, and they look perfectly matched!  Very happy customer here!", "pics": null, "resp": {"time": 1557171812085, "text": "Thanks for the great review!  The finish is a 2k Polyurethane"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "113473926746042093007", "name": "Ray Toth", "time": 1594327072212, "rating": 5.0, "text": "Great experience with NLR! From my first contact through completion of the refinishing of our front doors, they were outstanding.  Very professional, friendly, and responsive.  I would absolutely recommend them for your refinishing needs.", "pics": null, "resp": {"time": 1594331287050, "text": "Thanks for your business and the awesome review!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "104859565724622917402", "name": "Kevin Call", "time": 1485268045751, "rating": 5.0, "text": "Our live edge table turned out beautifully. They did an amazing job!! Highly recommend!! You wont be disappointed!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNc7g8RXO8ZEsdHbmZdEiyUe9PPDEMXLC0BfF1e=w150-h150-k-no-p"]}], "resp": {"time": 1485268492641, "text": "Thank you so much for the kind words and for the opportunity to work on your beautiful table. It is one of our favorite pieces we've worked on!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "117276214266290474894", "name": "Jake Glombowski", "time": 1584558730177, "rating": 5.0, "text": "Nick refinished an old dining room table for my wife and I. We inherited table from my wife's grandmother, so it had a lot of sentimental value. The table was made with white pine and has a lot of character and curves. However, it is old and had a lot of wear and tear, so it needed a lot of work. We wanted a somewhat dark gray table to go in our new home, but we were nervous that the white pine dining table couldn't be refinished to match what we wanted and we would have to pay for a brand new table. Nick blew us away with what he was able to do to stain and darken the white pine table. It took him a couple weeks to work on it and us viewing the table's progress. It was well worth the wait, and we love our newly refinished dining room table!", "pics": null, "resp": {"time": 1584563198376, "text": "Thanks so much for the kind words!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "105812188048576300678", "name": "Terry Patterson", "time": 1565093175523, "rating": 5.0, "text": "Nick and the rest of the guys did a fantastic job on refinishing our kitchen cabinets.  They were focused on delivering a perfect job and when the initial sanding did not meet their expectations, they re-sanded every cabinet to make it right.  They communicated well during the entire process.  They also  did a great job cleaning up after the job was completed.  I would highly recommend them for any refinishing job.", "pics": null, "resp": {"time": 1565094501171, "text": "Thanks for the kind review and for your business, we really appreciate it!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "104421237398295525406", "name": "Robert Guzowski", "time": 1565214313129, "rating": 5.0, "text": "Great quality work and craftsmanship.  I would trust them again with a family heirloom.  Great communication during the process, we couldn't have asked for more.  And they pick up and drop off to boot!  You just can't beat that.", "pics": null, "resp": {"time": 1565216058249, "text": "Thanks so much for the kind words!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "116113987368245790305", "name": "Grace Johnson", "time": 1558279668770, "rating": 5.0, "text": "Nick and his team are very professional and great to work with and I would highly recommend them. We recently bought our first home and wanted to change the cabinet color.  The kitchen cabinets were stained a cherry-redish color, and we wanted them to be a darker espresso color. New Life Refinishing took our existing cabinets and re-stained them for a fraction of the price you might pay to reface cabinets. Nick and his team did an excellent job, and our 20 year old cabinets look almost brand new. Nick took one of our doors to try sample colors, and when we didn't like the first color, he started over and tried a different color that we liked. They really want to make sure that you are happy with the product. They taped our entire kitchen off and did a great job ensuring there was no mess. I will be using them again when I want to re-stain my bathroom cabinets.", "pics": null, "resp": {"time": 1558282483343, "text": "Thanks so much for the awesome review, we really appreciate it and your business.  Thanks!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "103582571375410060754", "name": "Philip Panagos", "time": 1583282001094, "rating": 5.0, "text": "NLR did a perfect job removing the finish on a nearly 80 year old mahogany end table, so it's ready for an oil finish.  Will definitely go back to them in the future.", "pics": null, "resp": {"time": 1583285698618, "text": "Thanks so much for the nicer review and your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "107587039039447608905", "name": "Wendy Smythe", "time": 1576517216165, "rating": 5.0, "text": "Great experience. They showed up when expected and did an excellent job.  We are very happy with the work.", "pics": null, "resp": {"time": 1576521304603, "text": "Great to hear, thanks so much for the review!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "110114285322720566742", "name": "WordWashed Wife", "time": 1535751632642, "rating": 5.0, "text": "New Life Refinishing is a first class refinishing company!  They are all artists and the finished work in my house is simply beautiful!  They repainted my cabinets, mantle, front door and refinished a Hutch I'd had for 20 years.  I love it all.  Great group of guys - Drew, NIck, Robert, Will and Luke were all extremely professional.  They showed up when they said they would and delivered the product on the day promised!  Highly recommend this company!  It was a pleasure working with them.", "pics": null, "resp": {"time": 1535752491948, "text": "Thanks so much for the great review and your business, we really appreciate it!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "109162376325544338030", "name": "Cassy Reeves", "time": 1465767767467, "rating": 5.0, "text": "Nick did an excellent job painting our built in bookcase in our living room.  Bookcase was wood colored and he sanded and applied a white lacquer paint.  Great guy to work with and he did a wonderful job.  Job was finished quickly and around our busy schedules.  😊  I had also just painted our walls in that room and I didn't even have to do touch up paint after the project was done.  Awesome job!  Highly recommend!", "pics": null, "resp": {"time": 1465767949974, "text": "Thanks for the kind words Cassy and thank you for your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "106587274757069288614", "name": "Lois Jones", "time": 1505324073894, "rating": 5.0, "text": "I can't remember the last time something/anything exceeded my expectations- this kitchen cabinet makeover has! It is above and beyond what I have always wanted/dreamed of. So thankful that my daughter found Drew and his amazing team (especially Rob- he is just awesome!). They are the most incredibly talented craftsmen. Their attention to even the most minute detail is beyond comprehension. They even take their clean up process to the next level. Absolutely no aspect of this process was neglected. You would expect to pay a premium price for work of this caliber, but the best part, you don't! The price for all of this perfection is extremely fair and beyond reasonable. They are an absolute pleasure to work with. Oh, and did I mention that my 15 year old cabinets feel like silk...because they do! 😊", "pics": null, "resp": {"time": 1505331489473, "text": "Thank you so much! We really appreciate the opportunity that you gave us and the kind words! Your hospitality was amazing. Thanks again!!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "118138386467492989882", "name": "Kerri Call", "time": 1539034077126, "rating": 5.0, "text": "Overwhelmingly  pleased with the service as well as the quality of the end product. I had kitchen cabinets painted from boring brown wood finish to beautifully painted cabinets that brighten the extremely dark kitchen.  New Life updated worn drawer slides and installed new hardware that I ordered. From quote, time estimated to complete the job, to final invoice the service was outstanding.", "pics": null, "resp": {"time": 1539034825422, "text": "Thanks so much for the great review and your business Kerri!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "116107664884278385519", "name": "Blake Williams", "time": 1520804195061, "rating": 5.0, "text": "New Life Refinishing recently refinished our oak kitchen cabinets and they turned out great. They did a fantastic job and we couldn’t be happier with the finished product. They finished the job in about 5 days and left our kitchen spotless. Very good company and I highly recommend!", "pics": null, "resp": {"time": 1520804865824, "text": "Thanks so much Mr. Williams for the kind review!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "103813444991604961257", "name": "Gx Mx", "time": 1484687719971, "rating": 5.0, "text": "This company is unbelievably professional!  I was very impressed with their quick response to my initial contact.  I was equally impressed with the solutions Nick recommended for my furniture and the reasonable estimate costs.  Nick kept me informed every step of the process.  I am very pleased with the quality craftsmanship given to my china cabinet and table.  I highly recommend New Life Refinishing.", "pics": null, "resp": {"time": 1484688632807, "text": "Thanks so much for the great review and your business, we really appreciate it!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "110262216756714271104", "name": "Kathy Stampley", "time": 1477936295011, "rating": 5.0, "text": "New Life Refinishing provided us a reasonable price, delivered on time as scheduled, and the workmanship was exceptional.  We could not be more pleased with the work that was done.  I would highly recommend this company and we will use them again in the near future. Very professional and does excellent work!", "pics": null, "resp": {"time": 1477936669268, "text": "Thanks so much for taking the time to share your experience Mrs. Stampley!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "103876485111064667915", "name": "T. V.", "time": 1476394628934, "rating": 5.0, "text": "I had a wonderful experience with New Life Refinishing! I wanted to change my kitchen from oak to white which can be very tricky to do without looking tacky.  I found his website by doing a google search for refinishing kitchen cabinets.  Nick came over and gave me an estimate right away.  He has a very warm personality and is immediately likeable.  I knew after talking to him about his process and reviewing his photos on his website that I had found the right person to do the job.  He kept me in the loop through the whole thing.  He comes over when he says he will and calls beforehand, he finishes the job when he says he will.  He took my cabinet doors and drawer faces back to his shop and sprayed them there.  He came into my house and sprayed the actual cabinets and surrounds.  The whole process took under a week and I was amazed at how stunning the kitchen cabinets came out.  I can't stop looking at the kitchen without saying WOW!  His attention to detail and the quality and craftsmanship is beyond compare.  I would highly recommend New Life Refinishing to anyone and would ask him to do any future work!!!", "pics": null, "resp": {"time": 1476389719678, "text": "Thanks so much for taking the time to write this review Theresa.  It was a pleasure working with you!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "118084215953918499392", "name": "Christina Sirten", "time": 1551592156496, "rating": 5.0, "text": "Drew, Nick and Will were all great. Nick was very patient and helpful in helping me choose a color. They are very professional and finished my cabinets in the time quoted. I highly recommend New Life refinishing.", "pics": null, "resp": {"time": 1551636070809, "text": "Thanks so much for taking the time to review our company, and thanks for your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "114925401934815477341", "name": "Debbie Schumann", "time": 1549056200519, "rating": 5.0, "text": "Very pleased with the repainting of our bathroom cabinet drawers and doors.  They did an excellent job matching the original paint.  Very professional and responsive.  I would definitely use them again!", "pics": null, "resp": {"time": 1549077671853, "text": "Thanks for the review and your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "103621447681056910459", "name": "Joe Harless", "time": 1535460239374, "rating": 5.0, "text": "Nick and Will gave us great service in our recent need for staining and finishing the furniture we are using in our church auditorium renovation. They worked to match the stain on our pews and even repaired a badly damaged arm on one of our pews detailing the grain for a perfect match to the original grain and color. The service was fast and we highly recommend New Life Refinishing and will be using them again for any future needs. Thanks guys for all you did for us - Joe H.", "pics": null, "resp": {"time": 1535460963447, "text": "Thanks so much for the kind words Mr. Harless, it was a pleasure working with you!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "102811337031236434258", "name": "Erin Atkins", "time": 1519100513877, "rating": 5.0, "text": "I couldn’t be happier with the way my table turned out! I told Nick what I had envisioned, and he and his team made it a reality. New Life was easy to communicate with and worked quickly to complete the refinishing job. Will definitely hire them again!", "pics": null, "resp": {"time": 1519101193484, "text": "Thanks so much for the great review!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "114167392722554373955", "name": "Angela Arguello", "time": 1480088801717, "rating": 5.0, "text": "Nick at New Life repaired and refinished several handmade pieces of furniture for us that were damaged in our last move. We had six dining room chairs, an expandable table, a pub table and a twin bed headboard that needed to be completely rebuilt. Nick did a wonderful job on everything for us and he had it all completed quickly. He looked at other furniture that was damaged and made on the spot repairs for us. We still have a few pieces that we are considering getting refinished and we'll only have Nick at New Life Refinishing complete it for us.", "pics": null, "resp": {"time": 1480090628320, "text": "Thanks so much for the kind words Angela, and thanks for your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "113902525398329389446", "name": "Janice Kelly", "time": 1492200273436, "rating": 5.0, "text": "Outstanding service. Repaired my damaged (corner) of my dining room table to PERFECTION! Matched the finish FLAWLESSLY. Professional service. Will definitely use again. Highly recommend!", "pics": null, "resp": {"time": 1492200887337, "text": "Thank you so much for the kind words!! We enjoyed working on your table."}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "108794637136396486027", "name": "Carmen Wright", "time": 1578672430681, "rating": 5.0, "text": "I really appreciated the quick responses to any questions i had. All the team members were very professional and the finished product looks fantastic!", "pics": null, "resp": {"time": 1578676978164, "text": "Thanks so much for the kind review!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "115067354445879527241", "name": "Jonathan Powell (JP)", "time": 1479918204983, "rating": 5.0, "text": "These guys do amazing work! Nobody works harder than these guys! They charge a fair price for the top notch quality they provide. Money well spent on preserving things you want to keep and pass down to your kids. Highly recommended!!!", "pics": null, "resp": {"time": 1479920693499, "text": "Thanks for the review Jonathan!  We really appreciate it!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "110496631122750078030", "name": "Edwin Rodriguez", "time": 1494019196311, "rating": 5.0, "text": "Great job.  The renters I had tried to fix the cabinets on their own and made a mess. New life refinishing did a great job matching stain color to the rest of the cabinets.  The level of service is great and very timely.", "pics": null, "resp": {"time": 1494019852939, "text": "Thanks so much for the kind words and your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "107966693564412003096", "name": "Kevin Zurmuehlen", "time": 1464231198855, "rating": 5.0, "text": "New Life Refinishing is our new go-to for all of our wood refinishing needs in our house! Nick is an honest and hard-worker who completes his tasks on time and at a great price. He refinished our 30 year old kitchen cabinets and made them look completely new. We are very happy and will recommend New Life Refinishing to all of our friends and associates.", "pics": null, "resp": {"time": 1464231797749, "text": "Thank you so much for the review Kevin.  It was a pleasure working for you and your family!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "113680233572297634341", "name": "Josh Novak", "time": 1538420838717, "rating": 5.0, "text": "New Life Refinishing did an outstanding job in refinishing my old oak table. They made it look absolutely brand new! I highly recommend them!", "pics": null, "resp": {"time": 1538421518918, "text": "Thanks so much for the great review and your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "107417447851415797467", "name": "Michele Banish", "time": 1483208018973, "rating": 5.0, "text": "We left town for a Christmas Holiday and returned to a new kitchen.  We left Nick and Drew to do their best with 20 year old cabinets.  What we received was truely New Life.  Rather than paint, we had the guys strip,sand,and stain.  Lovely! I'd say it looks like a brand new kitchen adding tenfold the value of the modest investment in the work.  On time. Trustworthy. Quality craftsmanship. They will be back to address our master bath!", "pics": null, "resp": {"time": 1483210208073, "text": "We absolutely had a blast working on your kitchen. Thanks so much for the kind review!! We hope you guys have a Happy New Year!!!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "117062794742274394791", "name": "Dale Cox", "time": 1478782896315, "rating": 5.0, "text": "Nick refinished all of our white kitchen cabinets as well as a new built in cabinet that we built.  The work was excellent and the price very reasonable.  Nick is a hard worker and makes sure that the job is done to the customer's satisfaction.  Highly recommended!", "pics": null, "resp": {"time": 1464701270180, "text": "Thanks for the review Dale! We really appreciate it!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "102458974941301616004", "name": "Louise Holland", "time": 1492443326453, "rating": 5.0, "text": "These guys did a fantastic job on my cabinets! They were prompt & called to let me know what the plan for the day would be. They finished in timely manner. I highly recommend them.", "pics": null, "resp": {"time": 1492443971152, "text": "Thank you so much Mrs. Holland. You were such a pleasure to work for!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "107072722378519979948", "name": "Deanna Loden", "time": 1495220707472, "rating": 5.0, "text": "This company is so reliable, with prompt service and polite employees. They do beautiful work. They repaired and refinished our front door and we're very pleased with it. I highly recommend New Life Refinishing!", "pics": null, "resp": {"time": 1495220889515, "text": "Thanks so much for the kind words and your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "105607321109591029055", "name": "Laurel Moulden", "time": 1472280530726, "rating": 5.0, "text": "Amazing work!!!  I had an old sideboard that belonged to my grandmother that sat in my basement for years. It was in desperate need of refinishing and repair. Thanks to the talented craftsmanship and TLC of New Life Refinishing, it is now my favorite piece in my house and sits proudly in my dining room, with a whole new generation to make memories with.", "pics": null, "resp": {"time": 1472297881405, "text": "Thanks for sharing Laurel, I had a blast working on your wonderful buffet!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "113637561457659385522", "name": "andrea foust", "time": 1479907301753, "rating": 5.0, "text": "I would highly recommend New Life Refinishing.  Nick has great attention to detail. He keeps you informed on his timeline as things go along.  Awesome .", "pics": null, "resp": {"time": 1479907887762, "text": "Thanks so much for the kind review, and thanks for your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "118206974036300183251", "name": "Jason Potts", "time": 1511193300673, "rating": 5.0, "text": "Great experience. The quality of work was great. You can tell costumer satisfaction is important to these guys. The level of communication and flexability during the restoration process was perfect.", "pics": null, "resp": {"time": 1511194299210, "text": "Thanks so much for your business and the kind words!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "111943573004912819064", "name": "David Dye", "time": 1518495810395, "rating": 5.0, "text": "New Life is what our furniture got. We are so pleased. Our furniture that is over 50 years old looks better than brand new.", "pics": null, "resp": {"time": 1518496601598, "text": "Thanks for the kind words!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "102237074338227794823", "name": "Valarae Pfister", "time": 1478549473915, "rating": 5.0, "text": "New Life Refinishing did a superior job of fixing my dearly beloved solid walnut hope chest (made by my father).  He does excellent work and has great service.  Highly recommend!", "pics": null, "resp": {"time": 1478550084067, "text": "Thanks for the great review Val!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "110463609900806540822", "name": "Lindsay Caro", "time": 1468422882344, "rating": 5.0, "text": "We had several pieces of furniture painted and stained by New Life Refinishing. We had a dresser stained and a bookcase, bed and dresser all painted. He did an amazing, flawless job. We will definitely use New Life again for any of our furniture restoration needs.", "pics": null, "resp": {"time": 1468423333701, "text": "Thanks for your business and thank you for your kind words Lindsay!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "110226835775547051526", "name": "Guisseli Reyes Turnell", "time": 1478736065577, "rating": 5.0, "text": "Nick repaired a table that was damaged by our cleaning company. He was professional, on time, and the repairs turned out beautifully and better than expected. I highly recommend this business.", "pics": null, "resp": {"time": 1478736460234, "text": "Thanks so much for taking the time to share your experience!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "103606412349484149993", "name": "e swinney", "time": 1472306786670, "rating": 5.0, "text": "We had our front door and side panels stained by New Life Refinishing. He did an amazing job. We will definitely use New Life again for any of our refinishing needs.", "pics": null, "resp": {"time": 1472307892890, "text": "Thanks so much for taking the time to share your experience!  I really appreciate it!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "108610824819769381382", "name": "Charles Phillips", "time": 1480385863340, "rating": 5.0, "text": "His work was very good.  We got a quick turn around and he explained what a was done.  We will definitely use again.", "pics": null, "resp": {"time": 1480386168548, "text": "Thanks so much for your business and the kind review Mr. Phillips!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "107669371398687021222", "name": "Linda McGuire", "time": 1522115311826, "rating": 5.0, "text": "New Life Refinishing did a spectacular job on refinishing a heirloom  dining room set given to me by my mother. I appreciated not only the high quality of work they performed but the kindness and care expressed by the team.", "pics": null, "resp": {"time": 1522115982754, "text": "Thanks so much for the kind words, it was an absolute pleasure working on your table and chairs!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "113244301681752246348", "name": "Benjamin Cain", "time": 1484073184498, "rating": 5.0, "text": "Professional and great at their craft. They can do it all, furniture repair, refinishing to name a few. Competitive price for the quality work they do.", "pics": null, "resp": {"time": 1484073770175, "text": "Thanks for the kind words Ben, we really appreciate it!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "116427123684068478143", "name": "Richard Ehrenreich", "time": 1530886609743, "rating": 5.0, "text": "I don't recall just how we were introduced to Nick, maybe from a newspaper insert. We called him and received an estimate to refinish an oak table with four chairs and a captain's chair, probably in excess of 25 years old with all the mars and scratches a table of that age would show, not to mention several moves while on active duty in the military.. His estimate was very reasonable, so we asked him to perform the work. To say that we were thrilled with the finished product is an extreme understatement. The set looked better than brand new. We then asked him to do a much harder job, refinishing a hard maple dining room pedestal table and four unmatching chairs (in finish and type of wood) in a stain to match a dining room china cabinet. To make matters even worse, one of the leg bases had been chewed on quite vigorously by a new puppy. Once again, Nick's work was unsurpassed and his estimate was right on. Before and after pictures can be seen on his web page. We are very pleased with his work and wouldn't ever consider anyone else for future work.", "pics": null, "resp": {"time": 1488724252521, "text": "Thanks so much for the kind words and for your business, we really appreciate it!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "115040791932261917767", "name": "Cathie Jones", "time": 1471723438098, "rating": 5.0, "text": "New life Refinishing did an amazing job on our kitchen table top. I am so very pleased with not only his work, but also his estimate was the most reasonable.", "pics": null, "resp": {"time": 1471723821666, "text": "Thanks for the review Cathie!  Really appreciate your time and your business....thanks!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "117406631571244247039", "name": "Carmen Valeria", "time": 1485641226667, "rating": 5.0, "text": "We have had them refinish a coffee table, end table and a desk . Perfect every time! Very nice and professional!", "pics": null, "resp": {"time": 1485642372822, "text": "Thanks for your business and the kind words Carmen!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "104331672588526576687", "name": "Kimberly (Crystin) Hunter", "time": 1535772284065, "rating": 5.0, "text": "Great customer service!! Good work!", "pics": null, "resp": {"time": 1535772963873, "text": "Thanks for the kind words Crystin!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "114693715229913444665", "name": "Scott Dewald", "time": 1465265833713, "rating": 5.0, "text": "They refinished all of our cabinets and we couldn't be happier with the way they turned out. Would highly recommend this company for any cabinet work.", "pics": null, "resp": {"time": 1465266101694, "text": "Thanks Scott!  It was a pleasure working with you!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "116173489455111598255", "name": "MJ Game", "time": 1570708510929, "rating": 5.0, "text": "Really nice work!", "pics": null, "resp": {"time": 1570722909265, "text": "Thanks!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "109156394377129238249", "name": "Janie Davis", "time": 1468188523480, "rating": 5.0, "text": "AWESOME JOB on the Dining room table refinishing.", "pics": null, "resp": {"time": 1468192296048, "text": "Thank you Janie, we appreciate your business!"}, "gmap_id": "0x88626aabb242d771:0xa0f58e9bffda8d63"}
{"user_id": "116304123264346053058", "name": "Joshua Southard", "time": 1613134842882, "rating": 5.0, "text": "They are very nice and extremely helpful to the extent of looking at pictures of the wall color and getting a good match for the floor and not clash. They have everything you need to get a floor done with real hardwood, laminate hardwood, vinyl and tile carpets and rugs. If u can walk on it THEY will have it. I'm still waiting on the free home estimate and I will update this post after with pictures.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMoNDUz1nUwQ3clPi7Ms8eA1or37X9T7mmjgGa4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNNrR14rt5OBblvzCaG8AnP6Nx0p74ThsgWqcY4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMt37P91ft1XcOSoqdngMR_WVNKqjIvkuVDRHK4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNPmoio3E6HGanV6zgzyFHWmDOyZ23eSVMWh1hP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMVYU_ojO2WiFbdy8fmwewbqmYBF11fTFv05A1H=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "116917318814881034780", "name": "Traci Reed", "time": 1618606757888, "rating": 5.0, "text": "What a wonderful experience today at this establishment working with Kim! It was so refreshing to work with her and Dinah!! And we got Everything we wanted and needed. We love All we picked out!! Can’t wait to see it all in our New Forever Home!!!!", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "107629545306958167693", "name": "Mike Measels", "time": 1608559238516, "rating": 5.0, "text": "Shane and David did great. They were committed to and take great pride in their job. They were punctual every day and if they were going to be a little late would notify us. They have the process of refinishing floors down to a science and a lot of hard work.  They were also courteous and friendly.  We highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "105287292938466275483", "name": "Merri Bass", "time": 1619228954789, "rating": 5.0, "text": "Staff is the best!! Helpful and very knowledgeable about all things flooring.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "110191424794442440645", "name": "Steven Stovall", "time": 1610211978182, "rating": 5.0, "text": "Very nice and willing to answer all your questions Good people", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "110690283404264893827", "name": "Jacques Cockrell", "time": 1600868952658, "rating": 5.0, "text": "Great experience. Very professional and knowledgeable. Nice selections and great attitudes.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "105605293847708323016", "name": "Balinda Adams", "time": 1496180859701, "rating": 5.0, "text": "This place has just the right amount of a variety of flooring without making you overwhelmed. The young guy at the desk was very nice and attentive to us when we came in. Shane went out of his way to make sure my parents found everything they were looking for. He even gave them a sample of wood to take home to see if it matched the staircase. He also gave them a quote that was much cheaper than the other flooring store we had went to. He was honest and very upfront. If you go by, ask for Shane and he will take great care of you and even help with design questions.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "116341789387237960125", "name": "Adam Baker", "time": 1496176180003, "rating": 5.0, "text": "We were pleasantly surprised when we walked in the door! Not only did everyone greet us but several were busy with other customers yet they made sure we were taken care of. We told Vicki what we wanted and she read my mind and presented several options. We will not only mention them to our friends we will shop with them again very soon. Thank you for your hospitality and commitment to making sure we got what we wanted, in the budget we had to work with and all installed in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "109741078409095936113", "name": "T W", "time": 1509557415869, "rating": 5.0, "text": "Update to a review with only 1 star rating several months ago from De W. As the customer who wrote it, we made an effort to update the rating but could not seem to do so. However, please know that all concerns with the installer were addressed and done so professionally. In reality the concern was simply a breakdown in communication. No one is perfect and they did what was right and corrected our concerns. Ryan was excellent and prides himself on taking care of the customer. Please omit the rating from your decision process on where to buy your flooring. They truly deserve a full 5 star rating.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "102835260080024832829", "name": "Vicky Brown", "time": 1495749793814, "rating": 5.0, "text": "Very Helpful and Knowledgeable Staff.\nGreat Selection to choose from... well\nlaid out showroom.  I would Recommend\nto others.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "102435517894712712524", "name": "Judy Croft", "time": 1496023792475, "rating": 5.0, "text": "Our overall experience was outstanding, from the selection to the service. Thank you for your design advice, it really helped us make the right selection for our project. I would recommend to everyone. Thank you.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "114202475013389505625", "name": "De W.", "time": 1495725608505, "rating": 1.0, "text": "They promise you ethical treatment, integrity & flawless service. Don't believe it.\nOnce carpet was selected - salesman assured quality professional installers in a timely manner.\nThe installer arrived late; talking highly of himself and did not reply or respond when asked questions. Once carpet installed, we inspected job. Carpet had high strips where Sean's were like the carpet was doubled at the seam. I pointed it out to installer (Terry), and he pulled on it saying it won't come loose. I said I wasn't worried about it coming loose but the seam was obviously thick.\nHe ignored my concern. A week later I called back and spoke to sales person who came our days later to look at it. It took another week to get a call back where salesman asked for a convenient time for installer to come back. I gave him 2-days and timetable around my work schedule. Salesman said he would call installer and get back with me on day & time. I was assured installer would be back to repair on one of the days I provided but he would call back to confirm.\nOn the day installer was suppose to be here for repair I received a call from installer saying he was calling to set up the appointment. What?! You were were suppose to be here....\nI called the store and I got excuses from the lady sales person saying the installer was trying to call me.\nDon't bother calling these people..they don't know what they're doing and they are not customer service conscious. I won't be using them again.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "106807615328526239216", "name": "J Bin8148", "time": 1565017455588, "rating": 1.0, "text": "Price I was quoted for materials changed drastically after work was done. I was told those were the in stock prices. Had no choice but to pay I was never contacted saying the quote was going to be different. Stay away", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "116220530764713666634", "name": "Catrina J", "time": 1536353196536, "rating": 1.0, "text": "No customer service. My husband and I visit the store this morning looking to purchase some flooring. When we entered, no one greeted us or said one word to us while we were there. We looked around and nothing. Waited near the desk, nothing. We left! If you are with a customer or busy, all it takes is 10 seconds to say \"Hello! welcome! We will be with you shortly\"\nWe spent our money elsewhere.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "106169342884188317776", "name": "Lillian Black", "time": 1566244678583, "rating": 5.0, "text": "Very happy with experience from sales to fantastic installers. Price exactly what estimate was.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "105161777829111765850", "name": "Mark G.", "time": 1495766006608, "rating": 5.0, "text": "We bought our flooring from Alabama Custom Flooring  and Design and couldn't ask for a better experience.  The service was beyond my expectations.  I highly recommend them for all you flooring needs.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "115050475612973215501", "name": "Jared Toone", "time": 1485363215715, "rating": 5.0, "text": "Great selection and pricing. Order came in quickly and all went well.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "104703748919011224951", "name": "michael joseph", "time": 1519008355255, "rating": 5.0, "text": "easy experience. helpful/knowledgeable sales person", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "101529749488321458616", "name": "Michelle Hockersmith", "time": 1470497843147, "rating": 5.0, "text": "Thank you to Ryan for the excellent service.   I highly recommend Alabama Custom Flooring & Design for all your flooring needs.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "112513230607243614302", "name": "Stan D", "time": 1529441783316, "rating": 2.0, "text": "They quote cheap prices by the foot, and then over measure by nearly 20%...be careful with this place.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "116084288399862673075", "name": "Dana Lee", "time": 1495762361900, "rating": 5.0, "text": "Great place to find flooring.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "102447324698511197542", "name": "Dave Quandt", "time": 1627313763989, "rating": 5.0, "text": "Great product and prices and outstanding service", "pics": null, "resp": null, "gmap_id": "0x888ca3578d2096cb:0x7ba550de697389be"}
{"user_id": "112403097659107694907", "name": "Paige Thorn", "time": 1599272003735, "rating": 5.0, "text": "Love Gibson's. They as friendly and more when coming to making their customers satisfied.", "pics": null, "resp": null, "gmap_id": "0x888ca3578d2096cb:0x7ba550de697389be"}
{"user_id": "104904680913926603464", "name": "Melanie Gallagher", "time": 1582994364909, "rating": 5.0, "text": "Best flooring you can buy and really good people and very professional installers", "pics": null, "resp": {"time": 1583030567123, "text": "Thank you so much!"}, "gmap_id": "0x888ca3578d2096cb:0x7ba550de697389be"}
{"user_id": "109369950239874180976", "name": "Pamela Berthiaume", "time": 1611640649178, "rating": 5.0, "text": "The people at floor were so nice and helpful. Picking my flooring was so easy. They understood immediately what I wanted and second sample was it. Thank you floor gallery.", "pics": null, "resp": null, "gmap_id": "0x886261dabd3bde71:0x7f0198452f738c8c"}
{"user_id": "104701265909165668784", "name": "Virginia Adkins", "time": 1615923105424, "rating": 5.0, "text": "Great place for flooring.Everyone is friendly and helpful.Installers did a great job in a timely manner.Locally owned.", "pics": null, "resp": null, "gmap_id": "0x886261dabd3bde71:0x7f0198452f738c8c"}
{"user_id": "103987797629865045467", "name": "connie garcia", "time": 1581710690803, "rating": 5.0, "text": "Will and his family are AMAZING! So nice to meet people who want to help! Good home town people and even better prices. I’ll post pictures when my wood/tile are finished.", "pics": null, "resp": null, "gmap_id": "0x886261dabd3bde71:0x7f0198452f738c8c"}
{"user_id": "101366862146671752972", "name": "Bertie_B", "time": 1530552857858, "rating": 5.0, "text": "Absolutely hands down an amazing group of people. Great quality materials at a great price. Very professional and very friendly. They helped me with all the questions I had. I absolutely love our new carpet. The installers were very professional and friendly as well.\nThank you Steve and family!!\nDefinitely recommending!! God Bless!!", "pics": null, "resp": null, "gmap_id": "0x886261dabd3bde71:0x7f0198452f738c8c"}
{"user_id": "110683572348901167342", "name": "Pattie Lane", "time": 1569602878263, "rating": 5.0, "text": "Easy going no hard pressure sales. Had no problem  seeing what flooring  I liked.", "pics": null, "resp": null, "gmap_id": "0x886261dabd3bde71:0x7f0198452f738c8c"}
{"user_id": "107023731004491447239", "name": "Nathan Haygood", "time": 1585137515997, "rating": 5.0, "text": "They are great people great service. And I'll continue to use them", "pics": null, "resp": null, "gmap_id": "0x886261dabd3bde71:0x7f0198452f738c8c"}
{"user_id": "116829956589378256821", "name": "Joel Hamm", "time": 1575566095356, "rating": 5.0, "text": "Great prices, awesome service!!", "pics": null, "resp": null, "gmap_id": "0x886261dabd3bde71:0x7f0198452f738c8c"}
{"user_id": "104878542118141795308", "name": "Stephanie Allen", "time": 1522269479775, "rating": 5.0, "text": "The staff is extremely helpful and knowledgable. No pressure and friendly. Lots of selections!", "pics": null, "resp": null, "gmap_id": "0x886261dabd3bde71:0x7f0198452f738c8c"}
{"user_id": "108810982896547098293", "name": "Trice Woods", "time": 1550608363080, "rating": 5.0, "text": "Friendly Staff and easy to work with", "pics": null, "resp": null, "gmap_id": "0x886261dabd3bde71:0x7f0198452f738c8c"}
{"user_id": "105176779812446844525", "name": "Harold King", "time": 1527787760765, "rating": 5.0, "text": "Nice group of personnel...", "pics": null, "resp": null, "gmap_id": "0x886261dabd3bde71:0x7f0198452f738c8c"}
{"user_id": "104378838507977027743", "name": "laurence allen", "time": 1579592606381, "rating": 1.0, "text": "Horrible experience to be professional builders", "pics": null, "resp": null, "gmap_id": "0x862831bfb7129e77:0x633afefdb0cc9cbf"}
{"user_id": "100872051604800994421", "name": "Berta Mexidor", "time": 1531252831023, "rating": 4.0, "text": "Good quality work", "pics": null, "resp": null, "gmap_id": "0x862831bfb7129e77:0x633afefdb0cc9cbf"}
{"user_id": "101951501809604421944", "name": "Adam Bowers", "time": 1613669990162, "rating": 2.0, "text": "The store manager is very customer focused; the product (Driftwood Hickory VP) is very nice. Unfortunately, the installer that is contracted  by this store lacks the needed communication skills to be successful at customer satisfaction; also lacking is a defined work ethic that any reasonable person would expect.", "pics": null, "resp": {"time": 1613671888583, "text": "Hello Adam,\n\nThank you for providing this feedback. We apologize for the negative experience you had with the service received from the contractor. We would like to hear more about the matter and discuss it further. If you would like, please email LLResponse@lumberliquidators.com Kayla P | Customer Advocate"}, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "104224417313701508256", "name": "Rupert Ward,Jr.", "time": 1596559381147, "rating": 5.0, "text": "Great customer service and really low price", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO-TcGDr1quQMDxebAbLQEmJWW3Es9CE4pDK9Ib=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "108682821623072794772", "name": "Pati Phillips", "time": 1593020040037, "rating": 5.0, "text": "The service and product you receive from this location is top notch! They have so many choices and are very eager to help you in figuring out what and how much to order. Jeff is the rep I dealt with and he was excellent from beginning to end. I had found what we were looking for online so I showed it to Jeff and he gladly placed our order and it came in sooner than we expected .\nThe whole experience was so easy and we are so pleased with the final result. Their prices were great too and you can easily return any unused product.", "pics": null, "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "105897017814660460679", "name": "Riki Brunell", "time": 1622920771992, "rating": 5.0, "text": "These ppl are awesome.", "pics": null, "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "114123465533585964211", "name": "William Hoehn", "time": 1604793037162, "rating": 5.0, "text": "Helpful and friendly service. Knowledgeable about their products and able to answer questions and concerns well. Will use them again in the future.", "pics": null, "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "108229563124769757267", "name": "J. Brannon", "time": 1601412803763, "rating": 5.0, "text": "Extremely helpful, answered all questions concerning self installation, paid for flooring and held in store until we were ready for pick up.  Could not ask for a better experience!  Highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "101357904887249280891", "name": "Roy Bellamy", "time": 1617658209992, "rating": 5.0, "text": "The store was very clean and everything seemed to be in place.  The staff was friendly and professional.", "pics": null, "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "115030792937316366278", "name": "Linda Patrick", "time": 1599540338188, "rating": 5.0, "text": "great place where the staff is very knowledgeable. Jeff was very helpful.", "pics": null, "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "116739078621095762086", "name": "Brandon Hannon", "time": 1576192588704, "rating": 5.0, "text": "EXCELLENT customer service. Mike and the crew are fantastic. Cant beat the prices! Every time I visit, Im always pleasantly surprised with customer service and how knowledgeable the guys are there. HIGHLY recommend.", "pics": null, "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "112225513672342781440", "name": "Sandy Schmitz", "time": 1580409422143, "rating": 5.0, "text": "Hey, we love doing business with the Dothan Alabama store. Mike and Jeff are two of the best sales people and service people we have ever used. We do multiple houses a year and I will not use any other company!", "pics": null, "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "111080913486315972762", "name": "Brenda Oakley", "time": 1591553563866, "rating": 5.0, "text": "Always very helpful, exceptional customer service getting us the product we need in a timey matter.", "pics": null, "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "107708204657068683245", "name": "Russell Burton", "time": 1581716683255, "rating": 5.0, "text": "Mike Achors helped us pick flooring and supplies we wanted. He was so great to listen to what we were wanting. These guys here ROCK!!!! Our installer was also exceptional  he treated our home like it was his own.", "pics": null, "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "104133767458012516842", "name": "Elizabeth Sherwood", "time": 1576195511620, "rating": 5.0, "text": "Mike and team have perfected the art of customer service and going above and beyond for the customer. Best prices and wealth of knowledge for the do it yourselfer. Would highly recommend and will definitely go back for all flooring needs.", "pics": null, "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "116458927646081835749", "name": "Enterprise AL CBD", "time": 1569589232688, "rating": 5.0, "text": "purchased flooring for your CBD Store Enterprise, love the product and everything with my purchase was great.  When we picked up the flooring material, the guy helping us with our order went above and beyond to fulfill our order and get it loaded so we could be on our way.  I am now back to shop for my home flooring.  Thank you so much", "pics": null, "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "115674477893396960956", "name": "Zane Shafer", "time": 1579639088384, "rating": 5.0, "text": "Guys are amazing!\nGreat selection and go above and beyond. Have used on multiple projects, Jeff and Mike are the best!", "pics": null, "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "112034841772224483606", "name": "Bethany Vick", "time": 1584063760468, "rating": 5.0, "text": "Eric helped us with choosing a flooring for our hallway . He was very patient and listened to our wants/needs. This place has a great selection and great prices. Would reccomend 👍", "pics": null, "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "109118069648352338361", "name": "Jim Moran", "time": 1585247501167, "rating": 5.0, "text": "What a great place to do business they will really go above and beyond!", "pics": null, "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "101030247327368003393", "name": "Bob lee", "time": 1531920257192, "rating": 5.0, "text": "Love my new wood t&g ceilings. Great service. Great prices. You guys Rock!", "pics": null, "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "114534787184875894032", "name": "Rebecca Bemis", "time": 1547259177180, "rating": 5.0, "text": "Jeff and the guys who work with him are super knowledgeable and friendly.  The have mastered the art of helping DIY 'pro's' see potential installation problems they may be creating for themselves without making them fell stupid.  They ask all the right questions to make sure an appropriate product and the correct installation technique will be used.\n\nIn helping me find the right product for my project and budget, they patiently showed and explained various options to me.  Weeks later when I finally got fed up with not being able to make a decision I asked them for help on deciding the right color.  They considered the colors I was forced to work with and those I planed to use and helped me pick a beautiful floor.\n\nFinally, they happily match sales prices when the price on a product is reduced after it is purchased  (30 day price guarantee I believe).\n\nThese guys will have my business for any future projects I create for myself.  They are more patient with me than I am!", "pics": null, "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "105651527021051482779", "name": "Tasha Burgess", "time": 1553168650273, "rating": 1.0, "text": "My parents got a quote to do their house but the price was high so they decided to wait a few months. A month later they got a bill from a bank saying they were late on their payment. HOW IS THAT EVE  POSSIBLE WHEN THEY NEVER HAD THE FLOORS INSTALLED?? This company, its people and their service is extremely SHADY. I WOULD NEVER RECOMMEND THIS COMPANY TO ANYONE.", "pics": null, "resp": {"time": 1553189913073, "text": "Hello Tasha,\n\nThank you for your feedback. Here at Lumber Liquidators we take our customer's input seriously. Please provide your contact information in an email addressed to us at LLResponse@lumberliquidators.com and we will contact you to further discuss.\n\nSandra H.\nSocial Media Specialist, Customer Care"}, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "117524651130515468061", "name": "Jeanette Telencio", "time": 1561322336675, "rating": 5.0, "text": "Awesome, friendly, and professional professional help from Chip. and great deal on our new flooring for our kitchen!!!", "pics": null, "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "113084617266002215370", "name": "Kenneth Starr", "time": 1584534433093, "rating": 1.0, "text": "Not very helpful.", "pics": null, "resp": {"time": 1584544439964, "text": "Hi Kenneth,\n\nThanks for your review. We take our customer's feedback seriously and would love the opportunity to turn your experience around. Please feel free to email us at LLResponse@lumberliquidators.com. We would be more than happy to help you find what you need. We look forward to hearing from you.\n\nLauren R. Customer Advocate."}, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "105894658560102064548", "name": "Kin Folk", "time": 1550428641396, "rating": 2.0, "text": "I ordered some.unfinished pine flooring it's the worst I've seen  wood was split knot holes the edges we're broke on some .\nBetter off buying 2x4s and installing them instead\n\nI have responded nothing but crickets Sandra H", "pics": null, "resp": {"time": 1549296227556, "text": "Hello Kin,\n\nThank you for your feedback. We value your business and would like the opportunity to speak with you directly. Please provide your contact information, order number, or customer number in an email addressed to us at LLResponse@lumberliquidators.com and we will contact you to further discuss.\n\nSandra H.\nSocial Media Specialist,Customer Care"}, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "107619565524692003349", "name": "Barrie stebbing", "time": 1602971759970, "rating": 5.0, "text": "Great buys!!!!", "pics": null, "resp": null, "gmap_id": "0x8892926d8b6a7e1f:0xc3bedd46a9bbb65d"}
{"user_id": "117370394023014395975", "name": "Deborah Wright", "time": 1545273620225, "rating": 5.0, "text": "James with Got Wood did an excellent job on my hardwood floors. I love them and the quality of his work continues to get me compliments every time friends come over and see my beautiful hardwood floors. Just look how my Christmas tree shines in the floor. Beautiful! I love it!!! I just recommended him to a family member to get theirs done next.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMBDWxZCyvQbcCfPyKsygy4D2bf5o66u1HJXnLR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMePZ0CnRl98RvmDtLKDkcZggLwEub9fOq-zu8s=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMRSJM7MFqOHLX9h00qnfiz3BnJCT0N105MdPn0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOGcQAliNXAZyRX_2WOd2bhTJl97MLR9zmZs72E=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMtiV9M4-Me8cYTtjTrhqknRFJnsvoExTJbERWs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOUxruv8QXDoxAbJydDyCVeMgNgvLAkgyqa96wd=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ccdb601ca4b99:0xff5808d1dee98c57"}
{"user_id": "100628530463959634987", "name": "Judy JudyB", "time": 1513139278092, "rating": 1.0, "text": "I had them do my entire house that was empty. They started late, and then rushed the job as the movers were coming. I had issues right after they finished, my first contact after the job was Oct 31.  I have many text, but still haven't fixed the problem, even now July 5..\n\nMy next door neighbor who had Got Wood do her floors is beautiful, I will say that in a heart beat.  That is why I hired them to do mine. Got Wood suggested I get my tile from Lowe's as he thought it would look good in my condo, the tile cost more then the tile I was going to get, but he was the \"pro\". I ordered the tile, and James (Got Wood) bought the grout. I had to wait over a week for him to start on my floors after it all came in.  What has really got my goat is when he lies about his sorry work, and me getting drunk (I don't drink), and having a party. Two days after he finished, the painters came in, when they finished the movers came. He never came back to really clean the floors like he said he was going to.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMIGlCPEGhwKpTji5HS-iEVlzae54NIv0laaqQ3=w150-h150-k-no-p"]}], "resp": {"time": 1499345800318, "text": "First of all I would like to say that some people you can never make happy and since Judy wanted to call and make a complaint on the company that did the work in her house there is five other houses in her neighborhood that was tile and wood floors done in there and not one problem has occurred from the beginning we was rushed to this job so she could move across the street I went back to her house several times to address areas that was not cleaned that had grout powder still in the cracks after we acid washed and mopped I went back five other times to just wipe up stuff for her or look at stuff that she thought was a problem this is how it all occurred Judy went to Lowe's and purchased her tile and her grout herself I gave her some ideas on what to buy but I also told her to make sure that she checked the edges of the tile and made sure that all tile was covered her tile edges are great and the floor is brown so when you put wood tile together in the light shines in at a certain angle it is showing a gray line I told Judy to contact the company where she purchased the tile from and get them to come look at the tile and find out what was wrong in my eyes it was a defect I also recommended that she change her grout color because she picked a lighter color that she is not happy with herself so therefore my company is not to go in scrape out sanded grout and put in non sanded black grout so that this problem would be solved she buys a pen and wants me and my gas to come to her house and draw on every piece of tile that is not our job we are tile installers removers and sellers we do not set and draw on Floors if there is a defect from the company if I purchase it I would handle it so therefore Judy's complaint is all on her herself it has nothing to do with me and my company there's five other people in her same neighborhood that we have done the floors for and there's not one complaint not one callback not nothing this is the only person in the neighborhood and what a coincidence that people in the neighborhood complain on this also the time that we was installing the tile they was drinking having party time and walked on top of the tile after we left me and my boys went back and fix the tile the next day for free we told them do not walk on the tile at all none whatsoever and we had to fix tile the two or three days that we was there I don't have no complaints about my customers and what day do I fix what they mess up and I didn't even charge so therefore I'm very sorry that she is unhappy I done everything I could in my power to make her happy but I'm not"}, "gmap_id": "0x888ccdb601ca4b99:0xff5808d1dee98c57"}
{"user_id": "115805291272971837552", "name": "Andrew Lesley", "time": 1549500516706, "rating": 5.0, "text": "Professional, fast, fair prices. James is a great floor installer. He pulled old carpet off and refinished the hardwood underneath. I am in another house that needs flooring, he is the 1st person I called.", "pics": null, "resp": null, "gmap_id": "0x888ccdb601ca4b99:0xff5808d1dee98c57"}
{"user_id": "113589051818876852815", "name": "Lb Murphy", "time": 1581119856144, "rating": 1.0, "text": "I call several times over a few days never got a call back, I tried 1 more time and he answered I ask for a quote an I was told they would come out Monday evening or early Tuesday morning never heard back from them", "pics": null, "resp": null, "gmap_id": "0x888ccdb601ca4b99:0xff5808d1dee98c57"}
{"user_id": "103017914498183144802", "name": "Butch Skelton", "time": 1522158478356, "rating": 1.0, "text": "Sept 2016 James installed hard wood floors through out our new house, after many calls and many excuses as why he could not make it to the house.after floors were installed numerous calls to James to come and fix new floor only weeks old at this time.james came and looked and agreed that floors had to be taken up and redone.james had many excuses as why it was not his fault.james exact word was not to worry,i will take care of you,i promise!!!! fast forward to march2018 James has not done anything to fix the problem.so my experience with James at got wood was not a pleasant one. James never came back. I judge a man who keeps his word,his word and his work is not to be taken seriously.", "pics": null, "resp": {"time": 1522162159087, "text": "Let's tell the truth James come up and looked at the floors several times James did not go back in sand the floors because they had issues with the subfloor sagging over a 3/4 of an inch they had to also go back in and rebrace all flooring a year-and-a-half after the job was already done I told them to fix the subfloor before I would resend anyting because I wasn't doing it for free again it shouldn't be free this time but I told him I would do it for them so if everybody wants to talk garbage talk the right garbage or unload the truth"}, "gmap_id": "0x888ccdb601ca4b99:0xff5808d1dee98c57"}
{"user_id": "104131707366608549424", "name": "Jason Crowell", "time": 1584324124516, "rating": 5.0, "text": "Great people", "pics": null, "resp": null, "gmap_id": "0x888ccdb601ca4b99:0xff5808d1dee98c57"}
{"user_id": "116728461739989452164", "name": "Kendal Heart", "time": 1506526318435, "rating": 5.0, "text": "Best flooring store in the state.", "pics": null, "resp": null, "gmap_id": "0x888ccdb601ca4b99:0xff5808d1dee98c57"}
{"user_id": "117976511406048403174", "name": "Bosang Kim", "time": 1624443523557, "rating": 5.0, "text": "Excellent professionals provided better deals than other retailers.", "pics": null, "resp": null, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "100754277668689840974", "name": "Christopher Crain, D.Min.", "time": 1599262803140, "rating": 1.0, "text": "The installation was really a difficult process. Installation manager is way too busy. I could go into a lot of detail. However, I want to be gracious. Yet, I want to let potential customers know. Just be aware. Store personnel didn’t know what was going on.", "pics": null, "resp": {"time": 1599320611208, "text": "Hello Christopher, thank you for taking the time to post your review. We are truly sorry for the experience you received from our installation. It is never our goal to have an unhappy customer. We would like to look further into this for you if you would like to send us an email at LLResponse@lumberliquidators.com Jessica G. Customer Advocate."}, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "105556256629961530464", "name": "david middleton", "time": 1600370788405, "rating": 3.0, "text": "After install, weather warmed up and my floors popped up in places, contacted them in the spring, still no one cares to even look at their work and the problems we are experiencing . Buyers beware, very disappointed,they will sell new flooring ,but dont care about past customers floors . UPDATE, very nice crew came back,repaired problem flooring,as for now all is acceptable.", "pics": null, "resp": {"time": 1598292400238, "text": "Hi David,\n\nThank you for bringing this to our attention. First, we would like to apologize you are experiencing concerns with your flooring. We are truly sorry for your frustration. Your satisfaction is important to us, and we want to ensure any concerns you have are properly addressed as promptly as possible. We were able to locate your account and have notified your handling representative, as well as our regional managers. We will be in contact with you shortly, and look forward to resolving this matter.\n\nLauren R. Customer Advocate."}, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "117341755093537508213", "name": "Duane Ball", "time": 1613337775054, "rating": 5.0, "text": "Good place", "pics": null, "resp": null, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "108383730368496935219", "name": "Jeffery Moore", "time": 1600007069051, "rating": 4.0, "text": "Decent deal on lumber", "pics": null, "resp": null, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "118330985252623972869", "name": "Cheryl Mize", "time": 1583359271676, "rating": 5.0, "text": "Like the people there. Really help us pick the flooring we need.", "pics": null, "resp": null, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "117393023806145085030", "name": "Katie Ryder", "time": 1564949235992, "rating": 5.0, "text": "Excellent customer service. Excellent products.", "pics": null, "resp": null, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "115964333781021846115", "name": "Carol Thompson", "time": 1517588045353, "rating": 5.0, "text": "This place is awesome. I have bought bamboo flooring and laminate. I was pleased with both. The prices are the best.", "pics": null, "resp": null, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "111655038355730032722", "name": "Tammy Parker", "time": 1543155195658, "rating": 5.0, "text": "Very helpful sales associates... We purchased flooring for our new kitchen at a great price", "pics": null, "resp": null, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "100800331254048914469", "name": "mia fiterman", "time": 1527179711356, "rating": 4.0, "text": "The BEST prices on quality flooring....but you really have to keep calling to make sure you get everything you paid for...install is basically a good deal too unless you need anything removed(like carpeting)...", "pics": null, "resp": null, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "113141920140897445838", "name": "Wayne Martin", "time": 1572710931975, "rating": 4.0, "text": "There help was very helpful", "pics": null, "resp": null, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "103996230581180890820", "name": "Darrick Cooper", "time": 1546910838812, "rating": 4.0, "text": "Cheap prices and up to date flooring", "pics": null, "resp": null, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "104962054720002551831", "name": "Chase Tombrello", "time": 1532974962338, "rating": 5.0, "text": "Great price, friendly staff", "pics": null, "resp": {"time": 1533231093123, "text": "Thank you Chase for sharing your feedback! We strive to provide quality product at competitive prices along with the best customer experience. Enjoy your new floor.\n\nSandra H.\nSocial Media Specialist, Customer Care"}, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "114840230685006201913", "name": "Norris Crenshaw", "time": 1557005371860, "rating": 5.0, "text": "Lumber Liquidators great place to shop for flooring", "pics": null, "resp": null, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "117352455228175228618", "name": "Bridget Griggs PhD", "time": 1551557027404, "rating": 5.0, "text": "Can't beat free samples and great customer 👌 service", "pics": null, "resp": null, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "114188492051067441364", "name": "J.O.C. Anderegg", "time": 1604338510735, "rating": 5.0, "text": "😏🆗🆒🌝👍👌👀", "pics": null, "resp": null, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "104618180693643111820", "name": "Darla Hudson", "time": 1580891784930, "rating": 5.0, "text": "Great prices on flooring!!!", "pics": null, "resp": null, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "109455650233371626374", "name": "Lynda", "time": 1559319547137, "rating": 5.0, "text": "Helpful", "pics": null, "resp": null, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "104713173147341495632", "name": "Mike Brent", "time": 1519062170297, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "102843884744411803056", "name": "Corey Godwin", "time": 1542639969540, "rating": 5.0, "text": "Very helpful staff", "pics": null, "resp": null, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "115869347727623528923", "name": "Felix Hines", "time": 1510460462675, "rating": 4.0, "text": "Great prices, a lot of floors to choose from", "pics": null, "resp": null, "gmap_id": "0x88890dafc7a81b07:0xf322a512769caca9"}
{"user_id": "102729350135049851246", "name": "Ashlyn Jones", "time": 1605890811371, "rating": 1.0, "text": "Really wish I could give 0/5 stars because that's exactly what you will get working with Issis and Sons Flooring. During our previous home renovation, everything this company touched had to be fixed twice. Bathroom tile was laid un-level and a cracked piece was installed. Not to mention, the guy used so much self leveler it leaked through into our basement! A complete mess! 1500 SQ FT of LVP had to be removed and reinstalled due to no prep work involved and cracked pieces installed. Most quarter round was cracked and not even stained on the ends. Not to mention, they could not even provide ONE piece of missing quarter round that was requested for two weeks. POOR QUALITY AND CRAFTSMANSHIP. Stairs were stained twice and still had paint brush bristle hairs in the stain. Called it quits with these guys and will find someone to finish the job they already started. BEWARE...it's not worth your time or money.", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "102524139582533387217", "name": "daniel weber", "time": 1599797604248, "rating": 1.0, "text": "The guy I spoke with had a terrible attitude.\nI called there today and asked them to send one of their estimators over to do measurements and give me a bid on replacing carpet.\n\nAfter I told him that I would like to have the opportunity to introduce myself our company and products to them as well, he was very rude and said that he didn't need my business, then hung up the phone.\nI believe in doing business with organizations that want to do business with you and keeping money local.\nApparently this gentleman has all the business he needs and doesn't care about local businesses.\nDONT WASTE YOUR TIME HERE, WHEN THERE ARE MANY OTHER (LOCAL) FLOORING COMPANIES THAT WOULD LOVE TO WORK WITH YOU AND EARN YOUR BUSINESS.", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "102852085930204115695", "name": "mano de dios", "time": 1604430506994, "rating": 4.0, "text": "The guys at the ware house work hard to help you out . Good service the only thing I don't like about it is they need to have more tools for tile installers.", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "103046098306749220655", "name": "Shawn Armstrong", "time": 1538012385238, "rating": 5.0, "text": "After 3 months of getting the run around from two very non-professional flooring companies and walking over torn up wood, Issis and Sons stepped in to save the day! Not only were they quick to respond and sent a wonderful crew, they came when they said they would. We could not be more pleased with our beautiful flooring! We would recommend them above all others! Thank you Issis and Sons!", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "102870396781173999256", "name": "botcwc1", "time": 1522359143119, "rating": 5.0, "text": "Put 4 inch hardwoods in our master suite and closet. Excellent job. When I was putting furniture back I accidentally scratch the floor and Jimmy immediately send somebody out to fix it at no charge. Top-notch service. Thanks again :-)", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "100234670222462545800", "name": "David Gibson", "time": 1472273004446, "rating": 5.0, "text": "I can't say enough nice things about this company!  They have done work at my home and office, and always with great integrity and dedication to doing great work.  Great selection and pricing!", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "105328904311404814617", "name": "Michael Lawrence", "time": 1551878259499, "rating": 5.0, "text": "Largest selection of flooring in the entire state. The place to visit to purchase rugs. Knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "105044342388785199237", "name": "Paul Nurre", "time": 1583094439477, "rating": 5.0, "text": "Outstanding selection at reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "104233710197418078517", "name": "Sue Irwin", "time": 1520431421264, "rating": 1.0, "text": "I bought 3 rugs from Issis for my new house to put on my refinished hardwood  floors,   The rugs are beautiful and Issis came and installed them.  I later learned that the pads they had put underneath them were cheap and could deteriorate .  My the time I found out and replaced them my new hardwood floors already had spots where the pad had stuck to the floor and left a sticky residue.  You would think after buying expensive rugs that Issis would put better pads under them or at least tell you that you needed to buy pads.  The fact that they put pad under them that could ruin my floors is appalling .", "pics": null, "resp": {"time": 1521126820341, "text": "Sue, our apology for the slow response. I took over for the role of communication manager recently and would like to know what we can do to make you happy. Please email me at issis.furniture1@gmail.com or contact your sales representative directly. Thank you"}, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "117396401249301773631", "name": "Leigh Webb", "time": 1525319026725, "rating": 1.0, "text": "i had two staircases changed out from carpet to hardwood.  the work was well below average.  they returned and repaired most of the botched stain and paint, but it still looks below average.  the ironwork and railings were not replaced properly, and the wood on the stairs was not installed properly.  very disappointing as it cost over $10,000.\nthe salesman never returned my messages.  i took pictures to the billing manager-who agreed the work was substandard.", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "103824642941885797850", "name": "Bert Davi", "time": 1539993061559, "rating": 5.0, "text": "High quality flooring and the best service in town how can you beat that.", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "100292360040917359534", "name": "Davtopgun", "time": 1525351150680, "rating": 5.0, "text": "Great customer service, and good prices! Quality is top of the line!", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "109516307536481677410", "name": "Jeremy Jacobs", "time": 1575661090479, "rating": 5.0, "text": "Your one stop shop, for all your flooring needs.", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "118370281462972662792", "name": "Matt Herndon", "time": 1515190927290, "rating": 1.0, "text": "We will see how all of this works out.", "pics": null, "resp": {"time": 1521126837324, "text": "Matt, our apology for the slow response. I took over for the role of communication manager recently and would like to know what we can do to make you happy. Please email me at issis.furniture1@gmail.com or contact your sales representative directly. Thank you"}, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "109440576790090948440", "name": "Tammy Johns", "time": 1532047816326, "rating": 1.0, "text": "I found them very pushy, rude and arrogant. We decided not to buy from them before we walked out their door.", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "105733533758339015292", "name": "pandy agnew", "time": 1507298973982, "rating": 5.0, "text": "Best people to work with ever!", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "104559423800807966101", "name": "Donnie Sapp", "time": 1522250006878, "rating": 5.0, "text": "Excellent service and beautiful store", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "116104403017786492446", "name": "Dewayne Green", "time": 1551372802580, "rating": 5.0, "text": "Good business", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "110084280145127445433", "name": "Matthew Patmon", "time": 1513814014510, "rating": 5.0, "text": "Very knowledgeable", "pics": null, "resp": null, "gmap_id": "0x888924095d9f25f7:0xf1a402f10caa7af3"}
{"user_id": "116081808005636675352", "name": "Mary Brazell", "time": 1606145243646, "rating": 3.0, "text": "Installation was good. Had a problem after install and they would not return phone calls.", "pics": null, "resp": null, "gmap_id": "0x888e75ea456beb63:0xda98d90df70c552d"}
{"user_id": "117691720201799804369", "name": "Smitha challa", "time": 1580091574721, "rating": 5.0, "text": "This is my second time using Franks Flooring Installations. I was impressed with their amazing job. Quality of work is just excellent. They removed carpet and installed Laminate floors in Living room, Master Bedroom, closets and hallways. They also also put down Trim and cleaned up very well after they finished the job. Very professional crew. I plan to use them again and again in the future.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOHMmYSAJhvqJhQuZ7iP4o5zCl5qlojQp3Xb-Ng=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNbMY9UKPlrq1_guki5kAUuKm2-PqUQRa37PRL9=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e75ea456beb63:0xda98d90df70c552d"}
{"user_id": "108253285120386826567", "name": "Jim Riley", "time": 1611724854043, "rating": 5.0, "text": "Frank's team came  in and fixed our hardwood flooring that a previous installer screwed up badly.  His crew will return in February 2021 to complete the whole house.", "pics": null, "resp": null, "gmap_id": "0x888e75ea456beb63:0xda98d90df70c552d"}
{"user_id": "100116551391215333151", "name": "Uma Vajrala", "time": 1571886367635, "rating": 5.0, "text": "Franks Flooring Installations did an excellent job on my house. They installed Laminate floors on oddly shaped and angled room/nooks/closets and hallways. They were very professional and quality of work was great. Price was very reasonable. Very friendly and talented crew. I couldn't be more satisfied with the outcome. They cleaned up well and even went through everything with me before leaving the site. I plan to use them for my future flooring needs.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPSJzNL0omZQ_MuFKafVcW310THZ5Fym6WZ6yYJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOCTFPC0cSZySUEtrrLgMUgE_OUPKkp72IgUFUl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMrINi6w1MMYXakJzn40FyRr8XC7KPeHIgZA8u8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOVanmPVSyc3MxcbBdOSuLVrIeMoH3uc6DFqEui=w150-h150-k-no-p"]}], "resp": {"time": 1571912151723, "text": "Thank you Mr. Uma. Your business is greatly appreciated."}, "gmap_id": "0x888e75ea456beb63:0xda98d90df70c552d"}
{"user_id": "103860438254680297210", "name": "Barbara Sowell", "time": 1597671444253, "rating": 5.0, "text": "This was my 1st experience with Franks Flooring and if I could leave 10 ⭐️I would! They are exceptional! Very knowledgeable and professional. Plus, the crew that did our installation were the nicest and politest group of young men I have run across in a long time! Very concerned that they had done everything possible to ensure I was happy with their work! If I have flooring needs in the future, I won't use anyone else!!!", "pics": null, "resp": {"time": 1597831331759, "text": "thank you"}, "gmap_id": "0x888e75ea456beb63:0xda98d90df70c552d"}
{"user_id": "108788037180745906959", "name": "William Brendle", "time": 1597762772116, "rating": 5.0, "text": "You could not meet a more honest and caring couple than Frank and Randy. They are top notch people, as well as very competent flooring installers. They installed vinyl plank flooring in our living room, dining room, hallway, and three bedrooms.\nTheir price was very reasonable, and their workmanship even better.\nArrived on time, and worked their butts off til the entire house was completed in one day.\nWorkers were very professional and courteous.\nYou just couldn't ask for any better. We would give them ten stars if possible!!!", "pics": null, "resp": {"time": 1597831297189, "text": "Thank you"}, "gmap_id": "0x888e75ea456beb63:0xda98d90df70c552d"}
{"user_id": "109708231466792577102", "name": "Michael Barber", "time": 1527515439301, "rating": 5.0, "text": "Wow !  Our new hardwood floors look better than we expected. The floors look like they should be in a magazine. They got to work immediately, were Professional and courteous. The crew removed the old carpet, prepped the rooms and installed the floor all in One Day ! Great job Frank, Thank you", "pics": null, "resp": null, "gmap_id": "0x888e75ea456beb63:0xda98d90df70c552d"}
{"user_id": "103298403778313794097", "name": "Courtney A", "time": 1559326337681, "rating": 5.0, "text": "Hey did an amazing job the solid car stalled in my home. I would recommend for any solid hard needs!", "pics": null, "resp": null, "gmap_id": "0x888e75ea456beb63:0xda98d90df70c552d"}
{"user_id": "107542489802309672586", "name": "Robert Peterson", "time": 1481475885105, "rating": 5.0, "text": "I don't usually leave reviews but I was impressed by the quality of work completed by this company. Frank took the time to answer all my questions and concerns prior to the job being done. It is apparent that he is very knowledgeable about installing flooring. He completed the installation of my hardwood floors in the time frame that he said he would and was very cautious not to damage my walls while moving the furniture. His price was well below the other quotes I received and I feel he went above and beyond with his attention to details. I highly recommend this company and I will be using him again for any future flooring needs.", "pics": null, "resp": null, "gmap_id": "0x888e75ea456beb63:0xda98d90df70c552d"}
{"user_id": "114577833487140234326", "name": "Sarah Standford", "time": 1483489521576, "rating": 4.0, "text": "we had 2,050 feet  of hardwood flooring installed by this company and they did an amazing job.they showed up at the time they said  would and took time to put my furniture back  in each room, and I  like the way the owner was there all day and hands on. They ran my trim and caulked it for me .the only thing they said they don't do is paint trim or i would of gave a five star.", "pics": null, "resp": null, "gmap_id": "0x888e75ea456beb63:0xda98d90df70c552d"}
{"user_id": "111651595959890569250", "name": "Emily Davis", "time": 1488843936470, "rating": 5.0, "text": "Did an amazing job on our laminate flooring. Is a great company to do business with and we would highly recommended .", "pics": null, "resp": null, "gmap_id": "0x888e75ea456beb63:0xda98d90df70c552d"}
{"user_id": "115949345623768655032", "name": "Angela Hebert", "time": 1458864991808, "rating": 5.0, "text": "Did amazing job on my grandmothers floor!", "pics": null, "resp": null, "gmap_id": "0x888e75ea456beb63:0xda98d90df70c552d"}
{"user_id": "101987044554609727582", "name": "Dr L", "time": 1623824291342, "rating": 5.0, "text": "Great selection of flooring & wall - tile, laminate (wood & vinal) custom order and reference of skilled installers. Locations in Mobile & Baldwin county. Better selection than big box stores better quality also.", "pics": null, "resp": null, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "113600317468358978857", "name": "Irene Watsom", "time": 1619652496979, "rating": 5.0, "text": "Ronnie took my rotten uneven floor and made it beautiful again!  Thanks!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP0rf1naywvNG3X52y2i3fVdwYQDQGSmjSKXTYx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPGFdcDhb7lQwqS-TzWeZpcoQEoWpqh_jvIqqqx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNiYcvJhhPigIrPpu0zMz5J7p_O6V6mADtNrsPG=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPXf4zS4Ye9OH4CVGaeTzHU9V17uj4aGNzGj6N_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO7gAbVhwKhF3dwVacyhIBcm6gTNDGX1S6AeKw8=w150-h150-k-no-p"]}], "resp": {"time": 1619657259197, "text": "So glad to hear! We appreciate your business!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "114377944811510334065", "name": "Darren Armstrong", "time": 1620056536554, "rating": 5.0, "text": "Very nice selection of towels for floor and wall or any other decorative aspects the staff are wonderful very welcoming and has knowledge to help you complete your project", "pics": null, "resp": {"time": 1620064744829, "text": "Thanks so much for your review!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "114277536852777010523", "name": "Wade Parnell", "time": 1617391774360, "rating": 5.0, "text": "Wonderful people.\nVery helpfull.", "pics": null, "resp": {"time": 1617392827891, "text": "We appreciate your business! Thank you!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "108837936620002335712", "name": "Dan S", "time": 1597016944646, "rating": 5.0, "text": "Great people that go out of their way to help you find what you want. Great customer service and prices. Thank you!", "pics": null, "resp": {"time": 1597063375706, "text": "Thank You! We appreciate your business!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "101531334076742856456", "name": "marc guffey", "time": 1597343288646, "rating": 5.0, "text": "Awesome displays..lots of choice quality tile with a very knowledgeable staff", "pics": null, "resp": {"time": 1610142291883, "text": "We appreciate your review! Thanks!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "110890729795807530632", "name": "Anthony Welborn", "time": 1612902394327, "rating": 5.0, "text": "Wide selection and fair prices", "pics": null, "resp": {"time": 1612908716803, "text": "Thank you so much for taking the time to leave a review! Much appreciated!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "103945743370275520911", "name": "Larry Miller", "time": 1591204801926, "rating": 5.0, "text": "Great selection and wonderful list of installers. Been doing business there over 40 years.", "pics": null, "resp": {"time": 1610142323945, "text": "We appreciate your continued business!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "103067280062003932732", "name": "Chad kiper", "time": 1551905633628, "rating": 5.0, "text": "Shannon was super helpful. Great people. Great prices. They will not try and sell you something you don't need. Will purchase more flooring from these fine folks.", "pics": null, "resp": {"time": 1558540313838, "text": "We appreciate your business Chad! I am sure Shannon will be more than happy to help you with future purchases!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "118091682618536292293", "name": "Matthew Van Duyn", "time": 1610142969160, "rating": 5.0, "text": "Great selection of tile and great service.", "pics": null, "resp": {"time": 1610142303607, "text": "Thanks so much!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "107430239254515214934", "name": "Kim Leousis", "time": 1558494102325, "rating": 5.0, "text": "Been doing business with them since 2005. Good prices and quality. Staff are very helpful.  Location is accessible.", "pics": null, "resp": {"time": 1558540148106, "text": "Thanks so much Kim! We appreciate your business!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "109421172849716901630", "name": "AA N", "time": 1563879569367, "rating": 4.0, "text": "They always work with me ...to get me everything i need to complete my jobs....i highly recomend going here....they do try to be very helpful....", "pics": null, "resp": {"time": 1579801822739, "text": "We appreciate your feedback! Thanks!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "100647189132665736387", "name": "Steven Hall", "time": 1548356846238, "rating": 5.0, "text": "Easy to find location. The employees and owner  are helpful and wonderful local people to do business with. Walk-in are welcome, appointments are preferred.", "pics": null, "resp": null, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "102528142800489596063", "name": "Kathy Rhinehart", "time": 1563903818094, "rating": 5.0, "text": "Love them have used them for flooring since forever always happy with help recieved", "pics": null, "resp": {"time": 1579801801276, "text": "We appreciate your business! Thank You!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "109250779983167842814", "name": "John Tesch", "time": 1561390399607, "rating": 5.0, "text": "Fabulous experience wonderful personalities very knowledgeable in the business  Definitely recommend them", "pics": null, "resp": {"time": 1579801850797, "text": "Thanks so much for the 5 star review!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "111726982890578486040", "name": "RC", "time": 1579818846761, "rating": 4.0, "text": "Found the exact carpet I needed", "pics": null, "resp": {"time": 1579881035288, "text": "So glad we could help!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "115354375494675470886", "name": "Joel Minto", "time": 1565304274137, "rating": 5.0, "text": "Awesome service all around great company.", "pics": null, "resp": {"time": 1579801766368, "text": "We appreciate your feedback! Thanks so much!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "110278208421007821562", "name": "Warren Mills", "time": 1552424923766, "rating": 5.0, "text": "One of,the best place to go,if u building or remodeling ,,a great sale team,, with great knowledge,, with great materials.", "pics": null, "resp": {"time": 1558540246986, "text": "Thanks Warren! We have appreciated your business throughout the years!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "113034730970842333611", "name": "curtis powell", "time": 1503711358127, "rating": 5.0, "text": "High quality tile, great selection and price", "pics": null, "resp": {"time": 1579801898558, "text": "Thanks for your feedback! We appreciate your business!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "110887766334578521291", "name": "James Phelps", "time": 1556218668232, "rating": 5.0, "text": "Most friendly place in the world", "pics": null, "resp": {"time": 1558540218597, "text": "Thanks so much for the kinds words!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "101509955586661491628", "name": "Tiger Williams", "time": 1565286665809, "rating": 5.0, "text": "Was great.people are super", "pics": null, "resp": {"time": 1579801780548, "text": "Thanks so much for your business!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "108532491550946056580", "name": "Chuck Walls", "time": 1579604150464, "rating": 5.0, "text": "Selections good", "pics": null, "resp": {"time": 1579801735852, "text": "We appreciate your feedback! Thank You!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
{"user_id": "100755849156012219384", "name": "Nick Rivers", "time": 1557510396801, "rating": 5.0, "text": "Great place and great people", "pics": null, "resp": {"time": 1558540197686, "text": "Thanks Nick!"}, "gmap_id": "0x889a5265a0ef67b9:0x3272e984255c4d6d"}
