{"user_id": "102945757387788234536", "name": "Tj Murray", "time": 1619818551928, "rating": 5.0, "text": "Great little place!", "pics": null, "resp": null, "gmap_id": "0x889223d80138dd1b:0xc000178dac813098"}
{"user_id": "107898254940123771321", "name": "Vanholio !", "time": 1510862335835, "rating": 5.0, "text": "Geneva State Forest Lake is a great place for a picnic, to camp, and to fish! Very beautiful, clean, and quiet. When I was here, they had two clean port-a-potties. There is no drinking water or electricity.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN9-yJF1va9iHZysGAf2ZT8S2ky9gxhb2XFETwS=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889223d80138dd1b:0xc000178dac813098"}
{"user_id": "113830204158125638157", "name": "Michele Henderson", "time": 1582333920249, "rating": 5.0, "text": "Very quiet primative camping spot. Cost is $2 a day! And is 4 wheeler friendly most of the time (hunting days are posted). Bring everything, as it is very primitive having only picnic tables and 2 port a potties.", "pics": null, "resp": null, "gmap_id": "0x889223d80138dd1b:0xc000178dac813098"}
{"user_id": "106241693623361463939", "name": "Ben Wicker", "time": 1555877262381, "rating": 4.0, "text": "It's not to bad .", "pics": null, "resp": null, "gmap_id": "0x889223d80138dd1b:0xc000178dac813098"}
{"user_id": "117738218048807382100", "name": "Adene Duncan", "time": 1619369343333, "rating": 5.0, "text": "The conecuh National  forest  is a great place to live in", "pics": null, "resp": null, "gmap_id": "0x8891b0b268e5ef6b:0x99b59e2c2eb91b1f"}
{"user_id": "104992536336756105689", "name": "Emmons Crawley", "time": 1528942063026, "rating": 1.0, "text": "This is a good place if you only want to camp in campground only.They have most of forest blocked off and when we asked where we could park employees from ranger station told us where we could go, the the law showed up and said we couldn't be there and was talking about a $2000.fine plus vehicle being towed", "pics": null, "resp": null, "gmap_id": "0x8891b0b268e5ef6b:0x99b59e2c2eb91b1f"}
{"user_id": "108888339488895038571", "name": "Dermatology Residency Coordinator", "time": 1527611335602, "rating": 2.0, "text": "I was very excited to explore the trails, but once we got on them we discovered they had not been maintained in several months.  We got lost because the trail was not clearly marked.  For safety reasons, we ended up listening for cars to find our way back to the highway.  We almost stepped on a snake because the trail was so thick.  We had to cut through the swamp and brier bushes, but thank God we found our way to the road without sever injury.  Please maintain the trails, it was very pretty and worth seeing, but not at the risk of our lives or others.", "pics": null, "resp": null, "gmap_id": "0x8891b0b268e5ef6b:0x99b59e2c2eb91b1f"}
{"user_id": "105943151557768396358", "name": "Josh Bryan", "time": 1582420551557, "rating": 5.0, "text": "There's not a ton of options for hiking in southern Alabama, but this place is absolutely awesome at the right time of year! I prefer the cooler months of December through March. The Eastern long leaf pine habitat is unique and has a beauty of its own. I've hiked the entire North loop of the Conecuh Trail as well as the southern blue springs trail and I've gone 20 miles without seeing a soul. Once away from the roads, you may not hear anything but the wind in the trees and the soft steps of your feet on pine needles.  Rolling pine strewn trails, cypress swamps, and clear tannin stained streams. Your feet may get wet if it's rained recently but I don't consider it a problem.", "pics": null, "resp": null, "gmap_id": "0x8891b0b268e5ef6b:0x99b59e2c2eb91b1f"}
{"user_id": "106868057216147591068", "name": "Greg Wright", "time": 1555077853792, "rating": 1.0, "text": "The forest is burning over 600 acres today.Hen turkeys are nesting spotted fawns trying to survive.  Every thing else that can't get out of way will burn. That's bull", "pics": null, "resp": null, "gmap_id": "0x8891b0b268e5ef6b:0x99b59e2c2eb91b1f"}
{"user_id": "112188756293250953693", "name": "Julie", "time": 1528823913381, "rating": 5.0, "text": "Beautiful!!?", "pics": null, "resp": null, "gmap_id": "0x8891b0b268e5ef6b:0x99b59e2c2eb91b1f"}
