{"user_id": "108859647785200805632", "name": "thomas dunnavant", "time": 1516114538797, "rating": 5.0, "text": "I've been seeing Ms Emily for a couple months.  And, she has been helpful in providing me some new tools to deal with issues surrounding the death of my mother that knocked my train off the track.  While I cannot say that I am ready for the Cannon Ball Express, I am feeling so much better since i met her.  I have been treated with dignity and grace and recommend her without question.", "pics": null, "resp": null, "gmap_id": "0x8862134de65d352b:0x5d5a2757132814db"}
{"user_id": "109660291582448693516", "name": "Nisey", "time": 1618428042585, "rating": 5.0, "text": "Ali is absolutely wonderful! He was very informative and professional during my massage it was very much needed. I definitely will be returning. The atmosphere is great 👍", "pics": null, "resp": {"time": 1618515771449, "text": "Thank you very much! Looking forward to seeing you again soon."}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "108830532145799008526", "name": "Robett Robinson", "time": 1617921016550, "rating": 5.0, "text": "Great place to get relaxing therapy", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMXh6Qy6lbpORWZ4g6NKhujtUsoYdVpmjTg6D1z=w150-h150-k-no-p"]}], "resp": {"time": 1628474655639, "text": "Thank you very much! Looking forward to seeing you again soon."}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "107092883219053302397", "name": "KENNEDY SPIVEY", "time": 1599761787735, "rating": 5.0, "text": "Love this place staff very friendly and professional!!!!! Best massage in Montgomery check it out !!!!!\nKerry p", "pics": null, "resp": {"time": 1599779403901, "text": "Thank you very much Kennedy Spivey! We are happy to hear about positive experience! We appreciate your business."}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "104733641568860360924", "name": "Beverly Garrett", "time": 1552656097815, "rating": 5.0, "text": "Love Mind and Body Spa.  Great atmosphere.  I have referred several of my family, friends, and colleagues to them.  Personable and gives a great massage.  Ali has fixed my bricked up muscles several times.  211❤❤", "pics": null, "resp": {"time": 1552658409227, "text": "Awesome review Dr. Garrett. It's our purpose to help you feel your best and we can't wait for your next session. And as always we appreciate your business."}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "118045315829928795462", "name": "M N", "time": 1628943892066, "rating": 5.0, "text": "Foad has been working with me for 2 years now after 2 shoulder surgeries. He deserves 10/10 stars and has been a godsend! Love his encouragement and focus.  Have recommended Mind and Body service to my  friends!", "pics": null, "resp": {"time": 1569551745388, "text": "We are so happy to hear this! Thank you very  much for the kind words and taking the time to leave us a review. We look forward to your next visit!"}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "110074102381429718306", "name": "David Alexander", "time": 1579219504339, "rating": 5.0, "text": "Great service,  their therapy keeps me working. I recommend highly.", "pics": null, "resp": {"time": 1579223435070, "text": "Thank you! We look forward to seeing you again soon."}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "107317829958006579609", "name": "Jeff Welch", "time": 1579290826939, "rating": 5.0, "text": "Foad provides the best deep tissue and myofacial therapy in Montgomery. I recommend to anyone with back issues or sports injuries.", "pics": null, "resp": {"time": 1579295687608, "text": "🙏"}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "114644388759835800927", "name": "John Smith", "time": 1536768140275, "rating": 5.0, "text": "Foad at a time when my circulation was in bad shape rescued me with a deep Tissue orthopedic medical massage and workout weekly. My Doctor recommended him and was decision I ever made.\nCirculation is good and no more aches!", "pics": null, "resp": {"time": 1536775277974, "text": "I was pleased to welcome you to our practice. I look forward to seeing you again. And I appreciate your physician's confidence and trust."}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "104583054219891416098", "name": "Jorge Serafin", "time": 1524931427531, "rating": 5.0, "text": "My experience here has been extraordinary! I have had many different types of massages throughout the world, but my experience here has been the best overall. Foad has been outstanding in his treatment and recommendations.", "pics": null, "resp": {"time": 1579296076373, "text": "Thank you Jorge! We are delighted to hear that you had a wonderful experience with us."}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "113450126870700548610", "name": "Revewer Smith", "time": 1401068542532, "rating": 3.0, "text": "The massage therapist at this studio is VERY nice and personable, but his technique is not therapeuatic at all.  I left the massage session feeling worse.  His technique is just to massage and massage without regard to whether he is relieving tightness or not.  Unlike some of the other studios that have a technique, he doesn't really seem to have  a technique.", "pics": null, "resp": null, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "110161349051979801085", "name": "Jack Durham", "time": 1495747575900, "rating": 5.0, "text": "Always a relaxing experience to visit Foad at Mind & Body. wish I could go more often. Very knowledgeable about a variety of health and healing regimens. Also a fun guy to chat with. Always leave with a smile.", "pics": null, "resp": {"time": 1579530506347, "text": "🙏"}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "112239426179933751893", "name": "Larry Chapman", "time": 1536409043609, "rating": 5.0, "text": "Foad has been a faithful friend for 20 years. He is a good man and excellent at what he does. Countless times he has taken care of me and my family. Thank you Foad for running a first class business!!!", "pics": null, "resp": {"time": 1536697073355, "text": "Good afternoon Larry\nI wish to take this opportunity to thank you for your business for past 20 years.\nYou have paid me the nicest compliment possible. I appreciate your confidence and trust."}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "101877216692218287187", "name": "Mark McLendon", "time": 1495569222261, "rating": 5.0, "text": "Great people and top notch service.   I started coming in tons of pain and not only did the massage help but the stretches and exercise homework got me back on the road to health.  Can not say enough good things about Foad and his team!", "pics": null, "resp": {"time": 1580183000379, "text": "🙏"}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "116842888350493143380", "name": "Aaron Esfahani", "time": 1495321214739, "rating": 5.0, "text": "Foad and the whole staff at Mind and Body are first class. Likewise, the massages that I have had here are far better than what I've experienced home in Atlanta. Additionally, they specialize in sports and therapeutic treatments that will have you coming back for more. As an honest reviewer, I would have to say that you must try this place!\n\nAAE", "pics": null, "resp": {"time": 1580182901178, "text": "🙏"}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "112343840587637398948", "name": "Keith Blackwell", "time": 1495573123811, "rating": 5.0, "text": "Experienced my first massage at Mind  and Body today.  I could not  have  been more pleased with the experience - it was the best massage I have ever received.", "pics": null, "resp": {"time": 1580183008793, "text": "🙏"}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "111611133086853556981", "name": "Carrie Yates", "time": 1532448604430, "rating": 5.0, "text": "I began going to see Foad at Mind & Body a little over a month ago, and already, I can see a marked improvement in my symptoms. For example, I was unable to turn my neck all the way to the right for about a month when I first saw him.  Foad repaired that in two sessions.\n\nIn addition, he makes it an extremely comfortable and easy assessment process. I never got the sense that I was next in line, or that I needed to be in a hurry. The atmosphere is quiet, relaxing, and tranquil. He makes all of his oils home made, and they are incredible. He gives feedback, suggestions, and has a wholistic approach--all without making you feel like you've done something wrong, or haven't done something you were supposed to to take better care of yourself.\n\nVery reasonable priced, very effective, and very easy to do in the middle of a day.", "pics": null, "resp": {"time": 1532455370490, "text": "I wish to take this opportunity to thank you for your recent visits to my Wynlakes location. It was a sincere pleasure to be of service. I look forward to seeing you again."}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "114659564853457824937", "name": "Anne Mazyck", "time": 1495727120883, "rating": 5.0, "text": "Great experience. It definitely helped the headache. Ali is very gentle and very good.", "pics": null, "resp": {"time": 1580183032369, "text": "🙏"}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "114210002636935242760", "name": "Customer Critique", "time": 1477579916191, "rating": 1.0, "text": "HORRIBLE EXPERIENCE!!! I wouldn't recommend this place to my worst enemy. The therapist was late and I felt he rush through the massage trying to get himself back on schedule with no regard to me or my needs.  There was nothing relaxing or soothing about the massage.  I felt  exhausted and pretty beat up afterwards.  There was no balance or method to his technique.  Not worth the time or money.  DEFINITELY WILL NOT GO BACK!", "pics": null, "resp": null, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "104603451454883031829", "name": "L Skipper", "time": 1579525933483, "rating": 5.0, "text": "Foad is an excellent therapist.", "pics": null, "resp": {"time": 1579530430915, "text": "We are so happy to hear this! Thank you for the kind words and taking the time to leave us a review. We look forward to your next visit!"}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "113200937277869715303", "name": "Zsuzsa Rozgonyi", "time": 1495422477935, "rating": 5.0, "text": "Foad gives a 5 star massage. I highly recommend Mind & Body. Great atmosphere, great treatments! Love, love, love this spa!", "pics": null, "resp": {"time": 1628474717652, "text": "Thank you 🙏"}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "100977709089217049742", "name": "lens lens", "time": 1495888723129, "rating": 5.0, "text": "Foad is an excellent massage therapist. He can pin point and treat areas that create problems for other areas. He is highly recommended.", "pics": null, "resp": {"time": 1579530462836, "text": "🙏"}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "112677774953078673616", "name": "Arpi Sekeryan", "time": 1439171201615, "rating": 5.0, "text": "I have been getting massages regularly for years, and since I moved from Canada, I needed to find a massage therapist and fast...  Luckily, I found Mind & Body because Foad\"s Thai massages,  are by far the best!!", "pics": null, "resp": {"time": 1580182851325, "text": "🙏"}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "106248448958556616299", "name": "Mary Allinder", "time": 1496241883645, "rating": 5.0, "text": "I would recommend Foad and Ali to anyone searching for agreat place to destress and unwind . These two men have great skill in massage therapy and many more ways to get the best out of life! I highly recommend Mind and Body Holistic Spa!", "pics": null, "resp": {"time": 1579301407528, "text": "🙏"}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "113128647884259853962", "name": "Missy Mathis", "time": 1496333556218, "rating": 5.0, "text": "Best Massage in town! I highly recommend!", "pics": null, "resp": {"time": 1579296130258, "text": "🙏"}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "112534308495086610590", "name": "Ryan Powers", "time": 1495583939480, "rating": 5.0, "text": "Unbelievable! Not only did Foad relieve my lower back pain but he gave me specific stretches to help prevent lower back pain!", "pics": null, "resp": {"time": 1580183021159, "text": "🙏"}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "116201877092253496548", "name": "Susie White", "time": 1495851650825, "rating": 5.0, "text": "Foad has been my go-to massage therapist for at least 5 years now.  I wouldn't trade him for anything!", "pics": null, "resp": {"time": 1579530491523, "text": "👍👊"}, "gmap_id": "0x888e81ac40187dbb:0x798ddab6c31adbf5"}
{"user_id": "103342520922671677752", "name": "Nia Taylor", "time": 1628639795538, "rating": 5.0, "text": "I had a great first visit. I came in with back and neck pain and William, the owner, used his magic fingers to help me. He is clearly knowledgeable and passionate about what he does and gave me some great suggestions on how to help myself at home. Very nice guy and will definitely continue to come here.", "pics": null, "resp": {"time": 1628642121497, "text": "Thanks Nia! I'm so glad you enjoyed your visit.\n- William Henson"}, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "106354779625925884245", "name": "Leslie Dejohn", "time": 1624812185905, "rating": 5.0, "text": "William and his team are all excellent in what they do. I recently had a stretch session with William and he helped release areas in my hips and shoulders that were giving me a great deal of discomfort. He was careful to make sure that I was feeling the stretch in that specific area. He communicated with me each stretch and what I was supposed to be feeling. I would highly recommend a stretch session for anyone that is experiencing tightness in any area of their body. Can’t say enough about this group and their knowledge and professionalism. I have been seeing them regularly for at least 3 years.", "pics": null, "resp": {"time": 1624813516953, "text": "I'm glad you enjoyed your assisted stretching session Leslie. And thank you so much for the review!\n\n- William"}, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "102502941767836230418", "name": "Kelly Lansden", "time": 1628568063404, "rating": 5.0, "text": "I got a massage from Abbey Porte a few days ago for a chronic pain flare up and she did an amazing job! Last week I could barely function because I was in so much pain, but now I feel great! My pain dropped from a 7/10 to a 2/10. That’s major improvement! I highly recommend Abbey for pain management massage. She knows what she’s doing!", "pics": null, "resp": {"time": 1628599768805, "text": "Thank you so much for the review Kelly! We're so glad you enjoyed your massage with Abbey the other day! It's so good to hear that your pain levels have dropped so dramatically.\n\n- William Henson (owner)"}, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "108511350413598810877", "name": "soapy jones", "time": 1626794315177, "rating": 5.0, "text": "A wonderful experience with a wonderful group of people. I highly recommend and am looking forward to my next appointment!", "pics": null, "resp": {"time": 1626795261287, "text": "We're so glad you enjoyed your visit!  And thank you so much for taking the time to leave us a review."}, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "109464709578778561886", "name": "Mary R", "time": 1622330284675, "rating": 5.0, "text": "I’m so happy I found this place! I’ve struggled with back and neck pain since I was a teenager, among other things here and there, and now that I work in dentistry it’s been even harder on my back. I wanted to find a place that not only gave a relaxing massage, but could recognize and target my problem areas. William listened and explained what he would be doing and even gave me some at-home tips to get things loosened up. I’ve already booked my next appointment and can’t wait to see more results!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "104173410783560800899", "name": "Tiffany Postell", "time": 1618615184157, "rating": 5.0, "text": "Rob Ginwright did a great job focusing on my problem areas. He explained everything throughout the session and made sure I was informed about everything. He even gave me tips on things I can do at home, and I have continued to see improvement. Definitely looking forward to my next session.", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "103810863068125006105", "name": "Debbie Momma Dee Dee", "time": 1622045143576, "rating": 5.0, "text": "I went to APM with chronic pain in one shoulder. Abbey carefully and persistently worked on every muscle knot until I had complete relief! Her knowledge of the body muscles was extremely impressive and she knew exactly where the problem was likely occurring and how to solve it. I will be a regular from this day forward!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "103490356319127744152", "name": "Allison Daniel", "time": 1618752615248, "rating": 5.0, "text": "Rob Ginwright has helped me so much. He was very proessional and carefully explained everything he was doing. I feel better than I have in years. I can't wait to go back.", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "107839408922558243109", "name": "Jill Nelson", "time": 1592070855855, "rating": 5.0, "text": "Clean and very quiet. The therapist was very nice and willing to help my pain area. She was very social with me which was very nice and just over all a great therapist. Everyone there was very friendly and nice. I would definitely recommend this place for all your needs or just for a day of relaxing!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "113675268955193436188", "name": "Chyna B.", "time": 1590687013336, "rating": 5.0, "text": "Clean and relaxing space. I had a male therapist for a deep tissue, he was great, I left feeling relived, I will be back!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "113796691226010652534", "name": "Amy Spinks", "time": 1541868540208, "rating": 5.0, "text": "I received a 90 minute massage treatment with Alex and she was WONDERFUL!!  She was very professional and very helpful in relieving my pain all while providing a relaxing, \"pampered\" massage!  I suffer with Osteoarthritis and had been told this treatment would help with day to day muscle tension.  It was true and I will be returning for more massages with Alex!!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "102282146720602638724", "name": "Frances Tombrello", "time": 1567116293238, "rating": 5.0, "text": "The Physical Therapist was very kind and very interested to help me.  This was my first visit and have another appointment on August 30th. I felt very comfortable ,.  Would recommend Mr. Henson to my friends and family. (One of my family members goes every 2 weeks and has been doing this for several years.", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "105006425046698860773", "name": "Mona Squeels", "time": 1541725877098, "rating": 5.0, "text": "I just had my first massage by Alex and it was absolutely wonderful. She was informed, and made sure I understood everything. It was wonderful to be able to explain what was wrong and her explain what she was going to do to help! I cannot wait to go back.", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "100844034547003236990", "name": "Cindy Carruba", "time": 1581391037647, "rating": 5.0, "text": "So wonderful! Went in for a extreme pain in shoulder and next day it was gone! Definitely recommend this place for any kind of massage you need.", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "100406468371299396529", "name": "Drew Moore", "time": 1549977585818, "rating": 5.0, "text": "I was having severe sciatic nerve pain. I had a 90 minute session with Alex that helped tremendously. Very knowledgeable and professional. Wonderful place conveniently located.", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "104387442651341842898", "name": "David Burrowes", "time": 1542406928812, "rating": 5.0, "text": "Great! They have helped me tremendously! I thought I needed back surgery, but Alex got me feeling better and able to do more than I have in a few years. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "112332974425247030435", "name": "Shella Sylla", "time": 1408378728636, "rating": 5.0, "text": "William is an extremely skilled masseuse. He took the time to assess my unique situation, and worked to alleviate muscle pain, soreness and even some structural issues that I had mentioned to him.  I love working with people who are obviously passionate about what they do, and William exemplifies this through his skill and mastery of his craft.  I highly recommend that anyone who is looking for more than your typical \"feel good\" massage and who wants to get real therapeutic results should go and see him.  Totally worth the investment!!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "110404902367163116336", "name": "Cindy L Bili", "time": 1559523308017, "rating": 5.0, "text": "William worked on trigger points in my neck and shoulder.  I have not had pain since my first visit, which was 3 days ago and I have had chronic pain for years.  I am so excited to have found a massage therpist that I truly feel can help me with eliminating back pain!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "107605466730854496066", "name": "Bob Berry", "time": 1429576581211, "rating": 5.0, "text": "Jennifer's 30 minute deep tissue was just what I needed. I had several knots that she worked out and the massage results lasted a long time. I am sold on these folks and they are very convenient to I65 at Hwy 31 (in Hoover) and are very professional and accommodating. Great massage!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "114745880743169486317", "name": "Julie Jefferson", "time": 1515890984008, "rating": 5.0, "text": "I had a wonderful massage with Alex. She was very professional and thorough.  My back pain was greatly relieved.  I would definitely recommend her to others, and will be returning myself.", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "112228177113767646209", "name": "Morton Ulakovits", "time": 1371772402018, "rating": 5.0, "text": "I've been here 3 or 4 times now.  They do a great job at catering to your specific issues.  For me, a massage every month is just what I needed. Friendly, professional, convenient and affordable would be how I describe them.", "pics": null, "resp": {"time": 1432704978407, "text": "We are glad to hear that you are satisfied with the services we provide. Thank you for your feedback."}, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "110535660584024528790", "name": "Lauren Hughes", "time": 1538425876310, "rating": 5.0, "text": "I've struggled with persistent muscle tension in my upper back, neck, and lower back for quite awhile. Physical therapy and dry needling have helped tremendously, but the muscle tension was still present all day every day. The tension makes it difficult to maintain proper posture and contributes to lordosis in my lower back. After one treatment from William last week, I can see a big improvement. Tension in my chest is greatly reduced, which makes maintaining proper posture much easier. Any headaches I've had since then are mild, and I've had less upper and lower back pain. I still have a long way to go, but I'm excited about the progress made in just one session!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "116043071146616510899", "name": "Megan Therrien", "time": 1425518206680, "rating": 5.0, "text": "I highly recommend Alternative Pain Management! About 6 months ago, I finally decided to go to a massage therapist on a regular basis to try and deal with recurring upper back problems, headaches, and TMJ issues. I have had massages all over the place (massage envy, spas, other therapists), and I don't think I have ever met a massage therapist as attentive and creative as William. Even though he is working on the same places, every appointment is a new experience and he ALWAYS manages to find little places I had no idea were even hurting! William is easy to talk to and work with, and I appreciate that he offers advice and tips to help manage my problems in between visits. I can't say enough good things about William and Alternative Pain Management!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "118387947846918586869", "name": "Matt Butler", "time": 1488476730161, "rating": 5.0, "text": "Went to see William at APM at the suggestion of my orthopedist because of a nagging muscle knot in my back. This was my first visit and William was pleasant and thorough with his explanations of what he was going to do and what I should expect. I have noticed some improvement with my back but he mentioned it could take a couple of sessions to help release everything. I go back in a week to continue the work on my issue and will look forward to continued relief.", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "118159708627161914624", "name": "Kathryn Groat", "time": 1539891632005, "rating": 5.0, "text": "My husband and I have been going at least once a month for over 2 years now for therapeutic massages. Jennifer and William are both very knowledgeable and professional!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "117647040352632700858", "name": "Brandy Wills", "time": 1568847169842, "rating": 5.0, "text": "Jennifer and William are a great team! Jennifer has helped immensely with my pain management! I highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "112788239579290048474", "name": "Greg Mullinax", "time": 1443465581696, "rating": 5.0, "text": "William at APM is very skilled in deep tissue massage. I've had 4 visits now and every time my condition has improved dramatically. He is treating me for multiple injuries and aches. I am very happy with the results. I highly recommend William.", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "109195136131153328429", "name": "Heather Batey", "time": 1499794458497, "rating": 5.0, "text": "William is a knowledgeable and extremely skilled massage therapist. He uses a variety of techniques with different patients to achieve the best possible outcome. He is trained in myofascial release and neuromuscular therapy as well as the more popular Swedish and deep tissue techniques. The atmosphere is relaxed and inviting, and I always leave feeling so much better. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "112768851534048657257", "name": "Shane Nicholas", "time": 1503070711408, "rating": 5.0, "text": "I've been going to Alternative Pain Management for about 6 months now and the results are incredible. I have had a dull pain at the base of my skull for a decade and within a few treatments it was completely gone. No more dull pain. No more headaches. William is amazing and didn't stop at treating the symptoms but worked until he found the source. As someone that dealt with recurring pain for years and thought there was no hope, I can't recommend Alternative Pain Management highly enough. Best in Bham!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "100048505403462200009", "name": "Monika Croom", "time": 1395328935367, "rating": 4.0, "text": "At first I wasn't sure what to expect as I have always gone to a spa type massage deal, but because this is for an injury/pain, this alternative management was the next step for me outside doctors and chiropractors.  Although walking in I was reluctant because the set up was not what I had expected, I found it to be very clean and comfortable.  William Henson is very professional and knowledgeable in this field.  He was very soft in his approach, but his hands were really strong to really get into my pain issues.  I have only had 1 treatment but I have made an appointment for another as I experienced a good bit of improvement off one treatment.  At the end of the session, he also took the time to show me exercises specific to my ailment.", "pics": null, "resp": {"time": 1396137339413, "text": "Thanks Monika, I'm always  happy to help in any way that I can.\n-William"}, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "104244945155147271483", "name": "DannaMichellRay", "time": 1430930533357, "rating": 4.0, "text": "I have lower back pain and trying to avoid another epidural. My pain reoccurred from a yoga class that was a little advanced for me which left me in pain - again.  A friend recommend Jennifer @ APM so I gave it a try.  Jennifer was well informed with my injury and knew exactly what I needed.  To be honest, deep tissue massage is not a relaxing and soothing kind of therapy but it's specific to help relieve my very tight muscles and connective tissue. I instantly felt some relief and looking forward to my second session.", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "108595587190665788538", "name": "Izz Noland", "time": 1541624416155, "rating": 5.0, "text": "Great service, a hidden gem in Hoover. Alex did a wonderful job explaining everything and working on my extremely tense back!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "105765186332602571729", "name": "Jessica Peterson", "time": 1473969386490, "rating": 5.0, "text": "I had significant neck and  shoulder pain from answering the phone and holding the phone up to my ear with my shoulder. William used myofascial techniques on me and I have never felt better! It was the least painful and most effective experience ever! Thanks William!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "104243155491585199976", "name": "Ritter Cindy", "time": 1538525888964, "rating": 5.0, "text": "Very professional, relaxing atmosphere, great massage and pain relief. I highly recommend .", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "101261763699298549026", "name": "Siera Justice", "time": 1538933242154, "rating": 5.0, "text": "William is a wonderful- he is very efficient in patient care, pain management & very thorough. I would highly recommend his services!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "107419470653082555467", "name": "Daniel Moore", "time": 1434006587367, "rating": 5.0, "text": "William has done a great job in targeting the pressure points in the nerves causing my pain from stenosis and sciatica.  As an artist, I spend hundreds of hours per month seated at the easel with my muscles locked basically into the same position.  My weekly visits help loosen and restore those muscles back to normal.  Plus, William works wonders at getting cricks out of my neck and shoulders.  It should go without saying that I highly recommend APM!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "116455925925992665189", "name": "Ashley McNaughton", "time": 1446748000321, "rating": 5.0, "text": "Jennifer is great at deep tissue work.  I am about to schedule my second massage with her.  The hunt for a great massage therapist for my pain is over. Thank you!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "112641316195091318331", "name": "Beth Gray", "time": 1432937215366, "rating": 4.0, "text": "I gave my husband a SpaFinder gift card for Christmas. We checked to see which places would take them and found Alternative Pain Management. Though the reception area was plain, his initial impression quickly changed once he met Jennifer. After a brief assessment, she was able to find the trouble spots in his back and neck and was able to work out the knots thoroughly. She even found new places that he had not previously realized were an issue. Her demeanor and professionalism were top notch and the atmosphere was very quiet and relaxing.  We are making another appt and would highly recommend Alternative Pain Management.", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "113675268955193436188", "name": "Chyna B.", "time": 1590687013336, "rating": 5.0, "text": "Clean and relaxing space. I had a male therapist for a deep tissue, he was great, I left feeling relived, I will be back!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "101261763699298549026", "name": "Siera Justice", "time": 1538933242154, "rating": 5.0, "text": "William is a wonderful- he is very efficient in patient care, pain management & very thorough. I would highly recommend his services!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "105941392765896790676", "name": "Milton Malone", "time": 1472600815592, "rating": 5.0, "text": "Very professional staff. I am very happy with my results and will be using them in the future for massage therapy. :)", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "114388102344313168619", "name": "Yan Zhu", "time": 1444842035023, "rating": 5.0, "text": "Excellent therapist, really works on your body and helps you with your injury. Professional and helpful. I highly recommend it.", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "108595587190665788538", "name": "Izz Noland", "time": 1541624416155, "rating": 5.0, "text": "Great service, a hidden gem in Hoover. Alex did a wonderful job explaining everything and working on my extremely tense back!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "104243155491585199976", "name": "Ritter Cindy", "time": 1538525888964, "rating": 5.0, "text": "Very professional, relaxing atmosphere, great massage and pain relief. I highly recommend .", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "106325809401529365434", "name": "Carol", "time": 1538940820823, "rating": 5.0, "text": "The massages I get from William is one of the things that make it possible for me to keep moving.", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "113461451541816982295", "name": "Anna Holmes", "time": 1544811298958, "rating": 5.0, "text": "They have helped me deal with chronic pain. Alexis is wonderful.", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "103128026177502589070", "name": "Bart Styes", "time": 1566139413930, "rating": 5.0, "text": "They helped me SO MUCH with recurring back pain!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "100492120550470464623", "name": "Luciana Silva", "time": 1540820387228, "rating": 4.0, "text": "Alex did a great job. I'll go to her again.", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "106325809401529365434", "name": "Carol", "time": 1538940820823, "rating": 5.0, "text": "The massages I get from William is one of the things that make it possible for me to keep moving.", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "103128026177502589070", "name": "Bart Styes", "time": 1566139413930, "rating": 5.0, "text": "They helped me SO MUCH with recurring back pain!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "105250499473408041865", "name": "Jerry Little", "time": 1463058383915, "rating": 5.0, "text": "Great experience.  Procedure was thoroughly explained.", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "116867098584452979799", "name": "Pam Thomas", "time": 1454516944920, "rating": 5.0, "text": "Jennifer is great and has helped me tremendously!", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "117685222110651323672", "name": "Zachary Allison", "time": 1540690083857, "rating": 5.0, "text": "Great experience", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "111387319643145066680", "name": "Kurtis Moore", "time": 1630695953019, "rating": 5.0, "text": "Very professional environment. William communicated exactly what his plan was and he relieved my pain within 60 minutes. I definitely recommend William and the team at Alternative pain management.", "pics": null, "resp": null, "gmap_id": "0x888918bb2ef21d6d:0x83b0b69b204d6017"}
{"user_id": "110490887771552467724", "name": "Drea Burbank", "time": 1622742625785, "rating": 5.0, "text": "Knowledgeable and friendly yogis. Great studio, I recommend the triple-threat!", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "112432779481173834847", "name": "Brian Morton", "time": 1586116963658, "rating": 5.0, "text": "Best yoga facility in Birmingham by far. Very skilled staff with credentials a mile long. Excellent classes you will never forget. Teacher training available. Seminars taught by famous yogis from around the world. They have a true hot room with humidity control and CO2 sensors. Super clean as well. I love the Zebra mats that challenge my balance and protect my joints. They are also great for falling out of inversions..", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "116869883255579409532", "name": "Beverly Berry", "time": 1586127178559, "rating": 5.0, "text": "There is no place like Kiva Hot Yoga! I love all of the instructors and the atmosphere of the studio is second to none. The vibe is welcoming and the workouts are energizing and addictive. Come on over to the wild side and join the Kiva family! I promise you won’t regret it!", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "112525114839812800031", "name": "Joy Gilbert", "time": 1595861928075, "rating": 5.0, "text": "Love love love Kiva. I hadn't done hot yoga in about 3 years, due to moving to Alabama. I had missed it so much and was so thrilled to have found a studio in bham. They always make you feel so welcome, and go the extra mile to try to get to know you. Definitely recommend :) Trina is the best!!", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "104778612983319517697", "name": "Shannon Tyndall", "time": 1582824137678, "rating": 5.0, "text": "I loved yoga classes that I attended in Mobile but when I moved back to Birmingham, I couldn't find my yoga \"home\" until I came to Kiva. The truly do a phenomenal job. The instructors are great at encouraging you and they really seem to care about your health and well being. They have a great mix of varying levels of classes. I enjoy feeling challenged but having more zin options. I would highly recommend trying no matter your level of experience.", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "110966965030010024882", "name": "Carneisha Cain", "time": 1593467804249, "rating": 5.0, "text": "This is a great hot yoga studio in Alabama. I have only been a couple of times but everyone is very welcoming and management will work with you if you have any issues.", "pics": null, "resp": {"time": 1593515619915, "text": "It was great to have you practice with us again, Carneisha!"}, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "101610144769610565689", "name": "Raquel T Green", "time": 1573654072847, "rating": 5.0, "text": "First class was great! So happy for the invite Christa. Never thought I would be comfortable in a yoga class, but the  exuberant reception and calming mood made for a most memorable first time yoga experience. Thank you everyone at Kiva Hot yoga, from reception\nto instructor, as well  as fellow patrons!!!\nNamasté", "pics": null, "resp": {"time": 1577390159093, "text": "Come back when you can, Raquel!"}, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "117175862414254975744", "name": "Amanda Darby", "time": 1548451473149, "rating": 5.0, "text": "This is such a fun way to get both exercise and care for myself mentally and spiritually. I've also lost 20+ lbs since starting about 4 months ago and coming consistently several times per week. I love the variety of the classes so I never get bored. And the staff is always so friendly and helpful. This is a perfect fitness regimen for anyone at all, inexperienced or a professional yogi!", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "117106647012003986264", "name": "Megan Elliott", "time": 1550071094824, "rating": 5.0, "text": "Love everything about it!! Incredible workouts with teachers who take the time to demonstrate, correct and challenge you. Every skill level is welcome and there is no judgement. The showers with provided blow dryers, brushes, hair bands, shampoo, etc. are an added bonus. Love Kiva!", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "110466523540148810808", "name": "Tara Rosschile", "time": 1569546067110, "rating": 5.0, "text": "Hot yoga was literally HOTT!! The instructor did her thing! As a first- timer, she didn't make me feel incredibly awkward or humiliated. I especially enjoyed the calming aspect of the whole experience!", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "100235986588481968801", "name": "Laura Nelson", "time": 1555807260959, "rating": 5.0, "text": "This place is the real deal! Nothing is short changed here!! The instructors are all very helpful and knowledgeable. Even the members are very friendly !!! You really become family when you join Kiva Hot Yoga 律‍♀️", "pics": null, "resp": {"time": 1569084323161, "text": "We love that you’re part of the fam, Laura!"}, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "111075738311490048356", "name": "Amy Burdette", "time": 1547825193537, "rating": 5.0, "text": "I absolutely loved coming back. It's been 4 years since my last class and I'm kicking myself as to why I left for so long! I always feel like a brand new woman walking out of Kiva. Awesome job.", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "105878725245345733386", "name": "ML Davis", "time": 1425611135673, "rating": 5.0, "text": "I love Kiva. It is beautiful, very clean and everyone who works here is super kind and welcoming. When I first came I had never done yoga before. The teachers were very friendly and helped me a ton! It is an amazing workout and now I'm addicted. My husband is a competitive cyclist and rock climber -- he comes to the class because it builds his core strength and flexibility.\n\nI can't recommend Kiva enough!!", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "111871004572829464761", "name": "Jeff Johnson", "time": 1522294025681, "rating": 5.0, "text": "Great experience! Great for ‘rehab’ of every kind of sports injury practically. Provides a platform base for every other form of activity movement.\n\nALL (100%) of the instructors are dedicated and caring individuals who are very knowledgeable and helpful.\n\nExcellent for weight loss also!", "pics": null, "resp": {"time": 1527793180837, "text": "Great!  Glad to here!  Look forward to seeing you!"}, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "102393071345151839526", "name": "Hemali Patel", "time": 1425655770976, "rating": 5.0, "text": "I have thoroughly enjoyed my experience at the studio over the last year and a half. The entire staff is very motivating, courteous and friendly. The studio is always very well maintained. I always leave with a very satisfying and fruitful feeling that this is the best thing I've done for myself today. Would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "102854254338274016769", "name": "Aubrey McCravy", "time": 1547748689040, "rating": 5.0, "text": "Everything from the atmosphere when you walk in to the atmosphere the instructor creates during the class.My classes at kiva have allowed me to experience a focus in time and awareness. Probably because I’m trying very hard to not die. 😂\n\nI’ve loved every class and can’t wait until my next one! P.s. Mary Lou has a unique training personality that I’ve never encountered anywhere else and I love it! Her ability to lighten the moment and allow true respite through her words and then immediately create a focus and intensity in the next set is incredible.", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "110951650743737742644", "name": "Erin Cornelius", "time": 1426047927524, "rating": 5.0, "text": "\"The moment I finished my first class at Kiva Hot Yoga...I was in love with it!  I was welcomed with a huge smile and I just felt I was exactly where I was meant to be.  This group of incredible instructors are so motivating and loving.  Life is challenging and every single time I walk out that door at Kiva...I am stronger than I was when I walked in.  What a beautiful way to approach the world...stronger, more confident, and definitely  equipped just the way we were made to be.\"", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "113528413901114356849", "name": "Cambro Living", "time": 1447274424833, "rating": 5.0, "text": "This studio has been life changing. I dropped in having never taken a real yoga class about 5 months ago. I instantly felt at home, and know I would be spending a lot more time here. Since then I have become a member at the studio and have grown to love my teachers, and the other students here. The physical benefits have been awesome, but have been vastly outweighed by the mental and spiritual ones that I never thought I would care about. The staff is incredibly knowledgable, the studio is clean, and the classes are fantastic.\nDrop in meet the staff and take a class that will make your week WAY better!", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "103303727423021356042", "name": "Frank McGough", "time": 1518093705668, "rating": 5.0, "text": "Nicole, Pamela, Erin and Mary Lou are the best. Make me feel comfortable as the beginner I am. However truly interested in seeing my progression in Yoga. Great instructors, better people.", "pics": null, "resp": {"time": 1527793729855, "text": "Thank You!  Great to hear!"}, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "103121356489185326612", "name": "rebecca gibb", "time": 1563491336415, "rating": 5.0, "text": "Great facility, Superior instructors, variety of classes and times, one always feels welcome with warm friendly faces, clean and well maintained, easy check in and great merchandise!  I highly recommend Kiva Yoga!!!😊😊😊", "pics": null, "resp": {"time": 1569084225736, "text": "Thanks, Rebecca!"}, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "114075691480492567461", "name": "ann miljus", "time": 1514515867431, "rating": 5.0, "text": "Kiva hot yoga is life changing. The hot 90 class has made my everyday life more peaceful and centered. My body has become stronger and more balanced.", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "112209540432766064366", "name": "Taylor Berger", "time": 1514470609881, "rating": 5.0, "text": "Great traveler special. Teachers were professional and fun. Studio was really nice - one of the best I’ve been to in almost a decade of practice.", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "105753604722721108332", "name": "Kimberly Paige", "time": 1574257877452, "rating": 5.0, "text": "Great instructors that welcome you to go at your own pace.", "pics": null, "resp": {"time": 1577390127918, "text": "Thanks, Kimberly!"}, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "114653477488973662747", "name": "Alyssa Gray", "time": 1369116715122, "rating": 4.0, "text": "I tried out two other Yoga studios before settling into Bikram.  I am a bit of a health nut so I have made Yoga part of my weekly routine for fitness.  I feel much more relaxed and in tune after I leave the studio.  Would recommend to first timers.  Got to give it a shot.", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "111935595099546980986", "name": "Heather Coleman", "time": 1565483378421, "rating": 5.0, "text": "Kate, the owner, is an amazing person and has gathered an amazing group of teachers and staff creating the most wonderful, safe, supportive, empowering environment. I can’t say enough great things.", "pics": null, "resp": {"time": 1569084131222, "text": "We love you and miss you, Heather! Come back when you can!"}, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "111558048076473397000", "name": "Kim Cullum", "time": 1567997507268, "rating": 5.0, "text": "The instructors I’ve had so far ensure beginners don’t feel out of place.  I also like the flooring better than carpet that is in most Bikram studios.", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "112103654477449931965", "name": "Ben Cornelius", "time": 1501702912450, "rating": 5.0, "text": "Everything!  Especially the instructor... that Erin Cornelius is special!!  But really the whole experience at Kiva is special.  You can tell it's more than just a YOGA studio... it's a yoga EXPERIENCE!!", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "115788590715832661068", "name": "Nina McBride", "time": 1551843809119, "rating": 5.0, "text": "Well-maintained, clean studio with friendly and helpful staff. Large hot room with great ventilation and even heat. Instructors are all encouraging and well-trained to deliver 26/2 dialogue.  Plenty of class times with variety of offerings. Everything from Bikram to Pilates to Yin classes.   I love coming here whenever I’m in town!", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "106090294999500898519", "name": "Christina Knox", "time": 1492001255985, "rating": 5.0, "text": "I highly recommend Kiva Hot Yoga! The staff is amazing and the studio is always pristine. I look forward to classes and feel SO good after a core body workout!", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "118117071019150288930", "name": "Paula Eckert", "time": 1532363607286, "rating": 5.0, "text": "Very healing environment. The staff is kind and understanding. It's a great place to learn yoga.", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "117357127838627898781", "name": "Lyndsay Blohm", "time": 1500213220833, "rating": 5.0, "text": "The classes are super fun and engaging. The instructors are encouraging and patient. The facility is clean and inviting. Everything was awesome!", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "118286724670868315023", "name": "Mariya Tytell", "time": 1389745856877, "rating": 1.0, "text": "I have been practicing various types of yoga for twenty years.  Their classes are alright.  Nothing special.  But the teachers are VERY RUDE and arrogant.  Now, I know Bikram yoga is supposed to be \"tough\" and more structured, but these people's rudeness and inappropriate comments cross all bounds of what I would consider \"good business practice.\"  They made me buy a monthly pass to try one class, but I will not be back after the month is up.", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "116733479846241841065", "name": "Angelean Bibb", "time": 1492570122443, "rating": 5.0, "text": "Obtaining a great workout.Sweating out toxins.Improving my mental physical and spiritual wellbeing.Great stress reliever.Gaining strength becoming more flexible.Increasing stamina.Hot yoga gives me an edge in all my other activities (swim,bike,run,golfing,bowling). Mood enhancer.Just a powerful total body work out.", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "101835146142084204848", "name": "Liz Malcom", "time": 1426443331260, "rating": 5.0, "text": "When i first came to a Hot yoga class at Kiva, i was scared and hadn't done much yoga before, but the teachers really put me at ease by telling me no one has ever died in a Hot yoga class. ha ha. I had been experiencing ongoing back problems since an injury at 19 yr old and after one class my back didn't hurt anymore! I was hooked and kept going back! I loved the way i felt afterward and it has been a transformational 3 years, where my diet has totally changed and I've lost weight and feel great!\nThanks Kiva!\nLiz", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "109869752454534726121", "name": "Jessie Chestnut", "time": 1562699661217, "rating": 5.0, "text": "I enjoy the 6:15 am class with Holly. It's a great start to my day!", "pics": null, "resp": {"time": 1569084209411, "text": "That early morning crowd! You all are a special breed! Much respect!"}, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "105106370473023739120", "name": "Layla S", "time": 1532542275329, "rating": 5.0, "text": "The studio and class space is very clean and has some pretty great amenities (showers, towels, etc) that definitely come in handy after a hot yoga class where you've been sweating profusely.\n\nThe teachers I've had class with so far were all excellent. They're inclusive, welcoming, generously kind-spirited, and non judgemental - those qualities are what one should expect from a good yoga teacher. The teachers create a great learning environment where every student (not just the advanced ones doing fancy things) feels important and encouraged.\n\nThe classes I've taken during the week in the afternoon and evening were both very well attended and had students at all levels mixed in. The teachers did a great job making these all-levels classes interesting and engaging for everyone.\n\nThe teachers are exceptionally skilled at recognizing how their students are doing students and adapting the flow of the instruction accordingly. I've seen a number of classes where teachers abandon beginners in down dog or child's pose for 2-3 minutes while they take advanced students through more showy asanas that's always a huge bummer. There's none of that sort of teaching at Kiva, which I love. I'm on the advanced side of things and I was sufficiently challenged by the additional options for intensifying the asanas seamlessly suggested during the classes.", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "106655156503769603107", "name": "Risha Tenae", "time": 1546228960021, "rating": 5.0, "text": "This is the studio where I took my very first Bikram class in 2013. I wasn't new to yoga, had been practicing off and on for 15 years. But, Bikram was intimidating, especially at the large studios in L.A.(where I lived before moving to Birmingham). After taking my first class at Kiva, I was hooked! I loved the studio and the teachers, and Kate. I moved away  from Alabama in 2014 but I took my Bikram practice with me and Kiva will always be \"home\". They have a great Traveler Package that made this week long trip back to Birmingham even better.", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "103485879266226264221", "name": "Lisa Brown", "time": 1526587984960, "rating": 5.0, "text": "I love the staff and the professional atmosphere ! It has been an amazing journey to wellness .", "pics": null, "resp": {"time": 1527793128603, "text": "Thank you very much.  We appreciate your comments and will pass them on to our staff.  Look forward to seeing you!"}, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "109594819367879453550", "name": "Carl Hess", "time": 1522081686509, "rating": 5.0, "text": "Great first time experience for a novice. Invigorating and calming at the same time", "pics": null, "resp": {"time": 1527793304705, "text": "Glad you had a good experience! Look forward to seeing you!  Thank You!"}, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "114359749937998032737", "name": "Janet Kavinoky", "time": 1513613588169, "rating": 5.0, "text": "I wanted to attend a yoga class on Saturday afternoon, and Kiva had one scheduled. It was not my first time in a Bikram-style class, so I generally knew what to expect. The studio is comfortable, with cushioned floors, a locker room, and friendly staff (thanks, Taylor!). For first timers: it's hot. No, really, not a joke. Alabama-in-August hot and humid. Take a towel to completely cover your mat, and a hand towel to wipe your face. Hydrate for several hours beforehand in addition to taking an icy cold extra large bottle of water with you to class. Familiarize yourself with the Bikram style before you go--especially if you are used to vinyasa-style classes--and it will help you make it through that first session. I plan to go back regularly, alternating with the other studio I like that offers other kinds of yoga.", "pics": null, "resp": {"time": 1527793682911, "text": "Thanks for your comments!  Sorry for responding so late!  That is some good advice.  Be sure to check our schedule; we have added some other types of yoga styles...Buti, Barkan, Yoga Flow as well as Yin and Hot Pilates!  Again Thanks!"}, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "118264977428413243128", "name": "Michelle Jackson", "time": 1509888717015, "rating": 5.0, "text": "Love the positive energy and encouraging spirit of all the instructors! Great variety of classes!", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "117886621571813152032", "name": "Khalia Wilkinson", "time": 1508707583933, "rating": 5.0, "text": "I had an amazing time at Kiva Hot Yoga! The staff was great and very personable.", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "102893297521489180472", "name": "mike finocchiaro", "time": 1548715494548, "rating": 5.0, "text": "The heat is just right, the instructors are awesome and the classes leave you feeling awesome.", "pics": null, "resp": {"time": 1527793358218, "text": "Great!  We do love our system and glad it was just right for you!  Thanks!"}, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "113341626977013501984", "name": "LeStryet Yow", "time": 1425515261622, "rating": 5.0, "text": "The staff is excellent and professional, and the studio is top notched.  Enjoyed my year there so far and would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "114384787384148778273", "name": "Regina Mumford", "time": 1425506836489, "rating": 5.0, "text": "This is such an awesome place to experience Yoga!  The teachers are great and everyone is so friendly you feel right at home!", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "113111390217507395795", "name": "Melinda Higginbotham Green", "time": 1425927189092, "rating": 5.0, "text": "It took my dear friend over a year to get me to finally attend a Bikram \"Hot 26 Yoga\" class.  The only reason I returned (within 24 hours) was to avoid being sore.  The way I felt after that 2nd class was unlike anything I had ever experienced.  I was actually craving nutritious foods (not the norm for me, at least not to the point that I was a little disgusted by junk food) and my joints didn't ache like they had for years!!  Hmmm...what was this??? As I listened to the instructors explain the benefits of the tourniquet created by many of the postures I could see how the increased blood flow following the release of the postures, to my body was actually helping/healing!!  That first class was about 3 years ago now and I'm hooked!  It has literally changed my life!\nKate Jenkins is a fabulous owner/curator of yoga...the facility is aesthetically pleasing, comfortable and is always kept in pristine condition (which is no easy chore with all of those sweaty bodies around!) Kate herself is an enthusiastic inspiring instructor and has always maintained a staff of excellent instructors.  Thanks Kate for giving Kiva to Birmingham!", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "102215384614103678309", "name": "Amy Baker Aguirre", "time": 1500648398208, "rating": 5.0, "text": "Discovering Kiva Hot Yoga and regularly practicing the [traditional Bikram style] Hot 26 completely changed my life!  Kiva's teachers and studio make it an excellent place to practice yoga.  The teachers are kind, knowledgable, and encouraging.  The studio is well designed and always clean.  I've tried other yoga studios in town and Kiva is by far my favorite!  I also like that they offer other classes and types of yoga [ex. Buti, Pilates, Yin] while keeping the Hot 26 on the schedule daily.", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "117616176609542054558", "name": "Robin Lewis", "time": 1529278263604, "rating": 2.0, "text": "Too hot for people who can get a little heated but not hot", "pics": null, "resp": {"time": 1580287492119, "text": "Kiva Little Heated Yoga? We’ll stick with the original recipe. The heat is what helped so many of our students make breakthroughs. We see you’ve never been in our classes yet! We’d love for you to try us!"}, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "101173725027827930520", "name": "Brad St. George", "time": 1507819379678, "rating": 5.0, "text": "Great atmosphere. Knowledgeable instructors.", "pics": null, "resp": null, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "110219466838363897841", "name": "L M", "time": 1555599667822, "rating": 5.0, "text": "My happy place", "pics": null, "resp": {"time": 1569084295919, "text": "We are happy you’re here! See you soon!"}, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "107979514446252227966", "name": "Braelyn Keana", "time": 1521226002380, "rating": 5.0, "text": "Very powerful & relaxing!", "pics": null, "resp": {"time": 1527793481248, "text": "Terrific!  That's what we aim for and glad that you experienced it!"}, "gmap_id": "0x14e3eab90b168e73:0x48fa172a4a29e5fb"}
{"user_id": "111799990150509124070", "name": "Josh kaley", "time": 1614137704197, "rating": 5.0, "text": "Great place. Nice facilities, super clean. Friendly staff", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "105975586054441238253", "name": "cody hallford", "time": 1611627162329, "rating": 3.0, "text": "NOT HAPPY ABOUT FALSE HOURS!! I recently decided to start going to the gym and working out....im a Blount county local.the gym was on the top of the list....GREAT PLACE!! but I havent committed to full membership yet...the website says they close at 10...so I came in tonight and found out that they closed at 9 instead of 10..i would have payed the 15 guest fee for 2 hours,but not 1...and the girl working really did nothing to help!! Other than that,its a great place!!thanks", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "107413284780090762716", "name": "Judah Hollis", "time": 1611609937540, "rating": 4.0, "text": "Great place to work out. Really pricey though.", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "116363301547634598061", "name": "BON ES", "time": 1592929717154, "rating": 1.0, "text": "Gym is fine\nPool is fun.\nManagement is unprofessional dealing with childcare issues. If you have children staying with morning shift keep a check in on your little ones. Issues with gate being left open. Caregiver falling asleep and on her phone all time.😡", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "109119015049173704569", "name": "sandra morris", "time": 1598405438745, "rating": 5.0, "text": "This is a great workout facility. Always clean and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "105073313898428321049", "name": "Becca Caroline", "time": 1621809972669, "rating": 3.0, "text": "The pool was soo dirty", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "109242050137546098717", "name": "James R", "time": 1595550149200, "rating": 4.0, "text": "Nice place to work out without having to wait on machine and have annoying teenagers running around and acting like fools. People come here to workout and it's noticeable!", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "108404795585406173189", "name": "Daniella Delcamp", "time": 1590410426259, "rating": 5.0, "text": "Indoor swimming pool is Olympic style and heated. Great place to run.", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "110629288763739371901", "name": "Lisa Lovell", "time": 1528230219853, "rating": 5.0, "text": "Great place to work out. Friendly staff. The pool is wonderful.", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "110285365145564672263", "name": "Mike Wooley", "time": 1542910253172, "rating": 1.0, "text": "I tried giving them a second chance. Years ago, there were problems with the cleanliness of the pool and hot tub. I joined last year and tried using the facilities but not much has changed. Every time I went, there was sand and other items on the bottom of the pool. The water was so cold that it would cause my back to hurt. The hot tub was either broken down or dirty every day I went. They get you to sign a 1 year contract so I have been paying for a service that I really would like to have used, but I refuse to put my body through this process. I haven't seen any improvement from years ago to now. Too bad, they have such potential.", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "114496834517385212907", "name": "Carole Lands", "time": 1506704794906, "rating": 4.0, "text": "Loved the deep water aerobics class on Tuesday night wish you had more than one time a week. Also need more belts for those who are not good swimmers", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "109647932251044857568", "name": "Georgia Gay", "time": 1529416532945, "rating": 3.0, "text": "Nice people haven't used that gym yet but would", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "118269897242238328306", "name": "Earl Seames", "time": 1528481437176, "rating": 5.0, "text": "Great workout gym these people have EVERYTHING  YOU NEED!", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "107903495616966290880", "name": "Karen Murphy", "time": 1502923886516, "rating": 5.0, "text": "Offers great classes,  pool, and spa. Friendly staff. Great for families", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "108118291684278635941", "name": "Rodney Putman", "time": 1527893252865, "rating": 5.0, "text": "Great gym to workout in Great staff Good instrustors", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "109723768055173890722", "name": "JesuTrend", "time": 1485825996113, "rating": 5.0, "text": "This place is great and fun for all ages. Great place", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "116932230839172833498", "name": "Chris Mahan", "time": 1487810771893, "rating": 5.0, "text": "Nice, clean, friendly environment that motivates me to become a better and more healthy person.", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "110479053882587202065", "name": "Wanda Yates", "time": 1520636343351, "rating": 5.0, "text": "Helpful staff encourages and inspires for a good workout.", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "107913964765229438344", "name": "Lynette Burkey", "time": 1529674048297, "rating": 5.0, "text": "Just joined and cannot wait to get started! The place is clean and well equipped.", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "107825117779034621502", "name": "Johnny “Bubba” Downs", "time": 1594940462452, "rating": 5.0, "text": "Freaking Awesome", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "118029228679641437349", "name": "Big D", "time": 1489858792354, "rating": 5.0, "text": "The best place to workout in Blount County", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "104006549035486270928", "name": "Ana Maria Cruz Shell", "time": 1523771368150, "rating": 5.0, "text": "Wonderful,close to home and staff are great", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "105380952166243630622", "name": "FIREMAN13", "time": 1484314139165, "rating": 5.0, "text": "Great place for the  family to get in shape", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "102848247376425808611", "name": "Chris Wheeler", "time": 1534694888444, "rating": 5.0, "text": "I love this place.", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "115893395318860676898", "name": "Allison Neal", "time": 1484352019577, "rating": 5.0, "text": "Clean facility. Anything you could ever want in a gym.", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "106686409113360927742", "name": "Tammie Gulley", "time": 1501635871846, "rating": 5.0, "text": "Water aerobics is my favorite", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "105041198619026734976", "name": "Derrick Foster", "time": 1512320649851, "rating": 3.0, "text": "Don't power lift", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "112493777840666713374", "name": "alex heard", "time": 1502649316731, "rating": 4.0, "text": "The locker room smells like depression and feet but hey you can look like you're healthy", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "109210914093906582392", "name": "Mark McCay", "time": 1504890795488, "rating": 5.0, "text": "Great Gym, Instructors are awesome!!!", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "110031835226720491193", "name": "Marlina Sherbet", "time": 1519326098577, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "110133046266045185563", "name": "Tina Anderson", "time": 1525498211463, "rating": 5.0, "text": "LOVE it!!!!", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "105323645798719744832", "name": "Hilda G Guevara", "time": 1495544208366, "rating": 4.0, "text": "(Translated by Google) The service is good.\n\n(Original)\nEl servicio es bueno.", "pics": null, "resp": null, "gmap_id": "0x888990ac418a6a33:0x4d2e74c9199dab58"}
{"user_id": "112029187253593613773", "name": "Chelle Ham", "time": 1534860140692, "rating": 5.0, "text": "Had a wonderful first session of beginners yoga yesterday! Nichole is so kind and a great teacher. The interior of the studio is very calming and the session itself was simple enough to follow along with for a beginner with some challenges to encourage learning. My husband went along with me and loved the session too! So happy to have found this studio in Dothan. I will be back!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPMU9j3ZPCH5A8VpKxaVu-GHssxf_Y8H3AIdc1_=w150-h150-k-no-p"]}], "resp": {"time": 1535591165820, "text": "Thank you soooo much!!!  I'm so happy you enjoyed your experience :)  Looking forward to seeing you soon at the studio!!!! ~ Virginia"}, "gmap_id": "0x88929300c3dfc6bf:0x120391758678efe9"}
{"user_id": "108614303858373234445", "name": "Susan Avello", "time": 1585764716916, "rating": 5.0, "text": "As a Personal Chef in Dothan AL specializing in Healthy food and Nutrition, my first yoga experience when I returned from Chicago was Nature Gallery and what a wonderful journey it has been.\n\nGretchen and her team is extremely knowledgeable, acceptable, kind and loving and help you no matter what level of expertise. They believe in giving back to the community and it shows! Their studio is warm and inviting and every class leaves you feeling uplifted and calm - ready to take on anything!\n\nFrom fabulous massages by Jason to the numerous classes offered at Nature Gallery you will find a loving and accepting staff and classmates as you surround yourself in the beauty of art in this lovely atmosphere of warmth.\n\nNamaste", "pics": null, "resp": null, "gmap_id": "0x88929300c3dfc6bf:0x120391758678efe9"}
{"user_id": "100067112355553889189", "name": "Christy Carter", "time": 1572035966695, "rating": 5.0, "text": "I have been doing vibration therapy on a regular basis for 3 months now and the cumulative effects are really noticeable.  A therapy session is relaxing and meditative.  Jason helps you find the perfect position for your session for comfort.  My sleep has improved, my overall mood, my outlook, pain in joints completely gone after a session.  If I am going through something tough I always book a session and it helps me through it.  I would recommend strongly you  try it for yourself.", "pics": null, "resp": {"time": 1572464116117, "text": "Thank you so much, Christy!!!"}, "gmap_id": "0x88929300c3dfc6bf:0x120391758678efe9"}
{"user_id": "115848584416393377733", "name": "Stephanie Paulding", "time": 1582000258733, "rating": 5.0, "text": "What a wonderful place to practice yoga! Beautiful atmosphere; great teachers! The Sound Bath is amazing also.", "pics": null, "resp": {"time": 1582152001568, "text": "Thank you so much, Stephanie!!!"}, "gmap_id": "0x88929300c3dfc6bf:0x120391758678efe9"}
{"user_id": "117017705692233593351", "name": "diane braun", "time": 1527864103308, "rating": 5.0, "text": "I've consistently taken Yoga classes at The Nature Gallery for going on 2 years now.  I even participated in their first Peaceful Warrior Teaching Training Series, which was an incredible and life-changing experience that I recommend to everyone!  They offer a variety of classes for different yoga styles, and various class times to meet most anyone's schedule.  The teachers, and all the staff for that matter, are awesome!  I can't say enough good things about The Nature Gallery!", "pics": null, "resp": null, "gmap_id": "0x88929300c3dfc6bf:0x120391758678efe9"}
{"user_id": "103418519822565522087", "name": "Nature Gallery", "time": 1523340574935, "rating": 5.0, "text": "Austin Prince ~\nI'm truly sorry your experience wasn't up to your standards.  We are all human... we have good & not so good days.  I'm very sorry that one crummy experience rushed you to jump on your electronic device & write a not so nice review.  Your credit card was fully refunded and we offered nothing but sincere apologies.  You were overly nice on the phone with us, which was odd after reading your yucky review.  Your wife was very sweet, we enjoyed meeting her :)  Maybe you should give our YOGA classes a chance... I assure you, your money won't be wasted there ~ $10 per class with an awesome team of Instructors.  Congratulations on your new little bundle of Joy!!!  ~ Namaste ~", "pics": null, "resp": null, "gmap_id": "0x88929300c3dfc6bf:0x120391758678efe9"}
{"user_id": "106677510161552009507", "name": "Hope Richardson", "time": 1528942334897, "rating": 5.0, "text": "The atmosphere is serene.. I had a massage by Jason. I could not walk without pain when I went to him. Every muscle in my lower legs where locked up. Jason did myofascial methods on my legs and I felt and feel so much better. Thank you Jason.  Thank you for your passion.", "pics": null, "resp": null, "gmap_id": "0x88929300c3dfc6bf:0x120391758678efe9"}
{"user_id": "104995994919175652940", "name": "Cathy Prange", "time": 1556657050902, "rating": 5.0, "text": "Just experienced Vibrational Sound Therapy with Singing Bowls with Jason Watford....WOW !!! I went in stressed and left feeling peaceful and at the same time energized, the sounds from the bowls resonated with my soul and the vibrations from the bowls seemed to know what my body needed and wanted !!!! Thank you Jason and The Nature Gallery Yoga and Massage Studio.", "pics": null, "resp": {"time": 1557605449662, "text": "So happy you enjoyed your experience!!!"}, "gmap_id": "0x88929300c3dfc6bf:0x120391758678efe9"}
{"user_id": "103729550913984901928", "name": "Danielle Fisher", "time": 1544630819183, "rating": 5.0, "text": "Love the energy at Shoals Yoga! I did my teacher training here and loved every minute of it! Danielle is such a loving, gentle soul! She and the other instructors do a great job. They always make you feel comfortable and you leave with such lightness! I love practicing yoga in the atmosphere they provide!", "pics": null, "resp": null, "gmap_id": "0x887d4814d2c851d5:0xe7a7e47021372a84"}
{"user_id": "110376820684158867095", "name": "Brittney Mashburn", "time": 1544631016589, "rating": 5.0, "text": "Danielle is the most loving and caring person! She is able to express that through everything she does at this studio. Her classes are so thought out and enjoyable. Every time I go I leave with a sense of ease and optimism. If you're looking for a great yoga teacher and studio this is the one for you!", "pics": null, "resp": null, "gmap_id": "0x887d4814d2c851d5:0xe7a7e47021372a84"}
{"user_id": "111693450234616457064", "name": "Alicia Donlan", "time": 1544647619950, "rating": 5.0, "text": "An absolutely warm and inviting space to practice yoga. The instructors are knowledgeable, kind, professional and humble. I’m so sad that I moved away from this amazing yoga home. I have not yet found a studio that compares.", "pics": null, "resp": null, "gmap_id": "0x887d4814d2c851d5:0xe7a7e47021372a84"}
{"user_id": "113235514867571077865", "name": "Samantha Mitchell", "time": 1544635520146, "rating": 5.0, "text": "Danielle has been such a blessing to our community. She is very passionate about not only her business but each and every person that walks through the door. She has even travelled to local nursing facilities to teach the elderly and local school to teach children the importance of yoga practices. I highly recommend Shoals Yoga if you are interested in yoga. She will get you on the right path.", "pics": null, "resp": null, "gmap_id": "0x887d4814d2c851d5:0xe7a7e47021372a84"}
{"user_id": "100343348114375364272", "name": "Erin Lier", "time": 1566346318274, "rating": 5.0, "text": "I just took a beginner's yoga class with Ella and it was great! She is a very welcoming and talented teacher.", "pics": null, "resp": null, "gmap_id": "0x887d4814d2c851d5:0xe7a7e47021372a84"}
{"user_id": "101198837845536794203", "name": "Casey Aldrup", "time": 1530368576747, "rating": 5.0, "text": "I love coming to Shoals yoga! The pricing is fair, the teachers are experienced and knowledgeable, and the classroom environment is always warm and inviting. I feel like I can relax while still getting a workout, too! I will definitely continue to attend classes here.", "pics": null, "resp": null, "gmap_id": "0x887d4814d2c851d5:0xe7a7e47021372a84"}
{"user_id": "118038728850957391134", "name": "Ashley Morrow Colonna", "time": 1544629415107, "rating": 5.0, "text": "Danielle is a mindful, thoughtful instructor. So much so that when our community was able to host a TedX event, Danielle lead the crowd in a mindfulness exercise. I wouldn’t hesitate to do business with her if you are looking for a yoga studio to practice!", "pics": null, "resp": null, "gmap_id": "0x887d4814d2c851d5:0xe7a7e47021372a84"}
{"user_id": "114714154292815992488", "name": "Dona Hill", "time": 1544631090377, "rating": 5.0, "text": "I have attended Shoals Yoga for several years.  Each class is encouraging, enlightening. I have recommended this studio to many and will continue to do so. Thank you to Shoals Yoga.", "pics": null, "resp": null, "gmap_id": "0x887d4814d2c851d5:0xe7a7e47021372a84"}
{"user_id": "105237022364442385435", "name": "Karen Williams", "time": 1544642179743, "rating": 5.0, "text": "Best yoga studio in the Shoals.  Danielle is truly one of the kindest people you will ever meet!", "pics": null, "resp": null, "gmap_id": "0x887d4814d2c851d5:0xe7a7e47021372a84"}
{"user_id": "100515473854495234151", "name": "Mary Parker", "time": 1544629324609, "rating": 5.0, "text": "Wonderful community with a transparent and authentic leader.", "pics": null, "resp": null, "gmap_id": "0x887d4814d2c851d5:0xe7a7e47021372a84"}
{"user_id": "113671678591622837124", "name": "Cassie McDonald", "time": 1527030896583, "rating": 1.0, "text": "I saw Danielle take money from a person that had just been through an extremely devastating event.  She had the opportunity to give, but chose to take.  Beware.  Just because someone calls themselves a \"yogi\" and wears Lululemon, does not mean they follow the true spirituality of yoga.  It was disappointing to see.", "pics": null, "resp": null, "gmap_id": "0x887d4814d2c851d5:0xe7a7e47021372a84"}
{"user_id": "113716836855560912368", "name": "Sara E", "time": 1530144140105, "rating": 5.0, "text": "Great ladies. Great love.", "pics": null, "resp": null, "gmap_id": "0x887d4814d2c851d5:0xe7a7e47021372a84"}
{"user_id": "116376689848607727447", "name": "Rachel Irwin", "time": 1626268573787, "rating": 5.0, "text": "I have had many of their treatments and used many of the products they offer. If you are looking for anything from weight loss to a facial you need to contact this place today! Support your local small businesses, you will be glad you did!", "pics": null, "resp": null, "gmap_id": "0x889a4317cf611cb1:0xb2b62007b7b1dc8"}
{"user_id": "115594901241296403027", "name": "Michelle Murrill", "time": 1603219250246, "rating": 5.0, "text": "I have been here several times for chemical peels and facials and have been very happy with the quality of services, the friendliness of the staff and the overall experience of the spa. I love this place! Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4317cf611cb1:0xb2b62007b7b1dc8"}
{"user_id": "113095077558618933453", "name": "Daniel Haddox", "time": 1603238483424, "rating": 5.0, "text": "Amazing and caring staff! Misty, Sherine and Zoe are all super people to work with and for sure care about you and your needs. I’ve done the Botox and the IV hydration there several times and definitely will be back!  Thanks guys!", "pics": null, "resp": null, "gmap_id": "0x889a4317cf611cb1:0xb2b62007b7b1dc8"}
{"user_id": "102751560590850361519", "name": "Holman Bowen", "time": 1603219953864, "rating": 5.0, "text": "Always has excellent service, I received a laser hair removal treatment and I am more than pleased with the results. Definitely will be returning!", "pics": null, "resp": null, "gmap_id": "0x889a4317cf611cb1:0xb2b62007b7b1dc8"}
{"user_id": "106295933675085696548", "name": "Vicki Harris", "time": 1603221182988, "rating": 5.0, "text": "Amazing staff, state of the art facility and the products have made a difference in my complexion.  The night time serum is super.  My favorite items are the facial with derma-planing and facial hair removal. Go see Misty, Sherine and Zoe, tell them I sent you!!", "pics": null, "resp": null, "gmap_id": "0x889a4317cf611cb1:0xb2b62007b7b1dc8"}
{"user_id": "113026910305450624882", "name": "Hope Robinson", "time": 1603226427076, "rating": 5.0, "text": "Beautiful office and excellent service. Go see Zoë for the ZO 3 step peel. It’s a game changer!\nAbsolutely will be back 😊", "pics": null, "resp": null, "gmap_id": "0x889a4317cf611cb1:0xb2b62007b7b1dc8"}
{"user_id": "100271443291519475830", "name": "Leigh Wright", "time": 1603220304668, "rating": 5.0, "text": "The BEST place in Baldwin County and Mobile County for weight loss, chemical peels, laser hair removal, you name it! Always worth the trip to Spanish Fort.", "pics": null, "resp": null, "gmap_id": "0x889a4317cf611cb1:0xb2b62007b7b1dc8"}
{"user_id": "117742641972138424354", "name": "Janna Jellison", "time": 1581602538475, "rating": 5.0, "text": "Very hospitable receptionist, went above and beyond with customer service. Dr. Dyas was very friendly and knowledgeable, took her time to answer all of my questions. I was highly impressed with their service", "pics": null, "resp": null, "gmap_id": "0x889a4317cf611cb1:0xb2b62007b7b1dc8"}
{"user_id": "105786914594498145622", "name": "Tina Burner", "time": 1547483215329, "rating": 5.0, "text": "Best Yoga Studio I have ever been too! They are the most welcoming people I have ever been around. I never felt out of place & they always provided such a pleasant experience.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM-7qCp7rc7W9oEH0yRe1kWVdgSo4tYUHz-Cfwg=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4d61a7c03d97:0x8fe447ae73b9bec8"}
{"user_id": "117032504536009689469", "name": "Alison Herlihy", "time": 1573478072839, "rating": 5.0, "text": "Glow is an amazing community! They have a great variety of classes and the classes can be accommodated for all fitness levels. When I first went to Glow, I was a little intimated by hot yoga, but now I am a believer.", "pics": null, "resp": null, "gmap_id": "0x889a4d61a7c03d97:0x8fe447ae73b9bec8"}
{"user_id": "101906601486659883182", "name": "Jackie Hawkins", "time": 1572395521731, "rating": 5.0, "text": "I love this place. Easy going, no pressure, no problems. I can easily plan times to go around my busy schedule thanks to the 530a classes. A lot of other yoga studios in the area I looked at didn’t have weekend, night, or early morning classes which always made it difficult to try something new.  I haven’t found an instructor I don’t like and I love the special events                (especially the ones that they partner with other businesses). I really look forward to continuing with Glow.", "pics": null, "resp": null, "gmap_id": "0x889a4d61a7c03d97:0x8fe447ae73b9bec8"}
{"user_id": "109463142189247232081", "name": "Danelle Adair", "time": 1572715591974, "rating": 5.0, "text": "When I decided to join a yoga studio, I looked local studios around town and when Glow Yoga popped up, I knew this studio was the right one for me. The good vibes I felt when I stepped into the front door confirmed how I felt when I saw the website. The teachers are so friendly, knowledgeable, and make classes fun. Namaste Glow Yoga family. ✨🧘🏻‍♀️✨", "pics": null, "resp": null, "gmap_id": "0x889a4d61a7c03d97:0x8fe447ae73b9bec8"}
{"user_id": "106101779259148701227", "name": "Marbury Buckhaults", "time": 1582754901193, "rating": 5.0, "text": "From the first moment I felt a part of the Glow family and yet we are given that gentle shove needed that produces results. Can't say enough good things!", "pics": null, "resp": null, "gmap_id": "0x889a4d61a7c03d97:0x8fe447ae73b9bec8"}
{"user_id": "110662802600658208142", "name": "Jacquelyn East", "time": 1467999483066, "rating": 5.0, "text": "Glow Yoga is a very welcoming studio. You can practice here at any level. When I first started practicing yoga at Glow, I was a beginner. It has been a wonderful journey to watch my practice grow and my body become stronger. No more back problems.", "pics": null, "resp": null, "gmap_id": "0x889a4d61a7c03d97:0x8fe447ae73b9bec8"}
{"user_id": "105688153868182142274", "name": "Emilee Shuler", "time": 1468262514122, "rating": 5.0, "text": "From my very first day at Glow Yoga Mobile, I have felt completely welcome and comfortable. Soon after starting classes there, I began to realize that this place is not just a yoga studio. It's a safe place where like minded people can go to practice yoga, but also a community in which everyone supports and encourages each other. I enjoyed it so much that I began the teacher training, and it is one of the best things that's ever happened to me. I'm not only learning the physical aspects of yoga and how to teach it, but how to incorporate it into my day to day life. I am learning so much about myself and life in general. I could go on and on!", "pics": null, "resp": null, "gmap_id": "0x889a4d61a7c03d97:0x8fe447ae73b9bec8"}
{"user_id": "114005284229680299214", "name": "Melissa Byrd", "time": 1468854504108, "rating": 5.0, "text": "Having tried many yoga classes, I never really felt connected to the practice or the classes until I began going to Glow Yoga.  I entered feeling very intimidated but left with a sense of community and peace.  The studio and the staff are so welcoming and inspiring.  I began practicing here at a very vulnerable time in my life having faced many terrible tragic losses, yet due to the constant positive energy, I was hooked.  I am now teaching yoga and thriving both on and off of the mat!  I cannot thank them enough for changing my life, one breath, one hour at a time!", "pics": null, "resp": null, "gmap_id": "0x889a4d61a7c03d97:0x8fe447ae73b9bec8"}
{"user_id": "101361992254263033855", "name": "addie hanson", "time": 1468121165977, "rating": 5.0, "text": "Such an awesome environment--I am brand new to yoga and everyone was so welcoming and helpful! Can't wait to go back and finish my 30 days for $30 special. They also have an awesome selection of workout gear including Lululemon (so cute!!)", "pics": null, "resp": null, "gmap_id": "0x889a4d61a7c03d97:0x8fe447ae73b9bec8"}
{"user_id": "116305212776254188077", "name": "Gail Harrington", "time": 1558804612128, "rating": 5.0, "text": "Changes your body and your mind .I feel stronger after every class.The instructors are so encouraging and positive. For me, it's a great way to end a stressful day.", "pics": null, "resp": null, "gmap_id": "0x889a4d61a7c03d97:0x8fe447ae73b9bec8"}
{"user_id": "102158145290818249455", "name": "Jacqueline Beverly", "time": 1467997529671, "rating": 5.0, "text": "Original location is in Gulf Shores, AL, but the Mobile studio has the same welcoming, friendly, and relaxed vibe. You will get a great workout for your body and mind! Plus, they sell Lululemon!", "pics": null, "resp": null, "gmap_id": "0x889a4d61a7c03d97:0x8fe447ae73b9bec8"}
{"user_id": "102877239753164761363", "name": "Kristin O'Connell", "time": 1467996940376, "rating": 5.0, "text": "Judgment-free, all skill levels welcome and super happy environment. Love Glow Yoga so much!", "pics": null, "resp": null, "gmap_id": "0x889a4d61a7c03d97:0x8fe447ae73b9bec8"}
{"user_id": "117085219266376342428", "name": "Jennifer Heitman", "time": 1468156264440, "rating": 5.0, "text": "Best Lululemon selection in southern Alabama. If you love Lululemon, you should definitely check out this studio. Great location in Springhill. Stay for some amazing yoga too!", "pics": null, "resp": null, "gmap_id": "0x889a4d61a7c03d97:0x8fe447ae73b9bec8"}
{"user_id": "111135164301653412670", "name": "Tara Brown", "time": 1468001472830, "rating": 5.0, "text": "I love Glow yoga!! Great people and wonderful yoga!!", "pics": null, "resp": null, "gmap_id": "0x889a4d61a7c03d97:0x8fe447ae73b9bec8"}
{"user_id": "103257836710335335188", "name": "Rachel Fulmer", "time": 1447336213677, "rating": 5.0, "text": "Perfect Location with a great community!", "pics": null, "resp": null, "gmap_id": "0x889a4d61a7c03d97:0x8fe447ae73b9bec8"}
{"user_id": "117813408099689720521", "name": "Cinna buunnzz", "time": 1569106781846, "rating": 5.0, "text": "Love it!", "pics": null, "resp": null, "gmap_id": "0x889a4d61a7c03d97:0x8fe447ae73b9bec8"}
{"user_id": "115303096608827210840", "name": "Mark Fisher", "time": 1520015635765, "rating": 4.0, "text": "Big roomy gym. Clean. Generally well behaved people work out there in all shapes and sizes. I rarely have to wait for equipment. Staff has always been pretty friendly but I didn't appreciate getting booted out early on Fat Tuesday when I had just started my workout. When equipment gets broken it can be down for a long time. I've never been impressed with the trainers there. Other gyms are cheaper and depending on the time of day less crowded but I think it's better than planet fitness. PF doesn't have a free weight squat rack which for someone who is serious about weight training is absolutely silly. Omni needs to fix its gear and also get the movie room up and running again. Put someone who loves children in the  daycare too. It's one of your big selling points for cryin out loud. Overall though a good gym.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "110665415046352292920", "name": "Raw Rodney", "time": 1382361532719, "rating": 5.0, "text": "This is a great gym. Most of the staff are friendly and the gym is spacious. There are a variety of workout items leaving lots of room for versatility. They even have a movie theater that can be utilized while running on the tread mill. No other gym has this in Mobile, AL. The atmosphere is very laid back. I highly recommend this gym to everyone.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "105990154317804785982", "name": "Austin F.", "time": 1534195178944, "rating": 3.0, "text": "So, what they don't elaborate on is that the \"2 weeks free\" is only an option if you're singing up for a 1 year contract. However, I wasn't informed of this until I got to the gym, and spoke to two employees at the front desk and they were neither friendly nor seemed to want to help me. The gym itself is large and really nice though, but I didn't want to spend my money there after encountering the aforementioned individuals.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "108896922384128401629", "name": "Marco Silva", "time": 1456353374247, "rating": 5.0, "text": "The best gym I have ever joined. Very clean, very nice staff, excellent equipment !\nThe gym is HUGE with tons of machines ! The free weight section is perfect, plus they have a lot of benches.\n\nYou won't find a better gym in the area.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "112646169921346917646", "name": "Zionette Cleek", "time": 1391016384399, "rating": 5.0, "text": "Fantastic workout facility!  Plenty of fitness options ( Yoga, Fitness Classes, Cycle Room, etc..) as well as a woman's only workout room which allows additional workout space and not to mention machine accessibility :) Friendly welcoming staff, along with a tanning club located next door as an option.\n\nZ", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "118111399133955161355", "name": "john cole", "time": 1559579724333, "rating": 1.0, "text": "We were told that they would be closing for remodeling but members would be able to go to the new sister location on Hillcrest because it would be up and running before the. Now Gym is closed and a week later the Hillcrest location is still not open. This is a major inconvenience. I try calling both the Hillcrest and Airport numbers and no answer. Very unprofessional. I think they made sure everybody renewed their membership before closing down just for this reason.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "111894355925630733763", "name": "K D", "time": 1528421903100, "rating": 2.0, "text": "Work out area is nice, but, disappointed with their classes. Only one Zumba class a week and have it in a hot room with rubber floors and no mirror. That's how you get injuries. No Pound classes either.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "106892440031881614496", "name": "Adam Jacobs", "time": 1443655067173, "rating": 1.0, "text": "Gym is great. Had to cancel because the child care center was not up to par. My son didn't feel comfortable there and for obvious reasons. The staff members all sat on their phones, a lot of times with their backs to the kids. One time when I dropped my son off, both child care workers walked out of the room & left me in there with all of the children. That was my last straw & I cancelled. I hope someone does something about this & gives the child care workers a formal training in taking care of children. And the gym should at least seek to hire people who like children. They certainly shouldn't be on their phones. And kids should be greeted warmly with a smile.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "105600719281789427028", "name": "Muscle Trucking", "time": 1526006870038, "rating": 4.0, "text": "Nice gym... very well equipped.... cleanliness could do a touch up....", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "112999819293409893569", "name": "Alisha Carruthers", "time": 1531334917139, "rating": 5.0, "text": "Christian \"CJ\" is AWESOME!!!! I left my RX rope while visiting their facility on vacation. One morning after I got back I went to grab my rope to practice for an upcoming Crossfit Comp, and noticed my rope was gone. I HAD TO HAVE THIS ROPE FOR MY COMPETITION. I immediately called and asked if my rope was there and sure enough he found it! He went above and beyond when he got off and overnighted it to me to ensure I would receive it by the weekend, just in time for my comp!! Not many people would go out of their way like he did, and I am so appreciative of his kindness!! Ten thumbs up!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "105791499926788434282", "name": "Stang Dhanesnit", "time": 1418787146786, "rating": 2.0, "text": "I wish they open 24 hours or at least 11 to midnight. Many people sometimes has to wait until their kids sleep to be able to come out. I bet if Omni does this, Gym like planet fitness will go out of business soon", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "106732430346128470413", "name": "Peck Proctor", "time": 1514861190221, "rating": 5.0, "text": "Great place employees are fantastic and extremely helpful the manager is extremely knowledgeable and so are the trainers I recommend this gym to everyone", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "106020578020168026744", "name": "Jessie Brumfield", "time": 1452021767298, "rating": 5.0, "text": "I've been going to the gym for over 6 months now and I can finally put a proper review of the place. They strive to keep the gym a clean, fully functional facility. Sure there may be a broken machine or a shower not working, but I do see these things get repaired in a pretty timely manner. They are currently doing renovations/improvements on items that need it. In my opinion, they are not OVERLY nice and they are not rude. They are polite, professional and basically just a \"no bullsh*t\" gym. They have the most workout equipment I've seen in any gym of Mobile. And UNLIKE Planet Fitness, they actually promote FITNESS (not pizza, doughnuts and being judgmental to anyone that works out hard to get the body they have). It's a good gym, I would definitely recommend it to anyone that is not a whiny baby.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "111104548697552764164", "name": "Jeff Oglesby", "time": 1475417575621, "rating": 5.0, "text": "It's a good gym, free weights, machines, cross fit room. It's not that luxurious but who really cares? Go stand at planet fitness waiting on a smith machine or come here and lift iron. All the comments about rude staff is inaccurate, no they don't seek to be your best friend but that isn't what gym workers are supposed to do. I get a \"have a good workout\" on my way in and a \"take it easy brother\" on the way out, it's all I need. I will say though watching their personal trainers, I wouldn't hire them. Their clients don't make alot of progress, haven't used them personally though and it could be the client not following the plan correctly.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "116591309173965457248", "name": "Jamie Busby", "time": 1444942289356, "rating": 1.0, "text": "Overall, I had an uncomfortable experience with the place. The employees are rude and do not give a crap about you; just your money. People there are incredibly judgemental. I went to get a protein shake at the counter and the man said \"are you sure you want one of these kinds of shakes skinny guy?\" Horrible experience. Find another gym that isn't full of judging people.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "108400580380536544138", "name": "Colin Hartery", "time": 1550881968497, "rating": 3.0, "text": "Things are getting better with the new management. Still some broken equipment and things that could use repair but things are changing for the better", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "114001153475860300748", "name": "Casey Chambliss", "time": 1488594360547, "rating": 5.0, "text": "Great place great people love the atmosphere affordable and fun. Great staff", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "107255050551074587818", "name": "A Google User", "time": 1331669528314, "rating": 5.0, "text": "The group exercise schedule is packed full of variety and the teachers are great.  So far my favorites are yoga, thighs butt and gut, and cardio/tone.  If you are into cardio equipment, they have a ton.  I was told you never have to wait.   To the moms out there, they also have daycare.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "105551116108605152375", "name": "Cassidy Cooper", "time": 1496967367440, "rating": 5.0, "text": "The facility is large and clean with a wide variety of machines and equipment. The group classes are great!", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "106636618395574526309", "name": "Barry Langley", "time": 1466535104268, "rating": 3.0, "text": ". Decent gym, poor management and/or computer software. There are repeated issues with automatic payment by credit card. Moving on to Sportplex. No hassles there.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "112237052014020716938", "name": "First Last", "time": 1356736401889, "rating": 2.0, "text": "This is a terrible gym. If you move away and try and cancel your membership the gym manager is never there and does not return phone calls.  After finally getting the manager on the phone and sending him the paperwork that he requested they they STILL did not cancel my membership.  4 months later I gave up on the gym manager and contacted National Fitness who does their billing and had to RESEND by postal mail more paperwork.  My membership STILL isn't cancelled. They just give you the run around so they can keep taking your money. I doubt I'll ever see a refund for the last 4 months that I have not been in the state to use the gym.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "106088236464690816481", "name": "William Torphy", "time": 1491000522384, "rating": 2.0, "text": "The equipment seems old and it doesn't seem like they've invested in new equipment, especially cardio machines for years. It seems to cater to body builders but even the weightlifting equipment seems dated to me. The carpet is old and it took forever to fix the urinal in the men's room which was disgusting. Also annoying is how they seem to have less and less bodypump classes. However the classes themselves are great (excellent instructor) when they have them. It doesn't seem like they are maintaining the gym properly and I will be going elsewhere. I do enjoy the theatre room when it's running as it makes the time go by. But overall not worth what I'm paying imo.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "118445460295954745059", "name": "Natalie C", "time": 1515267773263, "rating": 2.0, "text": "Here is the problem with this gym. It started off pretty good and then it went down here, but I blame corporate for that. Back when they first opened, they were charging $55 a month for this place which at the time, made sense because all the equipment was new and they have four and five of the exact same machine; ensuring that no matter what you did, you always had a free machine. However, as the equipment started to crack & deteriorate, it has not been maintained right. That was too much to charge so people left and now you can start off here for about $34 a month.\n\nApparently, the owners don't like this because they shut down the smoothie shop. They've closed off a lot of the rooms that we used to be able to go in and use and multitude of requests have been put in to fix certain equipment that never gets around to being fixed. They just got weight pins because people kept taking weight pins out of some machines to use them in others and we had to beg for about a month to get that. The yoga room used to be open to me where I could go in and use the exercise balls (because the ladies only room has only one ball and it is severely deflated.) I never messed up the room, but others did and now everyone else is being punished and is not allowed to use the room, but our dollars pay for the equipment. No one seems to know where a damn air pump is so they can inflate their own balls. It's ridiculous. If you going to the theater room, there is a graveyard of broken equipment and that they refused to fix or replace. They also have torn up machines in the food court and in the rooms that the clientele don't normally frequent. Why keep it if it's broken and you don't want to fix it?\n\nTo add insult to injury, we have to pay a $40 fee once a year for the equipment, but a lot of this equipment looks like it hasn't been changed out in years. To literally lock away a room full of equipment from members who haven't messed it up is wrong. Meanwhile, they have a set of high school kids that come in here tearing up the equipment all the time and being loud and using slurs that everybody has literally complain about, yet they are allowed to continue working out here. All of the quality Equipment is sealed off in some room somewhere while everyone else is left to use what's left.\n\nThere are ants in the ladies sauna that I ask the boys to tell the head girl about so it could be taken care of. They never told her and I had to tell her myself. I ended up getting bitten and I have welts on my arms from the ant bites. It has been about 4 days since I told someone about it and it still hasn't been taken care of. The manager here is really cool, but he doesn't move unless corporate gets involved.\n\nFurthermore, they won't stop hiring college kids to work here and they're not paying them all that much so they're simply not going to do the job. On the weekends, they work out on the clock  when they don't think they're going to get caught. Trash is overflowing in the restrooms, dirt is on the floor and a lot of the equipment is jammed up when you try to use it. They don't regularly check the paper towels towels or anything. There are far too many $10 a month gyms running around here for this. Between Pro Health, Sportsplex and the YMCAs, I'm sure I can find somewhere else that will find equipment that is quality.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "100900845316472408467", "name": "derek barefoot", "time": 1359403230995, "rating": 5.0, "text": "This is in response to Justa Mom.  I am Derek Barefoot the manager of Omni fitness.  Words can't describe how incredibly offended I am by your post.  I am the father of am amazing little girl who stays in the child care while I work.  I go in the child care to check on her.  The fact that you would suggest drug use or PERVERSION!! on my part is out of my realm of comprehension.  Before you, or any one else \"speculate\" why not come talk to me.  I am in the gym M-F 9am-7pm.  I am a man of high moral standards and reading your post made me sick to my stomach.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "100442913299217469927", "name": "Thieu Vo", "time": 1333331249927, "rating": 5.0, "text": "My first time going to a gym. I realllly like this gym. Most of my friends go to this gym. The smoothie bar is great, so  i dont need to make my own protein shakes. Great equipment. Great lockerroom.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "113746022303116937483", "name": "Wayne Douglas", "time": 1470518558302, "rating": 2.0, "text": "I have one complaint, fix the men's urinal. It has been broken for at least 8 months. It's bad when you can't walk in the bathroom for fear of stepping in piss because men have tried to use the handicap/ child urinal. C'mon ppl, 8 months? Still broken a year after this post! And, good grief, turn the water pressure up on the water fountain! Please!", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "117263442681671519237", "name": "Justin Dunnam", "time": 1469849018506, "rating": 5.0, "text": "Has one of the largest varieties of equipment in mobile.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "106631044908543964653", "name": "Treylen Washington", "time": 1460733268857, "rating": 5.0, "text": "I dont think nowhere is perfect but this is the only gym i feel comfortable at. Friendly staff and clean environment 😊😊", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "112037534893982065494", "name": "Richard Malone", "time": 1480100200302, "rating": 5.0, "text": "is moni open on black friday the 26th", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "110671414678791025287", "name": "Unique money", "time": 1557350292928, "rating": 1.0, "text": "I wouldn’t recommend this place to my worst enemy.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "102001682953927756321", "name": "Jaye J", "time": 1492700598369, "rating": 5.0, "text": "Thanks Omni for your understanding and service", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "105173142805150691003", "name": "Matusavage", "time": 1420599284364, "rating": 5.0, "text": "The hours posted on the web are wrong. They're actually 5-10 Mon-Thurs, 5-9 Fri, 8-8 Sat, and 12-6 Sun.", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "100940470319778262363", "name": "david grimes", "time": 1432410343340, "rating": 5.0, "text": "By far the best in Mobile", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "109668488042682681887", "name": "Ronda Thompson", "time": 1474887375358, "rating": 1.0, "text": "This gym sucks", "pics": null, "resp": null, "gmap_id": "0x889a4d6b22fa2ab5:0xc12047c9fedc974d"}
{"user_id": "116243428741110270452", "name": "Giselle Hollie", "time": 1622085855935, "rating": 5.0, "text": "I’ve been a member at Forge Fitness since 2017! Since the first day I dropped in to check out what CrossFit was all about I’ve been impressed with the professionalism and enthusiasm displayed by the coaches and owners and the sense of community. The owners are awesome and I even got my tire changed by Rich one time! I now have a 13 month old and since he was 6 weeks he’s been going to the gym with me and everyone has been awesome around him! During the pandemic the gym took extra precautions to keep staff and athletes safe. Equipment was cleaned daily, athletes had designated spaces, and when everyone was at home the coaches took videos and sent us At Home WOd’s to keep everyone motivated and moving. I’ve grown so much as an athlete at Forge and I’m stronger and fitter than before I joined. I’m glad to be part of this special community!!!", "pics": null, "resp": {"time": 1622113631833, "text": "Thank you so much Giselle for your dedication to forge. We have always admired how consistent you have been in your training. Keep up the great work and we can’t wait to see what else you accomplish."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "113339830607464128003", "name": "Emily Ledet", "time": 1622225336305, "rating": 5.0, "text": "I joined Forge about a year ago as a brand new crossfitter. The coaches and more experienced athletes were more than willing to help me out every step of the way. I have never experienced such a supportive community! We truly are a family. I have grown so much as an athlete due to the top notch coaches and programming and I have met some of the best friends I have ever had here. I can't give this gym enough praise!!", "pics": null, "resp": {"time": 1622241216273, "text": "You are the best and we totally agree about you being our family."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "103823653360468736979", "name": "Pat O'Brien", "time": 1622059366070, "rating": 5.0, "text": "I have been going to Forge since 2017. It's great. The coaches are knowledgeable and the community is fun to be around. It's a family owned business and you can tell. Rich and Patti do a great job of keeping things fun but also professional. I have seen this gym grow over the last couple of years. We get new equipment all the time and the facility is Grade A. I definitely recommend Forge to anyone looking for a gym. I found it doing an internet search in 2017 when I moved to Birmingham and it's been a wonderful experience.", "pics": null, "resp": {"time": 1622060067210, "text": "Well thank you Pat O’BRIEN… for the awesome review!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "106639935830176579776", "name": "Stacie Jackson", "time": 1622224411794, "rating": 5.0, "text": "Forge is a wonderful place that we look forward to every day. The programming is amazing, the staff is kind, caring and encouraging. The facility is amazing. The members are supportive of every fitness level. I also love the recovery room! I would highly recommend Forge Fitness!", "pics": null, "resp": {"time": 1622241169762, "text": "Thank you Stacie and we deeply appreciate all the support!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "104167962753290997325", "name": "Hannah Grant", "time": 1623343248573, "rating": 5.0, "text": "If you are looking for a gym that will take you in as you are and motivate you, this is the place. I am going on 8 months with this bunch and its hands down the best choice I could have ever made! The second you walk in the door on day one you are greeted with friendly, helpful, smiling faces. You will quickly NOT be a stranger! The members and coaches of Forge do not care if it is your first day ever in a gym, first time trying Crossfit,  if you are a scaled or  RX+ athlete, new mother getting back on your fitness journey, whether you're in your 20's or 50's, you will always get cheered on, coached, and pushed the same the same every single day in the best, positive way. With some of the best programming around, the coaches make it easy to be a better you.  They meet you where you are based off your bodies needs whether that's doing 1 rep or 15. Your gym friends quickly become your gym FAMILY that you stay after class with, and share laughs and good talks with. It becomes the best part of your everyday routine. Forge Fitness also features recovery shop options, sauna, childcare, cardio room, basketball court, soccer field, and track. There's a place for all members of your family here. I have been a member to multiple gyms across Eastern-Central Alabama, and you won't find another  home gym like this!", "pics": null, "resp": {"time": 1623838981487, "text": "This is hands down one of the most thoughtful review we have ever received. We truly appreciate you and all the support!!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "105661757138413626431", "name": "Armando Guell", "time": 1621191204202, "rating": 5.0, "text": "Amazing facility with a lot of culture in it! Atmosphere is great even when there are no classes going. The owner is a top notch guy, very helpful and passionate with what he does. I will definitely come back here as a drop in!", "pics": null, "resp": {"time": 1621301376814, "text": "Thank you Armando for the awesome review and come see us any time!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "114530573034780052089", "name": "Nick Quinn", "time": 1622242433579, "rating": 5.0, "text": "Forge Fitness is more than a gym, it’s a family! This is the most professional well kept gym that I have ever been a part of! Their coaches are very knowledgeable and they have top of the line facilities. You cannot go wrong with this gym!", "pics": null, "resp": {"time": 1622244097478, "text": "Love you Nick and appreciate you and all the support of Forge!!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "113525485414192235270", "name": "genamueller30", "time": 1622060404539, "rating": 5.0, "text": "From the first day I walked through the doors the Forge family has treated me like I one of them. It is hard to find a more welcoming group of people. This gym is amazing.", "pics": null, "resp": {"time": 1622061735571, "text": "You are the best Gena and we appreciate you so much!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "116310135262493972935", "name": "Amanda Wineman", "time": 1621377252212, "rating": 5.0, "text": "Haven’t been active since high school sports and this place is so accepting and excited to help you. Great supportive community", "pics": null, "resp": {"time": 1621390346319, "text": "Thank you for the support and the great review!!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "115079821430239451158", "name": "Appachu Palecanda", "time": 1622691988286, "rating": 5.0, "text": "Great gym and people. Amazing facility and super cool and knowledgable coaches.", "pics": null, "resp": {"time": 1622894587991, "text": "Thank you App!!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "113319485126469122754", "name": "Harris Reynolds", "time": 1621361861686, "rating": 5.0, "text": "Holt is such a great coach. Rich is ok too! 😀", "pics": null, "resp": {"time": 1621390323654, "text": "Love the review and thank you!!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "114254526049854058236", "name": "Pablo Perea", "time": 1621433856793, "rating": 5.0, "text": "Great box, great community, great coaches. I couldn’t be happier with my gym selection!", "pics": null, "resp": {"time": 1621457690821, "text": "Thank you Pablo for the awesome review!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "113408522027276734006", "name": "Win Warren", "time": 1621380545558, "rating": 5.0, "text": "The coaches, the community, the workouts. It's all around the best gym in Birmingham!", "pics": null, "resp": {"time": 1621390371034, "text": "Thank you for the awesome review and we appreciate you and all the support!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "107101681312603191572", "name": "ryan peardon", "time": 1601673528009, "rating": 5.0, "text": "Amazing facilities. Amazing coaches. Amazing owners. I’ve been a member for going on 5 months and this place is all around amazing, from the friendly, welcoming, encouraging atmosphere, to the equipment and programming, and everything in between. I’m always glad I joined the Forge family!", "pics": null, "resp": {"time": 1601675060743, "text": "Thank you Ryan for the awesome review and we appreciate you choosing to being apart of our Forge family."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "108546702511160027639", "name": "anvesh rocks", "time": 1624589526489, "rating": 5.0, "text": "Great gym with friendly atmosphere.", "pics": null, "resp": {"time": 1624590313203, "text": "Thank you!!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "108137103407501332370", "name": "Aditya Anchan", "time": 1622075051337, "rating": 5.0, "text": "Great gym! Even better coaches!!", "pics": null, "resp": {"time": 1622075938777, "text": "Thank you Aditya for the support!!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "100004155669345971146", "name": "Sophia Hua", "time": 1507142360877, "rating": 5.0, "text": "Was visiting Birmingham from Canada for the weekend and wanted to workout. I'm so glad I got a chance to workout here, great sweaty cardio session! Everyone was super friendly and the gym was very clean. Hope to see you guys again in the future!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM0jtlCeGmOfN59x3TJbE-2cE1NLvmkKkqXtWnP=w150-h150-k-no-p"]}], "resp": {"time": 1507144480869, "text": "Thank you Sophia for the 5 star review. How was the Alabama game?"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "108684321876282780580", "name": "Josh Holden", "time": 1596301338001, "rating": 5.0, "text": "Needed to use some equipment to get ready for Comp and they were happy to help. Did wod while I was there and really enjoyed it. Nice people, quality instruction and programming and great environment.", "pics": null, "resp": {"time": 1596305040416, "text": "Thank you Josh for the review and please come by anytime. Stay strong and stay healthy and good luck with the Comp!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "108254398062181556953", "name": "TJ Gonser", "time": 1610588933459, "rating": 5.0, "text": "Great culture great equipment great family run business.", "pics": null, "resp": {"time": 1614118170415, "text": "Thank you"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "118293991629626187995", "name": "Thomas Kopec", "time": 1558565969435, "rating": 5.0, "text": "I joined last summer (2018) and haven’t been able to be as regular as I would like- but even after not seeing me for a very long time the owner (Rich) recognizes me and stopped what he was doing to have a conversation with me to catch up. Those kinds of experiences really make you feel like you are pet of a family.\n\nThe coaches have all been wonderful, as well! They are very personable and interested in your individual fitness goals. They have been helpful with technique and suggesting scale (alternate) exercises when necessary also.\n\nFinally, the other members have all been very welcoming and friendly, which again helps foster an inviting atmosphere.\n\nThe facilities are fantastic (they have showers so you can get back to work after a class), and I love being a part of Forge Fitness! No complaints! Come try it out! They let me attend a few classes before deciding if it was a fit for me or not, so come try for yourself!", "pics": null, "resp": {"time": 1558616722965, "text": "Wow, what an awesome review. It is so good to see you in the gym and we truly appreciate the review. We look forward to helping you meet your goals."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "105492744694971212023", "name": "Jon Sheets", "time": 1590703015274, "rating": 5.0, "text": "The environment was incredible. The people were really friendly and the staff were so helpful! Definitely going to revisit soon!", "pics": null, "resp": {"time": 1590708911529, "text": "That’s so much and appreciate the awesome review. Look forward to seeing you again."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "100536019755252090895", "name": "Shree Bostick", "time": 1577700110824, "rating": 5.0, "text": "Definitely one of the best gyms in the Birmingham area!! I couldn't have pick a better place to call my new crossfit home after moving to Birmingham!! Great atmosphere, people, coaches and owners!! To anyone looking for a great facility to train or get a good workout in at definitely choose Forge Fitness!!!", "pics": null, "resp": {"time": 1584353760555, "text": "Thank you for the awesome review!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "103361312640876783481", "name": "Chase Glasgow", "time": 1578580393252, "rating": 5.0, "text": "Just finished up my Basics 101 classes with Paula and it was a blast! Forge is the most welcoming gym I've been a part of. The facility is amazing, spacious, and has everything you could possibly want!", "pics": null, "resp": {"time": 1584353742020, "text": "Thank you for the review and we love having you in the gym!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "105147998163842419877", "name": "Mela Donoso", "time": 1573697578993, "rating": 5.0, "text": "Being new to Alabama and not knowing a lot of people was a bit hard, but since starting at Forge I’ve met some awesome people who have made Birmingham feel like home now!\nEven my kids love coming along with me, owners are awesome and so are the coaches and all members!\nTruly a family/community feel to this gym!", "pics": null, "resp": {"time": 1573704305819, "text": "Thank you Mela for the awesome review and we are so glad you are enjoying it! It’s been a pleasure getting to know you and your family. #forgefam"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "104437803635671332373", "name": "Holly Cross", "time": 1573065200324, "rating": 5.0, "text": "I moved to Alabama alone and not knowing anyone. I had never done CrossFit in my life but these people took me under their wing immediately. My home away from home, truly blessed. Highly recommend!", "pics": null, "resp": {"time": 1573097045637, "text": "Holly, I’m glad you feel that way but we believe anyone that is apart of Forge is family. We are lucky to have you and Boomer as part of the family."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "111928471757468131879", "name": "Chris", "time": 1558393675797, "rating": 5.0, "text": "Was in town visiting family and needed a place to get in a workout. Rich, quickly responded to my inquiry online and openly invited me to the gym. They had a large variety of equipment for a good functional fitness workout, it was clean and in good shape. The staff was very friendly, as well as all the members. I will definitely visit Forge Fitness every time I come back in town.", "pics": null, "resp": {"time": 1558394780241, "text": "Thanks for the review Chris and we look forward to seeing you again!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "116972214040692566725", "name": "John Christopherson", "time": 1576110658595, "rating": 5.0, "text": "Couldn't say enough good things about Forge! The coaches are awesome and always trying to help you improve. The gym is huge, has great equipment and alway kept clean. The showers and sauna are a plus. And most importantly the members are very supportive!", "pics": null, "resp": {"time": 1576118678464, "text": "Thank you John for the Awesome review and we are so blessed to have members like yourself!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "104223426086013875058", "name": "Hobie Cole", "time": 1590712666010, "rating": 5.0, "text": "Great environment and the staff are very helpful. Great place to workout. Highly recommend.", "pics": null, "resp": {"time": 1590713504290, "text": "Thank you for the awesome review!!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "118155022927189916996", "name": "Caroline Jenkins", "time": 1593778012720, "rating": 5.0, "text": "Forge is an extremely welcoming gym with great crosssfit programming. The coaches are wonderful!", "pics": null, "resp": {"time": 1593894892345, "text": "Thank you for supporting us and being apart of our community. We couldn’t do it without the love and support of people like you."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "105162938909659651196", "name": "Anne True", "time": 1573707069949, "rating": 5.0, "text": "Best gym experience in town. Great coaches and fun workouts. Come to get in shape, stay for the community. Getting to Forge after work is the highlight of my day.\n\nThanks for doing what you do!", "pics": null, "resp": {"time": 1573731063743, "text": "Thank you True! We appreciate you so much and it’s been awesome to watch you develop into such a great athlete."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "101146500935797199742", "name": "Leigha McLendon", "time": 1621635573933, "rating": 5.0, "text": "Family owned and operated, and they make you feel like part of the family.\nFor me, a great deal of the attraction to CrossFit is the sence community, and none of the other CrossFit boxes I've been to have as great of a community feel as Forge does.\nThe coaches care, are knowledgeable, and always have advise and recommendations on how to scale any movement.", "pics": null, "resp": {"time": 1574858997587, "text": "Leigha, thank you for the warm review and kind words. We are so glad that you have enjoyed forge and we appreciate the support over the years."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "113063570656897860688", "name": "Libby Loveless", "time": 1574711652665, "rating": 5.0, "text": "Family oriented gym with the kindest people around. Talented, qualified, and intelligent coaches and administrators who support you and your fitness goals! This is a unique Crossfit gym.", "pics": null, "resp": {"time": 1574858311331, "text": "So kind and we truly appreciate the support!!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "114295249425330459116", "name": "Aaron Wolff", "time": 1621361859153, "rating": 5.0, "text": "Best CrossFit gym in Alabama!", "pics": null, "resp": {"time": 1593737027540, "text": "Thank you Aaron for the review and the support!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "109493662881038952059", "name": "John Gonser", "time": 1584282980550, "rating": 5.0, "text": "Cleanest CrossFit facility I've ever dropped in. Great coaching and a very large gym.", "pics": null, "resp": {"time": 1584353678256, "text": "Thank you for the review"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "101131982104258109312", "name": "Haleigh Chastain", "time": 1554921108797, "rating": 5.0, "text": "Forge is more than just a gym. It is a community where people come together to workout while forming friendships. I joined Forge 3 years ago when I moved to Birmingham and did not know anyone, now most of my best friends are from the gym. If you are looking for a new gym, I cannot recommend this place enough!", "pics": null, "resp": {"time": 1554928152110, "text": "You are the best Haleigh and we truly appreciate all your help and support of the years."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "111947437426456966789", "name": "Grant Scoble", "time": 1555001587335, "rating": 5.0, "text": "Forge Fitness did an excellent job of getting me back in the game. I also was able to learn best practices for recovery by having their recovery center available with my membership. You feel apart of a family as soon as you walk in.", "pics": null, "resp": {"time": 1555024556574, "text": "Thank you Grant for all the support and encouragement."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "113341143116000182174", "name": "Kyle Schwab", "time": 1575478093036, "rating": 5.0, "text": "Huge, friendly, affordable, and clean facility.  I highly recommend dropping in for a class and seeing this place.", "pics": null, "resp": {"time": 1575489697195, "text": "Thank you Kyle and we appreciate all the support!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "101572926410279582296", "name": "Katie Lucas", "time": 1550788231273, "rating": 5.0, "text": "Forge Fitness is definitely the gym to go to in the Vestavia Hills area. The owners, Patti and Rich, are so personable and friendly. They are always working to help you attain your fitness goals with a refreshing and positive attitude. Great environment, staff, and facilities.", "pics": null, "resp": {"time": 1550792758113, "text": "We truly appreciate the review and your support!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "106435105824450273253", "name": "Michael Gonser", "time": 1584285968948, "rating": 5.0, "text": "Extremely friendly staff, I love how big and spacious the place is, soccer field is amazing!", "pics": null, "resp": {"time": 1584353666434, "text": "Thank you for the review and come see us in Birmingham the next time you are in town."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "104627923582672070040", "name": "Suzie Spooner", "time": 1486827071510, "rating": 5.0, "text": "Forge is not just a gym, it's a community. A community of athletes with different skill levels. A community where athletes encourage each other to give 100% no matter where you are in your training. Forge offers coaches who are knowledgeable about each movement and who want to help each individual attain the goals they have set for themselves. Forge is a community of  friends. I wouldn't go anywhere else!!", "pics": null, "resp": {"time": 1486842879077, "text": "You are the best! Thank you for the review and being apart of our community."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "112974297835777518653", "name": "Lindsay Sport", "time": 1554856377063, "rating": 5.0, "text": "I have been involved in many Crossfit gyms throughout my years in fitness. The quad facility, the forge Crossfit community, and the equipment is the best around!  From the moment I stepped foot in forge I felt nothing but welcomed. If you want to come learn from some of the best at their trade and train in nice, clean, and welcoming environment- then you have found the place.", "pics": null, "resp": {"time": 1554859702695, "text": "That you Lindsay for all the support and it wouldn’t be Forge with out people like you."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "103610777712575692006", "name": "Owen Stayner/ThisWorkplace360", "time": 1557944788334, "rating": 5.0, "text": "Excellent space and outside area. This is good way to get to know people while working out.  Great sense of community!", "pics": null, "resp": {"time": 1557951038942, "text": "Thank you Owen for the support!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "116396934740907610944", "name": "Alanna Smith", "time": 1574104263071, "rating": 5.0, "text": "The facilities are top notch and you'll be hard pressed to find a more warm and welcoming community!", "pics": null, "resp": {"time": 1574858270737, "text": "Thank you Alanna and we appreciate all the support!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "110763785280045731470", "name": "Aaron Scroggins", "time": 1558576883915, "rating": 5.0, "text": "I have been going to Forge for many years, so I obviously enjoy it! I’m in sales and travel for work. I get to go into many CrossFit gyms and none of them compare to the facility we have at the Quad. If you are in town visiting or looking for a change please come and drop in for a WOD.", "pics": null, "resp": {"time": 1485533104259, "text": "Thank you Aaron for the review and we love having you as part of the Forge community."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "107389832046242827748", "name": "Leslie Parrish", "time": 1409021823732, "rating": 5.0, "text": "I went to this gym for over a year, and I'm telling you that there's no better gym in Birmingham. The owners, Rich and Chris, along with all of the other coaches, have a firm commitment to doing things the right and most safe way possible. I left this gym in the best shape of my life and with some of the best friends a person could have. So not only will you get a great workout, you'll also make a ton of great friends. I've since relocated to Tuscaloosa, but try to make it back to Forge as much as possible!", "pics": null, "resp": null, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "101568166335135785164", "name": "Pilar Rodriguez", "time": 1557507776118, "rating": 5.0, "text": "Ive been to many Crossfit gyms before. The level of cleanliness and the resources this gym has is incredible. The staff and members are some of the finest people I have ever met!", "pics": null, "resp": {"time": 1557508262988, "text": "Thank you Pilar for the review. We appreciate all the support."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "112055592297213122517", "name": "Jim Gonser", "time": 1584201576402, "rating": 5.0, "text": "Dropping in from Kansas one of the greatest places and the nicest people amazing facility", "pics": null, "resp": {"time": 1584205595572, "text": "Thank you sir for the awesome review."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "117282883721889819234", "name": "Shandi White", "time": 1485533226754, "rating": 5.0, "text": "Most positive gym experience I've ever had!  Forge has a created a family atmosphere with the motivation of your favorite high school coach combined with friendliness of your favorite church.\n\nThey care about your progress, and they notice when you're not there.  They're not just interested in your membership, they're interested in your success!\n\nWhether you're new to CrossFit or a regular competitive pro looking for a more positive gym experience, Forge in Vestavia is the perfect fit.", "pics": null, "resp": {"time": 1485556067299, "text": "Thank you Shandi for the awesome review. Your such a great person and we appreciate your support inside the gym and out."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "104341939755398079560", "name": "ghk142000", "time": 1495302836005, "rating": 5.0, "text": "Just began working out here 3 weeks ago. Very welcoming and fun atmosphere with a lot of great people. Rich and the rest of trainers have been nothing but helpful. Makes working out fun again.", "pics": null, "resp": {"time": 1495315610738, "text": "Thank you for the awesome review! I can't wait to see what all you accomplish. Keep up the hard work!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "109181429585034917960", "name": "ly walthall", "time": 1485570411589, "rating": 5.0, "text": "Really great gym. This is a great CrossFit gym. I've been to several and this one is the best. Great floor plan, tons of equipment so you don't have to wait around for someone to finish to do your WOD. The trainer's are fantastic, they will push you to do your absolute best. Not to mention there are several amenities and concessions; showers, energy drinks, recovery drinks, coffee machine, protein supplements and these killer peanut butter balls that are to die for. If your looking for a place to work out that will actually push you and and has a great community, this is it.", "pics": null, "resp": {"time": 1485578913278, "text": "Thank you for the awesome feedback! You didn't forgot one detail. You are the best."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "115173353560062620828", "name": "Dan Odle", "time": 1485536949342, "rating": 5.0, "text": "Great gym. Great coaches. Great people. While the workouts are solid and will kick your tail (in a good way), it's the community that makes the difference. We literally build our schedule around our workouts and are thankful for our Forge family.", "pics": null, "resp": {"time": 1485554335139, "text": "Thank you Dan for the awesome review. You and Stephanie have truly brought so much energy to our community. Forge wouldn't be the same without you both."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "104568608192400707035", "name": "Parker Smith", "time": 1486568686034, "rating": 5.0, "text": "I've been attending Forge for three years and there isn't a better gym in Birmingham! The attentiveness of the staff and the welcoming of its members is second to none! I give all the credit to them for helping me be in the best shape of my life.", "pics": null, "resp": {"time": 1486570431215, "text": "We love you Parker and you have accomplished so much in 3 years. Keep up the awesome work and let's see what you do over the next 3 years. Thank you for the great review!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "112875214717622072184", "name": "Chase Meadows", "time": 1486798247327, "rating": 5.0, "text": "Forge is the only Crossfit gym that I've been to, and it has so far been quite a positive experience. Proper technique is emphasized which has helped me stay injury free and improve my overall flexibility. I joined with the hope of regaining some of my previous quickness so that I could perform better in tennis and flag football, and it has certainly helped in that regard... You'll obviously only get out what you put into it, but all of the coaches are very knowledgeable and more than happy to discuss proper form, nutrition, supplements, etc. with you as well as demonstrate the correct technique of the different lifts when asked.", "pics": null, "resp": {"time": 1486818651009, "text": "Thank you Chase for the awesome review. We truly enjoy having you as a solid member of Forge."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "111423509120984163712", "name": "Dalton Roberts", "time": 1554853421995, "rating": 5.0, "text": "Friendly place where the people you work out with become your bestfriends. Have felt at home since the first day I walked in. Very encouraging people at Forge to help you be your best self. Classes all day to benefit your availability. Saturday morning Olympic lifting class and Partner WOD. Let Forge be the best part of your day.", "pics": null, "resp": {"time": 1554855876953, "text": "You are the best Dalton and people like you are the reason while people keep coming back."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "109973347616678793339", "name": "Jacob W", "time": 1564187962733, "rating": 5.0, "text": "Incredible space with some awesome members, coaches and owners. One workout and you feel like a part of the family!", "pics": null, "resp": {"time": 1564190162978, "text": "Thank you Jacob for the review and Yes you are part of the fam. Come back anytime and workout with us."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "116373701486077727178", "name": "Brandon Simmons", "time": 1383945065359, "rating": 5.0, "text": "I just started traveling to Birmingham for business and wanted to find a place in which to work out while I was in town.  I came across Forge Fitness on Google and messaged them to set up a meeting when I got in town.  I will be going here for the next few months while I am in town.  The trainers are knowledgeable, outgoing, and great motivators.  The place is incredibly clean and the equipment brand new.  Great owners and great members.", "pics": null, "resp": {"time": 1464288582424, "text": "We miss you Brandon and we appreciate all the support!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "113161300289552682003", "name": "Jack Eisenhut", "time": 1454533629631, "rating": 5.0, "text": "Great CrossFit experience!  Chris Wade is a co-owner and coach at this gym.  It was obvious that he is an experienced coach with a passion for what he is doing.\n\nThey filled the entire hour giving the expected value to each member.  The class started with a group warm-up, moved to strength component, then the workout of the day and finally a nice stretch/cool down.\n\nFinally, I travel for work and drop into many CrossFit gyms around the country.  If you live in Birmingham area, this is a gym you have to look at.", "pics": null, "resp": {"time": 1454644142093, "text": "Thank you the awesome feedback and we look forward to seeing you again!👊🏽💪💪"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "108294582611131947801", "name": "Lesley Hendon", "time": 1414608399460, "rating": 5.0, "text": "I just started in June of this year with the hopes of loosing the remainder of my baby weight! Chris and Rich are amazing and have made getting back in to shape something I actually enjoy! I have pushed myself so much further than I ever did in a conventional gym and have seen great results. They explain everything in great detail and coach you closely so you learn the correct way of doing things. I was super intimidated of the whole \"crossfit\" idea but Forge has changed that perception and made it something I truly enjoy!", "pics": null, "resp": {"time": 1464288515551, "text": "Thank you for your support Lesley!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "112274224279740170809", "name": "Haleigh Robinson", "time": 1485553389627, "rating": 5.0, "text": "Great gym with awesome members and coaches. I originally chose Forge because of location, but now there's not another gym in Birmingham I'd ever go to! I've accomplished so much more than I ever thought possible with the help of the Forge coaches.", "pics": null, "resp": {"time": 1485553877066, "text": "Thank you Haleigh for the awesome review and we love having you as part of the Forge family."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "105144725001942790809", "name": "Jason Maeder", "time": 1456800762026, "rating": 5.0, "text": "Great gym, great people.  Dropped in for a class while traveling and had a great workout.  Rich and Conrad made us feel right at home.  I'll be back next time we're in town.", "pics": null, "resp": {"time": 1464288436138, "text": "Thank you for the great feedback!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "110503651688595251803", "name": "derek schiefer", "time": 1494276145594, "rating": 5.0, "text": "Great gym!!! Awesome equipment all well maintained. Great lockers and restrooms. We even brought our kids with us and there is a room for them to hang out.\n\nThanks for the WOD.", "pics": null, "resp": {"time": 1494277121027, "text": "We are so glad you enjoyed Forge. Thank you for the feedback and we look forward to seeing you again."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "106011325398211236668", "name": "ryan barkley", "time": 1507997105904, "rating": 5.0, "text": "I've dropped into Boxes all over Alabama, Florida, and Louisiana and these guys might be the friendliest. Really enjoyed the WOD. Great environment to train. Owner is a class act.", "pics": null, "resp": {"time": 1508001305593, "text": "Hey Ryan!! Thank you for such a great review! We loved having you and you crushed the WOD. Hope you enjoy your volleyball tournament! Come back any time!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "104880920792756124907", "name": "Tyler Thompson", "time": 1486486032828, "rating": 5.0, "text": "Great CrossFit experience! Great people and great atmosphere. The coaches really know their stuff and are very helpful. Highly recommend this place!", "pics": null, "resp": {"time": 1486486794433, "text": "Great review and we truly appreciate your energy at Forge. However, we need a Tyler bicep region for every member."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "106103252068660300365", "name": "Jessica Lovel", "time": 1554923295776, "rating": 5.0, "text": "Great atmosphere, great owners and coaches! My day isn’t complete until I’ve been to the gym!", "pics": null, "resp": {"time": 1554928088731, "text": "We love you Jess and thank you for the review!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "115795411987355988454", "name": "Jason Jaegers", "time": 1485574388613, "rating": 5.0, "text": "Forge is a great place to work out. Not only is the facility clean and convenient but the staff is friendly and professional. The camaraderie between the members is as goods as it gets.", "pics": null, "resp": {"time": 1485578942248, "text": "Thank you for the awesome feedback! Come see us soon."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "100339427723528987960", "name": "Scotty Bostick", "time": 1574978104452, "rating": 5.0, "text": "Awesome experience! Would rate 6 stars", "pics": null, "resp": {"time": 1574988016729, "text": "Thank you brother!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "116052929774426158548", "name": "Tyler Landolt", "time": 1508257748079, "rating": 5.0, "text": "Everyone involved in this gym is amazing! The coaches, the members and the owner all come together to make one amazing community.", "pics": null, "resp": {"time": 1508258539128, "text": "You are awesome Tyler. Thank you for the review."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "110962846307423659400", "name": "Jake C.", "time": 1483029971910, "rating": 5.0, "text": "I've been coming to this gym for several years now.  Rich and the coaches at the gym are very enthusiastic and have always been incredibly attentive to my needs.  Caleb and Conrad always take the time to pay extra attention to beginners or people that need additional instruction and always do a great job leading class and keeping things fun.  The gym community is very welcoming to beginners and visitors and the atmosphere is very family friendly.  The gym itself is clean, spacious and well-organized.  I was spoiled by the fact that it had Heat when I dropped into a few other gyms last winter and nearly froze to death.  If you are looking for a superb Crossfit gym to join or just visit while in town, Forge is a solid place to do tough workouts with great people.", "pics": null, "resp": {"time": 1483041942277, "text": "Thank you so much Jake for being such a valuable asset to Forge. It's been impressive watching you meet your Fitness goals since starting CrossFit. You have done a great job and we look forward to watching you dominate the CrossFit Open in 2017."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "107311062087670672920", "name": "Regan Claire Hibbs", "time": 1554847968214, "rating": 5.0, "text": "Forge has such a strong sense of community and the new facility is so functional!", "pics": null, "resp": {"time": 1554852943603, "text": "Thanks for the review. Keep them coming."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "115013818793274652405", "name": "Stephanie Odle", "time": 1485552914110, "rating": 5.0, "text": "Great community. Great coaching. Great workouts. Love this Crossfit  family. I came to Forge wanting to improve and ramp up my training. Forge has helped me do that. If you're looking for a Crossfit community, you'll find it here.", "pics": null, "resp": {"time": 1485554015807, "text": "Thank you Stephanie for the awesome review and we really love having you as part of the Forge family."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "103459648957546801392", "name": "Alphonso Lewis", "time": 1485611995473, "rating": 5.0, "text": "Amazing workouts with a collection of competitive individuals. You could call everybody there one big competitive and  fit family", "pics": null, "resp": {"time": 1485624508624, "text": "Thank you Alphonso and we love your energy in the gym. The morning crew is looking forward to seeing you at 5:30am."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "108074218459457475870", "name": "Justin Lobdell", "time": 1513799926345, "rating": 5.0, "text": "Great facility with exceptional trainers that work one-on-one with you to secure your health/safety as well as push you to enhance your fitness skills/level!", "pics": null, "resp": {"time": 1513803736533, "text": "Thank you so much Justin for the awesome review. We appreciate you supporting Forge Fitness!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "117823288051871761331", "name": "Brad Barber", "time": 1539447310670, "rating": 5.0, "text": "Big box and a very friendly welcome when I dropped in. I’d definitely recommend Forge!", "pics": null, "resp": {"time": 1539453465194, "text": "Thank you Brad for dropping in and please come see us again."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "111724459151214506691", "name": "Sarah Lawson", "time": 1485626206732, "rating": 5.0, "text": "Great space with clean equipment and helpful, friendly staff. Plenty of parking. I'm not a crossfitter myself but I visited with a friend and was impressed by Forge and the people here!", "pics": null, "resp": {"time": 1485629051028, "text": "Thank you for the awesome review!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "100296335852668058410", "name": "Bradley Davidson", "time": 1493045997516, "rating": 5.0, "text": "Great experience for a great value. Caleb Dodd is a great coach and motivator. Class times and locations are perfect for anyone, espcially for those who live or work over the mountain.", "pics": null, "resp": {"time": 1493048027459, "text": "Thank you BRADLEY for the feedback. We look forward to seeing back in the gym this week."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "113631033315506598161", "name": "Rodney Overstreet", "time": 1372731274831, "rating": 5.0, "text": "I visited this box last Sat for their inaugural WOD. It was really tough and fun. Full disclosure: Rich & Chris are friends of mine. However, they are also enthusiastic, friendly, & knowledgable coaches. The space is large and well designed. I can recommend this box without reservation.", "pics": null, "resp": {"time": 1464288559772, "text": "Thank you Rodney for all the support!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "107634822470461782570", "name": "Matt Mogle", "time": 1409083046265, "rating": 5.0, "text": "Great gym with a great community. I've been to other Crossfit gyms around the World and this one is special. It's an incredibly encouraging environment and a wonderful place to watch people continue to get better and excel every day. Really cool to see your seasoned Crossfit veterans working out right next to beginners and encouraging one another throughout.", "pics": null, "resp": null, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "108719836781093958731", "name": "Deborah Pennino", "time": 1486486120476, "rating": 5.0, "text": "Great close-knitted gym with experienced and friendly staff.  It is very clean and has excellent equipment for workouts.", "pics": null, "resp": {"time": 1486486819460, "text": "Thank you for the AWESOME review!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "104980624644580402831", "name": "Clarisse Jackson", "time": 1410194350227, "rating": 5.0, "text": "I've never crossFit before and after searching for different gyms, I couldn't be happier to have chosen Forge. The atmosphere, the people and best of all the owners Chris and Rich show true commitment to their members and are able to push you to your limits in the safest way possible. I've tried different classes and exercises but was never constant because I will get bored, well let me tell you; I haven't gotten bored since I started going to Forge, it has been 9 months so far and I don't want to stop. I look forward to my classes and to the people that I've met at the gym. Plus is clean, has A/C and they put great music. So if you are looking into CrossFit in this area, this is the place to be!!!", "pics": null, "resp": {"time": 1464288405432, "text": "You are awesome and we truly appreciate your support!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "116115683560655377097", "name": "Stacey Hood", "time": 1461423827550, "rating": 5.0, "text": "Great gym, been to several others, but this place is top level and professional from the moment you walk in. It's everything that anyone could ever want in a CrossFit gym.", "pics": null, "resp": {"time": 1464288062454, "text": "Thank you for the feedback and we appreciate the support!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "106550827536935934234", "name": "Brooks Gant", "time": 1485791955933, "rating": 5.0, "text": "Cannot say enough good things about Forge Fitness in Vestavia! Coming from a cycling and running background, I was burnt out and looking for something new and challenging. After speaking with several crossfit gyms in the area, something just felt \"right\" about Forge and so I joined the 101 class. 9 months later I am probably in the best overall shape I have ever been in! From all the coaches who truly care about their athletes, to the positive and encouraging atmosphere, as well as all the great people I have met, if you have ever thought about giving crossfit a try, I highly recommend checking out Forge Fitness.", "pics": null, "resp": {"time": 1485792986072, "text": "Wow Brooks, thank you for the awesome review and we truly love having you as a solid member of the Forge Family. Keep up the great work!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "100317028911276321745", "name": "Sharon A. Moskowitz", "time": 1502398265568, "rating": 5.0, "text": "CrossFit Shades / Forge Fitness is awesome.  I travel to the Birmingham area for work once a month and was looking for a gym/box that has hours on Sunday.  I had heard some not-so-great things about a few boxes but I hadn't heard of Forge Fitness/ CF Shades.  Not only is CF Shades the only place with Sunday hours, but they were above and beyond wonderfully welcoming when I showed up unannounced during their open gym period.  Upon first glance, the gym was very clean, which is not very common among CrossFit and Crossfit-inspired facilities.  The owner, Rich, jumped up from a staff meeting and gave me a tour and after learning of my CF history, invited me to use any and all of their space as well as invited me back through my duration of stay while in town.  They have an awesome workout space out back with a platform, squat racks and a rig and the running course around the building is super safe.  I also met coaches Caleb, Josh and Rebecca who were all very accommodating and friendly.  When I returned for a class, Rebecca coached and I really appreciated her attentiveness.  I'm a CrossFit coach in Denver and because I move relatively well, I tend to get left alone - but I love being coached when I drop into new places and Rebecca was great.  I HIGHLY RECOMMEND travelers and locals to visit.  If you're a member somewhere else in Hometown or Birmingham, switch now.   I'll be back there for sure when I'm in town next.", "pics": null, "resp": {"time": 1505150475556, "text": "Hey Sharon, Thank you very much for this amazing review. This has to be the best review anyone could ever receive. We truly appreciate what you are doing and we look forward to seeing you next time you are back in the area."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "116494427880515182258", "name": "Justin Missanelli", "time": 1406579594581, "rating": 4.0, "text": "Friendly environment for fitness.  Competitive for those serious workout fiends. Don't let the afternoon classes intimidate you though, the people are friendly if you just talk to them.", "pics": null, "resp": null, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "101955416889578350846", "name": "Clay Conner", "time": 1485538435025, "rating": 5.0, "text": "Great gym, great people and great results! Highly recommended.", "pics": null, "resp": {"time": 1485554209346, "text": "You left out great programming and great workouts. We love you Clay and we appreciate everything you do for Forge."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "108162578406931661522", "name": "Nicole Dilg Beachum", "time": 1409021260449, "rating": 5.0, "text": "The trainers at Forge are great. If you want to try CrossFit, this is the place to go in Birmingham.", "pics": null, "resp": {"time": 1464288347557, "text": "Thank you for your support!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "113281844201244003346", "name": "desandra martinez", "time": 1584281808711, "rating": 5.0, "text": "Awesome! Great workouts", "pics": null, "resp": {"time": 1584353700060, "text": "Thank you for the review and come see us the next time you are in town."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "110357499333532351918", "name": "Conrad Taylor", "time": 1485448354177, "rating": 5.0, "text": "Great gym. Great athletes. Great community!", "pics": null, "resp": {"time": 1485533165467, "text": "Thank you for our awesome review."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "111942934342905766653", "name": "James LeCroy", "time": 1485880350485, "rating": 5.0, "text": "Started working out here over 2 years ago and have regretted one minute of it.", "pics": null, "resp": {"time": 1485885736014, "text": "Thank you for the review."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "110534150640619736494", "name": "Garrett Doss", "time": 1485552039840, "rating": 5.0, "text": "Can't go wrong.  Great gym!", "pics": null, "resp": {"time": 1485554048081, "text": "My man Garret. Thank you for the review and being awesome!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "109419341296845781179", "name": "Joe Ross Merritt", "time": 1430169970337, "rating": 5.0, "text": "Best Crossfit experience in Birmingham.  Great coaching and community..", "pics": null, "resp": {"time": 1464288483573, "text": "Thank you Joe Ross and we appreciate your support. We look forward to seeing you soon."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "103596435538903360458", "name": "Forge Fitness Powered by CrossFit Shades", "time": 1406584097077, "rating": 5.0, "text": "We appreciate our community and want to thank everyone for the support we've received from our members and their families since we've been open. Our members make it all happen.", "pics": null, "resp": null, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "112408622194949988334", "name": "Joey Beachum", "time": 1409021075514, "rating": 5.0, "text": "Great gym. If you want to get in shape, there's no better place in Birmingham.", "pics": null, "resp": {"time": 1464288608442, "text": "Thank you Joey for the support!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "115918429655402412118", "name": "Ploppy", "time": 1572475491380, "rating": 5.0, "text": "Just awesome place!", "pics": null, "resp": {"time": 1572479913875, "text": "Thank you Austin for the review!!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "112656134957250882475", "name": "Kelly Doss", "time": 1485551788333, "rating": 5.0, "text": "Great place! Convenient and accessible.", "pics": null, "resp": {"time": 1485554161470, "text": "Thank you Kelly for the awesome review!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "109878458674476514969", "name": "samuel walthall", "time": 1485569989160, "rating": 5.0, "text": "Awesome gym. The best coaches!!!", "pics": null, "resp": {"time": 1485578817465, "text": "Thank you for the awesome feedback!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "104384196306767622313", "name": "Todd Hollifield", "time": 1485783719596, "rating": 5.0, "text": "Great trainers and great athletes.", "pics": null, "resp": {"time": 1485784741809, "text": "Thank you Todd for the review and we greatly appreciate your support of Forge."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "113775718873737455635", "name": "Nate Mothershed", "time": 1485570044092, "rating": 5.0, "text": "Great place. Treated like FAMILY!!!", "pics": null, "resp": {"time": 1485578840696, "text": "Thank you for the awesome feedback!"}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "113970120484563681586", "name": "Brandon Stewart", "time": 1485535315138, "rating": 5.0, "text": "Great Gym, great people!", "pics": null, "resp": {"time": 1485555820321, "text": "Thank you for the review. It's been awesome training with you for the last 5 years. Also, it's awesome seeing your passion for fitness and life. Thank you for being apart of the Forge family."}, "gmap_id": "0x888918d081501381:0x9e51f71e4fd382be"}
{"user_id": "110556736777997308051", "name": "Jackson McMillan", "time": 1590709155770, "rating": 5.0, "text": "Owner super nice, great guy. Awesome facility has everything you will need.", "pics": null, "resp": {"time": 1590713337435, "text": "Thank you for the great review and appreciate the support!"}, "gmap_id": "0x888919a187f2eab3:0x91d8db4a065c2720"}
{"user_id": "116203798558571013536", "name": "Daniel Pritchett", "time": 1556839258761, "rating": 5.0, "text": "If you are looking for a clean and spacious gym with an abundant supply of the nicest equipment in town then Quad is your spot. I have dropped into Quad a few times. The people who make up Quad are the most friendly and motivating individuals you can meet. If you are in the area I would 100% check this place out.", "pics": null, "resp": {"time": 1556853761670, "text": "Thank you brother for the feedback and we greatly appreciate all the support!"}, "gmap_id": "0x888919a187f2eab3:0x91d8db4a065c2720"}
{"user_id": "118055535172678968565", "name": "Sarah Ladick", "time": 1554921733841, "rating": 5.0, "text": "Quad is an awesome place to train. The facility is so spacious, clean and all the equipment is well taken care of. The coaches that lead the classes help you every step of the way. Everyone is so friendly you feel like family. Highly recommend!", "pics": null, "resp": {"time": 1554948424867, "text": "You are family and it’s awesome to have you and the family working out with us again!"}, "gmap_id": "0x888919a187f2eab3:0x91d8db4a065c2720"}
{"user_id": "111947437426456966789", "name": "Grant Scoble", "time": 1555001646244, "rating": 5.0, "text": "Quad did an excellent job of getting me back in the game. I also was able to learn best practices for recovery by having their recovery center available with my membership. You feel apart of a family as soon as you walk in.", "pics": null, "resp": {"time": 1555074042684, "text": "Thank you for the review and all the support!"}, "gmap_id": "0x888919a187f2eab3:0x91d8db4a065c2720"}
{"user_id": "108074218459457475870", "name": "Justin Lobdell", "time": 1554853993370, "rating": 5.0, "text": "Everything you need under one roof! Awesome group fitness, one on one training, full size basketball court and a recovery shop. Great coaches who truly care about your well being and push you to get better every day!", "pics": null, "resp": {"time": 1554854297775, "text": "You are the greatest!!"}, "gmap_id": "0x888919a187f2eab3:0x91d8db4a065c2720"}
{"user_id": "101131982104258109312", "name": "Haleigh Chastain", "time": 1554921173496, "rating": 5.0, "text": "Best facility in Birmingham! The gym has everything you need to train. Nicest equipment around town.", "pics": null, "resp": {"time": 1554948386903, "text": "Thank you for the awesome review and always being such an awesome customer!"}, "gmap_id": "0x888919a187f2eab3:0x91d8db4a065c2720"}
{"user_id": "107311062087670672920", "name": "Regan Claire Hibbs", "time": 1554939805909, "rating": 5.0, "text": "What doesn't The Quad have?! Whether you want to have an intense crossfit workout with Forge, or a good stretch at Steel City yoga you can do it all right here. The recovery center is so nice too, and I want to try the NormaTec Boots that they have in there! Everyone here is so friendly and works together well.", "pics": null, "resp": {"time": 1554948363728, "text": "Thank you for the amazing review and checking everyone out!"}, "gmap_id": "0x888919a187f2eab3:0x91d8db4a065c2720"}
{"user_id": "106103252068660300365", "name": "Jessica Lovel", "time": 1554923013061, "rating": 5.0, "text": "Best facility in Birmingham! It has it all! CrossFit, yoga, sports massage and recovery, and personal training!! Great family atmosphere for me and my daughter!", "pics": null, "resp": {"time": 1554948464216, "text": "We got it all and it is because of the support of people like you."}, "gmap_id": "0x888919a187f2eab3:0x91d8db4a065c2720"}
{"user_id": "104880920792756124907", "name": "Tyler Thompson", "time": 1545499838732, "rating": 5.0, "text": "Great atmosphere and great people! Great place to get a good workout in.", "pics": null, "resp": {"time": 1554853843503, "text": "Thank you for the feedback TNT!"}, "gmap_id": "0x888919a187f2eab3:0x91d8db4a065c2720"}
{"user_id": "103610777712575692006", "name": "Owen Stayner/ThisWorkplace360", "time": 1557944891498, "rating": 5.0, "text": "Did a Google 360 tour of this business...wonderful place!", "pics": null, "resp": {"time": 1557951083047, "text": "Thank you so much for the 360 and the support!"}, "gmap_id": "0x888919a187f2eab3:0x91d8db4a065c2720"}
{"user_id": "111315288225593119168", "name": "Clay Conner", "time": 1554849079531, "rating": 5.0, "text": "The best fitness facility and family in Birmingham!", "pics": null, "resp": {"time": 1554853818164, "text": "Thank you for the feedback. We greatly appreciate the support."}, "gmap_id": "0x888919a187f2eab3:0x91d8db4a065c2720"}
{"user_id": "104582136229363800327", "name": "B. Morgan", "time": 1623189733546, "rating": 5.0, "text": "I attended a chair yoga class and loved it.  I am a senior citizen who needs to keep flexible.  Breezeville Yoga offers other classes of yoga.  I recommend it highly.", "pics": null, "resp": null, "gmap_id": "0x888e81bc0788beb1:0xc1391bdb0419b63c"}
{"user_id": "109461258598817058070", "name": "Val Acosta", "time": 1555466286081, "rating": 5.0, "text": "This is a great studio. I dropped in for a class during a short business trip to the area. The studio is beautiful, the Instructor (Hannah I believe) was amazing! I did Level 2 Hot Yoga. It was full but not crowded and it was SO HOT! I felt very welcomed even though I had never been there before. There are mats, towels and water available. After class while I waited for my Uber, Hannah waited with me so I wouldn't be alone. I will be returning to this studio during my next business trip.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNUYbm0nKu04PMhYj1omWVTIqkL0mqLCviCv3vE=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e81bc0788beb1:0xc1391bdb0419b63c"}
{"user_id": "103180011684646576523", "name": "Margaret Pittman", "time": 1595423916477, "rating": 5.0, "text": "Fantastic teachers and a wonderful atmosphere.  Breezeville is great no matter what level of yoga you're comfortable with.", "pics": null, "resp": {"time": 1610824416772, "text": "🙏"}, "gmap_id": "0x888e81bc0788beb1:0xc1391bdb0419b63c"}
{"user_id": "107147193223596715019", "name": "Erik Schweiss", "time": 1580705917956, "rating": 5.0, "text": "I'm out here for only a month but I am digging breezeville yoga. I have done yoga a few times in the past but I was never hooked on it and only tried it maybe once a year.  Some friends convinced me to go and it was the best decsion! I am having a ton of fun and I feel comfortable there at the studio trying and sometimes failing at the different positions.  Their instructors are awesome and they care about you and your experience.  If you have never gone go take a class with Breeze! He is awesome and I love his leading style.", "pics": null, "resp": {"time": 1610824536094, "text": "🙏"}, "gmap_id": "0x888e81bc0788beb1:0xc1391bdb0419b63c"}
{"user_id": "112801956661950878690", "name": "James Lee V", "time": 1591105434133, "rating": 5.0, "text": "Breeze is a great yoga teacher and Breezeville is a wonderful yoga studio.\n100% reccomended.", "pics": null, "resp": {"time": 1610824454631, "text": "🙏"}, "gmap_id": "0x888e81bc0788beb1:0xc1391bdb0419b63c"}
{"user_id": "115934751756379454934", "name": "Birdie B", "time": 1562020749036, "rating": 5.0, "text": "This studio has a fantastic variety of classes and instructors! I love the unity and peaceful atmosphere of Breezeville! I need my yoga!!", "pics": null, "resp": {"time": 1610824624372, "text": "🙏"}, "gmap_id": "0x888e81bc0788beb1:0xc1391bdb0419b63c"}
{"user_id": "115643601232541722126", "name": "holly martin", "time": 1594610535309, "rating": 5.0, "text": "Atmosphere and experience was amazing highly recommend Frank", "pics": null, "resp": {"time": 1610824436560, "text": "🙏"}, "gmap_id": "0x888e81bc0788beb1:0xc1391bdb0419b63c"}
{"user_id": "101089159616278284859", "name": "Meg Lewis", "time": 1562330580031, "rating": 5.0, "text": "Great instruction, great yoga family, and Frank continues to make this space itself more and more beautiful and welcoming. Nice variety of classes, including heated and hot options.", "pics": null, "resp": null, "gmap_id": "0x888e81bc0788beb1:0xc1391bdb0419b63c"}
{"user_id": "113236342660378200325", "name": "Rheanna Sinnett", "time": 1554148463176, "rating": 5.0, "text": "Lovely yoga studio with solid instruction and truly kind people.", "pics": null, "resp": null, "gmap_id": "0x888e81bc0788beb1:0xc1391bdb0419b63c"}
{"user_id": "103498196747131179977", "name": "helen woodall", "time": 1519183243240, "rating": 5.0, "text": "An absolutely wonderful experience. I highly recommend it. I will be going back regularly.", "pics": null, "resp": null, "gmap_id": "0x888e81bc0788beb1:0xc1391bdb0419b63c"}
{"user_id": "109525557233229163048", "name": "Danny Stephens", "time": 1523605796311, "rating": 5.0, "text": "Good vibes through and through. A place for anyone at any level in yoga and Frank is the truth. High recommendation for sure.", "pics": null, "resp": null, "gmap_id": "0x888e81bc0788beb1:0xc1391bdb0419b63c"}
{"user_id": "111981528523634177899", "name": "Tereza U Ancelet", "time": 1520853161678, "rating": 5.0, "text": "Attended my first class and loved it.  Great place.  Will definitely go again.", "pics": null, "resp": null, "gmap_id": "0x888e81bc0788beb1:0xc1391bdb0419b63c"}
{"user_id": "104550450233037052083", "name": "Rickey Moore", "time": 1451963466712, "rating": 5.0, "text": "Had my first class tonight and it was an absolute joy... not threatening at all and very relaxing... I look forward to many more classes.", "pics": null, "resp": null, "gmap_id": "0x888bb3953e22ab41:0x253da1ac058c37ba"}
{"user_id": "108615536065778492928", "name": "Lorraine Adams", "time": 1481474995199, "rating": 5.0, "text": "What a wonderful place!  Amelia makes everyone feel at home, and like part of a family.  I have learned so much from her!", "pics": null, "resp": null, "gmap_id": "0x888bb3953e22ab41:0x253da1ac058c37ba"}
{"user_id": "118027319361406612016", "name": "Heather Cole", "time": 1600134950941, "rating": 5.0, "text": "I moved from Nashville almost 2 years ago and immediately looked for a hot yoga studio. This studio far exceeded my expectations! I’ve enjoyed every class I’ve been to.  I appreciate the variety they offer and the knowledge of each instructor I’ve practiced with. From kickboxing and barre to traditional yoga classes, I’ve been challenged from each one. The facilities are clean and welcoming! You won’t be disappointed trying out a class!", "pics": null, "resp": null, "gmap_id": "0x886211937705f7e7:0x30e7a3d4d346273c"}
{"user_id": "107480874555347610553", "name": "Functional Chiropractic", "time": 1580865725191, "rating": 5.0, "text": "This place is great.  I have been doing hot yoga for 15 years.  This has become my favorite place.  One thing I love is the variety of styles and classes.  I send people here all the time because you can easily start as a beginner or be just as easily be challenged if you have been practicing hot yoga for years.", "pics": null, "resp": null, "gmap_id": "0x886211937705f7e7:0x30e7a3d4d346273c"}
{"user_id": "108074288201976189136", "name": "Whitney Painter", "time": 1581711727329, "rating": 5.0, "text": "I love this place! I cannot say enough about how knowledgeable the instructors are and willing to help. They are very skilled and masters of their trade. I have recommended this place to my friends, who love it too! Great place:)", "pics": null, "resp": null, "gmap_id": "0x886211937705f7e7:0x30e7a3d4d346273c"}
{"user_id": "104102690268998526910", "name": "Tarun Gupta", "time": 1580097273119, "rating": 5.0, "text": "I have been going to HYOH since 2013. This studio is amazing! It provides a perfect ambience for Hot Yoga. The instructors are genuinely there to help you. They have classes for all levels. Great place to make life long friends. With new ownership, sky is the limit! I wholeheartedly recommend this studio. Give it a try, you will be glad you did!", "pics": null, "resp": null, "gmap_id": "0x886211937705f7e7:0x30e7a3d4d346273c"}
{"user_id": "115294756056693027834", "name": "Teri Hasemeyer", "time": 1579636601277, "rating": 5.0, "text": "I am loving all the amazing positive changes going on here at HYOH. I have come here since the studio opened in 2010 or so, and the teachers and staff and ownership are just getting higher quality and kinder and even better customer service. I highly recommend hot yoga and highly recommend this studio!", "pics": null, "resp": null, "gmap_id": "0x886211937705f7e7:0x30e7a3d4d346273c"}
{"user_id": "117372726739501247953", "name": "Beth Guthrie", "time": 1386733588609, "rating": 5.0, "text": "I recently had my first experience with Hot Yoga at this studio, and walked in not knowing what to expect. I have a couple of co-workers who were very enthusiastic about practicing hot yoga and said that this was the place to go - I was not disappointed.\n\nThe owner of the studio was in conversation with another student when I came in, but made sure to greet me and make me feel welcome. There was a very brief form that I had to fill out with basic information to help the staff make sure you're prepared for your experience, and then after a brief tour I entered for my first hot yoga class.\n\nThe class itself was awesome, and was a challenge - but I noticed that because of the room being heated I didn't experience as much tension in my muscles as we worked through the poses. The instructor was very willing to help accommodate those of us who couldn't enter certain poses, and she was also quite helpful in adjusting form or making suggestions on how to modify your pose to get the most out of it.\n\nBetween the welcoming staff/instructors, pleasant atmosphere, and variety of yoga classes offered, I will DEFINITELY be back again!", "pics": null, "resp": null, "gmap_id": "0x886211937705f7e7:0x30e7a3d4d346273c"}
{"user_id": "113853219758456051368", "name": "Chung-thuy Pham", "time": 1520909130750, "rating": 5.0, "text": "I loved my experience at this studio!! I think the $20 introductory month is such an incredible value. I took advantage of this and went to as many as 4 classes in one week!\n\nSeek out the classes with Neal or Megan if you can. The classes with these instructors are tough, but Neal and Megan will help you get into the correct form and alignment. They will also help talk you through how to get into and improve on the more difficult poses. They're both very kind and encouraging =)\n\nUnfortunately, I live 30 mins away from the studio and with my college student budget I won't be able to continue classes here. Once my budget allows it, I would love to come back and take classes here again!", "pics": null, "resp": null, "gmap_id": "0x886211937705f7e7:0x30e7a3d4d346273c"}
{"user_id": "109182995193384083996", "name": "Ciara Holmes", "time": 1543437009036, "rating": 3.0, "text": "Just moved to the area back in June and have been trying to find a hot yoga studio. Did a lot of scouring in the area and come to find out there aren’t a whole lot of options. Decided to give this studio a try. Took a Yin class with Kris. The class was ok. She talked a lot during the class which I thought was slightly frustrating, her instructions could have been better, and she was on her phone for the most part. The studio was nice, the space however I don’t think is meant for a hot yoga studio persay. The hot aspect is where I felt like the studio fell short. Granted it was just a warm class, the warmth wasn’t consistent, and that may be due to the fact it’s forced heat. I was wanting to sweat and do yoga, I barely broke a sweat. I couldn’t find anywhere on the website or mind and body where they specify what type of heat they have going on.", "pics": null, "resp": null, "gmap_id": "0x886211937705f7e7:0x30e7a3d4d346273c"}
{"user_id": "115798503936854345507", "name": "Alex Cross", "time": 1486748130077, "rating": 1.0, "text": "I'm confused. Is this a dog kennel or yoga studio. I came here to do yoga and the first few times were fine. Then last night there were dogs everywhere. I dont want to put my bare feet on dog urine.I shouldn't have to take my shoes off and walk on the same floor that dogs use the bathroom on. Leave the dogs at home.", "pics": null, "resp": null, "gmap_id": "0x886211937705f7e7:0x30e7a3d4d346273c"}
{"user_id": "105614602347579767446", "name": "Bailee Barrilleaux", "time": 1357241192549, "rating": 5.0, "text": "I have done regular yoga before and  was curious about this 'Hot Yoga' place. One of my friends convinced a group of us to go and I loved it! I thought I would be uncomfortable in the heat, but I adapted to it and barely noticed by the end! After my class, I felt refreshed and not as tired and/or worn out as I expected, but i still felt like i had a good work out. Also, the teachers were very patient and kind to beginners, such as myself, so do not worry if you have never done yoga before! I  recommend taking a class to everyone!", "pics": null, "resp": null, "gmap_id": "0x886211937705f7e7:0x30e7a3d4d346273c"}
{"user_id": "105690762041555947857", "name": "Elizabeth Duling", "time": 1487466120122, "rating": 5.0, "text": "Love this place!  They are encouraging and every time I go I love it more!  Plus sometimes you get to see cute puppies too!", "pics": null, "resp": null, "gmap_id": "0x886211937705f7e7:0x30e7a3d4d346273c"}
{"user_id": "115810966890845464133", "name": "Liz Helton Bullard", "time": 1367957700509, "rating": 2.0, "text": "The manager was rude and condescending to me when I went to try my first class, so much so that I wanted to leave and drive back the 20 minute drive that I made out there to enjoy a workday evening yoga class. I arrived to the studio ten minutes before class, and the manager proceeded to lecture me for almost ten minutes about \"being late\" and \"interrupting others in their practice,\" when, if she had let me go into the room, I would not have been late at all. She insisted that I fill out forms that I had just previously filled out online when I signed up for the class online earlier in the day. The forms asked for all of the exact information (emergency contact, address, experience with yoga...) that had been filled out extensively on the online form, but she made it out to be that I was neglecting a step and trying to casually sidle in late. There were only six or so people in the class, and the manager's lecturing brought me into class about 1 minute late. She reminded me as I went in that \"this is Huntsville; it's different.\" My address lists that I am from Chattanooga, and I don't know if she was trying to make some comment about the caliber and status of clientele attending Huntsville studios as opposed to Chattanoooga ones, or not... but I can say that I am much more impressed with every Chattanooga studio I've been to than this one, which just left a bad taste in my mouth with its snobbery :/ The class was completely unremarkable, sadly. I'd had high hopes for it, especially after the huge deal that the manager made about entering late.", "pics": null, "resp": null, "gmap_id": "0x886211937705f7e7:0x30e7a3d4d346273c"}
{"user_id": "102901231208151856996", "name": "Ria Ghosh", "time": 1520019203435, "rating": 5.0, "text": "Best yoga studio in town! Clean studio! Lovely & knowledgeable teachers!", "pics": null, "resp": null, "gmap_id": "0x886211937705f7e7:0x30e7a3d4d346273c"}
{"user_id": "108161171198556670001", "name": "Kathryn Story", "time": 1346986708067, "rating": 5.0, "text": "Clean, Innovative, Inspiring, Enlightening...\n\nWhat a wonderful addition to Huntsville! <3", "pics": null, "resp": null, "gmap_id": "0x886211937705f7e7:0x30e7a3d4d346273c"}
{"user_id": "106573494482579209648", "name": "Streeter Michael", "time": 1479914591213, "rating": 5.0, "text": "I have been doing yoga for many years and I have been practicing Ashtanga, bikram, vinaysa flow, and yoga nidra ect. Robyn and here staff provide a very strong practice and challenging atmosphere. Just like anything else you get out of it what you put in. This place is yoga I know this because I come from a studio in Hilton Head South Carolina at the Jiva yoga center where they teach yoga and the philosophy of yoga. Yoga saved my life and it started in Hilton Head and now I can continue it at the hot yoga center. In closing I just want you to know I start yoga at almost 300 lbs and over a three year period I lost 86 lbs. At the age of 44 I am in the best shape of my life and better then when I was in Special operations with the US Army Rangers.", "pics": null, "resp": null, "gmap_id": "0x886211937705f7e7:0x30e7a3d4d346273c"}
{"user_id": "103899886446719253667", "name": "Brad G", "time": 1306958407497, "rating": 5.0, "text": "Great studio with heat and humidity. Instructors work with you (I'm a newbie) and keep the class moving along and enjoyable.", "pics": null, "resp": null, "gmap_id": "0x886211937705f7e7:0x30e7a3d4d346273c"}
{"user_id": "105731384998436039531", "name": "Whitney Sirten", "time": 1506203271131, "rating": 5.0, "text": "Love them!!!", "pics": null, "resp": null, "gmap_id": "0x886211937705f7e7:0x30e7a3d4d346273c"}
{"user_id": "107238263243313768390", "name": "Brian Terry", "time": 1618870934425, "rating": 5.0, "text": "As a vinyl collector, I don’t normally like to share my “honey-holes”, but Urban Atlas has one of the best selections of used vinyl records that I’ve seen anywhere . Prices are very reasonable and everything I’ve bought or looked at was graded accurately. There’s also a large selection of clothing, candles , teas and other cool things. They offer yoga and meditation classes as well .", "pics": null, "resp": {"time": 1619111515167, "text": "Thanks for the review!"}, "gmap_id": "0x8862842b0572bd23:0x5e37278f0ee3cf40"}
{"user_id": "100695648709332876949", "name": "Mark Mitchell", "time": 1624137669074, "rating": 5.0, "text": "Stopped in today first time,  great place and vibe, a real gem! Awesome vinyl section, picked up a few for the collection!", "pics": null, "resp": null, "gmap_id": "0x8862842b0572bd23:0x5e37278f0ee3cf40"}
{"user_id": "107900456130870678168", "name": "Callie White", "time": 1621966135573, "rating": 1.0, "text": "Cute store but I’ll never shop here again. I was given a gift card for Christmas, which was purchased mid-December, and didn’t realize it had an expiration date. This wouldn’t have been a problem, except the expiration date was April 1st, a mere four months after it was purchased. The problem isn’t the expiration date itself, it’s the fact that it’s not even six months out + we’re in the middle of a global pandemic. It’s not the easiest to get out and use gift cards at the moment. According to the store owner, the money “can’t be held that long” as it’s “unfair to others who sell in the store,” despite the fact that the gift card was paid for, in cash, and should be treated as if it’s cash. This is bad business practice and has turned me off as a customer.", "pics": null, "resp": null, "gmap_id": "0x8862842b0572bd23:0x5e37278f0ee3cf40"}
{"user_id": "116503101228339024727", "name": "Adalanta Grimes", "time": 1622509477670, "rating": 5.0, "text": "I visit every time I’m in Decatur and always find great birthday/Christmas gifts for my whole family plus tons of things that fit my own style!! Would definitely recommend checking it out next time you’re in Decatur!!", "pics": null, "resp": {"time": 1622510333540, "text": "Thank you so much!! ❤️"}, "gmap_id": "0x8862842b0572bd23:0x5e37278f0ee3cf40"}
{"user_id": "101674954551777336877", "name": "Rebeca Williams", "time": 1618521386743, "rating": 5.0, "text": "Urban atlas is my favorite place in Decatur! I visit here at least once a week, and I always leave with at least 1 thing! They have the coolest records, crystals, art, plants, and so much more! A must see place if you’re in Decatur!", "pics": null, "resp": {"time": 1619111539469, "text": "Thanks so much for the review!!"}, "gmap_id": "0x8862842b0572bd23:0x5e37278f0ee3cf40"}
{"user_id": "117153576554991346777", "name": "Sara Hurley", "time": 1608832888986, "rating": 5.0, "text": "Great place to find the best unique gifts! The owner is extremely helpful and nice. Highly recommended that you check this place out!!!", "pics": null, "resp": null, "gmap_id": "0x8862842b0572bd23:0x5e37278f0ee3cf40"}
{"user_id": "101703135008889509012", "name": "Caleigh Duncan", "time": 1598199306997, "rating": 5.0, "text": "I LOVE Urban Atlas!! There’s always such a great collection of records, clothing, and jewelry!! The atmosphere is always welcoming and enjoyable too. Definitely suggest stopping by to have a look around even if you don’t have anything specific in mind you’re looking for!", "pics": null, "resp": null, "gmap_id": "0x8862842b0572bd23:0x5e37278f0ee3cf40"}
{"user_id": "112445840289223043028", "name": "Amanda Richards", "time": 1595821082963, "rating": 5.0, "text": "I love this store so much! They have the best incense. The scents burn cleanly, with none of that funky, smoky \"incense\" smell (If you've ever burned the cheap stuff, you know what I'm talking about.). Smells Like Teen Spirit is my fave! It reminds me of my grandfather's cigars- warm vanilla and cherry.\n\nThe teas are good, too! Try the vanilla caramel rooibos herbal. So good, and it has a natural sweet taste.\n\nThe employees are also always super friendly and welcoming. This is far and away my favorite hippie shop. 😍", "pics": null, "resp": null, "gmap_id": "0x8862842b0572bd23:0x5e37278f0ee3cf40"}
{"user_id": "108573318364586301670", "name": "Rachelle Harden", "time": 1594143390362, "rating": 5.0, "text": "Absolutally love this place! I've been coming here for 3 years and the vibe is amazing and they have high quality products that are local and amazing staff who remember you. Recommend this place to anyone looking for a unique gift!", "pics": null, "resp": null, "gmap_id": "0x8862842b0572bd23:0x5e37278f0ee3cf40"}
{"user_id": "108989916459420758013", "name": "Jennifer Housley", "time": 1583426253983, "rating": 5.0, "text": "Got a beatiful green wand, loved it, store is so unique, you can get stuff here you can't get other places for sure. Sure even does meditation classes", "pics": null, "resp": null, "gmap_id": "0x8862842b0572bd23:0x5e37278f0ee3cf40"}
{"user_id": "102131983277614850990", "name": "Greg Wolodkewitsch", "time": 1571357730262, "rating": 5.0, "text": "Unique and wonderfully blended, with a smooth vibe and wonderful people. Don't miss out on a one of a kind store.", "pics": null, "resp": null, "gmap_id": "0x8862842b0572bd23:0x5e37278f0ee3cf40"}
{"user_id": "102151331848676857553", "name": "Jerry Cobbs", "time": 1563050808562, "rating": 5.0, "text": "Love this place! They had a free meditation day and we went to three sessions. Such a cool, laid back vibe.", "pics": null, "resp": {"time": 1563052515487, "text": "Thanks Jerry! It was great to have you!"}, "gmap_id": "0x8862842b0572bd23:0x5e37278f0ee3cf40"}
{"user_id": "109805221421449541235", "name": "Miss Nikki Shortkonner", "time": 1576615941157, "rating": 5.0, "text": "The girls are good to me and my son", "pics": null, "resp": null, "gmap_id": "0x8862842b0572bd23:0x5e37278f0ee3cf40"}
{"user_id": "100837376742956632775", "name": "Dede Quarry", "time": 1543018504461, "rating": 5.0, "text": "No longer Urban Atlas...they have moved down the street.  It's a new home goods/decor shop called Miss Muldrews", "pics": null, "resp": {"time": 1541439996239, "text": "Thank you for the review!"}, "gmap_id": "0x8862842b0572bd23:0x5e37278f0ee3cf40"}
{"user_id": "111471263471183156598", "name": "Byron Cloer", "time": 1558468945284, "rating": 5.0, "text": "Great place.. Great environment.. Great prices", "pics": null, "resp": null, "gmap_id": "0x8862842b0572bd23:0x5e37278f0ee3cf40"}
{"user_id": "103361726429163305463", "name": "Tyler Jackson", "time": 1561127540443, "rating": 5.0, "text": "Amazing store and great staff!!", "pics": null, "resp": null, "gmap_id": "0x8862842b0572bd23:0x5e37278f0ee3cf40"}
{"user_id": "103557045848986014589", "name": "Sherri House", "time": 1557107014893, "rating": 5.0, "text": "Super unique with great staff", "pics": null, "resp": null, "gmap_id": "0x8862842b0572bd23:0x5e37278f0ee3cf40"}
{"user_id": "105100949035491437059", "name": "Tammara Buckey", "time": 1535472716120, "rating": 5.0, "text": "Great array of clothing, accessories, music and more!", "pics": null, "resp": {"time": 1541439987807, "text": "Thank you so much!"}, "gmap_id": "0x8862842b0572bd23:0x5e37278f0ee3cf40"}
{"user_id": "116444511437150466157", "name": "Will", "time": 1562009618016, "rating": 5.0, "text": "Love it 💕", "pics": null, "resp": null, "gmap_id": "0x8862842b0572bd23:0x5e37278f0ee3cf40"}
{"user_id": "110695194047607550793", "name": "Barnacle Bill", "time": 1609449855511, "rating": 1.0, "text": "Among all the other locations this one is the least desirable. The Pelham location offers so much more in a more updated facility. Don’t waste your time here. 👎👎", "pics": null, "resp": {"time": 1609452101506, "text": "Hi Bill! Glad you are enjoying the Pelham location.  Members get to enjoy multi-club access. While Hoover may not have the glitz and glam of our newer locations, it is special to 24e. Hoover was our very first location and has an \"Old School\" vibe and equipment you would be hard pressed to find anywhere else. So show us some love and consider giving us 5 stars. Thanks and Happy New Year!!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "109127509679150715660", "name": "LaDarren Smith", "time": 1613533931584, "rating": 5.0, "text": "BYSWO Fitness Trains out of this funk and it is the absolute best for those looking to take their fitness to another level! byswofitness.com can help with personal training and nutrition coaching", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "108644939485319524677", "name": "Christopher Peters", "time": 1620088729004, "rating": 5.0, "text": "One of the best gyms in Birmingham with multiple locations", "pics": null, "resp": {"time": 1620096798628, "text": "Thanks Christopher!! So great to hear you are enjoying 24e. It's an honor to serve our awesome members!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "115012339210962110794", "name": "WADE COLEMAN", "time": 1612190612699, "rating": 5.0, "text": "Awesome gym, awesome environment. Great variety of equipment too.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "106575106403057564309", "name": "Philip Duchock", "time": 1604684808912, "rating": 3.0, "text": "Decent gym, a little small but conviemient for those who work odd hours. Customer service is good but im not a fan of the contract would recommend for locals near by.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "111349122196711972724", "name": "Devin M Chapman", "time": 1606201876856, "rating": 5.0, "text": "Clean, neutral environment. Great place to get some work in and be your self.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "103236502653345406024", "name": "JaCorey Murray", "time": 1583270808675, "rating": 5.0, "text": "I've been with this gym since 2012 and no complaints. Love the free weights, space and ability to come at any time of the day. If you're looking for a personal trainer, I'll recommend Nicolette Hayes. She is very talented and has a wide range of options to help with general cardio and strength conditioning. She'll also take the time to understand and customize your workout.", "pics": null, "resp": {"time": 1583277992286, "text": "Hi JaCorey! Thanks for taking the time to leave a great review. We are so thankful to have you at 24e for all these years. It is an honor. Thank you!!!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "113076976596957795299", "name": "Jason Harmon", "time": 1584650161062, "rating": 5.0, "text": "Knowledgeable management and friendly.\nMost adequate facilities for facilitating better health. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "115650200906132483627", "name": "Carlos Cumpiano", "time": 1529243238831, "rating": 5.0, "text": "This is a great gym. The staff is great. Very friendly people and like to make sure they have relationships with their members. It’s a little more than PF black card but well worth the price. Everyone that goes wants to work and better themselves.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "105947533891577453135", "name": "Sabrina Gaddy", "time": 1517715844412, "rating": 5.0, "text": "Luv 24e! It's a modern 'old school' style gym. Fantastic equipment & lots of it! Also lot of free weights! Open 24 hrs which is so awesome for those of us who work weird hours. Staff is great! always cheerful &  happy to assist!  Luv this gym!!", "pics": null, "resp": {"time": 1518622039347, "text": "Thank you, Sabrina!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "101229824711235668561", "name": "Tommie Wisaeu", "time": 1560190207024, "rating": 5.0, "text": "Honestly, this gym is EASILY the BEST gym I've been to. Nothing else comes close. Well, maybe a gym that costs 3x as much will be as good, but why bother when this gym is clean, has all of the equipment you could possibly need, and staff that genuinely cares. Price is fair, all the equipment works, plenty of changing rooms and bathrooms, private showers, this gym is as good as it gets.", "pics": null, "resp": {"time": 1560192016817, "text": "Thanks for the awesome review, Trent!! So thankful to have you at 24e!!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "103572289789355983391", "name": "Bergen Bolt", "time": 1545327704538, "rating": 5.0, "text": "The best gym in town!\nI've used several different local gyms over the years, and this one is far and away my favorite. The equipment is fantastic, the facility is large and open, the staff is knowledgeable, helpful, and friendly, and the other members are amazing. As a woman on a weight loss journey, it can be difficult to find a gym where it feels like I belong. And it's really cool to feel like I belong in a gym where bodybuilding athletes train!\nThe price is perfect and the service and support from staff is above and beyond! I recently had surgery and they called to check on me to make sure I was healing okay. I love this gym!!!!!", "pics": null, "resp": {"time": 1545330149783, "text": "Thank you so much for those kind words!! It is truly a blessing to have such awesome members!! Thanks Bergen!!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "101821504676585052264", "name": "Garrett Bell", "time": 1488751394183, "rating": 5.0, "text": "This gym is great for anyone. The environment is very nice, with a good mix of beginners up to series bodybuilders. Mix of older and newer equipment which is very well maintained. Staff is friendly and helpful. I have and would recommend this gym to anyone. Gym gets fairly busy later in the day from 4-6pm but never to busy to get on the machines and weights you want to use. The best part is you can workout any time any day. For the most part there is always a few people working out.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "117856550233604513195", "name": "Deep South", "time": 1584630731146, "rating": 5.0, "text": "Best gym I have ever been a member of, common sense owner and staff.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "109742934740902592449", "name": "Steve Trowbridge", "time": 1590080138855, "rating": 5.0, "text": "Great Gym! Never packed, very clean, employees are great!", "pics": null, "resp": {"time": 1590084863092, "text": "Thanks Steve!! That is great to hear! We are thankful have such awesome members and staff!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "102987175959138358246", "name": "David Rhodes", "time": 1597110406347, "rating": 5.0, "text": "Team Swole, Whooo!", "pics": null, "resp": {"time": 1597147570929, "text": "Ha! That's right! Thanks for the five stars!!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "116083622897591079175", "name": "Steven Johnson", "time": 1515909534741, "rating": 5.0, "text": "I have been going to this gym since it opened. I love it because they have a lot of free weights and many different types. They even have lifting platforms with bumper style plates for Olympic and power lifting. I wouldn't go anywhere else. The owner and staff are top notch as well", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "113233360805889051213", "name": "Koinonia with God", "time": 1510012626101, "rating": 5.0, "text": "What makes 24e so special is my personal trainer, Hugheston. He is one of the most soft-hearted and intentional people I have ever met. Your goals become his goals and he somehow always manages to go the extra mile with you. I have spent my whole life away from the gym but he has transformed my negative perception of working out into a world of excitement and possibility. I never thought I could enjoy working out!\n\nI'm always suspicious about trainers but he is not in it for the money, his motivation is in getting to transform your lives and I have gotten to see that first hand.", "pics": null, "resp": {"time": 1510062779610, "text": "Thank you, so much! We are certainly proud of Hugheston and are thankful for awesome members like you!!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "110639571745473348028", "name": "Jim McFerrin", "time": 1589154738059, "rating": 5.0, "text": "Best equipment and staff in town.", "pics": null, "resp": {"time": 1590519348829, "text": "Not to mention, the best members!! Thank you!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "114885680758644730394", "name": "Bryan Gilbert", "time": 1529177710513, "rating": 5.0, "text": "Best customer experience I’ve ever had at a business. Houston at the front desk was one of the friendliest people I’ve ever met. Give that man a raise.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "109226187055541814015", "name": "B D", "time": 1513118410868, "rating": 5.0, "text": "Best bang for buck ive ever gotten from a gym. Always open and it's good for people who really want to work out. Even though it's more of a bodybuilder gym, the crowd has always been really welcoming to whoever", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "113233360805889051213", "name": "Koinonia with God", "time": 1510012626101, "rating": 5.0, "text": "What makes 24e so special is my personal trainer, Hugheston. He is one of the most soft-hearted and intentional people I have ever met. Your goals become his goals and he somehow always manages to go the extra mile with you. I have spent my whole life away from the gym but he has transformed my negative perception of working out into a world of excitement and possibility. I never thought I could enjoy working out!\n\nI'm always suspicious about trainers but he is not in it for the money, his motivation is in getting to transform your lives and I have gotten to see that first hand.", "pics": null, "resp": {"time": 1510062779610, "text": "Thank you, so much! We are certainly proud of Hugheston and are thankful for awesome members like you!!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "100205131368639110410", "name": "Charles Perkins", "time": 1533849146560, "rating": 5.0, "text": "Best fun I've ever been apart of. Love the staff love the environment of real lifters in there.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "112677209952685006312", "name": "bwarren1975", "time": 1512003239109, "rating": 5.0, "text": "I like this gym. Owner is cool. Employees are cool. Membership price is not bad.  Hammer strength equipment is good.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "112213677942375182581", "name": "Craig Summerville", "time": 1353944550399, "rating": 5.0, "text": "Why would you go anywhere else?  Definitely the best \"bang for the buck\", so to speak.  There are no other gyms in the area where you can spend $25.00 a month and have access to a gym 24 hours a day!  This makes it super convenient if you work odd hours.  The atmosphere is fantastic.  The equipment is modern, clean, and well maintained.  The staff is extremely friendly and knowledgeable.  So, I ask again, why would you go elsewhere?", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "102885004382106196936", "name": "Shaun Southward", "time": 1352159768556, "rating": 5.0, "text": "Best gym in Birmingham. Only gym in town that gives you access to a full gym, that's 24/7 with no contract memberships. Staff was great, not stuffy like most places. $25 per month for this place is a steal", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "105368079860412924563", "name": "Marc Glass", "time": 1552838068075, "rating": 5.0, "text": "8 dollars daily. Great for travelers. Awesome gym, friendly staff.", "pics": null, "resp": {"time": 1552921572271, "text": "Thanks Marc!!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "100915287207296049422", "name": "Donald Watkins", "time": 1475935108793, "rating": 4.0, "text": "I have some friends that work out here. its not for the faint of heart. if you are serious about getting fit and making it a lifestyle this may be the perfect gym for you.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "114103470590767294870", "name": "Charlie Prince", "time": 1510247148071, "rating": 5.0, "text": "Best gym I've ever been to. Clean, had whether you need the people and ut has a great culture of your serious about getting in shape.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "107333605866751873999", "name": "J Spratling", "time": 1348517143319, "rating": 2.0, "text": "I experienced the same poor service when I tried to cancel my membership.  Jack, the manager, was extremely unprofessional.  I would NOT recommend this gym to anyone.  There are several gyms in the Birmingham area.  You can easily find one that appreciates your business from the time you sign up to the time you cancel.  Do not go to this gym.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "105628799221292284572", "name": "Kevin Wilkie", "time": 1518616948142, "rating": 5.0, "text": "Great place to workout. Plenty of equipment and everything you need for a good workout!", "pics": null, "resp": {"time": 1518621992707, "text": "Thanks Kevin!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "112796962025229948754", "name": "Austin Mann", "time": 1599848614983, "rating": 5.0, "text": "Great staff, vibe, and equipment", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "109165282789115104095", "name": "Dylan Stephenson", "time": 1516733796438, "rating": 5.0, "text": "Great place to go workout. it's also has a very friendly and helpful staff as well!", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "115784141368860316662", "name": "Michael Wallace", "time": 1511630657453, "rating": 4.0, "text": "Great Gym.  They have all you need for a full body workout.  Employees are friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "114364962922163115009", "name": "Brent Harris", "time": 1510006153018, "rating": 5.0, "text": "24e fitness in Hoover is awesome, and the atmosphere is great. Hugheston is my personal trainer and I highly recommend him. We have great interaction, while he gives me valuable coaching techniques. Hugheston has also helped me with a great diet plan to help me achieve my goals. Thanks Hugheston!!", "pics": null, "resp": {"time": 1510063098095, "text": "Thank you, Brent! It is truly rewarding to have such awesome members and to hear that our trainers, like Hugheston, are making a difference!!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "103526215274855507836", "name": "Grant Price", "time": 1517690880921, "rating": 5.0, "text": "Great gym, Houghston helped me get in shape with a personal training program!", "pics": null, "resp": {"time": 1517691395932, "text": "Thanks Grant! We're so happy to hear that Hugheston is helping you meet your fitness goals!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "104027806870290515098", "name": "frank baker", "time": 1489734484575, "rating": 5.0, "text": "This is a beautiful facility convenient to research park.  It's nice to have a place to work out at lunch break.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "103701172021316493655", "name": "Jay R", "time": 1513089656405, "rating": 5.0, "text": "This is a clean, well run, locally owned business. 24e offers just about every service you'd want from a Health Club membership.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "103701172021316493655", "name": "Jay R", "time": 1513089656405, "rating": 5.0, "text": "This is a clean, well run, locally owned business. 24e offers just about every service you'd want from a Health Club membership.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "107930452770084877250", "name": "Nannette Zeanah", "time": 1484156200867, "rating": 5.0, "text": "I have used this gym for 5 years.  My family uses it as well.  I have lost 105 pounds.  Wow!  That's amazing isn't it!.  My son has lost over 100 pounds as well.  I couldn't have done it without the help of the staff and trainers.  I train with Hugheston at present.  He's amazing and very knowledgeable.  He is very conscientious and seems to care about his clients.  He helps me to do the exercises with the correct form. I am older and have some physical issues.  He works with me to help improve my mobility and flexibility.  That really helps me alot.  I am a nurse and work 12 hours shifts three days a week.  Hugheston helps me immensely.  I could keep going on and on but I want everyone to know that the Hoover 24e is a great place to get healthy and fit.  I've never been uncomfortable or felt out of place.  If I have questions Daniel or Hugheston makes sure to help me find the answers.  So if you want to get fit or just be healthy come see what the gym is all about.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "111886805585653251946", "name": "Chris Ehrixh", "time": 1555554807851, "rating": 5.0, "text": "Great gym. Love it.", "pics": null, "resp": {"time": 1555683328191, "text": "Thanks Chris!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "104225583279221189013", "name": "Cameron White", "time": 1501597385602, "rating": 5.0, "text": "Great staff, great regulars, and most importantly great gym.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "100615409011947891101", "name": "Jeff Randle", "time": 1484228509223, "rating": 5.0, "text": "This fitness club is HUGE with so many options for literally anything you could want to do. The cardio equipment is all the way on the other side of the gym from the free weights so the people who don't want to mingle don't have to. If machines are your thing, they have any and all that you can imagine. They've really tried to cover every base with this gym.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "105528502462775682389", "name": "Shantavia", "time": 1397068495259, "rating": 1.0, "text": "At first i thought it was a wonderful gym and i didnt mind pay 30 dollars a month then a family emergency came up so i could no longer pay for the personal trainer i decided to get the trainer understood but the managers couldnt i wouldnt recommend anyone to go to this gym", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "102423992374480634330", "name": "ZbzDogo Outdoors", "time": 1444228302621, "rating": 1.0, "text": "worst customer service at a gym I have ever encountered. out dated equipment. do your self a favor and join a different gym", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "105606894019527410661", "name": "Jackancoke", "time": 1556202124263, "rating": 5.0, "text": "Great gym", "pics": null, "resp": {"time": 1556303738588, "text": "Thanks Michael!!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "110137899704764508404", "name": "Nicholas Keith", "time": 1568566533451, "rating": 5.0, "text": "Love it.", "pics": null, "resp": {"time": 1568640326469, "text": "Thanks Nicholas! That is great to hear!!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "106583360125880739544", "name": "William Caldwell", "time": 1548339705185, "rating": 5.0, "text": "Great clean gym", "pics": null, "resp": {"time": 1548343145431, "text": "Thanks William! That is great to hear!!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "109425032513092747776", "name": "Jonathan Murray", "time": 1557846684760, "rating": 5.0, "text": "The best", "pics": null, "resp": {"time": 1557847378545, "text": "Thanks Jonathan! We also have the best members!!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "112824527949319826347", "name": "Todd Sobel", "time": 1547768502224, "rating": 5.0, "text": "Great equipment", "pics": null, "resp": {"time": 1547847795482, "text": "Thanks Todd!!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "117281701940179179362", "name": "Herman Mattingly", "time": 1540295518028, "rating": 5.0, "text": "Awesome Gym", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "115140169293139559393", "name": "Clay Hasenfuss", "time": 1531312929418, "rating": 5.0, "text": "Weights and Cardio", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "115652914217844053815", "name": "Joseph Felix", "time": 1522025969989, "rating": 5.0, "text": "Convenient for all levels", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "102394731071993859414", "name": "Cutty Dean", "time": 1541705724564, "rating": 5.0, "text": "Love this place", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "108976525450614030303", "name": "Bethany Cusimano", "time": 1517630698477, "rating": 4.0, "text": "Everything you need, just older", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "113083721617002801610", "name": "Charlie Graham", "time": 1498170053872, "rating": 2.0, "text": "No Cooling Off Period or Try It Out Time. I joined this gym and after going five times did not feel like it was the right fit for me, and did not like going to a gym without staff at night. When I contacted Daniel at the gym and asked if I could cancel I was told my only options were to pay a $150 or finish out the contact without using the gym if I did not like it. He said it did not matter that I had only been a member for less than a two weeks. So beware they do not offer a trial period - join and if you do not like it pay their fee.", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "115237065291157247395", "name": "Ray Gamble", "time": 1474403388001, "rating": 1.0, "text": "Absolutely Terrible!!", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "103308748375270019932", "name": "dez davis", "time": 1455862667132, "rating": 1.0, "text": "Ripoff\n\nHorrible customer service and overpriced memberships", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "115837255548493185035", "name": "TIM CASTELLON", "time": 1426789109023, "rating": 4.0, "text": "Great place to workout, staff is awesome!", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "107777590206216574561", "name": "Cat DG", "time": 1564691849629, "rating": 5.0, "text": "(Translated by Google) They speak Spanish?\n\n(Original)\nHablan español?", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "111563722122447241098", "name": "Félix Santiago", "time": 1504612124447, "rating": 5.0, "text": "(Translated by Google) It is the best of the best\n\n(Original)\nEs lo mejor delo mejor", "pics": null, "resp": null, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
{"user_id": "107646740205953432638", "name": "J.A.P mendoza", "time": 1582230630293, "rating": 5.0, "text": "(Translated by Google) The best\n\n(Original)\nLo mejor", "pics": null, "resp": {"time": 1582240387650, "text": "Thanks for the five stars!!"}, "gmap_id": "0x888918a4b3874e27:0x627f367f072cb79b"}
