{"user_id": "110528981220440592979", "name": "Lisa McDonald", "time": 1623866338657, "rating": 5.0, "text": "I just attended a 3-day, 2-night girls' camp with 12 girls from 11 to 18 years, in addition to 5 other adult leaders.  Susan and Ron were absolutely wonderful to work with from the time we booked our adventure until we drove away.  Susan was very accommodating when we needed to change our schedule and quickly responded to all questions.  The girls loved the zipline, pool and lake activities as well as all of the team-building games and competitions we did, and Ron was kind enough to open the water slide which was not scheduled. The accommodations and food were great and Susan even sent us home with extra muffins!  We would definitely go again!", "pics": null, "resp": {"time": 1623869916061, "text": "Lisa, thanks for the great review.  We really enjoyed having your group here and hope to see you again."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "115754082846404759860", "name": "David Norris", "time": 1622805151509, "rating": 5.0, "text": "This was just what we were looking for! They accommodated our zip lining group ages 5 to 86 and everyone was safe and it was fun! Ron, Susan and entire staff are great. Hidden gem.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPZzuMnLkyMax6C9ebOtbYve1wn3vjua3NORX1e=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPj7XeDZ567AszSRbfx5d5AgPGmtG2vyyK9oKpC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPF1pQC2H9B_dJmoD9VfXk5ht0w3DVrGrRy_LvF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMRGz0sDemTjx5xE4YHxHmHwxb6bt6j2BhxU4Wm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPcAZlBArHtaqFNhawskKn1XuPF6TC9L8bgeMjG=w150-h150-k-no-p"]}], "resp": {"time": 1622808602147, "text": "Thanks David.  We really enjoyed your group yesterday.   Hope to see you again."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "117798315304560947780", "name": "Sara Thompson", "time": 1621620886028, "rating": 5.0, "text": "These was such a great adventure to do as a family. We stop on are way done to Florida and we are so glad we did. We did the tree adventure and zipline but we wish we could have spent more time there. Diffently take the time to stop.", "pics": null, "resp": {"time": 1621679432683, "text": "Thanks for visiting Butter and Egg Adventures.  We hope that your visit was just one of many great times your family will have while on this trip.  We thank you for stopping by and having some fun with us."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "111255533946984683007", "name": "Charles uh60m", "time": 1609878047774, "rating": 5.0, "text": "What a great place this is! My kids and I just left there and had a blast! There is so many fun things to do but I have to say zip lining was the best!", "pics": null, "resp": {"time": 1609934098201, "text": "Charles, thanks for bringing your family here yesterday.  We could tell they were having a great time.  Look forward to seeing everyone again."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "103988428412878848042", "name": "Erin Shae", "time": 1558045141337, "rating": 5.0, "text": "SO MUCH FUN! Can't wait to go back and try even more...we were there with a school group and were able to zipline, rockclimb, canoe and paddle boat, shoot eachother with lazer guns on the Battlefield (totally beat my own kid's team 😁), and eat our lunches under a covered pavillion...it was great. The staff interacts well with the kids and everybody was helpful and informative. Considering it for this year's birthday!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPlqEqShmSU2FgNioP-uH3m36jPI2-ERNZGi_tY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPUfyZKl0lTZs6UeUJgqjGo2rGNG-OJBx2tUSAj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOmZizrIrDBnuVYZduPymRlbTojLL4EPUoz39tf=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPfaZdxPMgWY_KKX9RyizJX6zFSPBf787nFcgEj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNyULJ2H6LJXOmZ_AMi1fcu1eoZ4x3B7dHrqhUB=w150-h150-k-no-p"]}], "resp": {"time": 1558049452851, "text": "Thanks for the great comments and we look forward to seeing you again!"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "106360953977410975958", "name": "Xhilyn", "time": 1623377223403, "rating": 5.0, "text": "My friend saw your billboard on the highway and the name itself warrants such a good review. Cheers, - Bethany Rae Jackson", "pics": null, "resp": {"time": 1623407273159, "text": "Thanks, if you liked the billboard...you would love the facility.  Come out sometime and enjoy our adventures."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "110789612782110688549", "name": "zion michelle", "time": 1623006118252, "rating": 5.0, "text": "so fun!! i went eith my cousins", "pics": null, "resp": {"time": 1623006781896, "text": "Zion, thanks for coming to Butter and Egg Adventures!"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "108784952081529799480", "name": "Randy Nix", "time": 1616530206759, "rating": 5.0, "text": "My grandchildren had a blast and the employees are were  great with the kids", "pics": null, "resp": {"time": 1616539021165, "text": "Randy, thanks for the 5 Star review.  We really enjoyed having your family here today.  Thanks for coming to Butter and Egg Adventures!"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "109784203562850570354", "name": "DandK", "time": 1500296528559, "rating": 5.0, "text": "It was one of those thing on my bucket list  we was down there for a state tournament  baseball game  . So we 2 grandmother's we wanted to do something fun and we did it was the best we laughed we was scared caused we never done it laughed at each other we loved it I will stop every  time I come threw and thank y'all for letting 2 grandmother's have a great experience   . Darlene Zills.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMwow8BfPtqltP-jqbpaYAzWYDIBFNGnj7Q2eEr=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "115284742395775627731", "name": "Marty Parson", "time": 1604340936417, "rating": 5.0, "text": "Awesome time, they are well organized and want you to have good time", "pics": null, "resp": {"time": 1621857112605, "text": "Thanks Marty.  Hope to see you again."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "116684870333098641600", "name": "Ashley Creekmore", "time": 1581908859646, "rating": 5.0, "text": "Took my Girl Scout Troop here for a 3-day weekend. They loved it!  The food was great and the staff was amazing. They were extremely knowledgeable and friendly. They went above and beyond for us. We definitely got more than our money’s worth with this camp and will likely come again. The zip lines and tree adventures with high ropes course were the girl’s favorite. But the human foosball was equally fun. So many good memories made that weekend.", "pics": null, "resp": {"time": 1581937032109, "text": "Thank you Ashley, we really enjoyed having your group here!"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "114196094782823885429", "name": "Kristen Piazza", "time": 1592248704003, "rating": 5.0, "text": "Went here for my birthday and had an awesome time! 😍 Went ziplining and axe throwing. 🪓Natalie and her husband were super awesome guides! They wear masks the whole time so if you're worried about Covid, don't be. Definitely go here you will not regret it!", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "107056063201402933137", "name": "sherita newby", "time": 1592683729962, "rating": 5.0, "text": "GREAT place, with a GREAT staff. I hurt myself and they took very good care of me!! I will definitely be back!!", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "112444999828813503842", "name": "Dawn Burley", "time": 1603731375791, "rating": 5.0, "text": "Awesome place great staff love the property!", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "110966049569140539727", "name": "k9krate", "time": 1622153788581, "rating": 5.0, "text": "Great experience", "pics": null, "resp": {"time": 1622199251779, "text": "Thanks for coming to Butter and Egg Adventures.  Hope to see you again!"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "117596790244509604385", "name": "Mollie Waters", "time": 1622230800458, "rating": 5.0, "text": "Loved it!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNKGsCUabfCtwLNBPisyV9SwivBs88E2262McMm=w150-h150-k-no-p"]}], "resp": {"time": 1622808651957, "text": "Molly, thanks for visiting Butter and Egg Adventures.   Glad that you had a great time!"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "113138037756686914042", "name": "Kayla F", "time": 1565830999578, "rating": 5.0, "text": "We had such a fun group ! The guides were friendly and explained everything well. Natalie was a great guide and they were so accommodating of all skill sets. Can't wait to go again", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "109005137324549888984", "name": "Mary-Aileen McLemore/ Anti-Cook Girl", "time": 1493591168819, "rating": 5.0, "text": "My boys (12 and 14) and I had a fantastic time! This is by far the most creative tree course we've done. The zips were the best too- lots of them for long distances unlike other places that only give you one or two of those in your package. You also can't find a better price out there for this type of adventure. We will go back!", "pics": null, "resp": {"time": 1493768357137, "text": "Thanks for taking on our three tree courses!"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "109005137324549888984", "name": "Mary-Aileen McLemore/ Anti-Cook Girl", "time": 1493591168819, "rating": 5.0, "text": "My boys (12 and 14) and I had a fantastic time! This is by far the most creative tree course we've done. The zips were the best too- lots of them for long distances unlike other places that only give you one or two of those in your package. You also can't find a better price out there for this type of adventure. We will go back!", "pics": null, "resp": {"time": 1493768357137, "text": "Thanks for taking on our three tree courses!"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "110535425167356785607", "name": "Amanda Kelley", "time": 1563087039661, "rating": 2.0, "text": "My daughters came to camp there July 11th through the 13th for kids camp with Crossroads Baptist Church. They came with $20.00 a piece to purchase anything of their choosing. The Adults that we’re in charge of both of my daughters money made them share $20.00. With that being said neither of my daughters were able to purchase a shirt from your camp. Not happy because we live over 2 hours away. It would be nice if y’all were able to make it to where your shirts can be purchased from your website.A staff member was very rude to my oldest daughter had I been there it wouldn’t have happened. If your staff can’t be nice to children then they don’t need to work for the camp period. I’ve heard great things about your camp. But after what happened with my daughters makes me see different.", "pics": null, "resp": {"time": 1563113506236, "text": "Amanda, we are sorry that your daughter had a bad experience at Butter and Egg Adventures.  We work hard to make sure all of our guests are treated with dignity and respect.  With that in mind, to find out more about the situation of a staff member being rude to your eldest daughter, please call 334.670.9954 or 334.670.9953 to discuss with us.  We need to find out more information, so that we can act accordingly.  On your other matter about buying a t-shirt, we had no control of your daughter's money and on how to spend it.  We certainly want to sell t-shirts to all our guests.  Our primary purpose for our website, is to provide information about our services and recreational opportunities at Butter and Egg Adventures. If you would like to buy a t-shirt at this time, please let us know and we can make arrangements to sell you one via our payment gateway.  We look forward to hearing from you."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "101400206115844213769", "name": "Ana A", "time": 1451880042866, "rating": 5.0, "text": "My daughter, her boyfriend and I went to Butter and Egg Adventure the day after New Year's Day. It was the first sunny day in weeks and we really enjoyed getting out and being active. The owners, Ron and Susan, were gracious enough to take us through the course themselves, which we thoroughly enjoyed. The grounds, structures and property are well maintained and good safety procedures are in place. We hope to return in the Spring with a bigger group of family and friends. Perfect for a family outing or activity for a big group of friends or venture groups.", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "113813310906588010348", "name": "Mrs. Rose", "time": 1450604235415, "rating": 5.0, "text": "My family and I visited Camp Butter and Egg this past summer and we had a blast! I would definitely recommend this place to anyone who's interested and having a ton of fun. There were various activities available for both adults and children. In addition, the staff was very welcoming and showcased excellent customer service.", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "107829419020097399729", "name": "Joe Sherwin", "time": 1482338528873, "rating": 5.0, "text": "I took 17 members of our leadership team here for a staff ride where we focused on teambuilding, communication, and critical thinking skills.  Susan and Ron provided an excellent environment and program to engage our staff.  From the Escape Room to the confidence courses to the zip-lining, it was a top-notch experience.  We look forward to coming back in the near future.  Great investment!", "pics": null, "resp": {"time": 1493768434345, "text": "We enjoyed having you experience our facilities and look forward to seeing you again."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "117975922625527879049", "name": "Anthony Roberts", "time": 1497187683972, "rating": 4.0, "text": "This place has so many fun things to do. We took a group of almost 300 people and they accommodated us well. Everyone was very helpful as far as explaining the climbing gear, how to work the ziplines and laser tag. Our lunch was hamburgers and they tasted very good and the kitchen staff did a great job of moving everyone along.\n\nThe only reason this is not a five star review is that we had several from our group complain that some of the staff were rude and not friendly, almost like they really didn't want to be there. The majority of the staff went above and beyond to help us out and for that we are very thankful.\n\nI don't remember the young lady that helped us at the climbing wall in the beginning, but she was probably the best there that day. She was very nice and understanding to our group, and the majority of them had never climbed before so that was great.\n\nAlso, Ron took a group picture with his drone for us and all the kids loved it.\n\nOverall I would definitely recommend this to anyone for an event or just a fun weekend with the family.", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "100701285662622367427", "name": "halee dix", "time": 1479668188699, "rating": 5.0, "text": "Dix Family Thanksgiving has been at Camp butter &a Egg Adventures for the last 4 years. Some of us zip line and we all play laser tag on the battlefield.  The owners are so sweet. Family owned and operated. Great place for family reuinions or just a small family day of fun.", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "117315525441706091891", "name": "Brandon Stephens", "time": 1479073887178, "rating": 5.0, "text": "We have been bringing our preteens here for a 3-day 2-night retreat for the last 6 years. This year we decided to do two trips and bring two different groups. Butter & Egg is A+. The friendly staff and top notch facilities make it a prime destination for budget conscious families and groups looking for fun and adventure in a safe exciting environment. Can't wait until our next trip.", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "104990727996224262700", "name": "Christie Brantley", "time": 1535126595381, "rating": 1.0, "text": "Idk who is in charge of this place but there is a girl by the name of Bethany (I think) who was so extremely rude to my children the last time I came in... she was SO unprofessional and I can’t believe she would ever be allowed to work with children................ I used to come here all the time... never again. I would not recommend this place to anyone especially someone with children. Please take my advice... she was grouchy, rude, and disrespectful. Never again.", "pics": null, "resp": {"time": 1535128405705, "text": "I am sorry that your children had a bad experience here.  Please provide some information, as to the date and event they were here for.  My email address is ron@butterandeggadventures.com.  This will allow me to further research this matter."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "103887855849146659311", "name": "Meagon Underwood", "time": 1528761313507, "rating": 5.0, "text": "Loved it! This is definitely a place to be entertained for hours! Ron and the B&E staff are on point!", "pics": null, "resp": {"time": 1528797282682, "text": "Meagan, we enjoyed sharing our “Fun Place” with you guys!  Thanks for coming."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "110631167564604860534", "name": "MaryAnna Lushbough", "time": 1475354523794, "rating": 4.0, "text": "It was really fun. Had a high ropes corse and a  HUGE zip line over a pond. I went on a trip with my jrotc group with 30 other cadets and we all had a blast. The only complaint was the bunk beds are extremely squeaky. Other than that was a great place and a wonderful surroundings.", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "112567271262182788926", "name": "Elysse McKenna", "time": 1453325864211, "rating": 5.0, "text": "The zip lining course was amazing! My youth group also participated in some laser tag at Butter and Egg Adventures and had a great experience!", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "111573824719475291678", "name": "Nathan Harrelson", "time": 1496871083584, "rating": 1.0, "text": "Had a great time with everyone from our group, and a lot of cool stuff to do however, the staff could've been more friendly and happy that we were there. The majority of their staff was very rude, beginning with the main guy in charge.", "pics": null, "resp": {"time": 1496925408486, "text": "Wow, we don't get too many 1 Star Reviews at Butter and Egg Adventures.  I am sorry that your experience here yesterday, was not good.  We take all of our reviews seriously and we will address your concerns.  Here is my cell phone number, if you would like to discuss your concerns (334-670-9953)"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "115800097350184732643", "name": "drake rollins", "time": 1497040946488, "rating": 5.0, "text": "By far the most fun place in Troy !\nShoutout to Mr. Ron and Mrs. Susan for being awesome. Great Place !", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "114665631689455224262", "name": "Charles Nelson", "time": 1480460678697, "rating": 5.0, "text": "Went with a group of friends to do the new Escape Room. Kept me on my toes and brought out the detective in me. Wonderful experience and helped me connect closer with my friends.", "pics": null, "resp": {"time": 1493768504759, "text": "Charles, we are glad you and your friends tried out our Escape Room."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "113466733654446676074", "name": "Jared Bonebrake", "time": 1457373872380, "rating": 5.0, "text": "Cub Scout Pack 156 from Prattville AL took us to Butter and Egg Adventures and we had a blast.  At the end they asked the kids what they liked best about the day and they all started yelling out Ziplining, Laser Tag, The Giant Swing...  Then they started getting confused, wait, I liked it all.  We'll definitely be back next year!", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "108784436175378990700", "name": "Yvonne Cary", "time": 1540328997229, "rating": 5.0, "text": "Had a great time with the kids of Morningveiw elementary", "pics": null, "resp": {"time": 1540375871603, "text": "Thanks for coming to Butter and Egg Adventures and having some fun!"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "109426412390635878766", "name": "Scott Martin and Jill Moore", "time": 1502332444161, "rating": 5.0, "text": "It is so much fun!  Excellent facilities, lots of options, and the staff is awesome.", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "111255431384891633335", "name": "Khadija Neely", "time": 1452484316541, "rating": 5.0, "text": "Troy University softball visited today and it was an success !! Can't wait to go back !", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "111501225910420460831", "name": "Lilly Bright", "time": 1480802479304, "rating": 5.0, "text": "we used it as a team bonding weekend and it worked. we stepped out of our comfort zone and trusted each other.", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
